[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Supply  Chains. My office heard from numerous awardees who were left confused  and frustrated by the complete lack of communication from DOE on this  matter. Many of these grantees heard about their grant cancellation by  reading stories in the media, and some still have not received any  formal communication from the Department of Energy.\n\nIf the Department…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…example, according to recent reports, the  Department of Housing and Urban Development, or HUD, is attempting to  experiment with crypto in their operations, including by paying  grantees in stablecoin or crypto. One of Trump's executive orders  leaves the door wide open for Trump to require the use of his  stablecoins and meme coins in order to pay taxes or…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…down the U.S. Refugee Admissions  Program, slowing assistance for those impacted by conflict, and  reprioritizing funds for its own agenda. Our international broadcasting  grantees are also experiencing significant cuts even as they try to  provide essential information and services in Ukraine, Iran, and across  the Indo-Pacific.\n\nAnd I want us to understand…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…their attempts to claw back nearly $20 billion in grant  funds that were awarded in April 2024 and fully dispersed into private  bank accounts by August. After terrorizing grantees with false  allegations of fraud and trying to open bogus criminal cases that went  nowhere, EPA froze and then announced the termination of these fully  obligated and dispersed…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…it.  It was signed into law by the President. The money went to the  Department of Justice. It was programmed for those purposes. $811  million was awarded to each of those grantees and now we have got some  reportage explaining what happened. It all came down to this one guy,  Tarak Makecha, working for Elon Musk.\n\nDid anybody elect him around here?…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…mandated reports that the committee  has received, VA has not established enough metrics to allow Congress  to monitor the success of the program. Additionally, in our view,  grantees are not collecting or reporting complete data for all  participants, which further limits Congress' ability to determine  whether the program is meeting its intended purposes.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…any event, those of us who voted for the money, and that is people  on both sides of the aisle, voted for the money to be distributed by  the Department of Justice to local grantees didn't even know about  this. I shared with the chairman and with all the members of the  committee, the one name of the DOGE employee, an unelected bureaucrat,  a juvenile…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…United States  to have a seat at the table at the U.N. and many other international  organizations.\n\nIt rejects the closure of USAID, the U.S. Agency for Global Media and  its grantees, and other independent entities.\n\nCritically, this bill includes new transparency and oversight  requirements to close loopholes that were abused by the Trump  administration…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…risk.\n\nIt prohibits the use of funds to purchase software or hardware from  foreign entities of concern when those products do not align with CISA  guidance, and it directs grantees to follow secure-by-design  recommendations so that public money is not spent on tools that  undermine security.\n\nWe also provide more predictability around cost share requirements…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…an example where one contractor billed $9 million for labor  and could only support or back up $1.5 million of it. Another was  reimbursed twice for the same $40,000. Some grantees couldn't even  prove they delivered services. FEMA had approved it all.\n\nThen you compare things, Mr. Speaker, where folks were needing help,  and they were getting the runaround…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…let  this lifesaving program that veterans and their families rely on stop.  That is what we are here to do.\n\nWhen it comes to the screening tool, it is essential that all  grantees use the same protocol to determine the effectiveness of  services and programs.\n\nThe Columbia-Suicide Severity Rating Scale is currently a tool used  by VA as one component…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…housing assisted by the Department;\n\n``(3) the financial health of the mortgage insurance funds       of the Federal Housing Agency;\n\n``(4) oversight by the Department of grantees and       subgrantees for purposes of preventing waste, fraud, and       abuse;\n\n``(5) the progress made by the Federal Government in ending       the affordable housing and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…face. They have told us in no  uncertain terms that now is not the time to pull back and now is the  time to lean in.\n\nNow is the time to strengthen these programs and ensure grantees have  a meaningful voice in shaping the policies that guide their work on the  ground.\n\nMy district, like so many others, relies on the Urban Area Security  Initiative and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the  uniform.\n\nWhile I respect my colleague's comments from the other side of the  aisle, to ask for data for metrics and for outcomes but not to provide  a tool for these grantees seems to be the wrong path to take.\n\nMr. Speaker, 17 veterans die by suicide every single day. That number  should shake this Chamber. It is a national tragedy and a moral…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691507/no-wrong-door-for-veterans-act"}]