[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Gibson Center showcases exceptional care for the senior residents  of the Mount Washington Valley. Every day, they provide invaluable  services to those in need and make our Granite State communities better  and stronger.\n\nOn behalf of my constituents in New Hampshire's First Congressional  District, I want to congratulate the Gibson Center for Senior…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Americans, not by other countries. And what the President  is doing amounts to a new tax for Americans. For example, heating oil  and propane that keeps hundreds of thousands of Granite Staters warm in  the winter is going to cost more. We are going to add about $150 to  $250 to the cost of heating homes in New Hampshire.\n\nAnd gas prices are going to go up.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…corporate overlords and robber barons who have their heels on the  necks of the American people. We need to restore competition and break  the monopolies.\n\nMy colleague from the Granite State gets this, having worked in the  Justice Department to take on monopolies. She has been in the trenches  in the fight against this kind of corporate power run amok.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…witnessed the amazing work they do. The mission of the  New Hampshire AHEC is to support workforce development activities for  current and future healthcare workers in the Granite State. In 2024,  the New Hampshire AHEC offered continuing education to over 4,500  healthcare workers, improving treatment options for patients suffering  from diseases such…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Portsmouth Black Heritage Trail,  which has since grown into the Black Heritage Trail of New Hampshire,  has fought to uncover and honor the often-overlooked Black history in  the Granite State and southern Maine for more than 30 years.\n\nThe mission of the Black Heritage Trail of New Hampshire is to  promote awareness and appreciation of African American history…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…constructing long-awaited roads,  conserving land, and expanding police and fire stations. Throughout his  43 years of working in local government, David consistently ensured  Granite Staters received the support they deserved, greatly helping  residents across the state in Jaffrey, Londonderry, North Hampton,  Belmont, and Gilford.\n\nDave is not only a…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…On behalf of my constituents in New Hampshire's First Congressional  District, I thank Pat for her thoughtfulness and dedication to the  surviving spouses she has supported. Granite staters are grateful that  the spouses of our brave veterans may receive attentive care from  professionals like Pat, and I wish her only the best in the years to  come.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…agency representatives, to keep our  government engaged at the local level with trends in immigration cases.  Throughout the course of his career, David consistently ensured Granite  Staters received the support  they deserved and was able to help with any inquiries that came his  way.\n\nDavid is not only a diligent public servant, but a man of outstanding…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…all this thanks to her  bravery, optimism, and generosity, but she may not have even gotten  that chance without Medicaid.\n\nAnd then there is Cheri from Lebanon. Like other Granite Staters, she  has had struggles with addiction, as well as mental health challenges,  but Cheri was eligible for Medicaid. She got treatment and went into  recovery. She was…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…of service to  our state. As Commissioner of NHDOT, Bill has fostered a supportive  work environment and spearheaded multiple major transportation projects  to help improve Granite State roads, bridges, and infrastructure.\n\nA lifelong Granite Stater, Bill grew up in Rollinsford, New  Hampshire, and went on to earn a Bachelor of Science in Civil  Engineering…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Janette Gibb for her selflessness and dedication to  the veterans she has cared for. By giving so much to those who served  our Nation, she has made her community a better place. Granite staters  are grateful that our brave veterans may receive care from  professionals like Janette, and I wish her all the best in the years to  come.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688916/recognizing-janette-gibb-for-her-service-at-the-manchester-va-medical-center"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…administering care in Vermont, Maine, and New Hampshire. In New  Hampshire, Northeast Delta Dental plays a crucial role in providing  dental insurance to over half of insured Granite Staters. Additionally,  through their Northeast Delta Dental Foundation, the organization  supports various oral health initiatives, contributing over 1.3 million  dollars…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688205/recognizing-the-achievements-of-northeast-delta-dental"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…he continues to provide  guidance to the faithful.\n\nOn a per capita basis, New Hampshire is proud to host the largest  Greek diaspora in the United States. On behalf of the Granite State, I  wish him well on his visit to the United States and look forward to  continued engagement between His All-Holiness and the people of the  United States.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Republicans in the  House.\n\nIn addition, New Hampshire's Medicaid expansion, established on a  bipartisan basis, would end with any decrease in Federal funds, leaving  68,000 Granite Staters uninsured and devastating our hospitals and  community health centers.\n\nI have heard from literally thousands of Granite Staters on this  issue, including a woman…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…member of Somersworth Police department, rising from patrol officer to  Chief of Police in 2022. Throughout his career Chief McLin has played a  crucial role in supporting Granite Staters through the Adverse  Childhood Experiences Response Team (ACERT) and Comprehensive Opioid,  Stimulant, and Substance Use Program (COSSUP).\n\nIn addition to his decades…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688242/recognizingmc-the-achievements-and-retirement-of-somersworth-police-chief-timothy-j-lin"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…We remember the  58,000 patriots who never returned home safely to the warm embrace of  their families. Today, their names are hauntingly etched into the two  faces of black granite in our Nation's Capital known simply as The  Wall.\n\nA replica of this very wall, almost 300 feet long, will be on display  in my district from April 17 to April 21, 2025,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Dell'Orto is a passionate historian and a mentor. He spent most  of his career teaching AP U.S. History, IB History of the Americas,  Military History, and World History at Granite Bay High School.\n\nNot only does Mr. Dell'Orto have a deep understanding of these  subjects but he also knows how to bring historical events to life. His  integrated and engaging…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…most recognizable  temple of  The Church of Jesus Christ of Latter-day Saints.\n\nMany visitors associate the temple with Utah's capital city. The  temple is built of native granite and took 40 years to complete, with  the goal to construct it so it would last throughout time.\n\nCome experience the spirit of this event with me.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698141/visiting-salt-lake-temple"}]