[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Republicans' big, ugly bill will cut  Pennsylvania's Medicaid program, known as Pennie, by about $53 million  over the next decade.\n\nWhat will happen to our parents and to our grandparents?\n\nSome facilities may be forced to make impossible decisions like  reducing staff or raising prices for those who don't qualify for  Medicaid. Others simply will not survive.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694077/nursing-homes"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…United States Representative, is a reminder for me of what it took for  myself and for people like me to be able to stand here.\n\nI know I was born on first base because my grandparents made  sacrifices for my father to be able to step up to the plate and swing  for the fences, and swing for the fences he did. He broke down color  barriers in his own right.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…pursuit of happiness, but who are we as a country if we backtrack on  those founding values? We would not be the country that inspired our  parents, our neighbors, and our grandparents to make a dangerous and  brave journey in the hopes that their children will have a better life  than they did.\n\nEveryone has a story that they can relate. Mine is about…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…is because the Bible that I  have, Mr. Speaker, doesn't say that you starve children, that you cut  off their healthcare, and that you cut off the healthcare for their  grandparents.\n\nMr. Speaker, if your Bible says that, then I submit that maybe you  change your Bible. That is because that is unchristianlike to kill  seniors and children.\n\nLet's talk…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…fighting because we possess those talents in fields  because we have suffered along the way.\n\nYou have heard the stories of our parents. You have heard the stories  of our grandparents. We just don't come tonight for a Special Order to  tell you our stories, but we want America to know that we are  suffering. We want America to know that we stand with…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…active member of his faith community. He and his wife, Alice Hutchins,  are parents to Machelle (Joyce) Hutchins, Allison (Andrea) Harrison,  and Tre Hutchins, and proud grandparents of TiGeronika Lindsey, Bryson  Hutchins, and Jru Harrison. He is a member of Empowerment Temple under  the leadership of Apostle Turkeisa Rushin.\n\nOn a personal note, Councilman…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…community because the State of Alabama did not provide a good  education to Black children. As explained in his autobiography, he  wanted to teach children, whose parents and grandparents had been  enslaved on plantations nearby, to be of better service to themselves,  their employers, and the community in which they lived.\n\nIn the 1930s, my father and his…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…for rural communities like mine in Hawaii, this bill isn't  abstract policy. It is about whether people can get care and whether  caregivers can keep going.\n\nI have met grandparents caring for grandchildren, parents caring for  children with disabilities, and adult children caring for aging loved  ones, often with no backup and no break.\n\nThat is why…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…afford.\n\nLook, New Mexicans aren't looking for handouts. They work hard. They  care for one another. I know it because I have lived it. When I was a  kid, we moved in with my grandparents, Celedon and Nestora Lujan. I  didn't understand it then, but I understand it now. We lived together  because we had to. Now, don't take that wrong--we were also blessed…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…and for coming here this  evening to talk with us.\n\nMr. Speaker, home health aides are some of the most essential workers  in our economy, taking care of our parents and grandparents as they age  and ensuring that sick and disabled people can live with dignity.\n\nIt is downright despicable that this administration has proposed to  reverse the rule requiring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…became one of the most important leaders in the  20th century civil rights movement. At a young age, Rustin learned the  values of nonviolence and peacekeeping from his grandparents' Quaker  faith, and he would continue to build these values into his life as a  civil rights movement leader.\n\nRustin attended City College of New York, where he joined…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…fast-tracked for deportation.\n\nLet's be clear: This isn't about catching dangerous criminals. It was  never about catching dangerous criminals.\n\nThese are moms, dads, students, grandparents, workers, people who are  trying to get through the legal process the right way, but ICE is  turning our courthouses into traps.\n\nThe very places that immigrants are supposed…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…immigrants from  the administration's authoritarian attacks. History presents us with  plenty of inspiration. In some cases, it is someone who made it  possible for the grandparents of so many of my colleagues to be able to  serve in this very same Chamber.\n\nToday, I honor the legacy of Sister Frances Xavier Cabrini, better  known as Mother Cabrini,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…live fulfilling  lives with dignity.\n\nThe impacts of the $880 billion in cuts being proposed to Medicaid  are not statistics. They are children, parents, educators, and  grandparents. They are our neighbors and our friends.\n\nI heard from a father whose son was almost institutionalized. He was  getting ready to quit his job to take care of his son full…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690740/medicaid-is-a-lifeline"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…of media and the challenges facing traditional  broadcast television, ASMW remains a beloved and enduring institution.  It is now a generational program, with parents and grandparents proudly  watching their children and grandchildren compete on the same stage  where they once stood. Each year, the championship match becomes a  regional event, covered…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…is ready to lead the Cougs to  new heights in his first head coaching role.\n\nKirby grew up going to Cougar football games. Kirby said: ``For me,  this is home. We've got grandparents in Palouse. We've got aunts in  Pullman, aunts in Spokane. My parents just built a house in the Tri- Cities, so there's some incredible memories for my kids.'' They are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Association.\n\nMr. Folks has been married to his wife, Vickie, for 42 years. They  were blessed with three sons: Shannon (deceased), Dewan and Steven, Jr.  They are the proud grandparents of nine grandchildren and one great- grandchild.\n\nMr. Folks serves as an ordained Deacon with Mission Church of God by  Faith Ministry, where his wife serves as the Pastor.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688463/recognizing-the-retirement-of-steven-d-folks-sr-as-city-manager-of-anniston-alabama"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…financial, or neglect. For every elder abuse case that is reported, as  many as 24 go unreported, it is estimated.\n\nThese aren't just numbers. They are our parents, our grandparents,  our neighbors, and our veterans. Elder abuse isn't limited by geography  or income. It occurs in nursing homes and private residences, the very  places meant to offer…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…supper--beef was the main dish always, but still with more  fresh fruits, maybe some potatoes, some new potatoes. And, yes, we put  bacon in the new potatoes, but all my grandparents lived a long healthy  life on those diets as well.\n\nYou know, on a Saturday night--I don't want to forget. Once or twice  a month, on a Saturday night, we would finish work…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…extermination camps on       Polish soil to be properly maintained. It is also the place       where many of my paternal relatives from Zamosc perished,       including my great-grandparents Rabbi Yaacov and Dena Manzis       Zoberman. Visiting there in 2017, I led our group of       seventeen American Jews in the Kaddish, aware that I was       touching my…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…tragic for our  kids.\n\nEarlier this month--and I thought this was such an amazing stat--the  Federal Trade Commission revealed that in 2019, Instagram--many parents  and grandparents know their kids and grandkids like to show them  pictures on Instagram. Well, get this. Instagram encouraged  ``groomers'' to connect with children on its platform. These…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…offense with little kids. That is  because that is how the offender got access to the child.\n\nMr. SCHMIDT. Mr. Speaker, on our watch, we prosecuted parents, we  prosecuted grandparents, we prosecuted ministers, and we prosecuted  coaches.\n\nMr. Speaker, the only evidence you have is what that child can  testify to in front of a bunch of strangers in a jury…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Mr. President, across America, 1.3 million people live  in nursing homes. Many of us have parents, grandparents, or other loved  ones who rely on these homes for care and community in their golden  years. We understand just how vital nursing homes are--whether it is in  urban, suburban,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…our  men and women serving on the front line from illicit actors who would  use weapons bought with this technology to threaten them, to the very  mothers, fathers, and grandparents who are being taken advantage of by  foreign actors to steal their money to fund this type of threat.\n\nMr. Speaker, this bipartisan bill establishes a working group, a task…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…keep taking the drugs.\n\nIn any event, I strongly hope we take up this bill.\n\nI should also point out that last year doing doorbells, like  politicians do, I ran into two grandparents who had one granddaughter  and one grandson going down this rabbit hole. I felt so sorry for them  because when somebody makes this decision, it affects not only  themselves,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698356/protect-childrens-innocence-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Vietnam veteran in that story struck me. He  said:\n\nI'm no hero. The heroes are the ones that didn't get to       come back and have families, didn't get to become       grandparents. They're the heroes.\n\nMr. President, this is a common sentiment among veterans. I know my  dad, a World War II veteran, never talked much about himself; it was  always about…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…alone, the  Washington Department of Fish and Wildlife reported that three calves  were killed and two injured in just one 30-day period.\n\nFolks in our region know why our grandparents worked so hard to  control the gray wolf population. They understood that balance must be  kept between wildlife preservation and the livelihoods of those who  live and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…If next year we spend $94 million and we did that for everyone, we  could balance the budget.\n\nInterestingly, people who are emotionally involved with this--moms,  dads, grandparents with Alzheimer's--look at me and say: You know what?  For the good of the country, we can do that.\n\nYet if you talk to people around here, they go: Oh, you hate old  people.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…anniversary of the AmeriCorps Seniors Foster Grandparent  Program.\n\nThis is one of the oldest, most impactful senior service programs in  the country. Since 1965, foster grandparents, who are volunteers aged  55 and older, have provided consistent support, mentorship, and care to  children and youth.\n\nThrough this intergenerational service, they help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695216/recognizing-americorps-seniors-foster-grandparent-program"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…creation.\n\nIn the Dallas area, I met with Andy Ellard, the owner and general  manager of Manda Machine Company, a third-generation, family-owned  company in Dallas. Andy's grandparents founded the company in 1950,  operating the business out of a back room in their house. Eventually,  when the time came for them to retire, they sold the business to their…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}]