[{"senator": "Al Green", "party": "Democrat", "sentence": "…what  is happening now, and that is our government is devolving into  authoritarianism.\n\nFinally, the Citizens' Impeachment movement, this movement is  something that has grassroots elements associated with it across the  country. I am proud to say that they are part of the countdown to  impeachment.\n\nAgain, a flag will be flown in honor of these organizations…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…in 1992, the Leflore County chapter has become a  beacon of hope and unity in the Mississippi Delta. At a time when  division often dominates our national discourse, this grassroots  organization brings people together across racial and denominational  lines through intentional fellowship, shared meals, and mutual respect.\n\nMission Mississippi of Leflore…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…after all.  His irrational tariff policies are backfiring. If his backtracking on  environmental progress, threats to Social Security and VA benefits  weren't creating a grassroots pushback, then this wouldn't be  necessary. The unpopularity of his policies should lose him the  tightfisted control of this House.\n\nMr. Speaker, we cannot box following…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694768/redistricting"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Labor's Representative of the Year by the Labor's Educational &  Political Club Independent in recognition of his effectiveness in  organizing, legislative engagement, and grassroots mobilization. These  accolades reflect the tangible, community-level impact of Mr. Thomas'  contributions toward creating more equitable hiring practices, greater  workplace…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…housing, quality education, and more in Chicago and across  the State of Illinois.\n\nI am proud to have worked alongside Amisha during her 15 years as the  executive director of Grassroots Collaborative, where we opposed school  closures, championed affordable housing, and fought for critical  investments to our social safety net.\n\nAmisha is a fighter for peace,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…care about is profit. They don't  care that these data centers will absolutely make life miserable. All  they care about is the money and the power.\n\nI am so inspired by the grassroots movement in the State of Michigan  right now popping up all over the State to protect our communities from  data centers. I want them to know loud and clear, here in Congress,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697553/protecting-michigan-communities-from-data-centers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…legislation in this Congress to help  reunify families who remain divided from the war. I look forward to  continuing to work to support our veterans.\n\nI thank the Korean American Grassroots Conference and partner  organizations like the Council of Korean Americans, the Korea Economic  Institute, The Korea Society, the Korean American Institute, and  Remember…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…seeing the work that she will continue to do in  shaping the spiritual lives of those around her.\n\nWell done, Lieutenant Colonel Addison.                            Closing of GrassRoots\n\nMs. McBRIDE. Mr. Speaker, I rise today in recognition of the closing  of GrassRoots, a gift shop in Newark, Delaware, after 50 years in  business.\n\nWhat started as a small…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…its efforts to achieve a world free of  nuclear weapons and for demonstrating through witness testimony that  nuclear weapons must never be used again.\n\nNihon Hidankyo is a grassroots movement of atomic bomb survivors form  Hiroshima and Nagasaki. In 2 weeks, members of this organization along  with activists and citizens from Japan and around the world…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…lives on       through its alumni-many of whom have remained in Mississippi       and work tirelessly to improve their communities, including       through civic engagement, grassroots organizing, and       philanthropic leadership;\n\nWhereas more than 130 alumni from the graduating classes of       the 1960s, 1970s, and 1980s are expected to gather for…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…expand opportunity, ensure dignity, and  promote independence for individuals with intellectual and  developmental disabilities in Northern Virginia.\n\nWhat began in 1975 as a grassroots response to the lack of community- based housing for people with disabilities has grown into one of the  region's most respected providers of inclusive services. In its…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696045/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…no-questions-asked  grocery store that now serves more than a thousand families each month.\n\nTime and time again, Ms. Denson has stepped up to serve our most  vulnerable neighbors. Her grassroots work has touched thousands of  Oregonians and should serve as an inspiration to all of us.\n\nMr. Speaker, I thank Jennifer for her contributions and am grateful  to have her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695683/recognizing-jennifer-denson"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…surrounding the test site.\n\nIn 1989, before the dissolution of the Soviet Union, anti-nuclear war  activists in Kazakhstan established the Nevada-Semipalatinsk Movement.  This grassroots initiative supported by victims of Nevada's own nuclear  legacy sought the closure of Semipalatinsk and the cessation of nuclear  testing. Of the 18 planned detonations in…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the world of the human costs of explosive  testing of nuclear weapons.\n\nCivil society, too, has helped illuminate what is possible. The  Nevada-Semipalatinsk Movement, a grassroots anti-nuclear weapons  movement uniting citizens across continents, helped build the momentum  to end nuclear testing. We must draw on that same spirit today to  reinvigorate…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…All  three are committed Scarsdale volunteers for organizations like the  local PTAs, the League of Women Voters, and numerous other community  groups. This gives them the grassroots contacts and feel for what is  happening every day that they report on regularly. They report on what  is happening by being there in person at event after event.\n\nThe publication…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…of Republican candidates, an achievement that  demonstrates not only her dedication, but also her determination to  connect with voters and strengthen our Nation through grassroots  engagement. She has given thousands of hours of volunteer service,  never asking for recognition or reward. Her work has been marked by  passion, humility, and humor. Through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…indigenous  connection to their ancestral homeland; and\n\nWhereas, hate crimes directed against the Jewish community have  skyrocketed in recent years, inspiring the formation of a grassroots  End Jew Hatred civil rights movement to alter public discourse and make  Jew hatred unacceptable in contemporary society, empowering Jews with  positivity and strength to…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…Cleanup  Crew for their commitment to environmental preservation and education  in the town of Cornwall and across the Hudson Valley of New York State.\n\nSince 2023, this grassroots group has worked with community members  to clean up litter and illegal dumping around the town and educate the  public on the importance of conservation and environmental…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Americans  have made extraordinary contributions to every facet of American life-- strengthening our culture, economy, and society.\n\nThis alarming trend has inspired a growing grassroots civil rights  movement, End Jew Hatred, dedicated to making antisemitism and Jew- hatred unacceptable in contemporary American society. This movement  empowers Jews to live…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…both countries.\n\nCBYX is an excellent example of how cultural and political exchange  amongst citizens can positively impact international relations in a  different, more grassroots, and hands-on way.\n\nAs the co-chair of the bipartisan German-American Caucus and  representing Pennsylvania, a State with a long history of German  heritage, I am proud to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688275/recognizing-41st-anniversary-of-cbyx-exchange-program"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…which celebrates 50 years of providing confidential and  professional services for victims and survivors of domestic, dating,  and sexual violence.\n\nCentre Safe began as a grassroots effort in 1975 as the Centre County  Women's Resource Center. Since then, it has grown from a one-room  operation in State College to three locations which are the  administrative…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…as  enduring as their service.              Honoring the Holstine Family and Heroes Homestead\n\nMr. BAUMGARTNER. Mr. Speaker, I rise to recognize the Heroes  Homestead, a grassroots nonprofit founded by marine veteran Andrew  Holstine and his wife, Danielle.\n\nMy family and I recently participated in their annual 5K walk in  Spokane. This wasn't only…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691526/recognizing-washington-army-national-guard-1st-battalion-161st-infantry-regiment"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I rise today to recognize the outstanding  contributions that Shawn Woodruff has made through her work at the  Nature Coast Outreach Center. Shawn is a shining example of grassroots  impact and unwavering compassion. This nonprofit organization has  become a vital support system in our community, meeting both practical  needs and offering emotional encouragement…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…her throughout a  distinguished 20-year career in public service. She helped elect and  advise two U.S.  Presidents and two U.S. Attorneys General while leading national  grassroots and communications efforts that achieved historic gains  among minority, veteran, and faith voters.\n\nAppointed by President Trump as Deputy Assistant to the President and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Producers Federation, and in  particular Paul Bleiberg; the International Dairy Foods Association;  the Farm Bureau; the Pennsylvania Farm Bureau; and the most dedicated  grassroots movement in America, 97 Milk, including the leadership of  Bernie Morrissey and Sherry Bunting, Nelson Troutman, Krista Byler,  Christine Ebersole, Dr. Edward Silverman,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…again. As if to underscore the need for this  legislation, this same group, CHIRLA, that helped organize the L.A.  riots, has now announced that they will be leading the grassroots  organizing for Gavin Newsom's redistricting sham. The same group that  has benefited so generously from his largesse that has received funding  from California taxpayers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]