[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…office because he knows the communities, local leaders, and needs of  the Seventh District better than just about anyone.\n\nMr. Speaker, while we will miss him, we are grateful for his service  to Virginia's Seventh Congressional District and wish him every success  in his next endeavor serving Virginians.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…because of Muslim Americans like Captain Khan and the  thousands of Muslim American police and  Muslim American soldiers, sailors, marines, airmen, and guardians. I am  grateful for their service every day.\n\nThe contributions of Muslims to Virginia should not just be measured  by titles or economic impact; they are seen in generosity, compassion,  and community.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…the season.\n\nOn March 30, 2025, Kathy will retire from the YMCA. Over the last 30  years, Kathy has dedicated her life to the betterment of others. We are  deeply grateful for her service. The world could use a few more Kathy  Quigleys.\n\nMr. Speaker, I am proud to honor Kathy Quigley, and I ask that my  colleagues join me in recognizing her extraordinary…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…foolish  idea to think that this won't have a negative impact.\n\nThey are just trying to remove people from the program, and it is  cruel.\n\nPatrick is correct. I am grateful for his service as a registered  nurse at the VA hospital. I am grateful for all that he is doing to  love and cherish his two disabled children, who are on Medicaid.\n\nHe is exactly…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…profound impact one person can have when they commit to making  a difference.\n\nIt is clear Shae Burgess has made a profoundly positive impact on our  community, and  I am grateful for her service. May we all strive to serve our  communities with the same dedication and humility.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691987/recognizing-shae-burgess"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…County.\n\nIt is clear Maria Wilkinson has made a profoundly positive impact on  our community through her work as part of the Pasco County Human  Services Team, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contributed to the Valor and  Legacy program in a variety of meaningful ways.\n\nIt is clear Sue Simone has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Tyra Youngblood has made a profoundly positive  impact on our community, and I am grateful for her service. May we all  strive to serve our communities with the same dedication and humility.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692457/recognizing-tyra-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Mrs.  Gaston is that rare human being who is dedicated to helping humanity.\n\nIt is clear Tami Gaston has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692210/recognizing-tami-gaston"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…vision that everyone deserves a safe place to call home.\n\nIt is clear Charles A. ``Charlie'' Rogers has made a profoundly  positive impact on our cpmmunity, and I am grateful for his service.  May we all strive to serve our communities with the same dedication and  humility.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sometimes dealing  with personal health challenges along the way.\n\nIt is clear Lt. Colonel Kathy Logue has made a profoundly positive  impact on our community, and I am grateful for her service. May we all  strive to serve our communities with the same dedication and humility.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…is an integral part of the Double Branch school climate  and culture.\n\nIt is clear Emily Mazzaro has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…chairing the committee for the  whole-council camporee this coming year.\n\nIt is clear James Sheridan has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…County in Congress, I have seen the  impact of his work up close. He has been a strong advocate for the  community, a trusted partner, and a genuinely good man. We are grateful  for his service, and I wish him all the best in his next chapter.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697946/recognizing-representative-harry-warren"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sweetheart of 50+ years, and his children and grandchildren  keep him busy.\n\nIt is clear Jerry Phillips has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for hospice saved my life, and I  hope it does the same for others too.''\n\nIt is clear Joan Moore has made a profoundly positive impact on our  commuity, and I am grateful for her service. May we all strive to serve  our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Services Team is a truly deserving nominee for the Heros Among Us  Award.\n\nIt is clear Jordan French has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of  responsibility and pride in her work. Her dedication, hard work, and  commitment to BMS have made an undeniable difference in our community,  and we are deeply grateful for her service.\n\nIt is clear Cindy Gandy Mahon has made a profoundly positive impact  on our community, and I am grateful for her service. May we all strive  to serve our communities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…true hero to  YFA and to every young life touched by the RAP House.\n\nIt is clear Victoria Barley has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}]