[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…in which our country has built on the  foundation that is our Constitution.\n\nThe Framers could not conceive exactly what the future would bring,  but they did anticipate a great deal, in significant part because they  could count on some of the immutable characteristics of human nature,  of institutions, of communities--like the attraction of the  accumulation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…govern the use of military force.\n\nNot since the very early part of this century has Congress approved  any authorization for the use of military  force. Nevertheless, a great deal of military force has been, in fact,  used by the United States, since then, in far-flung places in the  world.\n\nIn fact, post-World War II, the war powers have been utilized…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Mr. Chair, I yield an additional 1 minute to the  gentleman from New York.\n\nMr. PALLONE. Mr. Chairman, I yield myself such time as I may consume.\n\nMr. Chairman, I have a great deal of respect for the chairman of the  Health Subcommittee, but he goes on to talk about how the Republicans  are supporting these programs, and it is simply not true.\n\nMr.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…just a matter of moving  money around on paper until you are able to make sure your taxes just  go poof. These big, profitable corporations and private equity firms  got a great deal from the Trump administration last year.\n\nThis debate is about a simple change in policy from the Treasury  Department that handed them $10.3 billion. If you ask me, they…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…them by suggesting the system of veterans'  benefits is overgenerous is grossly insulting to me, and I am sure to  Americans, as well. If anything, we know there are still a great deal  of toxic exposures, locations, injuries, and illnesses that VA doesn't  recognize or cover.\n\nToo many veterans and their families are left waiting for help. If  anything,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…increase cost transparency for hotels, motels, and short-term  rentals.\n\nMr. Speaker, have you ever planned a vacation and when you searched  online, you thought you found a great deal at a hotel or a short-term  rental, but then you were surprised at check-in or check-out that there  were a lot of surprise fees added on?\n\nThis piece of legislation will…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…European Commission, forcing 15  percent taxes on imports. Now, compare that to what we were paying in  2024 at this same time. That was about 1.5 percent. So under this great  deal that the President negotiated with the EU, Americans are going to  be paying 10 times what we paid last year. And with Japan, President  Trump agreed to a 15-percent tax.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…millions of Americans will cause undue  friction in our healthcare system and only serve to divide us.\n\nMr. Speaker, our healthcare system is by no means perfect. We have a  great deal of work to do to improve the system for everyone and to  reduce disparities, but we must start by following what we often call  the Hippocratic oath to first do no harm.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…insurance!\n\nI avoided doing [necessary] follow up with doctors due to       not being able to afford additional needed care.\n\nThere were hard times on top of this. I suffered a great       deal of depression due to losing my job during my leave of       absence. This medical debt is currently following me. There       was a point of time that I was rebuilding…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…father was a physician. One of the main  things he was taught in medical school--and I think it is part of the  Hippocratic oath--is do no harm.\n\nOur budgets are doing a great deal of harm to our healthcare system.\n\nThe Association of Medical Colleges came out with a statement  yesterday that our healthcare is in existential crisis because of the  cuts…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692406/do-no-harm"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I have to respond to the chairman of our committee who,  of course, I respect a great deal.\n\nThe Republicans have never supported the Affordable Care Act. When we  passed it--and I was one of the drafters how many years ago now--I  think there were none--certainly…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Trump administration is unapologetic in its efforts to target  immigrants, the Constitution, and the law be damned.\n\nNow, in addition to being unconstitutional, this wastes a great deal  of tax dollars because they are detaining masses of people in these  large sweeps, only to have to release them when proof of their legal  status is shown. It also horrifies…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Bolts Ditch structure.\n\nIt builds on legislation that we successfully got across the finish  line several years ago. It is common sense. It is bipartisan, and it  means a great deal to the folks that I represent in western Colorado.\n\nI hope that my colleagues can support this measure. I look forward to  doing everything that needs to be done to get it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…a happy 60th birthday, I call on all  Georgians and all Americans across this country to take action and  speak out in support of our children. What we do today matters a great  deal for the future of our next generation.\n\nIt is my hope and my prayer that 60 years from now this body will be  comprised of many more Head Start alumni, living proof that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691246/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…to frame their cuts as eliminating wasteful  Democratic spending, but the communities and constituents they were  elected to represent, they are going to stand to lose a great deal. The  States with the highest spikes in energy prices are going to be South  Carolina, Kentucky, Oklahoma, Mississippi, and Louisiana under this  bill. We are taking out…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…prosperity you do in the United States.\n\nIn this hearing, we heard of a woman who is a member of the Finnish  Parliament. She was charged with a crime and has had to go through a  great deal of legal work to not be penalized yet because she quoted the  Bible in Finland.\n\nThe Finnish Government had apparently decided, particularly what I  guess this body would…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school track and  field relay team in Ohio's Fifth Congressional District. The young  women of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693513/special-recognition-of-oberlin-high-schools-girls-4x100-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school basketball  team in Ohio's Fifth Congressional District. The young women of the  Columbus…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690078/recognizing-columbus-grove-high-school-winning-the-division-vi-state-girls-basketball"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…by choice but by obligation.\n\nWhen relocated to another State, servicemembers uproot their whole  lives to answer the call to serve and their families often sacrifice a  great deal.\n\nFor servicemembers who have dependents with disabilities, the  sacrifice can greatly impact their livelihood. Unfortunately, with  every move, dependent children must re-enter…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school track and  field relay team in Ohio's Fifth Congressional District. The young  women of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693428/special-recognition-of-oberlin-high-schools-girls-4x200-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…more than 31,000--31,000--requests from Senators  for these six bills alone.\n\nOver the last months, our subcommittees have worked through all of  these requests and done a great deal of important work. They have also  worked hard on a bipartisan basis with their House counterparts to  reconcile House and Senate priorities for these bills, as well as those…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Isabella Zahn, a senior at  Coldwater…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693373/special-recognition-of-isabella-zahn-for-winning-the-division-iii-state-track-and-field-title-for-the-200-meter-dash-400-meter-dash-and-long-jump"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. I would like to talk about a topic that may seem  irrelevant to the average person at first glance, but it actually  affects all of us a great deal more than we might imagine. A tiny but  vicious parasite known as the New World screwworm is infecting cattle  across Mexico, and it is getting closer and closer to the United…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…committees of  jurisdiction have their work cut out for them to pencil in the details  of the precise policies that will then require the President's  signature.\n\nI spent a great deal of time back home hearing about the importance  of these tax cuts and how they have benefited not just Texas families  but small businesses throughout the State.\n\nI know…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school basketball  team in Ohio's Fifth Congressional District. The young women of the  Bellevue…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689987/recognizing-bellevue-high-school-winning-the-division-iv-state-girls-basketball"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Mr. President, my Republican colleagues and I spent a  great deal of time this Congress focused on securing justice for  victims of crimes committed by illegal aliens.\n\nUnfortunately, during the last administration, the Biden  administration…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Owen Scott, a senior at Van  Wert High…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693332/special-recognition-of-owen-scott-for-winning-the-division-ii-state-track-and-field-title-for-the-1600-meter-run"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Rania Brown, a senior at Avon  High School,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693391/special-recognition-of-rania-brown-for-winning-the-division-i-state-track-and-field-title-for-the-discus-throw"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school cheer team  in Ohio's 5th Congressional District. The young student athletes of the  Norwalk…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698000/recognizing-the-norwalk-high-school-cheer-team-on-winning-the-division-iii-ohscca-best-in-the-state-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school volleyball  team in Ohio's 5th Congressional District. The young women of the Avon  High…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}]