[{"senator": "Cleo Fields", "party": "Democrat", "sentence": "…beyond slogans, when we truly see each other as fellow  citizens on one shared journey, we find that what unites us is far  greater than what divides us.\n\nWhile the temptation is great, we cannot let this moment divide us.  We were never meant to be the divided States. We were created as and  have thrived for over 250 years as the United States.\n\nMr. FIELDS.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…alliance remains strong and enduring.\n\nIt would not be possible to hold an event of this magnitude without  the support and commitment of volunteers from the community. It is my  great honor to recognize the efforts and include in the Record the name  of the following individuals:\n\nSteve S. Lee, Victoria Lee, Taesung Lee, Brian Kim, Mi       Kyung An, Jae…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696020/recognizing-the-korean-american-association-of-the-washington-metropolitan-area-and-the-2025-korus-festival-volunteers"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…colleague, the  gentleman from Montana (Mr. Downing).\n\nI will point out that I am uniquely unqualified to address this bill  since my entire district is in an urban area, that of the great city of  Los Angeles. Yet, even I recognize the importance of getting capital to  our small businesses in rural areas.\n\nI strongly support this legislation, which would require…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…This eligibility criteria led to some jurisdictions being funded  and supported by the Securing the Cities program in one year but not  the next. The inconsistency has caused great harm.\n\nThis bill clears up the eligibility criteria for the program so that  it can be a steady, reliable source of support for cities. It removes  the statutory requirement…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, it is with great honor that I rise today to  co-anchor the CBC Special Order along with my distinguished colleague,  Representative Steny Hoyer of Maryland.\n\nFor the next 60 minutes, members…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…platforms hosting actual and computer-generated  nonconsensual intimate images have promised to address such abuses  online and protect their users but, nevertheless, victims report great  difficulty in getting such images removed from the internet. They tell  us they feel powerless as it spreads or even resurfaces years later.\n\nThe TAKE IT DOWN Act will require…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, water is a human right. We can't live without  it, but far too often our government treats it as just another product  to be sold.\n\nIn Michigan, the Great Lakes Water Authority voted to increase water  rates by 5.9 percent and sewage rates by 4.5 percent. They approved  these unaffordable increases despite unanimous and passionate…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…prevent veteran suicide. Without additional funding, this critical  program will expire later this year. We cannot and must not let that  happen.\n\nAfter sacrificing so much, our great veterans should never struggle  to get the care, recognition, and respect they have rightfully earned.  That is why I strongly urge my colleagues to support the en bloc  package.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…costs, and the policies of this  President will, once again, raise costs on Americans and make it harder  for them to access healthcare, mental health resources, or even get a  great education.\n\nThe next time we hear about workforce shortages or rising costs,  remember that this administration made the problem worse with this  move.               Homeownership…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…exceptional service.\n\nThroughout his tenure, Peter played a vital role in advancing the  University's mission, leading its federal, state, and community  relations efforts with great skill and dedication. Among his many  achievements, he was instrumental in the University's affiliation with  NextCorps, strengthening support for the Laboratory for Laser…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…enforcement around the country and back home  in Colorado.\n\nOn Capitol Hill, the men and women of the U.S. Capitol Police protect  us and the seat of our democracy. I personally owe a great debt of  gratitude to these officers who responded to the attack on the U.S.  Capitol on January 6, 2021.\n\nMany of my colleagues and I were trapped right up there in the House…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, it is with great honor that I rise today  to co-anchor this Congressional Black Caucus Special Order hour, along  with my distinguished colleague from Louisiana (Mr. Carter).\n\nFor the next…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…here in  our Nation's Capitol. Of course, I am doing so on behalf of my  incredible constituents in southeast Michigan, but also for all the  residents of Michigan and this great Nation for, you see, the exercise  of our democracy is ensconced and inscribed here in our House Chamber  and on our House floor. We use both our voice and our vote to move…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the thousands and tens of  thousands of citizens there who so deeply care about victory for  Ukraine.\n\nLet me now move to a highly capable Member from the eastern part of  the great State of Pennsylvania, Congresswoman Madeleine Dean.\n\nMs. KAPTUR. Mr. Speaker, I thank Congresswoman Dean so very much for  joining us and for her firm, firm support of Ukraine…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…landscape, strengthened professional  standards in the venue management field, and supported countless  colleagues, businesses, and community partners.\n\nMr. Speaker, it is with great pride and deep appreciation that I  recognize Jim Brown for his remarkable career and his enduring  contributions to the Rochester community. His legacy of service will  continue…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…DOGE, going through and trying  to cut costs, we do have to be mindful that we are getting the best  products for the Federal Government to use because that actually does  yield great results for the American people.\n\nMoreover, we, as Congress, have an obligation to fully understand the  impacts of utilizing the LPTA.\n\nOne example of when the LPTA may not…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…am prepared to close and I reserve the  balance of my time.\n\nMr. Speaker, I am obsessed with the threat of a looming debt crisis  and the irreparable harm it would do to our great economy, our national  security, our leadership in the world, and our children's future.\n\nWe have an opportunity. It is a historic generational opportunity to  right this ship,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…first-team all-State, and to catcher Madalyn Wolfe, also  first-team, All-State, whose leadership anchored the team throughout  the season.\n\nMr. Speaker, I congratulate these great athletes, their coaches, and  the entire Broadway community on a historic and inspiring championship  year.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…rival high schools, and  we actually competed against each other in speech and debate. He was a  Billings West Golden Bear, and I was a Bozeman Hawk. This is what makes  America great. Two kids from Montana dreamed big, they worked hard, and  now we have the opportunity to serve the State we love together.\n\nBill received his undergraduate degree from the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…every corner of  this Earth.\n\nOrganized by local citizen leaders, churches, nonprofits, and  volunteers of all ages, Love Thy City is a day of service to others,  rooted in the great command to love our neighbors. That is a principle  that transcends politics and parties, race and gender, and every other  perceived difference between us.\n\nIt is our shared…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…enrichment.\n\nHis exemplary record of military valor, educational leadership, and  civic dedication makes him an ideal recipient of the Congressional  Veteran Commendation. It is with great honor and respect that I present  retired USA Lieutenant Colonel William (Bill) Patterson Matthews with a  Congressional Veteran Commendation from the 17th Congressional District…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Owen Scott, a senior at Van  Wert…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693332/special-recognition-of-owen-scott-for-winning-the-division-ii-state-track-and-field-title-for-the-1600-meter-run"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…his wife, Vickie, for 42 years. They  were blessed with three sons: Shannon (deceased), Dewan and Steven, Jr.  They are the proud grandparents of nine grandchildren and one great- grandchild.\n\nMr. Folks serves as an ordained Deacon with Mission Church of God by  Faith Ministry, where his wife serves as the Pastor.\n\nOn April 10, 2025, Mr. Folks will…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688463/recognizing-the-retirement-of-steven-d-folks-sr-as-city-manager-of-anniston-alabama"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…trillion on a party-line vote. Less than 9 percent of that  money, by the way, went to combat COVID. Tucked inside that bill was  $110 million to FEMA. We would think that is a great thing, right?\n\nHere is the problem. It wasn't for disaster recovery. It was to fund  something they were calling humanitarian assistance. What that was, was  to help illegal…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…a 3-day celebration that includes a  Revolutionary  War reenactment, displays of antique farm and lumbering tools,  historical presentations, quilts and other local crafts, great food,  and good friendship. This long-planned event demonstrates why Whiting  prides itself on being a small town with a big spirit.\n\nThe Revolutionary War reenactment is especially…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…gentlewoman for  yielding time. It is a reflection of what really should happen around  this place. We should love and help each other and try to find common  ground. It is a great representation of how Doug LaMalfa served.\n\nHe was a man of the people. He served his people well. He was a man  of the land. He loved his land. He loved his rice. He would…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698668/protecting-healthcare-for-millions-of-americans"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…somewhere across the country or the globe where maybe  they have a home that they have to leave and put it up for sale or they  have to rent it out while they are gone. There are a great number of  circumstances that affect our servicemembers with their homes when they  are not around to be the immediate tenants of their homes.\n\nThis piece of legislation comes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695472/servicemember-residence-protection-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…just borne by our servicemembers  but also by their families who support them and by their children who  are left at home while we send them into harm's way to defend this  great country and all that she represents.\n\nTo my brothers and sisters in arms in Montana and across this great  Nation, I thank them. I thank them for taking the watch. I thank…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690884/military-appreciation-month"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…exemption  from the able-bodied requirement for substance use disorder recovery  and mental health.\n\nMr. Chair, I yield 2 minutes to the gentlewoman from Florida (Mrs.  Cammack), my great friend and a member of the Energy and Commerce  Committee.\n\nMr. GUTHRIE. Mr. Chair, I will remind you that we spend about almost  $700 billion in Medicaid. When this bill goes…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Memorial.\n\nHis continued civic work through service on the Papio-Missouri River  Natural Resources District Board, and as a founding member of 100 Black  Men of Omaha leave a great mark in our city.\n\nMr. Conley and his wife, Teresa, have three children and have resided  in the same North Omaha district they have dedicated themselves to for  over 40 years.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}]