[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…``amigo'' means friend. It has been lost in the journey. The  meaning of that word has been lost, and I may add maybe mutilated, but  I am here to call Chuy tonight ``my great friend''; ``mi gran amigo.''", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…the city of Chicago--are  you kidding?\n\nThere has not been one single person that has stood up in Chicago and  said that there should be some sort of punishment for our great friend.  I mean, he has been there every day of the year helping people, every  day of the most recent years helping people because we know that people  have been in Chicago trying…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696779/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Madam Speaker, I thank the gentleman for yielding.\n\nMadam Speaker, Georgia has long been a great friend to the United  States. I went to Georgia for their election when they elected the  Georgian Dream ticket about 12 years ago, but the Georgian Dream party  has turned into…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…neighbors. And, according to this rule, they would be good  neighbors, but the EPA is rolling it back, withdrawing it.\n\nAnd so I am grateful to be here with two champions, my great friend  and neighbor the Senator from Rhode Island, Senator Whitehouse, who has  made this battle a constant struggle from his seat on the floor, in  meetings, in townhalls, in…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…are going to close a bridge as it goes to Canada,  like Canada is an enemy. I have not met anybody in America who was ever  mad at Canada for anything. They have been a great friend, great ally,  and a great neighbor.\n\nLet's have a tariff on NATO because of Greenland. Let's have a tariff  on South Korea because of who they talk to in an international…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699969/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Mr. President, as we close this colloquy, I want to  thank my colleagues who have come to the floor: Senators Durbin, Kim,  Welch, Whitehouse, Hirono, Schiff, and now my great friend and  colleague Senator Booker.\n\nTo my Republican friends, let me just say that there is ample  evidence on the record already to say no to this nominee. But even if  you…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Dallas Regional Chamber. Under his guidance, the Chamber has  helped make North Texas one of the most dynamic and business-friendly  regions in  America. Dale has also been a great friend, we've shared many  conversations about leadership, community, and our love of baseball. I  congratulate him on his remarkable tenure and thank him for  representing the…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696653/recognizing-dale-petroskey"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…and  congratulations to my dear friend, Steny Hoyer, on the announcement  that he has made today. We wish him the very best.\n\nMr. Speaker, I rise today to pay tribute to a great friend and fellow  northwest Arkansan, Doug McMillon, who steps away at the end of this  month from a 12-year run as chief executive officer of Fortune 1,  Walmart, in Bentonville,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Mr. BIGGS of Arizona. Madam Chair, Taiwan is a great friend of the  United States, and it is a unique friend to Arizona.\n\nThe CCP uses every tool it can, including maps, to undermine truth  and assert illegitimate claims over sovereign…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693690/department-of-defense-appropriations-act-2026"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…unfocused spending and reduces bureaucratic  bloat.\n\nBefore I get into specifics, let me thank my Subcommittee Ranking  Member  Jim Clyburn for his partnership. He has been a great friend,  and he has been an invaluable asset and partner through this process. I  appreciate his dedication to crafting this division of the bill and to  advancing the entire package.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…safeguard our most vulnerable.\n\nI urge my colleagues to join me in voting in favor of S. 146. The  House sponsor is the gentlewoman from Florida (Ms. Salazar). She is a  great friend of mine. Let's get this done. We need to be protecting our  children.\n\nMr. BILIRAKIS.  Salazar), the House sponsor of this  particular bill, who is my good friend and a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…around  Duluth for 27 years. He is a faithful, faithful servant of our Lord,  Jesus Christ, as reflected by his homilies on a daily basis.\n\nNot only is Father Richard Kunst a great friend to our family but to  the Catholic family in and around Duluth, Minnesota.\n\nI thank him for traveling all this way from Duluth, Minnesota, to our  Nation's Capital to open…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694112/welcoming-reverend-richard-kunst"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…California from Oregon. This meant we worked together over  and over again on issues involving water to try to save it from the  grasp of misguided environmentalists.\n\nHe was a great friend and an incredible advocate for his district. He  did his very best for his constituents. He never gave up. He focused on  wolves, water, forests, and fire. May my good friend…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698720/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…from the able-bodied requirement for substance use disorder recovery  and mental health.\n\nMr. Chair, I yield 2 minutes to the gentlewoman from Florida (Mrs.  Cammack), my great friend and a member of the Energy and Commerce  Committee.\n\nMr. GUTHRIE. Mr. Chair, I will remind you that we spend about almost  $700 billion in Medicaid. When this bill goes…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Isaac Hayes to the floor of the Tennessee State Senate. The  gentleman from Tennessee (Mr. Cohen) is the first person who ever fed  me lobster, oddly enough. He has been a great friend, and he also  called my momma when my daddy died. I am very close to Steve. Even  though our political allegiances are about as far apart as they can  get, he is still my…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…significance the site holds in our military history and honor the  site where so many gave their last full measure of devotion.\n\nMr. Speaker, I express my gratitude to my great friend and classmate,  Chairman Bruce Westerman, for his partnership in ensuring our  battlefields and historic sites in upstate New York and across America  are preserved and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…hardworking, and unwavering in his commitment to others. His legacy  will live on through the countless lives he touched and the workers he  proudly fought for. He was a great friend, an honest broker, and a true  New Yorker. I will miss my friend dearly, and may he be at peace.                        Honoring John ``Spo'' Esposito\n\nMr. LAWLER. Mr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Madam Speaker, I rise today to recognize an incredible  public servant and a great friend, Mayor Marilyn Hatley of Myrtle  Beach, South Carolina, who is retiring after two decades of public  service.\n\nMarilyn has been a constant force for many years, leading…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…fantastic--the  creation of a new synagogue in Fairbanks, the northernmost Chabad in  the United States.\n\nIt began with a call from Rabbi Greenberg in Anchorage. He is a great  friend of mine, one of the leaders of our Jewish community throughout  the State. He asked Jay if he could host a young orthodox rabbi and his  wife for a short visit. Of course,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…was a faithful member of  the Church of Jesus Christ of Latter-day Saints. He loved Elvis, Jackie  Robinson, rhubarb, and reading the newspaper.\n\nRoger Reed was a great man, a great friend, and we honor his legacy.                           Commending Active4Youth\n\nMr. BAUMGARTNER. Mr. Speaker, as the father of five, with my youngest  daughter attending…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}]