[{"senator": "Al Green", "party": "Democrat", "sentence": "…vote for  you. This is a democracy. As such, in this democratic republic, I  choose to stand and fight this movement toward authoritarianism. I  stand to do so because the greatness of America is not going to be  found among a very few who have power concentrated in their hands or in  a single person who has power concentrated in his hands. That is not…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…state of Florida and to the United       States of America, contributing to the vibrant cultural,       historical, and social framework of American life; and\n\nWhereas, the greatness in American democracy and the       promise of liberty and opportunity have drawn countless       Jewish individuals to these shores, including those escaping       from…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…school that showed  excellence thrives here, and for a community that has so much to be  proud of.\n\nWe thank the players, coaches, families, and fans for reminding us  that greatness lives right here in Rochester. I cannot wait to see what  all these young people go on to do. We congratulate the Monroe Red  Jackets.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698991/congratulating-monroe-red-jackets"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…love, and I ought to be proud of it, proud to  be associated with it. I am proud because my ancestors were sacrificed  for more than 240 years  to lay the foundation for the greatness of this country, the economic  foundation. They were sacrificed. They were enslaved. They have never  been given the honor and respect that they merit.\n\nWe have respected…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…accessible and  affordable for all of its citizens.\n\nI am proud to be a part of what I consider to be a great country.  There is no need of being made great. We have to make that greatness  accessible to everybody, affordable by everybody. That is what  educating everybody is all about.\n\nMr. Speaker, I thank the gentlewoman for the Special Order.\n\nMr. Speaker,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…`The Trump administration's policies are delivering much-needed  economic relief for everyday Americans while laying the groundwork for  a long-term restoration of American greatness,' White House spokesman  Kush Desai said in a statement, noting that inflation cooled in March  and that gross private domestic investment increased by 22 percent in  the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…time than at any time       I can remember. Our deliberations can still be important and       useful, but I think we would all agree they haven't been       overburdened by greatness lately. Right now, they aren't       producing much for the American people.\n\nBoth sides have let this happen. Let's leave the history of       who shot first to the historians.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…threaten programs. It threatens progress.  We must fight back.\n\nLet's protect our students, support our researchers, and defend the  right for everyone to dream big and achieve greatness in the United  States of America.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…CAFTA,  all these trade agreements, the Korean agreement, is that they  outsourced our jobs to cheap labor, and these communities are trying to  restore themselves.\n\nThere is a greatness to these communities. There is an industrial  muscle and a patriotism that is important to acknowledge and not to  say: Well, we are done with them.\n\nNo. We need to focus…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…commitment to a country? How could  they have that love for a country that history had shown them did not  love them in the same manner?\n\nThey held it because they knew that the greatness of America was  really about what America could be and what it could be for them. Even  if they came here in the bowels of slave ships, even if they slaved as  laborers in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that has lasted until  today.\n\nNow, what I did not expect is for their poems to be so good. I was  actually literally shocked. I look at you all, and I just don't expect  greatness. But your poems were exceptional. I literally texted Senator  Britt in agony.\n\nI was like, how do we decide on which poems to choose, because in  past page classes--I hope…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…participate. The men and women we are  honoring tonight, as we commemorate the 100th year of celebrating Black  history, made memorable and consequential contributions to the  greatness of this country. It should not be insulting to any red- blooded American to hear about them, read about them, and learn about  them in the same manner that we learn about…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…certainly, but even more for the  ideals it represents and the justice with which it acts.\n\nThat effort must extend beyond this House. I fear that America is  heading not toward greatness but toward smallness, pettiness,  divisiveness, lawlessness, and disdainfulness.\n\nWe must respect and love one another. We must remember that we are  not great or unique…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to a diverse, equitable, and  inclusive telling of our Nation's history so that young girls and boys  from across the country and around the world continue to strive for  greatness, knowing that their dreams are always possible in the United  States of America.\n\nMs. De La CRUZ.  Malliotakis).", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…W. Bush.\n\n``And finally, the museum showcases the talent of some of our finest  Americans. The galleries celebrate not only African-American equality  but African-American greatness. I can't help but note that a huge  influence in my teenage years is honored here, the great Chuck Berry;  or my baseball idol growing up in far West Texas, the great Willie…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…renaming symbolizes  Republicans' commitment to putting America first, and honors the Gulf  of America's important role in unleashing American energy and our  Nation's return to greatness.\n\nMr. WESTERMAN.  Greene), the lead sponsor of this legislation.\n\nMr. Speaker, just earlier this week, this very committee spent 14  hours in a markup on our reconciliation…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…generations that follow by  recognizing these standout citizens--some of them citizen warriors who  helped us win World War II--so that when future Americans are called to  greatness, they, too, in Clyde Milligan's words, will do anything for  their country.\n\nOn this monumental birthday, we all--from the U.S. Senate back to his  church in Whitestown--send…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…aligning resources to actually meet them. But this time around, the  stakes are a lot higher. A shortsighted NDS that doesn't align with the  President's vision of American greatness and peace through strength  could wind up as the pretext to extend Biden-era constraints on our  military indefinitely.\n\nUnfortunately, early reports suggest that this risk…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Savannah, Georgia,  on July 11, 1733, making Savannah the largest Jewish settlement in the  English colonies in North America at the time; and\n\nWhereas, the belief in the greatness of the American way of life, the  freedoms enshrined in American law and jurisprudence, and the  opportunities sustained by American democracy drew generations of  Jewish…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…stabilized budget.\n\nI have always believed that people of America spend their money  better than Washington, D.C. does. In fact, it is just a fact that we  cannot achieve greatness when we are saddling our children with  unbearable amounts of debt. The President's efforts to root out fraud,  waste, and abuse is critical to restoring trust in our Nation's…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689466/restoring-trust-in-our-nations-government"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…rise  in support of H.R. 6938.\n\nFrom national security and law enforcement to American innovation and  space exploration, the CJS bill before us puts the Nation on a path to  greatness while reinforcing President Trump's bold agenda on trade and  combating illicit drug trafficking.\n\nTo continue the fight against the drug cartels that are ravaging  American…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698761/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…administration's failed policies, and I firmly believe  there is a brighter future ahead.\n\nI look forward to hearing from President Trump tonight as he outlines  his vision for American greatness.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank my friend from Arizona, and I would  really just commend the people who watch C-SPAN, all 14 of them, the  greatness of my friend from Arizona and how much he focuses on the  spending concerns of our country and the vast amount of debt that we  are passing down to our children and grandchildren…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…for his leadership. I look  forward to working with him and his administration to deliver policies  that deliver for American families and usher in a new era of American  greatness.                           Farewell to Riley Pagett\n\nMr. MANN. Mr. Speaker, the Big First District of Kansas is the third  largest ag-producing district in the country. Agriculture…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…direction  of this country demands it. The people in this country demand that we  keep moving forward and fixing the problems that are holding them back  and holding more greatness for this country back.\n\nMr. Speaker, I urge everybody to vote ``no,'' but anybody who doesn't  want to vote ``no'' needs to understand what they are blocking and  understand…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…competition-- all while setting a powerful example of determination and excellence.\n\nThey continue to raise the bar for what collegiate athletics can be,  showing that true greatness is defined by heart and perseverance.\n\nI know, on a personal level, each and every time I see these  wonderful student athletes in person, I am inspired. I have seen the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…developing lifesaving drugs, but it could be done in concert with  governments and universities. What we don't need is continued  profligate Federal funding in order to achieve greatness.\n\nThe Wright brothers, Henry Ford, the great inventors, the great  industrialists, the great innovators in technology, the entrepreneurs  out there, for the most part, are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Speaker, the 19-century French philosopher, Alexis de  Tocqueville, traveled across the United States in the early 1800s in  search of what he said was ``America's genius and greatness.'' He said  that it wasn't in the commodious harbors or the fertile fields, not the  public schools or institutions of higher learning, not the democratic  Congress even,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695810/welcoming-rev-elliott-j-powell"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…energy, American businesses, and American job creators to unleash the  engines of our economy, raise the tide of our economic standards, and  bring a new definition of American greatness to the world.\n\nPerhaps the reason why Democrats are so desperate to smear this  legislation is because they are caught in their own self-inflicted  malaise of denial. Perhaps…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…hangover, but Republicans in  Congress and President Trump have delivered. America is now reaching  new milestones under Republican leadership, turning the tide back to  American greatness.\n\nLet's just look at the economy. Quarter three GDP growth was a  roaring 4.3 percent, the fastest growth in years. The deficit is being  addressed. The Federal Government's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]