[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…sons--all serving in the U.S. Marine Corps.\n\nMr. Speaker, we make movies about families like this. He has three  sons who are ready to make the ultimate sacrifice for this great  Nation, and, instead, he is being held in custody in an ICE facility in  Los Angeles.\n\nOur Federal agents should be taking criminals off of our streets, not  gentlemen like this.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693093/wake-up-call-for-immigration-reform"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…have  tanked the economy, President Trump's first 100 days have also  escalated this relentless assault on the checks and balances that have  been the foundation of our great Nation.\n\nOn day one, he pardoned more than 1,500 criminals who stormed this  very building on January 6. Hundreds of them were convicted of  violently assaulting law enforcement…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…placement act does seek to honor  Benjamin Franklin, as mentioned, a renowned author, inventor,  statesman, and dare I offer, the most important Founding Father of our  great Nation.\n\nMr. Franklin's accomplishments and inventions are numerous and  infamous. Electricity, bifocals, and the lightning rod are just a  couple of examples that every day still…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688221/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, as everyone in this Chamber knows and  everyone in our great Nation knows, we are in the midst of a healthcare  crisis. Now, the word ``crisis'' probably is the most overused term in  the political lexicon, but the American people know that…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…to come home to their families too. It is  just one small way I can honor those buddies who saved my life, every  other veteran, and all those still in the uniform of our great Nation  today.\n\nIf only this five-time draft dodger hadn't cried ``bone spurs'' when  his Nation needed him the most, then maybe he would understand the  first thing about what…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…that we grow that population of scientists, of  engineers who can then provide for the muscle of our innovation  economy, to allow for that intellectual capacity of this great Nation  and the pioneer spirit of this Nation to continue to foster this growth  of product delivery that speaks to the quality of life of people across  this great world.\n\nWe…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…that people from diverse backgrounds  worked together to create a new country, the Republican Congress and  Trump Administration advance hate and brutality to divide our great  nation.\n\nI reject this bill that makes poor people poorer, sick people sicker,  and hungry people hungrier.\n\nI reject this bill that bill rips health care from 17 million  Americans,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…celebration of birthdays.  What really matters is what we do between the birthdays to keep faith  with our men and women in uniform and afterward when they return to our  great Nation. We can leave no veteran behind in healthcare as well as  in education and training and in everything they need to be successful  when they come back. Let us rededicate…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, as you know, there are hundreds of  sovereign Tribal nations across the United States. Since this great  Nation's founding, the United States has signed hundreds of treaties  with Tribal nations and passed hundreds of laws reaffirming Tribal  sovereignty, self-determination, and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…behalf of African Americans.\n\nHe said: ``This museum is an important addition to our country for  many reasons. Here are three.\n\n``First, it shows our commitment to truth. A great nation does not  hide its history; it faces its flaws and corrects them. This museum  tells the truth, that a country founded on the promise of liberty held  millions in chains…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in some  country and turn to the local population to stand by us and risk their  lives to help us and when they agree, turn our backs on them again.  That is not what a great nation does.\n\nI think most Americans feel particularly that Afghans who risked  their lives to help our troops deserve better than to be forced to  return to the danger of Afghanistan.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…so that it can make way for  further tax cuts for the Nation's wealthiest 1 percent.\n\nAt over $500 billion, I would think Mr. Musk might say: Do you know  what? This is a great Nation that has provided me these great  opportunities. How about we care for them the same way this Nation has  cared for us?\n\nHe won't lose a moment of sleep at night. For more…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…here in  our Nation's Capitol. Of course, I am doing so on behalf of my  incredible constituents in southeast Michigan, but also for all the  residents of Michigan and this great Nation for, you see, the exercise  of our democracy is ensconced and inscribed here in our House Chamber  and on our House floor. We use both our voice and our vote to move our…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Madam Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I love America, and I  will do anything to protect our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Washington analyze the  solar and water power options with a goal of transitioning to 100  percent renewable energy by 2040.\n\nAlthough this program has helped so many across our great Nation, it  has never been formally codified. Our bill, the Energy Transitions  Initiative Authorization Act, will ensure this program can continue the  technical assistance offered…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…by delivering relief from the  death tax to more than 2 million family-owned farms, which ensures that  the next generation of American farmers can continue to feed this great  Nation.\n\nIn November, the American people voted for a change in leadership and  a return to the prosperity that our Nation enjoyed during President  Trump's first term.\n\nI now…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…interests, and erode our academic freedom.\n\nAmerican schools are not for sale, and they are for education, not  espionage. We cannot allow our students, the future of our great  Nation, to be corrupted by foreign adversaries who are systematically  and aggressively attempting to influence our Nation's K-12 schools.\n\nChairman Walberg has been a warrior…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…have become fast  responders, industrial workers, farmers, truck drivers, and public  servants. We are exceptionally grateful for their continued selfless  service to our great Nation. Since the conflict, the relationship  between the United States and Vietnam has also progressed to remarkable  milestones. Vietnam has emerged to become one of our closest…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and so is common sense.\n\nThis last year has reminded us of what is possible when America has a  competent and respected leader who understands the unique role that our  great Nation should fill on the world stage.\n\nI am grateful to have President Donald J. Trump back in the White  House with the strength and vision needed to be the leader of the free…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…From the very first day I set foot in this Chamber, I have  always promised my constituents that I would do everything within my  power to reinstate fiscal sanity to our great Nation.\n\nWhat is worse than a bankrupt country? How does that help children?  How does that help single moms? It doesn't. That is what this bill  attempts to stop or at least begin…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…expenses from 14 to 21 days to ease the burden of PCS moves. These are  not abstract numbers. They are real solutions for the families who  sacrifice so much to serve our great Nation.\n\nFinally, I traveled to Wallops Island in my district to visit the  Mid-Atlantic Regional Spaceport, where Virginia is playing a vital role  in America's return to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…and months for the IRS to issue a  replacement for a stolen refund check. That is a long time. Due to the  frequency of mail theft that is happening right now across this great  Nation, many taxpayers are having their replacement checks stolen, as  well. This is truly not acceptable. These outdated IRS regulations are  partially to blame.\n\nThe IRS' current…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Speaker, on behalf of the people of Missouri's 4th District, I  extend my deepest gratitude to every Marine, past, present, and future,  for their extraordinary service to our great Nation. May we continue to  honor their courage and uphold the values they so bravely defend.  Semper Fidelis.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696572/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…all--religion and morality enjoin this conduct; and  can it be that good policy does not equally enjoin it? It will be  worthy of a free, enlightened, and, at no distant period, a  great nation, to give to mankind the magnanimous and too novel example  of a people always guided by an exalted justice and benevolence. Who  can doubt that in the course of time and…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. Chairman, there was silence in the room because it is not 5,000  companies, it was 3,700. Why? It is because we don't have enough  qualified public companies in this great Nation--the largest economy in  the world--to have 5,000 public companies in the Wilshire 5000.\n\nTonight we do something about that. We make it easier to be a public  company in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…soldiers, and the freedoms we hold dear.\n\nMr. Speaker, let us extend our deepest appreciation to Master  Sergeant Tommy J. King for his decades of selfless service to this  great Nation. His legacy of leadership, sacrifice, and patriotism will  continue to inspire generations to come, and it is my distinct honor to  recognize him as our Veteran of the Month.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Congress, allowing us to monitor and evaluate the  effectiveness of their efforts.\n\nAs Members of Congress, it is our solemn duty to ensure the safety  and well-being of our great Nation. We cannot afford to ignore the  increased aggression and influence of China on the global stage.\n\nIn the 118th Congress, I was honored to have the backing of my  colleagues…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Thirteenth  Congressional District of Texas, I extend my sincere appreciation to  Jeff Billman for his years of hard work, dedication, and service to the  state of Texas and our great Nation.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…our officers, and we will fight to protect  those who protect us.\n\nGod bless our law enforcement community. God bless the Hooser family,  and may God continue to bless our great Nation.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691165/events-this-week"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…this done.\n\nLet's be crystal clear about the content of this historic bill. We  are restoring our borders once left defenseless and without redress. We  are protecting our great Nation by investing in our military and  military families. We are preserving tax cuts that made the United  States economy the envy of the world just 8 years ago. We are reviving…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}]