[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Redding (Amanda) of Baton Rouge,  Louisiana; and his sister, Gail Redding Corlee (Leonard) of Georgetown,  Georgia. ``CP'' also leaves behind seven grandchildren, nine great- grandchildren, two great-great-grandchildren, and numerous nieces,  nephews, and cousins.\n\nMr. Speaker, my wife Vivian and I, along with the more than 765,00  people of Georgia's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…children--Darrell, Brenda, Marcus, and Pamela--and  built a family that mirrored the values they lived: faith,  perseverance, and tenderness. John took pride in his grandchildren and  great-grandchildren; he celebrated their milestones as if they were his  own, and they drew strength from his example. Family, for Sheriff  Bowens, was not a private matter--it was the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Living Word Christian Center, in Forest Park  Illinois. Above all else, Mrs. Pough's greatest life joy continues to  be her legacy of 8 children, 19 grandchildren, 25 great-grandchildren,  and 26 great-great-grandchildren.\n\nMr. Speaker, I consider it both an honor and privilege to celebrate  the 100th birthday of Mrs. Essie Pough and commend her for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…hearts in marriage, a  steadfast partnership of 56 years. Family was his pride--his son Adrian  Jenkins, Jr., his late daughter Sharon Jenkins Hicks, grandchildren and  great-grandchildren, who will carry his laughter, his stories, and his  legacy forward.\n\nFor over 60 years Mr. Jenkins served Mount Zion Baptist Church as a  deacon, offering his time,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…how to live with  integrity, humor, and genuine heart.\n\nWith his beloved wife of 62 years, Linda; his children, Debbie,  Patti, Robert, and Julie; 13 grandchildren; 10 great-grandchildren; and  countless other family and friends who loved him dearly, I join to  celebrate a life of purpose and courage well-lived. May his example  forever inspire all those…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…carry on her legacy William O. Wagstaff, Jr.; William  O. Wagstaff, III; William O. Wagstaff, IV; her daughter-in-law,  Christina; and bonus children, grandchildren, great-grandchildren,  cousins, and friends who have become family.\n\nIt is an honor to recognize Lynne on the House floor today.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…has called home the Marian Park  Apartments, a Wheaton affordable housing community serving seniors and  families.\n\nWhile raising her children, grandchildren, and now great- grandchildren, Deborah has brought together her community to organize  for the resources they need to thrive, whether it is secure  transportation for school, childcare for working…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…late wife, Judy, who died too young and gave so much.\n\nTo my beloved daughters, Susan, Stefany, and Anne, who paid a price  for Dad's absences.\n\nTo my grandchildren and great-grandchildren, for giving me great joy.\n\nTo my mother, who thankfully lived to see her son become the  president of the Maryland State Senate.\n\nTo my staff, for serving me and their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…their life of service to others.\n\nIn 1965, Doris and Tomio bought their home in Santa Ana, California,  where they raised eight children and countless grandchildren and great- grandchildren. It was in this same house, on January 14, 2026, that  Doris passed away at the age of 93.\n\nDoris was surrounded by her family, sending her back to Heaven, where  they…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…those he served with, but he  is also the beloved father of three daughters and two stepsons, a proud  grandfather to 16 grandchildren, and a great-grandfather to 10 great- grandchildren. He has spent 43 years married to his devoted wife,  Evelyn. His nephew, Ryan Page, describes him not only as a remarkable  veteran but also as an extraordinary father…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…fighting the same fights that  our parents, our grandparents, and our great-grandparents fought, we  cannot leave those fights to our children, our grandchildren, or our  great-grandchildren if we expect this country to survive.\n\nThat is because what Dr. King also recognized was that now human  beings hold the power to destroy each other and to destroy this…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…family. Together with her beloved husband, Louis  Shlomo Leib Litvin, she raised five children, and today, she is the  proud grandmother to over 100 grandchildren and great-grandchildren,  including Jewish leaders in America, Cyprus, and Israel.\n\nGeraldine's devotion to her family is equaled only by her commitment  to her community. In Boston, she distinguished…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…married his wife, Lina. They were married for 65 years when she  passed away in 2011. Mr. Drake is survived by his son, Sam W. Drake, as  well as two grandsons and three great grandchildren.\n\nMr. Drake began working as a registered professional engineer and had  a distinguished career for over 50 years. He was a member of the  Institute of Electrical and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "French Hill", "party": "Republican", "sentence": "…spearhead, the 5th Armored Division, and the 29th Division  in Operation Kaput.\n\nJohn married his wife, Beverly, in 1947. They have 5 daughters, 17  grandchildren, and 19 great-grandchildren.\n\nAfter his service to our Nation in World War II, he worked at the  Krebs Brothers Supply Company as a traveling salesman, and he retired  as president of Krebs after…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…our  servicemen got paid for their sacrifices.\n\nMr. Fullerton created a wonderful family with his wife, Betty, and 2  children, 4 stepchildren, 13 grandchildren, and 8 great-grandchildren.\n\nI am proud to honor Mr. Fullerton on the floor today, and I thank him  for his service to our great Nation.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in 2016. They had three children: Dr. Orval  Lee Mullen, James Mullen of Oakwood, and Judith Wieging of Willshire.  The family has grown to include grandchildren and great-grandchildren.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to the life and service of Orval Mullen. On behalf of the Fifth  Congressional District of Ohio,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Lewerenz is survived by his wife of 56 years, Marilyn; his  children Lorraine Berg, Stephanie Hanks, Jennifer Brant, and Stephen  Lewerenz; nine grandchildren and three great-grandchildren. He will be  remembered as a patriot, mentor, and friend whose legacy of service,  faith, and love continues to inspire those who knew him.\n\nMr. Speaker, it is an honor…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…late wife Irene, a US Army  cadet nurse, and they were happily married for a remarkable 77 years.  Together, they had three daughters and many more grandchildren and  great-grandchildren. Walter earned his doctorate degree from the  University of Colorado and guided the doctoral research of 65 graduate  students at the University of Missouri. For his…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…age. Her legacy continues through her son who now pastors his own  church, carrying on the important work begun by his father. Today, her  children, grandchildren, and great-grandchildren honor and love her  deeply as she remains faithful to God.\n\nI congratulate Sylvia on reaching this remarkable milestone. May God  continue to pour out His abundant blessings…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…for her mother  until her passing and worked for many years at the Mary Brandon Nursing  Home in Oxford, Alabama, as a nurse's aide. Helen has two  grandchildren, six great-grandchildren and eight great-great  grandchildren. After retiring from the nursing home, Helen helped raise  her great-grandchildren and later helped at the Senior Center until she…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692887/recognizing-the-100th-birthday-of-helen-dramer-jarrell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…aviator turned first responder is  remarkable to witness. After returning from overseas, he married in  1945. Johnny has one daughter and many more grandchildren and great- grandchildren. He enjoys spending time with his family and building and  painting homes in his free time. Johnny has remained a devoted man of  faith, and he regularly attends First…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…married his high school  sweetheart, the love of his life, Paula Graham Lewis, with whom he has  shared 54 years of marriage, three kids, six grandchildren, and five  great grandchildren.\n\nAfter graduating, Dennis began his professional career with the  Department of Army at Red River Army Depot in 1972, where he would  serve for 39 years until his retirement…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…North Carolina, until 1967, when they moved to  Lake Norman.\n\nGertrude spent her entire career in the textile industry. She is the  proud grandmother of four, with ten great-grandchildren and five great- great-grandchildren. She is not shy to be blunt and share her many  years of wisdom with the younger generations.\n\nOn behalf of all of Western North…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688681/congratulating-gertrude-pauline-whitener-milburn-on-her-100th-birthday"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…children, Barak       (Katie), Debbie, Nate (Kate), Tim (Amy), Ben (Renata) Bjorge;       Carol's two children, Dawn and Brian Winter; sixteen       grandchildren; fifteen great grandchildren; and a number of       nieces and nephews. He was preceded in death by his parents,       Johs and Esther; brothers, John and Mark; grandson, Willie       Bjorge; and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…herself through nursing school, and achieved a career in the field.  Today, she is the proud matriarch of a growing family that includes  seven grandchildren and fourteen great-grandchildren. Her legacy of  love, perseverance, and hard work continues to shine through them.\n\nMr. Speaker, Marjorie Curtiss is an exceptional woman who answered  the call to support…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…is married to the former Dana Woodall, and they have  three daughters; Beth, Brooke, and Brittney; a stepdaughter, Jordan; a  stepson, Logan; six grandchildren; and 10 great-grandchildren.\n\nI'd like to congratulate Mr. Ziegenfuss on his outstanding career.  Please join me in thanking him for his many years of service to others  and wishing him well on…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690124/recognizing-hollister-city-administrator-rick-ziegenfuss"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…involved in the lives of her three children: Karen,  Ronald, and Loree, always providing a welcoming home where their  friends could gather.\n\nShe has five grandchildren, six great-grandchildren, and ten nieces  and nephews who all call her weekly and some even daily to keep in  touch. She is a social animal who loves being with people and is a  wonderful friend,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}]