[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…influence, values, and position sets us  apart.\n\nWhile FMS transfers are fit for many cases and situations, some  foreign partners have sought to expand their defense purchases via  greater direct commercial sales from U.S. firms. While these steps need  to be taken carefully, the review required by this bill is a smart step  in the right direction which I support.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694810/made-in-america-defense-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…person or in  any one institution.\n\nCongress has steadily over the years been ceding much of its  responsibility and authority to the executive branch. There is no  authority greater than the power to tax, and that is why, in the  Constitution, the power to impose tariffs resides in the House of  Representatives and the Senate. And shouldn't it be that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…and contributions of U.S.  Army veteran and community leader Alcario ``Al'' Castellano for his  dedication to advancing education, arts, and leadership in San Jose and  the greater Silicon Valley of California. He is not simply a tremendous  model of generosity but, more importantly, of purpose.\n\nAl Castellano won the lottery. No, I am not just talking…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…the United States Army. Over the course of  his heroic military career, he served in World War I, the Korean war,  and the Vietnam war.\n\nToday, Oscar is a proud member of the Greater Gary AMVETS Squadron  Post 6 where he can frequently be found supporting veterans throughout  northwest Indiana as they return home from service.\n\nIt is because of the sacrifices…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…businesses.\n\nMr. Speaker, I am grateful for Sayers Jewelers and congratulate them  on their continued success. I thank them for continuing to pour into  Smyrna, Kent County, and the greater central Delaware region one family  heirloom at a time.                        Congratulating Robbie Stephens\n\nMs. McBRIDE. Mr. Speaker, I rise today to congratulate Robbie…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…people have been killed in these strikes.\n\nWhat he is doing is un-American, unconstitutional, and downright  dangerous--dangerous for our servicemembers whom he is placing at  greater risk of retaliation, dangerous for Americans who should be  afraid that Trump is using military might to kill people without due  process or proper evidence, and dangerous…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…votes in a judicial election--an estimated  2,000 to 8,000 of which were military and overseas voters.\n\nWe are on the brink of exporting this injustice nationwide on a much  greater scale. Senator Padilla is right to sound the alarm about this,  and I am proud to join him. We want to help our fellow citizens  participate in our elections because only…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…compensation compared to their  workers. It is triggered if it is 50-1. That is the trigger, 50-1, that  a company will pay more in corporate tax if that is the case. The  greater the ratio, the larger the increase in the tax rate.\n\nThis will not only incentivize more reasonable CEO pay packages, but  it would also compel companies to increase their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…ships, crew members, and  critical ship-dependent supply chains.\n\nMr. Speaker, my bill is also a necessary step to ensure the  development of African economies and generate greater prosperity  through stability in Somalia. No country can be expected to grow and  prosper while facing serious piracy threats. We cannot allow violent  criminals and terrorists…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…providing students with an  educational foundation for success.\n\nThe attacks on higher education are equally devastating to the well- being of our citizens and economy, promoting a greater divide between  the haves and have nots. This Trump Administration seeks to slash key  federal programs that improve access to higher education, including  Pell Grants, loans,…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…been rolled  back by the current administration. Actually, I am somewhat surprised  that that happened.\n\nAmerica's grid is old. I hope President Trump hears this. It is under  greater strain. Our country actually set new records twice this past  July for peak electricity demand. It is getting hotter in many parts of  the country during the summer months,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…address the root issue that both sides  of the aisle are trying to address, which is the potential nefarious  foreign influence on college campuses from a list of countries far  greater than the four countries of concern outlined in the DETERRENT  Act.\n\nMr. NEGUSE. Mr. Speaker, I don't know if the gentleman from New York  (Mr. Goldman) is still here, but…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…United States argues that terminating its sweeping national       emergency tariffs would have catastrophic consequences for       our economy.\n\nThis is backwards. The greater threat to the economy of the       United States is not that the Trump Administration's tariffs       will be struck down, but that they will be allowed to remain       in…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the fiberoptic company has to enter that sanctuary  regularly in order to repair and rebury the cables that were improperly  installed. All of this would have been an even greater mess had this  bill been law at the time, had NOAA been unable to put some conditions  and some guardrails into the special use permit, had NOAA been unable  to charge that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…some to bristle. But a lack       of such distasteful realism can divert resources, time, and       energies away from where they're most needed.\n\nDesperate needs include far greater activism, public       messaging, and political organizing to avert the worst. The       top of the agenda should include: renewal of US-Russia New       START treaty set…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…opportunities to work with like-minded       nations to address such challenge.\n\n(9) Ongoing Federal Government efforts to improve the       investment climate and facilitate greater levels of foreign       direct investment in the United States from responsible       private-sector entities based in trusted countries.\n\n(10) Innovative and noteworthy initiatives…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…protect public       money. In particular, California has had difficulty stopping       fraudsters who steal benefits destined for the most       vulnerable among us. To gain a greater understanding of the       impact this theft has on Californians and the Nation, I am       asking that the GAO conduct a study on the amount of waste,       fraud, and abuse…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…production, use, and end use of       cement, concrete, and asphalt; or\n\n``(B) provide quality, durability, resilience, engineering,       or other performance metrics equal to or greater than       commercially available products.\n\n``(3) Medium- and high-temperature heat-generation       technologies used for the advanced production of low-      emissions…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…as sparingly as  possible, avoiding occasions of expense by cultivating peace, but  remembering also that timely disbursements to prepare for danger  frequently prevent much greater disbursements to repel it; avoiding  likewise the accumulation of debt, not only by shunning occasions of  expense, but by vigorous exertions in time of peace to discharge…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…continues to design and distribute tool and equipment  mounting solutions for the fire service, military, and other industries  in over 38 countries.\n\nIn 2007, Dick established the Greater Lancaster Museum of  Firefighting, located next to his business. The museum showcases  historic firefighting artifacts, including those from local departments  and even pieces…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…will ensure that we are as  ready as we can be for the upcoming fire season.\n\nFor example, we provide funding so that Agencies like the Bureau of  Land Management, BLM, have greater capacity to issue permits for energy  projects. We have included robust funding from mapping and minerals- related work at the USGS.\n\nWe have also provided funds to bolster…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…repealing  DOE's separate energy rules, restoring clear authority to HUD, which  already oversees construction and safety standards.\n\nLower costs mean more homes built and greater supply. More families  will be able to build equity and secure their future. This is  conservative policy at its best. It is less government, more  opportunity, and more relief…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698636/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…leaning in to try to seek the truth.\n\nTens of thousands of pages have been released by Jamie Comer, and 13  subpoenas have all been put out.\n\nNow the House just voted to have greater transparency. Time will tell  what that means in terms of what the court does and how they deal with  the grand jury secrecy and what they do to continue to redact and  protect…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…CEO of Trumark  Credit Union, whose birthday on November 3rd provides a fitting  occasion to honor her outstanding service and dedication to our  communities.\n\nBased in the Greater Philadelphia region, Ms. Kelly Botti has built a  distinguished career marked by integrity, compassion, and an unwavering  commitment to financial empowerment. As CEO of Trumark…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…give their lives, then we in this body can at least muster  the courage to debate if American military intervention is warranted.\n\nWashington's record of involvement in the Greater Middle East is  particularly abysmal, with dozens of campaigns costing thousands of  American lives and trillions of dollars. Afghanistan, Iraq, Syria,  Lebanon, Pakistan,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…athletes to receive scholarships.\n\nIn 1981, Sandra Day O'Connor, also a Republican, made history as the  first woman confirmed to the U.S. Supreme Court, paving the way for  greater female representation in our legal system.\n\nMost recently, President Trump authorized the Smithsonian American  Women's History Museum in 2020. In his first few days of his…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…healthcare, and education  wherever there are millions and millions of illegal aliens allowed to  come into the country and then placed throughout our country.\n\nOf equal, if not greater, concern to me is the rampant growth and the  effects of transnational criminal organizations that have grown  throughout our country. This is perhaps best seen with Tren…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…as to who we should be removing in  this country.\n\nRight now in America, we have no shortage of people who are here from  other countries. We are at an all-time high, even greater than the  1890s or 2010s in the number of people in this country who were not  born here. That is over 15 percent. We are naturalizing about 850,000  people a year.\n\nNevertheless,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…when people are more financially strapped than  when they have young children.\n\nI am strongly opposed to the so-called SALT Caucus of people who  desperately want to have a greater deduction for State and local taxes.  These people are, as a practical matter, looking to encourage their  Governors, their school boards, and their county boards to raise…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…influence.\n\n``A servant leader understands that life is not just a quest for  pleasure or power but of meaning. Meaning and happiness is found when  one is dedicated to a cause greater than oneself. The servant nature is  not bestowed and cannot be taken away; it is who one is deep inside.  Once this is recognized the servant intentionally chooses to lead.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]