[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…have,  particularly on safety net hospitals which Catholics are definitely a  part of all across the country. It fell on deaf ears.\n\nChildren's hospitals rely on Medicaid to a greater proportion than  other hospitals because they don't have elderly patients, obviously.  They are children's hospitals, and Medicare pays for a lot of those  patients. Children's…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692841/stop-this-insane-attack-on-healthcare-that-affects-every-single-american"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Mr. Speaker, I rise today to recognize the  Taiwanese American Chamber of Commerce of Greater Chicago (TACCGC) for  its longstanding contributions to economic development,  entrepreneurship, and civic engagement in the Greater Chicago region.\n\nFounded in 1988, TACCGC…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698927/commending-the-taiwanese-american-chamber-of-commerce-of-greater-chicago"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…I ask my colleagues to do everything we can  to help those living with rare diseases such as Huntington's Disease,  and to fight for more research, better support, and even greater care.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and build lasting and strategic partnerships that transform  lives.''\n\nEarlier this year, The Remedy Church moved to downtown Akron, further  establishing themselves in the greater Akron faith community. Their  reach goes beyond the church doors, as they have fed thousands, housed  hundreds, and ministered in prisons and throughout the community.\n\nMy…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Olympics to help transit agencies manage local  transportation in support of games across the country.\n\nMadam Speaker, this year's Transportation-Housing bill will provide  greater economic certainty to communities across the country and  improve the day-to-day lives of everyday people. I urge my colleagues  to support this legislation.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…our candor and honesty with our own  struggles.\n\nI am a man of great physical stature relative to my smaller Senator,  but I hope everybody in America knows this: I may have greater physical  stature, but since I met him as a college student, I have looked up to  my friend and my brother, a giant of a human,  Andy Kim.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…recognize Orlando Ortiz  during Hispanic American Heritage Month. His professional achievements  and civic service have left a lasting mark on both the Hispanic  community and the Greater Rochester region.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…votes in a judicial election--an estimated  2,000 to 8,000 of which were military and overseas voters.\n\nWe are on the brink of exporting this injustice nationwide on a much  greater scale. Senator Padilla is right to sound the alarm about this,  and I am proud to join him. We want to help our fellow citizens  participate in our elections because only…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…filings were impossible and  impractical to make.\n\nThese reforms are not radical. They are commonsense improvements  designed to deliver timely justice, lower court costs, and greater  access for everyday Americans, small businesses, and those who  currently face intimidating and burdensome procedures.\n\nIn a system where there are high stakes for individuals,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…today by Representative Jackson is an  important step toward remedying this problem by calling for the  Commerce Department's Bureau of Industry and Security, BIS, to conduct  greater transparency around license application, information, and  conduct checks for problematic companies in arms-embargoed nations.\n\nThis bill will also enable Congress to conduct…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…to  get here in just the next few minutes to speak on the next two bills.  Since they are not here yet, it does the House no harm for me to speak  more slowly and perhaps at greater length.\n\nMr. Speaker, I rise in support of H.R. 1190, the Expanding Access to  Capital for Rural Job Creators Act, sponsored by my colleague, the  gentleman from Montana (Mr.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…significant part of the vast  Pacific Ocean and our Earth's surface.\n\nThe Pacific Islands region remains critical to our national security  interests in the Indo-Pacific and advises greater U.S. engagement to  advance our shared interests and values, particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…that began  nearly a century ago.\n\nThat same spirit of innovation continues today through the Minnesota  Sustainable Aviation Fuel (SAF) Hub at MSP. This partnership, led by  Greater MSP, brings together partners such as Delta, Ecolab, Xcel  Energy, and the Metropolitan Airports Commission in the Nation's first  large-scale hub committed to scaling production…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…for  their benefits. With this closure, residents, likely on a fixed income,  will have to travel much longer distances: to Albany, to New Haven, or  to the south Bronx at greater expense, in some cases 4 hours one way on  public transit.\n\nThis is a financial and logistical hardship for people already  fighting for support. With the Westchester County…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…rendered, Leader Thune and Speaker Johnson have sided  with rightwing extremists who are happy to see these credits die. The  result: higher premiums, more uninsured Americans, greater uncertainty  for the people back home--especially people, actually, in the red  States.\n\nDemocrats will not relent on the issue of the cost of living, of how  difficult it…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…which they are licensed. This bill  affords qualified law enforcement officers the same privilege.\n\nThis legislation improves public safety as our officers face  increasingly greater dangers, and current restrictions hinder their  ability to carry firearms and protect themselves and others.\n\nAt a time when violent crime continues to plague our Nation,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…repealing  DOE's separate energy rules, restoring clear authority to HUD, which  already oversees construction and safety standards.\n\nLower costs mean more homes built and greater supply. More families  will be able to build equity and secure their future. This is  conservative policy at its best. It is less government, more  opportunity, and more relief…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698636/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692514/recognizing-kevin-vaughn"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…details of a tactical victory. But they owe it to the  American people--and, frankly, the long-suffering people of Venezuela-- to lay out the path to strategic success in much greater detail.\n\nIf the aim is to reestablish American primacy in its near abroad,  great. If the idea is to evict enemies who hate America from a valuable  foothold in our region,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California: spending billions  of billions, homelessness getting worse, and zero accountability.\n\nThe Governor even vetoed last year a bipartisan bill that would have  allowed for greater transparency and accountability when it comes to  homelessness spending.\n\nMr. Speaker, this is absolutely unacceptable, and it has gotten to  the point where I believe we…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…efficiently shared between agencies.\n\nInformation silos are not unique to the intelligence community, but  the need to overcome them is more acute. The consequences are far  greater if there are problems that arise. The intelligence community's  ability to detect and prevent attacks against our homeland depends on  coordinated and efficient information…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…production, use, and end use of       cement, concrete, and asphalt; or\n\n``(B) provide quality, durability, resilience, engineering,       or other performance metrics equal to or greater than       commercially available products.\n\n``(3) Medium- and high-temperature heat-generation       technologies used for the advanced production of low-      emissions…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…environment by 2025.\n\nJudy played an influential role in decisions vital to Warminster's  fiscal health and infrastructure. Highlights of her service include  transforming greater expertise into local water authority and making  improvements at Five Ponds Golf Course. Judy maintained the standard of  being thoughtful and resident-focused in her approach…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Hopi, Navajo, and Zuni Nations in the American Southwest. By providing  essential goods and services, ANA addresses critical community needs  while serving as a foundation for greater self-reliance and long-term  empowerment.\n\nConnie and Bill Eastburn founded this organization by recognizing  pressing needs in these Native American communities--warmth,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…States Code, is amended--\n\n(1) in clause (i), by striking ``5-year'' and inserting       ``10-year''; and\n\n(2) in clause (ii)--\n\n(A) in subclause (I)--\n\n(i) by inserting ``the greater of'' before ``0.4''; and\n\n(ii) by striking ``and'' at the end and inserting ``or'';       and\n\n(B) in subclause (II), by striking ``0.8'' and inserting       ``0.9''.\n\n(b)…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692424/recognizing-john-blaho"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…try to do better, especially those of us  in elected office.\n\nI ask every Member of this House, myself included, to think hard  about how we can approach our work here with a greater spirit of  collegiality and conciliation. In this terrible moment, that has to be  the path forward for our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692478/recognizing-michael-goodwin"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating  shelters for 5,800 individuals and 1,315 animals--an extraordinary feat  of operational precision and compassion. Despite personal hardships,  including…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…athletes to receive scholarships.\n\nIn 1981, Sandra Day O'Connor, also a Republican, made history as the  first woman confirmed to the U.S. Supreme Court, paving the way for  greater female representation in our legal system.\n\nMost recently, President Trump authorized the Smithsonian American  Women's History Museum in 2020. In his first few days of his…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}]