[{"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise, and I rise now to  proudly yield to a person with great honor and integrity. She is a  Member of this Congress who has been on the right side of  righteousness. She is a Member of this Congress who stands for those  who are among the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, it is with great honor that I rise today to  co-anchor this Congressional Black Caucus Special Order hour along with  my distinguished colleague from Oregon (Ms. Bynum).\n\nFor the next 60 minutes,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today with great honor to welcome to  our Nation's Capital His All-Holiness Ecumenical Patriarch Bartholomew,  Archbishop of Constantinople-New Rome and Ecumenical Patriarch. He is  the Spiritual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…activism reminds us how much our immigrants contribute to  our communities and shape the change they know we need.\n\nOn behalf of Illinois' 3rd Congressional District, it is my great  honor to congratulate Angelica Garcia Santos for her activism,  leadership, and advocacy.\n\nThank you, Angelica.\n\nEn honor al Mes de la Mujer, felicito a la lider comunitaria y…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, it is with great honor that I rise today  to co-anchor the CBC Special Order hour along with my distinguished  colleague, the legend,   James Clyburn.\n\nFor the next 60 minutes, members of the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, it is with great honor that I rise today  to co-anchor this CBC Special Order hour along with my distinguished  colleague, the gentleman from South Carolina (Mr. Clyburn).\n\nFor the next 60 minutes,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Speaker, it is with great honor that I rise today to  co-anchor the CBC Special Order along with my distinguished colleague,  Representative Steny Hoyer of Maryland.\n\nFor the next 60 minutes, members of…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…remains strong and enduring.\n\nIt would not be possible to hold an event of this magnitude without  the support and commitment of volunteers from the community. It is my  great honor to recognize the efforts and include in the Record the name  of the following individuals:\n\nSteve S. Lee, Victoria Lee, Taesung Lee, Brian Kim, Mi       Kyung An, Jae Byun,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696020/recognizing-the-korean-american-association-of-the-washington-metropolitan-area-and-the-2025-korus-festival-volunteers"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, it is with great honor that I rise  today to co-anchor this Congressional Black Caucus Special Order hour,  along with my distinguished colleague from the great State of Ohio,  Representative…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Teresa,  Archbishop Desmond Tutu, and Nelson Mandela. On behalf of New York's  20th Congressional District, I congratulate His All Holiness  Bartholomew on receiving this great honor.\n\nHe is the spiritual leader, and the Primus inter Pares--First among  Equals--of Orthodox Christianity worldwide, a Church of 300 million  people. Named as one of the world's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, it is a great honor for me to rise today to  co-anchor this Congressional Black Caucus Special Order hour alongside  my distinguished colleague, Congressman   James Clyburn of South  Carolina.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Act. Keep your hands off our Medicaid.\n\nThat is why, Mr. Speaker, I stand before you today to lift up stories  on behalf of the American people who don't have the great privilege and  honor to stand on this House floor as all of us do, Democrats and  Republicans alike, on behalf of the American people in this great  institution, the House of Representatives.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, it is with great honor that I rise today  for the third week in a row to anchor the Congressional Black Caucus'  Special Order hour to tell stories of people who stand to lose their  health insurance…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, it is a great honor that I rise  today to co-anchor this CBC Special Order hour, along with my  distinguished colleague from Virginia, Congresswoman Jennifer  McClellan.\n\nFor the next 60 minutes,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, it is with great honor that I rise today  to anchor this Congressional Black Caucus Special Order hour, as we  celebrate the life and legacy of Dr. Martin Luther King, Jr., whose  national holiday…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…nation which forgets its defenders will be itself  forgotten.'' His words perfectly encapsulate the importance of  remembering our Vietnam War veterans.\n\nI rise today with great honor to recognize the legacy and great  sacrifice of our Vietnam War veterans through The Wall That Heals,  which will be on display in Nassau County, Florida, from April 17th…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…H.R. 1682, the Benefits that Endure for Lifetimes Of Service  Act, or BELO'S Act, named after Marc Belo, a fellow veteran, aviation  legend, and friend with whom I had the great honor of serving.\n\nThis bill would honor our Nation's fallen heroes and their loved ones  by expanding free access to national parks to the families of veterans  who pass away…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…leadership,  education, and community policing. His enduring contributions have had  a lasting impact on the people of Texas and the broader law enforcement  community.\n\nIt is with great honor and respect that I present Danny Wallace Smith  with a Congressional Veteran Commendation from the 17th Congressional  District of Texas. His exemplary service to our Nation…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…secure the area.  Thanks to the swift and coordinated response of Sergeant Leap and his  fellow officers, this violent criminal was taken into custody.\n\nMr Speaker, it is my great honor to recognize Sergeant Leap and to  commend him for his heroism and this well-deserved award. I wish him  many safe and distinguished years on the police force to come and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691041/recognizing-nypd-sergeant-christopher-e-leap"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Dr. Bodiford's career stands as a testament to the power of vision,  passion and leadership in shaping both institutions and lives. His  tireless dedication has brought great honor to Jax State, the Marching  Southerners and the State of Alabama.\n\nMr. Speaker, on behalf of the Jax State fans and family, I ask my  colleagues to join me in recognizing…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…for Jewish  problems around the world because I am Jewish. I have always been part  of a small minority throughout my life. I am one here in Congress, as  well, and it is a great honor to be here.\n\nIn 1979, 100,000 Jews lived in Iran. The same people who Iran likes  to fund to talk about genocide, suffering, and rooting out people and  all these problems…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Farms, which has been operated  for generations by the Stanfield family in southern Ohio.\n\nAmerica's cattlemen, farmers, and ranchers are the backbone of our  country. It is a great honor to advocate for them in Congress, and it  is my sincere hope that we can pass a full farm bill on their behalf.\n\nCurrently working with Trans Ova Genetics on innovative…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690854/recognizing-garrett-stanfield"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…His exemplary record of military valor, educational leadership, and  civic dedication makes him an ideal recipient of the Congressional  Veteran Commendation. It is with great honor and respect that I present  retired USA Lieutenant Colonel William (Bill) Patterson Matthews with a  Congressional Veteran Commendation from the 17th Congressional District…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…personally in any number of ways, through family, and of course through  a strong commitment to faith, Bill has made himself more than worthy of  this achievement.\n\nIt is with great honor and respect that I present William ``Bill''  Forest Harris with a Congressional Veteran Commendation from the 17th  Congressional District of Texas. His exemplary service…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…Amaria Youmans of Fayetteville and Connor Ambrose from Raeford were  Bronze Medalists in 2022, and Fred Vinson from Pinehurst was a Bronze  Certificate earner in 2024. It is a great honor to represent these  hardworking young people.\n\nThis bill will ensure the Congressional Award program continues to  challenge young Americans like Caroline, Amaria, Connor,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698221/congressional-award-program-reauthorization-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…child did not survive.\n\nMr. Speaker, Detective Gonzalez demonstrated extraordinary courage,  composure, and selflessness in the face of life-threatening danger. It  is my great honor to recognize him for his bravery and to commend him  on receiving this well-deserved award. I wish Detective Gonzalez  continued success and safety in his distinguished…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691108/recognizing-nypd-detective-fabio-l-gonzalez"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…for. Ecumenical Patriarch  Bartholomew's impact on our world is immeasurable, boundless, and  magnified all the more through the countless people he has inspired.\n\nIt is a great honor to add my voice to the many, including the Greek  Orthodox Christians at St. George Greek Orthodox Church in Kingston,  St. Nicholas Greek Orthodox Church in Newburgh, Kimisis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "Mr. McCORMICK. Mr. Speaker, it is my great honor to recognize Lee  Irwin on the week of her 90th birthday.\n\nShe has lived an extraordinary life. Mr. Speaker, she has spent 90  years of serving the community, making tens…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690402/recognizing-lee-irwin"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…changed as the needs of the  nation have evolved. Throughout it all, the men and women of the 55th  Wing have never wavered in their mission to fly, fight, and win. It is  my great honor to recognize their achievements and salute their history  today. Once again I say, happy birthday to the men and women of the  Fightin' Fifty-Fifth.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Task Force, a group committed to working with critical community  organizations with the goal of uniting and supporting the veteran  community of Pflugerville.\n\nIt is with great honor and respect that I present retired USA  Sergeant First Class Alyn Michael Macleod with a Congressional Veteran  Commendation from the 17th Congressional District of Texas.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}]