[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…share a love of liberty. Rather than stand united  as we have been for decades, the Trump administration has threatened  to--are you ready for this--annex Canada and invade Greenland, which is  part of Denmark.\n\nBoth are current NATO allies. Canada fought nobly with our troops on  the shores of Normandy on D-day and many other places. Both nations  served…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and comfort to a group  that would divide and destabilize an ally and peaceful neighbor like  Canada is beyond reality.\n\nYet, those who speculate we should invade and take Greenland by force  are operating with Vladimir Putin's ambition to create some illegal and  unholy American empire fueled by ideology to force Canada as well into  submission to America.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699490/alberta-canada"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…questions than  answers: What will this unending occupation cost the American people?  Why did the administration, led by Secretary Rubio, lie about regime  change? Which is next: Greenland? Cuba? Colombia? Mexico?\n\nBut one answer is perfectly clear: the answer to the question of why  Trump and Rubio did this. It is obvious. This is not a war for the  Venezuelan…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…donors. They don't  want politicians who chase headlines or who try to flatter the whims of  erratic leaders with insane ideas like renaming the Gulf of Mexico,  invading Greenland, annexing Canada, or reinstituting Alcatraz.\n\nWhile many Americans are struggling just to get by, the last thing  they want is a Republican tax bill that guts their healthcare…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…strategy--a dangerous combination.\n\nMoreover, it seems President Trump is drunk on this hubris. We have  now seen Stephen Miller saying that the United States has the right to  take Greenland. Secretary Rubio threatened Colombia and Cuba. It  appears that President Trump thinks that reverting back to an era of  imperialism or ``spheres of influence'' is the best…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, I thank the gentlewoman for  yielding. This has been a week. We invaded Venezuela; threatened to  invade Greenland; put Cuba, Mexico, and Colombia on notice that they  could be next; had the administration and many of my  colleagues, who know better because they were here, try and rewrite…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to spur domestic  manufacturing and policies that enabled us to work with our partners  and allies across the globe to counter China. We didn't do anything  like threaten Greenland or insult Canada. We thought it was important  to work together to counter all of the coercion from the Chinese  Communist Party.\n\nThere have been major investments in domestic…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…2024. Let's talk about that 2024 cycle.\n\nSuper-PACs spent $4.5 billion. That is up from $2.3 billion in 2022,  almost double in 2 years. That is more money than the GDP of Greenland.\n\nIn the 2024 Presidential election, the biggest super-PACs supporting  majority party nominees raked in $865 million from donors who  contributed $5 million or more alone.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to big corporations and to the  President's friends? That is what is going on here.\n\nThere is no limit. Within hours of Maduro's capture, President Trump  was threatening Greenland; they have minerals. Colombia, they have  resources as well. Cuba and Mexico. Is this the world that will work  for us or the world that we want where rather than acting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tariffs. We  need to help families afford daycare. These are the things that  Americans care about, not invading Venezuela, not attacking Colombia,  or dreaming of invading Greenland.\n\nThe Democrats are focused on the things that matter to the American  people, and we will focus on these like a laser--the high cost of  living; affordability. Just like…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…you have lost in 2026 when  Republicans in the United States House of Representatives are openly  talking about impeaching the President of the United States if he  invades Greenland, as one was quoted today in the press.\n\nLet us be clear. Mr. President, Greenland is not for sale. Greenland  is not for war. Greenland is not to be invaded. Greenland is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699145/greenland-is-not-for-sale"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today to urge my Republican  colleagues to reject the President's proposed takeover of Greenland.\n\nAs we celebrate Dr. King's legacy, I am reminded of his belief that  the ultimate measure of a person is not where they stand in moments of  comfort and convenience but…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699297/takeover-of-greenland"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…Congress, unfortunately, has not stood up to his despotic actions.\n\nHe is not listening to Congress or to the American people. He has  threatened military action against Greenland, Colombia, Cuba, Mexico,  and Panama; and he has threatened to keep sidestepping Congress if you  will let him.\n\nAt a time when Americans are struggling to pay for rent,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…who work to eliminate  government waste and fraud and abuse.\n\nNo. 15, threatened to hold California wildlife aid hostage.\n\nNo. 16, threatened to use military action against Greenland to take  it by force and violate its sovereignty.\n\nNo. 17, illegally fired two National Labor Relations Board officials.\n\nNo. 18, banned transgender Americans from serving…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of the United States says he no longer feels obligated to  think of peace.\n\nThen he pivots from grievance to threats, saying that he wants  ``complete and total control of Greenland.''\n\nThat is nuts. Again, this is truly crazy. This is the President of  the United States talking about a NATO ally the way that Putin talked  about Crimea before he invaded…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…isn't cranky Thom; this is Thom trying to explain a  very serious subject.\n\nLadies and gentlemen, the thought of the United States taking the  position that we would take Greenland, an independent territory within  the Kingdom of Denmark, is absurd. Somebody needs to tell the President  that the people of Greenland, up until these current times, were…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…strategy, the LC-130 fleet is also critical in supporting our Nation's  scientific research efforts.\n\nEach year, the current LC-130 fleet assists in critical missions in  both Greenland and Antarctica pursuant to President Ronald Reagan's  Presidential memorandum 6646.\n\nHowever, our current LC-130H fleet is aging quickly, with some planes  over 50 years…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…serious about global competition with China, these are  relationships worth tending. These are allies we ought to be working  with, not against, which brings me to the matter of Greenland.\n\nThe President is right that Arctic security is a central concern in  our strategic competition with major adversaries, and he will find  similar interest in Arctic security…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…body just 2  weeks ago visiting our trusted, loyal NATO ally Denmark, as they were  alarmed about the rising tide of threats from our President to extract  the territory of Greenland from their nation.\n\nThis coming weekend and week, I will travel to the annual Munich  Security Conference, which my friend and late colleague Senator John  McCain helped…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…was  extraordinary in its precision and complexity, I do not support  committing additional U.S. forces or entering into any long-term  military involvement in Venezuela or Greenland without specific  congressional authorization.\n\nThe resolution I have supported today does not include any language  related to the removal operation. Rather, it reaffirms…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…honorable retirement from the United States Air Force in 1969.\n\nOver that distinguished career, Mr. Mass served in posts worldwide,  including the Philippines, Guam, Thailand, Greenland, Germany, and  bases across the United States, where he contributed to the safety and  effectiveness of airborne operations.\n\nNow, at 97 years old, Mr. Mass' record of service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…interview that I saw with one of the  President's senior policy advisers, Stephen Miller, on CNN, a couple of  nights ago.\n\nMr. Miller said that the U.S. Government--``obviously, Greenland  should be part of the United States.''\n\nThat is absurd. We have to go back and take a look at the  relationship to Greenland.\n\nWhy am I coming to the floor, a Senator from…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…but there is one thing that  we should not be doing, one thing that we should not be spending our  time doing, and that is an effort--any effort--that would seek to annex  Greenland, whether it is taking it by force, taking it by coercion,  taking it by pressure or threat, or, really, in fairness, any related  method. It is not an issue that I would…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Amendment No. 248 Offered by Mr. Ogles\n\nMr. CALVERT. Madam Chair, I look forward to working with the  gentlewoman. We need a place for those aircraft to land in Greenland.\n\nMr. CALVERT. Madam Chair, I certainly rise in support of the  amendment. The amendment prohibits the expenditure of funds to create,  procure, or display any map that depicts…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…our Nation's Cold War  military exercises. He also flew into other various conflicts such as  the Israel-Jordan Crisis, and across the world to Pakistan, Ethiopia,  Panama, Greenland, and Libya. Danny had the privilege of flying the  last C-133 to the Boneyard at Davis Monthan AFB, Arizona. He received  the Air Force Commendation Medal, National Defense…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}]