[{"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…his leadership on matters of faith and peace, All- Holiness Ecumenical Patriarch Bartholomew has been a pioneering  advocate for environmental stewardship. Often called the ``Green  Patriarch,'' he has elevated ecological awareness to the forefront of  his ministry, inspiring both individuals and institutions to act with  moral urgency in protecting our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Madam Speaker, and still I rise. I rise today to  state the state of the Union.\n\nMadam Speaker, the state of the Union is fragile. It is fragile  because we have…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700176/state-of-our-union-is-fragile"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…reconciliation.  He has boldly raised the conscience of the world to the urgent moral  imperative of environmental responsibility. For these efforts, he is  rightly known as the ``Green Patriarch.'' He has also been a steadfast  advocate for human rights and religious liberty across the globe,  strengthening the cause of freedom for all people.\n\nOn behalf…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise, a proud, liberated  Democrat, unbought, unbossed, and unafraid.\n\nMr. Speaker, I rise today because I believe in the Pledge of  Allegiance.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Garcia (CA)      Garcia (IL)      Garcia (TX)      Gillen      Golden (ME)      Goldman (NY)      Gomez      Gonzalez, V.      Goodlander      Gottheimer      Gray      Green, Al (TX)      Grijalva      Harder (CA)      Hayes      Himes      Horsford      Houlahan      Hoyer      Hoyle (OR)      Huffman      Ivey      Jackson (IL)      Jacobs…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…for who he was, not for who  the Trump administration wanted him to be to fit into their narrative.\n\nAlex Pretti grew up in Wisconsin and graduated from Preble High  School in Green Bay. In recent days, his classmates have reached out to  me and his friends and his teachers to share with me and the world who  Alex really was.\n\nJose from Green Bay met Alex…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…from this  administration about the so-called worst of the worst. These are people  that are active, contributing members of our community. These are legal  residents who hold green cards who are being flown to Texas with no  legal representation, no access to counsel.\n\nAnd you know what happens sometimes? They get down there; they go  through another…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…last week, H.R. 884, would repeal D.C.'s  local law that allows  noncitizens to vote in local elections. I have serious concerns with  allowing noncitizens who do not hold a green card to vote in local  elections, but this is the wrong way to go about addressing that. I  voted present because I can't support repealing a local D.C. law, but I  do support…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692632/opposition-to-hr-hr-and-hr-2096"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…millions of acres of public lands to big corporate  drillers and would allow them to pay to get their projects rubber- stamped without any input from the public.\n\nEight, it guts green energy subsidies, including investments in  renewable energy projects that are already underway.\n\nNine, it blocks State AI regulations in a giveaway to Big Tech,  completely…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…assault, not  United States citizens, children with cancer, not pregnant women, not  fathers with legal residency, not organ donors, not student activists,  not professors, not green card holders, not asylees, not DACA  recipients.\n\nTrump and Noem have wasted millions of taxpayer dollars in their  criminal acts from a $200 million anti-immigrant ad campaign…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise.\n\nI rise today, Mr. Speaker, to first announce two pieces of  legislation. Thereafter, I will go into my message, which will be the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…top  State in property value decline.\n\nThis is coming at us, and it is coming at us hard. In other speeches,  I have given surveys of the multiple, multiple warnings--not from green  groups, not from environmentalists, but from people who understand the  financial system and see this threat that is bearing down on us.\n\nSo fossil fuel's climate denial fraud…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…who still denies it.\n\nBut America's closest allies are calling for an end to the war.  America's closest allies are wanting to cut off the shipment of weapons  that sends a green light to Netanyahu's extremist government.\n\nAnd yet we are here today where just 2 weeks ago, President Trump, in  fact, indicated that he intends to ship another half billion…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Committee or the Armed Services  Committees for consideration, markup, and amendments. Yet, as soon as  our two committees introduced a comprehensive safety bill, the Speaker  green lights the other chamber's bill to fly off the desk and bypass  our committees. That's not regular order, and it's not right. Our  carefully crafted joint Transportation and…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700106/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…educated  generations on the importance of protecting our natural environment and  worked diligently to preserve historic gardens across Virginia,  including Mount Vernon and Green Spring in my district.\n\nThis centennial marks more than longevity; it also celebrates the  enduring impact of The Garden Club of Alexandria. Through their  tireless efforts…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697252/recognizing-the-garden-club-of-alexandrias-centennial"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of Electrical Workers Local       Union 1426; International Brotherhood of Electrical Workers       Local 160.\n\nUp North Jobs Inc.; Minnesota Conservative Energy Forum;       Green Bridge Metals; City of Babbitt, MN--Mayor Andrea       Zupancich; Duluth Area Chamber of Commerce; Laurentian       Chamber of Commerce; Hermantown Area Chamber of Commerce;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…who truly need it.\n\nIt implements popular work requirements for able-bodied Americans  receiving taxpayer-funded benefits.\n\nIt eliminates hundreds of billions of dollars in green new scam tax  credits. It reverses electric vehicle mandates that let radical climate  activists set the standards in American energy.\n\nIt ends Biden's war on American energy.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise today in support of my legislation,  H.R. 708, the SHIELD Against CCP Act.\n\nI thank Chairman Green and each of the Members who have joined me in  introducing this bill.\n\nThere is no question that the Chinese Communist Party poses a clear  and present threat to both the security…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…that President Trump accomplished in  his first administration. Yet, the Biden administration worked to  undermine us at every step along the way.\n\nMr. Chair, $5.1 billion in green new energy scam funds are being  transferred to various nuclear programs, including the Advanced Reactor  Demonstration Program, which helps companies get closer to building…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694857/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…openings. This means the appliance's interior temperature may rise  above safe food-storage conditions, jeopardizing food safety.\n\nOnce again, the left's pro-Big Government, Green New Deal agenda  harms the little guy. The Biden Department of Energy implemented a  policy that threatens small businesses, harms consumers, and drives up  costs, even as…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…proudly enlisted in the United  States Marine Corps. Walter served in combat as a Field Communications  Specialist during the grueling battles of Guadalcanal, Bougainville,  and Green Island, in which he was awarded a Unit Citation for his  meritorious actions. He later worked in aviation electronics in North  Carolina before being honorably discharged in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the  government. Of course, they also had bailouts for student loans and  expansion of the IRS by $80 billion, mandating electric vehicles for  every American, tax breaks for green energy corporations, and the list  goes on and on.\n\nThey will also dust off an old playbook where they say that the Tax  Cuts and Jobs Act was simply a tax cut for the rich.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…in 1991, Patriarch Bartholomew has been an  unwavering advocate for peace, interfaith dialogue, religious freedom,  and environmental stewardship, earning him the title of ``Green  Patriarch'' and international recognition for his vision of  reconciliation and unity. He has convened historic gatherings of  Orthodox leaders, fostered dialogue with other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…statutes, rules, or orders.''.\n\nMr. Speaker, I rise in support of H.R. 3716, the Systemic Risk  Authority Transparency Act.\n\nMr. Speaker, I thank the gentleman from Texas (Mr. Green) for  offering this bill. I am pleased to note that this legislation earned  unanimous support of the House Financial Services Committee in June,  passing 51-0. I thank Mr.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…is a part of a  much larger course correction. This bill rips back over $9 billion from  the clutches of globalist NGOs, projects that fund radical gender  ideology, and the green new scam.\n\nThe great people of North Carolina didn't send me here to manage  decline. They sent me here to help President Trump usher in the new  golden age. Let the left scream.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…enforcement.\n\nThe House bill had core components to make sure our defense can  modernize. The House bill had core components--and this is where it  gets important--to terminate the green new scam subsidies, but not all  of them. That is why I said the bill wasn't perfect.\n\nI think we should repeal them all and save over $1 trillion. We  should stop subsidizing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…have at least one critical nominee today  approved.\n\nLet's consider Bradley Hansell to be Under Secretary of Defense for  Intelligence and Security.\n\nMr. Hansell is a former Green Beret, Senior Director on the National  Security Council staff, and has previously received bipartisan  support. He will be responsible to exercise the Secretary of Defense's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "French Hill", "party": "Republican", "sentence": "…million. It caps the Consumer  Financial Protection Bureau's budget authority by nearly half.\n\nIt rescinds unobligated and unused funds from the SEC's reserve fund  and HUD's Green and Resilient Retrofit Program.\n\nIt targets $1 billion for strategic use under the Defense Production  Act to ensure that America can meet its national security supply chain…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693152/one-big-beautiful-bill-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…staggering, Madam Speaker. Over the next decade,  115GW of power is expected to come offline while 151GW of demand is  needed to come online. Do that math.\n\nFor too long, radical green activists in the Obama and Biden  administrations were able to hijack environmental agencies with no  authority over the grid to force shutdowns of power plants without  regard…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…ended, Mac landed in the  Office of the Chief Administrative Officer in 2016 and immediately  began serving as the Director of the Wounded Warrior Program, now known  as the Green & Gold Congressional Aide Program.\n\nOver the past nine years, Mac's leadership, stewardship, and  dedication have driven several significant enhancements to this  outstanding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}]