[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…like to admit it, that means adding clean  energy to the grid. It is the quickest source of energy to add to the  grid, given the current multiyear gas turbine shortage.\n\nGrid reliability regulators have been clear that renewable energy and  batteries were critical in allowing the grid to endure multiple heat  waves this summer. That is why Texas added…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…energy prices down. That means adding clean energy to the grid. It is  the quickest source of energy to add to the grid given the current  multiyear gas turbine shortage.\n\nGrid reliability regulators have been basically clear: Renewable  energy and batteries were critical in allowing the grid to endure  multiple heat waves this summer.\n\nThat is why Texas…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…permitted and almost fully constructed offshore wind  projects. We will put that aside. However, to keep the Campbell plant  open, the administration cited a so-called grid reliability emergency,  but they produced no actual evidence of any kind of emergency. Since  their order, the Department hasn't appointed to a single instance where  the plant was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Pennsylvania, where two units that were nearly 60 years  old were set to expire. Pennsylvania's grid operator determined that  taking the plants out of service would not impact grid reliability, but  President Trump didn't care. The Pennsylvania Public Utility Commission  chairman noted that ``the price tag for consumers could grow quickly.''\n\nConsumers aren't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…permitting reform. That is absolutely not true. They do  absolutely nothing to make it easier to expand or improve our power  grid, despite this being a time when our grid reliability is a growing  threat.\n\nFor years, Democrats have been clear: A permitting package is  impossible without reforms to the way we build transmission lines that  transport…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…assessment and draft periodic reports on the state of the electric  supply chain.\n\nI understand that our electric supply chain is important for national  security and grid reliability, but I have to question the Republicans'  seriousness in making this request and the ability of the Department of  Energy to conduct these assessments and draft the periodic…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Energy  canceled nearly $8 billion in clean energy funding for the whole  country. It included $53 million for 12 projects in Connecticut  supporting lower energy prices, grid reliability, and American energy  independence.\n\nIt was done in a way that was as illogical, chaotic, and likely  illegal as canceling Revolution Wind was. Again, a self-inflicted…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…opportunities for public comment and stakeholder engagement  before submitting proposals to FERC. Operators must also provide  regular reports to FERC on the state of grid reliability and actions  taken under this bill.\n\nFinally, FERC must review and, if necessary, update its regulations  to ensure they remain effective in addressing evolving challenges…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…administrations were guilty of using the EPA to promote radical policy  designed to drive out baseload generation in favor of wind and solar,  which simply cannot assure adequate grid reliability. It increases the  risk of rolling blackouts.\n\nH.R. 3616 will correct that very problem by improving Federal  rulemaking to ensure that future regulations impacting power…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698276/reliable-power-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…restore Florida's Everglades; projects to  build or improve sidewalks, bridges, utilities, roads, and highways;  solar energy projects; and other projects that impact grid reliability.\n\nThe ability for States to take the lead in regulating their natural  resources is vital, particularly in a State like Florida where growing  our economy is contingent…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…technology and semiconductor industries, it is  critical to meet the needs of our electric grid, and I believe we must  take an all-of-the-above energy approach to ensure the grid's  reliability.\n\nIn fact, on July 9, Arizona's largest utility providers, APS and SRP,  reported a State record of energy demand as we were hit by a heat wave.  Luckily, Arizona did…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…none. Well, good for us.\n\nThe vast majority of the world is producing power with coal and  natural gas, and it is growing exponentially. Meanwhile, we are  crushing our grid, the reliability of American power, making it more  expensive for the average American and doing really nothing about  worldwide CO2 production. That is the truth. China and India…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…because of  legitimate water quality impact concern. The basis of these blockades  has been in the name of radical climate agendas, ignoring what is best  for consumers, grid reliability, and economic growth.\n\nDuring the 2013 to 2021 time period, several pipeline projects were  canceled, leading to a pipeline capacity growth of only 26 percent.  Meanwhile,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…war on coal. He expanded coal leasing,  rolled back Biden-era rules targeting coal-fired power plants, and  restored commonsense permitting.\n\nCoal remains critical for grid reliability, baseload power, and  national energy security. I am proud to fight side by side with  President Trump to ensure that our miners can go back to work, our  lights can stay…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "Mr. BALDERSON. Mr. Speaker, I thank Vice Chair Weber for yielding.\n\nMr. Speaker, America's electric grid is facing a reliability crisis,  one created by heavyhanded Federal rulemakings that prioritize politics  and ignore the realities of power generation and the needs of American  families.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…unleashing American energy brings down electricity prices for  families and boosts real wages for hardworking  Americans who keep our economy running.\n\nThis CRA is about grid reliability, energy affordability, and  ensuring that States across the country have access to dispatchable  baseload power, especially during extreme weather and peak demand. It…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…a simple clarification. It ensures that DOE  evaluates barriers not only to manufacturing components, but also to  their delivery and installation. In the real world, grid reliability  depends on whether critical equipment can actually reach the job site  and be installed on time.\n\nIf we want a serious assessment and serious recommendations, then we…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697889/electric-supply-chain-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…more energy, not less; and the  CRA is a deliberate attempt to shut down powerplants in Indiana that  are not popular. They are coal-fired power plants--love it--when grid  reliability experts are warning of a shortage of baseline power.\n\nI am fully against this CRA, and I hope that my colleagues will join  me in that.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…infrastructure;\n\n(2) address the impact that the record of decision has on       hydropower production at Glen Canyon Dam, including costs to       replace hydropower resources and grid reliability; and\n\n(3) identify impacts that the record of decision has had on       species listed as a threatened species or an endangered       species under section 4 of the Endangered…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…great energy bills that will come to the House floor later this week.\n\nThis Congress, Republicans on the Energy and Commerce Committee have  worked diligently to improve grid reliability as well as the permitting  process for Federal projects, ultimately supporting President Trump's  goal of unleashing American energy dominance.\n\nUpcoming legislation that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}]