[{"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…MULLIN. Madam Speaker, I rise today in opposition to the so- called State Planning for Reliability and Affordability Act. This  measure will encourage State regulators to push our grid toward more  expensive and polluting sources of energy at the very moment families  are struggling with rising energy bills.\n\nAcross this country, households and small businesses…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…which is just the opposite of what we  should be doing. Then they went further, eliminating incentives for  wind and solar projects, meaning fewer jobs and less power to the grid.  It is supply and demand. Less power equals higher prices. And the  consequences of these policies are already taking effect.\n\nAccording to the Century Foundation, past-due…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…shot at meaningful reforms that will cut red tape and  accelerate the build-out of abundant, affordable energy. We can build  more power lines for a more connected and nimble grid, and we can  secure our supply chain of critical grid infrastructure, as well.\n\nThis bill that we are voting on today does none of that, and that is  why I am asking my colleagues…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…conduct  an assessment and draft periodic reports on the state of the electric  supply chain.\n\nI understand that our electric supply chain is important for national  security and grid reliability, but I have to question the Republicans'  seriousness in making this request and the ability of the Department of  Energy to conduct these assessments and draft…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of new wind or solar is at least 30  percent cheaper than the cost of running most fossil coal plants. So it  is no surprise that in 2024, 94 percent of the new energy on the grid  came from renewables, from harnessing the power of the sun and the  wind.\n\nPrioritizing expensive fossil fuels over cheap renewables drives up  the price of energy that families…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Might the Senator be willing to retain the floor for  a moment to yield for a question?\n\nMr. WHITEHOUSE. In Rhode Island, we have a grid. ISO New England it  is called. It is through that grid that electrons get from powerplant  to the grid and from the grid to people's homes, and it is run as a  basically common…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…with everything that the President  had to say last night. In fact, I was genuinely pleased that he  acknowledged the pressure that data centers are placing on our electric  grid. The explosion of artificial intelligence, cloud computing, and  advanced manufacturing is real, and it is transforming our economy. It  is driving electricity demand upward…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the ranking member for  yielding the time.\n\nI rise in opposition to H.R. 1047. It is a bill that will give  polluting gas plants an unfair and costly shortcut to the electric grid  while doing nothing to protect working families from rising energy  costs.\n\nThis is an unfortunate theme this Congress. Despite the promises of  the President and my Republican…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Fatih       Birol said. ``As renewables' role in electricity systems       rises in many countries, policymakers need to pay close       attention to supply chain security and grid integration       challenges.''\n\nThe report came as clean-energy think tank Ember said       renewable energy generated more electricity than coal in the       first half of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…attempting to finish the job by further continuing their nonsensical  attack on clean energy.\n\nThis bill would aim to make it harder to hook clean power up to the  electric grid and would remove safeguards intended to ensure that the  entities in charge of our power grid can't discriminate against clean  energy.\n\nWhile the regulatory processes that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…from the same time:\n\nThe Trump megabill gives the oil industry everything it       wants and ends key support to solar and wind.\n\nMost of the power that has been added to the grid in the United  States in the last couple of years has been solar and wind. It is  cheap; it is native; it is clean; it is sustainable; it works. It is  bringing people's costs…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…on energy costs than they did last year. In part, why? Because  Donald Trump and his obeisant Republicans cut out the cheapest way to  get new power and new electrons on the grid--solar energy. They cut it  out in obeisance to the oil industry. It was disgraceful.\n\nThat is what is wrong with this government--the corruption. The oil  industry promises…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…more expensive for our  four States. In other words, it is all downside, no upside.\n\nWe have now seen weeks of taking a chain saw to our Federal programs  and damage to our grid, national forests, national security, and,  frankly, personal security. It is time for Congress to take our power  back and protect our constituents.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688300/senseless-bonneville-power-administration-workforce-cuts"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…infrastructure that allows us to deal with the critical issue of  climate change which brings me to that issue and the infrastructure  needed to address that. That is electrical systems, grid systems, and  the like.\n\nWe also need to make sure that in this process we not only pay  attention to those elements but we also pay attention to the  international situation…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Trump and House Republicans also claim to care about China,  particularly about beating China in the artificial intelligence race.  That requires getting as much power on to the grid as quickly as  possible, but the big, ugly bill will do the opposite. It will instead  cause electricity capacity to decrease by more than 2\\1/2\\ times the  size of the entire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…projects to restore Florida's Everglades; projects to  build or improve sidewalks, bridges, utilities, roads, and highways;  solar energy projects; and other projects that impact grid reliability.\n\nThe ability for States to take the lead in regulating their natural  resources is vital, particularly in a State like Florida where growing  our economy is contingent…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…reviews,  undermining otherwise federally authorized projects.\n\nThis has resulted in energy shortages in certain areas of the  country, exposing consumers to high prices and our grid to increased  vulnerability.\n\nIn fact, a recent study estimated that pipeline blockades have  already driven average natural gas prices up by 160 percent in major  demand centers.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…cost to taxpayers is enormous. Over the next decade, these  subsidies are projected to cost up to $900 billion.\n\nSecond, these subsidies are driving instability in our power grid.  Right now two-thirds of the country is at risk of not having enough  power to meet demand. That is not a few years from now. That is not a  near, long-term problem. That is…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…standing to the applicant or those who face direct or  irreparable harm, preventing activist groups from weaponizing the  process to stall projects that are essential to our power grid,  economy, and, most importantly, national security.\n\nMr. Chair, we cannot meet growing energy demand, power our data  centers, or lead the world in AI without the infrastructure…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…leached back into the watershed.\n\nDon't let the scare tactics influence the way you vote on this  legislation because the inputs we need to sustain our fast-growing  electricity grid are right under our feet. We should be leading the  world in technological innovation and AI infrastructure.\n\nThe only reason we are mired in mineral dependence today and not…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…We need more energy, not less; and the  CRA is a deliberate attempt to shut down powerplants in Indiana that  are not popular. They are coal-fired power plants--love it--when grid  reliability experts are warning of a shortage of baseline power.\n\nI am fully against this CRA, and I hope that my colleagues will join  me in that.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…America to live, work,  and raise a family, and this investment means more doctors, nurses,  stable hospitals, and peace of mind for the people who grow our food,  power our grid, and keep our communities strong.\n\nMr. Speaker, I am proud to support this historic tax relief and this  transformational funding.                Baby Jay Sets Washington State's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…to the historic ice storm that left tens of thousands  without power across northern Michigan and the Upper Peninsula. Ten  counties are under a state of emergency, and our grid suffered near  total collapse under nearly 1 inch of ice.\n\nIn the face of these challenges, linemen from Michigan and across the  country have worked tirelessly in brutal conditions…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689858/congress-supports-northern-michigan-and-the-upper-peninsula"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…public health.\n\nThe bill protects the public from future Federal rules that would  force the premature retirement of power generation that is absolutely  essential to keeping our grid reliable.\n\nMadam Speaker, our Nation today is confronting a reliability crisis.  The North American Electric Reliability Corporation, which is the  Nation's electric reliability…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Correspondent and Special Projects Director  before joining the House Committee on Energy and Commerce as Lead  Legislative Clerk for the Subcommittee on Energy, Climate, and Grid  Security and the Subcommittee on Environment, Manufacturing, and  Critical Minerals under Chair Cathy McMorris Rodgers. She then joined  my team and became Policy Analyst for…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "Mr. BALDERSON. Mr. Speaker, I thank Vice Chair Weber for yielding.\n\nMr. Speaker, America's electric grid is facing a reliability crisis,  one created by heavyhanded Federal rulemakings that prioritize politics  and ignore the realities of power generation and the needs of American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…retired power plants, and the need for  additional backup generation to keep the lights on when the weather  doesn't cooperate.\n\nJust look at States like New York, whose own grid operator has begun  sounding the alarm over how their State laws are driving up baseload  generation resources that could threaten the integrity of their system.\n\nComparatively,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697887/state-planning-for-reliability-and-affordability-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…makes a simple clarification. It ensures that DOE  evaluates barriers not only to manufacturing components, but also to  their delivery and installation. In the real world, grid reliability  depends on whether critical equipment can actually reach the job site  and be installed on time.\n\nIf we want a serious assessment and serious recommendations, then…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697889/electric-supply-chain-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the  great energy bills that will come to the House floor later this week.\n\nThis Congress, Republicans on the Energy and Commerce Committee have  worked diligently to improve grid reliability as well as the permitting  process for Federal projects, ultimately supporting President Trump's  goal of unleashing American energy dominance.\n\nUpcoming legislation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…wasteful subsidies. Our bill begins to refill our dangerously low  Strategic Petroleum Reserve and creates new investments to generate  reliable energy that will secure our grid and power AI.\n\nThe One Big Beautiful Bill Act also spurs technological innovation by  renewing American wireless leadership through spectrum auction  authority that protects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}]