[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of new wind or solar is at least 30  percent cheaper than the cost of running most fossil coal plants. So it  is no surprise that in 2024, 94 percent of the new energy on the grid  came from renewables, from harnessing the power of the sun and the  wind.\n\nPrioritizing expensive fossil fuels over cheap renewables drives up  the price of energy that families…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Fatih       Birol said. ``As renewables' role in electricity systems       rises in many countries, policymakers need to pay close       attention to supply chain security and grid integration       challenges.''\n\nThe report came as clean-energy think tank Ember said       renewable energy generated more electricity than coal in the       first half of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…administration won't make these big donors  who are in crypto world and data center world bring their own clean  energy or provide their own clean water, for that matter, to the grid.\n\nSo what they do is they arrive, they dump a huge amount of demand  into the existing grid, and that means that new and more expensive  units have to come online. As those…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…more domestic energy projects, raising  barriers to those buildings in the process, and it will half the  deployment of cheap, renewable American energy and imperil our power  grid. These historic price hikes are on top of the $29 billion in  electricity bill rate hikes that utility companies have requested since  the start of President Trump's term.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…energy transmission capacity across our region, to  build resiliency and lower energy bills.\n\nNearly $400 million was going to be invested through the Department  of Energy's Grid Innovation Program to provide onshore connections for  offshore wind power, improve the electric grid, and install energy  storage through a project called Power Up New England.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…which is just the opposite of what we  should be doing. Then they went further, eliminating incentives for  wind and solar projects, meaning fewer jobs and less power to the grid.  It is supply and demand. Less power equals higher prices. And the  consequences of these policies are already taking effect.\n\nAccording to the Century Foundation, past-due…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…mines and opening Alaska to  oil and gas drilling. There is no set correlation between more drilling  and lower consumer prices.\n\nWe must act now to fix our outdated electric grid to bring more  renewable energy sources online. This will make us less reliant on  natural gas prices that fluctuate.\n\nThis week, the majority brought bills before this House,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698098/functioning-in-the-face-of-an-affordability-crisis"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Louisiana, playing a  vital role in meeting the power needs of nearly half a million  customers by providing a maximum dependable capacity of 1,152 megawatts  and contributing to grid stability during periods of peak demand and  extreme weather events.\n\nWaterford 3 employs more than 800 employees and contractors who have  demonstrated a commitment to operational…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…on energy costs than they did last year. In part, why? Because  Donald Trump and his obeisant Republicans cut out the cheapest way to  get new power and new electrons on the grid--solar energy. They cut it  out in obeisance to the oil industry. It was disgraceful.\n\nThat is what is wrong with this government--the corruption. The oil  industry promises…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…shot at meaningful reforms that will cut red tape and  accelerate the build-out of abundant, affordable energy. We can build  more power lines for a more connected and nimble grid, and we can  secure our supply chain of critical grid infrastructure, as well.\n\nThis bill that we are voting on today does none of that, and that is  why I am asking my colleagues…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…conduct  an assessment and draft periodic reports on the state of the electric  supply chain.\n\nI understand that our electric supply chain is important for national  security and grid reliability, but I have to question the Republicans'  seriousness in making this request and the ability of the Department of  Energy to conduct these assessments and draft…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…attempting to finish the job by further continuing their nonsensical  attack on clean energy.\n\nThis bill would aim to make it harder to hook clean power up to the  electric grid and would remove safeguards intended to ensure that the  entities in charge of our power grid can't discriminate against clean  energy.\n\nWhile the regulatory processes that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Https://energyinnovation.org/wp- content/uploads/One-Big-Beautiful- Bill-Senate-Reconciliation- Analysis_July-2025.pdf\n\nHttps://earthjustice.org/wp-content/uploads/2025/08/grid- strategies_cost-of-federal-mandates-to-retain-fossil- burning-power-plants.pdf\n\nHttps://energyinnovation.org/wp- content/uploads/Coal-Cost-Update.pdf\n\nMr. Speaker, we cannot…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…When we reduce development assistance that ensures people have access  to food and clean water, people will die.\n\nWhen you cut money to Ukraine for food security and energy grid  resilience, more people will die in their war against the Russian  invasion.\n\nUSAID is our strongest soft power vehicle. Even if you don't care  about how many people will…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692547/rescissions-act-of-2025"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…infrastructure that allows us to deal with the critical issue of  climate change which brings me to that issue and the infrastructure  needed to address that. That is electrical systems, grid systems, and  the like.\n\nWe also need to make sure that in this process we not only pay  attention to those elements but we also pay attention to the  international situation…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "John Thune", "party": "Republican", "sentence": "…trajectory. The  administration sharply restricted oil and gas development. It  threatened the closure of existing powerplants with burdensome new  regulations, even as our electric grid struggled to keep up with  demand. President Biden attempted to force the widespread adoption of  electric cars, despite the incredible strain that would place on our  already…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…purchase significantly more expensive or less efficient models.\n\nNot only do bans on gas appliances infringe on consumer choice, but  it also increases strains on our Nation's grid, which cannot sustain  such massive and rapid amounts of forced electrification without new,  baseload generation coming online.\n\nPresident Trump, understanding the serious…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…cost to taxpayers is enormous. Over the next decade, these  subsidies are projected to cost up to $900 billion.\n\nSecond, these subsidies are driving instability in our power grid.  Right now two-thirds of the country is at risk of not having enough  power to meet demand. That is not a few years from now. That is not a  near, long-term problem. That is…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the agriculture and energy sectors, including in       collaboration with the program authorized under section 5012       of the America COMPETES Act (42 U.S.C. 16538).\n\n(J) Grid modernization and grid security.\n\n(K) Rural technology development, including manufacturing,       precision agriculture technologies, and mechanization and       automation…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…environment, to get the reforms that we were getting to Medicaid, to  get the reforms that we were getting to terminate 60 percent of the  green new scam subsidies undermining our grid, and to get the tax cut  extensions for hardworking Americans, to me it was worth doing that  when I thought credibly and believably we would not be adding to the  deficit and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…We need more energy, not less; and the  CRA is a deliberate attempt to shut down powerplants in Indiana that  are not popular. They are coal-fired power plants--love it--when grid  reliability experts are warning of a shortage of baseline power.\n\nI am fully against this CRA, and I hope that my colleagues will join  me in that.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…homes, businesses, and daily lives.\n\nMy amendment is straightforward and common sense. It directs the  Secretary of Energy to identify any vulnerabilities to our domestic  energy grid that may arise from noncitizens' access to U.S. facilities  that generate or transmit electricity. That is it. It creates no  prohibition, no hiring restrictions, and no burdens…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…us to use American energy and making  us more dependent on foreign sources of energy. Joe Biden took coal  offline in America. Democrats' war on American energy strained our  grid, subsidized unreliable energy, and as a result, energy prices  spiked in their administration by 31 percent. That hit American  consumers, American manufacturers, American families;…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…public health.\n\nThe bill protects the public from future Federal rules that would  force the premature retirement of power generation that is absolutely  essential to keeping our grid reliable.\n\nMadam Speaker, our Nation today is confronting a reliability crisis.  The North American Electric Reliability Corporation, which is the  Nation's electric reliability…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…standing to the applicant or those who face direct or  irreparable harm, preventing activist groups from weaponizing the  process to stall projects that are essential to our power grid,  economy, and, most importantly, national security.\n\nMr. Chair, we cannot meet growing energy demand, power our data  centers, or lead the world in AI without the infrastructure…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…aisle are advancing a repeal effort that would punish Indiana at  the worst possible time.\n\nHoosiers should not pay more because government insists on regulating  yesterday's grid instead of today's realities. Instead, we should focus  on adding new capacity--new capacity--before prematurely retiring  existing assets and cut redtape so that generation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…supply chain for the power sector.\n\nThe Electric Supply Chain Act will seek to uncover risks,  vulnerabilities, and security considerations in the availability of  manufactured grid components that are necessary to maintain and expand  our electric infrastructure.\n\nAs part of the comprehensive evaluation of supply chains, the  Secretary would maintain discretion…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…makes a simple clarification. It ensures that DOE  evaluates barriers not only to manufacturing components, but also to  their delivery and installation. In the real world, grid reliability  depends on whether critical equipment can actually reach the job site  and be installed on time.\n\nIf we want a serious assessment and serious recommendations, then…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697889/electric-supply-chain-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…America to live, work,  and raise a family, and this investment means more doctors, nurses,  stable hospitals, and peace of mind for the people who grow our food,  power our grid, and keep our communities strong.\n\nMr. Speaker, I am proud to support this historic tax relief and this  transformational funding.                Baby Jay Sets Washington State's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…stability and affordability of their electric grids.\n\nOver 35 States utilize resource plans to ensure their utilities are  appropriately planning their investments in the electric grid.\n\nThe U.S. grid, commonly referred to as the greatest machine on Earth,  is a complex system compromised of myriad components and infrastructure  to deliver electricity that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}]