[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Michele with profound sorrow. (And moved by the loving  statement by Jake and Romy, we hold their loved ones close in our  hearts and are praying for them, and all who are grieving during this  unimaginable time of pain. May Rob and Michele's memory be a blessing,  and may their lives continue to inspire kindness, courage and hope.)", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…First Lady and Co-Overseer, LaVerne Shinault Carter.  For 35 remarkable years, he shepherded his congregation through  blessings, baptisms, weddings, and offered comfort to grieving  families. Under their dynamic leadership, First Monumental became a  beacon of hope and salvation.\n\nAs the great Agriculture Chemist George Washington Carver once said,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Mrs. GRIJALVA. Mr. Speaker, today, while Kristi Noem staged yet  another photo op, this time in Nogales, Arizona, families across this  country are still grieving people who should be alive.\n\nLet's be clear: Border communities are not war zones. Border towns,  like Nogales, which I represent in Congress, are vibrant, binational  communities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today, for the 39th time, to call  on the Trump administration to restore lifesaving food aid for children  around the world.\n\nWe are grieving today. We are grieving the lives lost on September  11, 2001. We are grieving the lives of Charlie Kirk and others who have  been victims of political violence and mass shootings.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695350/restore-lifesaving-food-aid"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, Minnesotans are grieving the loss of two  precious lives and enduring immeasurable community suffering due to the  ill-advised policies of the Trump administration and the failed  leadership of DHS…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…families and loved  ones in the event of a tragedy.\n\nServicemembers' life insurance plans must keep pace with economic  demands. A robust life insurance policy can provide a grieving family  with the financial security they need to navigate the loss of their  loved ones and do so with dignity.\n\nThe brave men and women who sacrifice their lives deserve…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…through their work to make our infrastructure stronger--1 year later,  we remember their loss. They are greatly missed. One year later, their  families and communities are still grieving. May we continue to pray  for their strength and peace.\n\nWe also remember the two men, including Julio Adrian Cervantes  Suarez, who miraculously survived the devastating…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…drove 30  miles. He was asked to show his ID online. It went on and on and on for  days, until he called our office, and we got involved and tried to help  him--a man who is grieving, who just lost his wife. That is what these  cuts are going to mean for regular people.\n\nYes, it is a disaster for Wall Street, but it is more of a disaster  on Main Street.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…than 13,000 Black lives are lost to this epidemic.  They are mothers, fathers, sons, daughters, friends, and neighbors  whose futures are stolen, whose communities are left grieving, and  whose absence is deeply felt every single day.\n\nTragically, the violence does not end there. For years, Black  Americans have faced a persistent and disproportionate…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691750/national-gun-violence-awareness-month"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…out to the families and to the entire  State because it is obviously something that had a profound impact upon  the entire community, and it is something that has all of us grieving  for them. I was just touched, as I think everyone who heard them was,  with the presentations that we heard.\n\nMr. President, I rise today in opposition to the Republican's…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…waive their own requirements for usage of any  collision avoidance technology in the DCA area. The inclusion of these  provisions is unconscionable when families are still grieving, and the  airspace congestion has not improved.\n\nI also remain concerned by the Trump administration's actions to  weaken the merit-based civil service across the Federal…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…showed up: walking  neighborhoods, listening to concerns with patience, mentoring young  people who might otherwise have lost their way, and standing at the  bedside of a grieving family or the side of a frightened child until  calm returned.\n\nSheriff Bowens' leadership flowed from a bedrock of faith. Introduced  to Christ early, he first joined Pleasant…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…of Americans in condemning  the actions of Immigration and Customs Enforcement. There is brutality  and death in our streets, so-called leaders trashing victims and their  grieving families, warrantless searches, and fear in our own citizens.  I had a State senator in my own district tell me this last week that  she was fearful of going out to talk to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…fight for the rest of my  life to make sure that no child, no individual in this country, ever  feels discriminated against. It is what my father did. It is what I did  as a grieving mother when my son, Jordan, was killed by a White man who  simply didn't like the loud music that he was playing in his car. It is  what we must do now as a Presidential administration,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…the country.\n\nI have a granddaughter Rosie Gracie, and I will absolutely encourage  her to get involved in Turning Point when she is just a little bit  older.\n\nTo Charlie's grieving wife Erika and his two beautiful children, we  are praying for you. Just know how grateful we are for Charlie's life  and legacy. I will continue fighting every day for the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…were CNN and  MSNBC? Where were the New York Times and the Washington Post? Where  were the armies of journalists and camera crews to tell their stories,  to interview their grieving parents, to regale us all with stories  about their kindness and their decency and their innocence?\n\nWhere were Chuck Schumer and Hakeem Jeffries? Where were Barack Obama…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…legislation would close the loophole  and prevent VA bureaucracy from being forced to take back benefits  delivered to the veteran who earned it through their service.\n\nFamilies grieving a veteran's passing should not have to worry that  VA will go after them to recover a pension payment.\n\nThis legislation would prevent those situations while recognizing our…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to the cemeteries to the  respective counties.\n\nWhile this is a straightforward bill, I think many of us can attest  to the invaluable role a burial place can play in the grieving process.  Burial sites are sacred, eternal resting places that provide closure  for the families of the deceased. Families should not be forced to  travel long distances to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…stand with them as we continue to understand what  happened on that tragic night of January 29. I hope the answers that  are uncovered will help bring some closure to those grieving and help  ensure that a tragedy like this never happens again.\n\nMr. Speaker, as we honor the 67 lives cut short by this accident, I  also thank the countless first responders…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…room at Valerie House to create a  more welcoming space. She repainted the room and assembled a resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting positive impact on  the community.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Dakota for achieving…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…and the grief that is being  expressed, it is clear that Ella left a lasting imprint on the people  she touched. Alabama misses Ella, and we join her family and friends in  grieving her loss.\n\nYou know, it certainly seems like this might have been a targeted  attack. We will not rest until the deranged psychopath who did this is  brought to justice. But…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Texas this weekend. More than 100 have been  reported dead--among them, at least 28 children. It is a moment of  unfathomable pain for so many, and my prayers are with the grieving  parents and the grieving families.\n\nI am grateful for the efforts of the rescue workers, military  members, and volunteers who put themselves in harm's way to rescue  flood…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693248/central-texas-floods"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I rise today to honor the many families still  grieving from the heinous assault that claimed 1,200 innocent lives on  October 7, 2023.\n\nLast Monday marked 500 days since Hamas terrorists perpetrated the  unprovoked and truly evil…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688087/500-days-since-october-7-attack"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…it takes  on them. I know the long hours, sleepless nights, and time spent away  from family. I know this stuff.\n\nI know what it means to respond to a tragedy, to console a grieving  victim's family after a horrendous crime has happened to them involving  tragic accidents. I have seen things most Americans will thankfully  never have to experience.\n\nWhen…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}]