[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…country.\n\nIncluded in his order are coffee, tea, fruit juices, tropical fruits,  spices, bananas, oranges, and tomatoes. Obviously, if you talk to  anybody who has been in a grocery store lately, the prices for all of  those products have gone up by large margins, again, in the wake of the  April tariffs that were put into place.\n\nCoffee is up 19 percent.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to death of a $230 billion cut to the Food Stamp  program which would end that lifeline for themselves and for their  families.\n\nLast year, the FTC identified that large grocery store chains  exploited the product shortages due to the pandemic by raising prices  significantly more than needed to cover their added costs, and they  have continued to increase…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Just today, the nonpartisan Congressional Budget Office confirmed  what families already feel--American consumers are paying 95 percent of  these tariffs. They pay at the grocery store. They pay in higher energy  bills. They pay when small businesses shut their doors.\n\nThese blanket tariffs on Canada are a slap in the face to one of our  closest trading…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699977/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…don't pay these  tariffs. They know that American families do. The farmers feel it.  Small businesses feel it. Moms and dads feel it every time they see the  prices at the grocery store.\n\nWhat this is, we can go back and forth, but the American people are  watching. They are the ultimate judges. They can see. They can hear.  They know our friend. They…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Mr. Speaker, from my very first conversations 9 years ago, when I  first asked my neighbors to place their trust in me to represent them,  to even just this weekend at the grocery store, I have heard from  parents, grandparents, and small businesses alike that the childcare  crisis is suppressing our economy and forcing families to make  impossible decisions.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…of the most  wealthy person in the world, of Cabinet Secretaries, did we speak up?\n\nWhen the American economy, in 71 days--71 days--has been upended;  when prices at the grocery store were skyrocketing and the stock market  was plunging; when pension funds, 401(k)s were going down; when  Americans were hurting and looking up; when the resounding answer…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…get ahead. I hear it from  seniors who are struggling to survive on fixed incomes. I see it with  my own eyes. Moms and dads are putting items back on the shelves in the  grocery store because they can't afford them. Parents can't go back to  work because they can't afford childcare. People's health insurance  premiums are doubling and tripling because…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…economic uncertainty out of  the White House are driving up costs across the country and squeezing  working people who are already stretched thin with higher prices at the  grocery store, higher rent, and stagnant wages.\n\nThat is why, now more than ever, programs like the Low-Income Energy  Assistance Program, LIHEAP, are so critical. Yet earlier this year,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697917/in-support-of-liheap"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…this,  and I have to have hope that our country can find its way again. We  must build the future that our kids deserve, where we are safe at  school, the movie theater, the grocery store, where we can go to a  political rally without worrying about getting shot, and where we can  disagree with the President and the political party in charge without  being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…National Egg  Day: Easter eggs, chocolate eggs, egg yolks, egg whites, egg souffle,  meringue pie, egg salad, and so much more.\n\nEgg prices still cost 25 percent more at the grocery store. The  answer is: Don't ignore the devastating impact of bird flu decimating  flocks across our district and Nation. Meanwhile, the big egg  conglomerates like Cal-Maine…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…supply can't keep up with demand,  prices go up. That is not just ideology; that is simple economics.\n\nSimilarly, Trump's self-imposed taxes have increased your costs at  the grocery store. You are paying more for the essentials you rely on  most: coffee, produce, meat, so much more. Trump and his billionaire  buddies, who probably haven't gone grocery shopping…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…thrilled  that they were finally able to get the Social Security benefit that  they deserve and earned. There wasn't anywhere that I could go in the  community: church, the grocery store, the gym, restaurants, someone  always stopped me to thank me for voting for the Social Security  Fairness Act and to tell me a story of how it is going to change lives.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…that, food is medicine, cutting  SNAP benefits not only takes food away from hungry people, but it also  undermines our economy because those dollars are spent at our local  grocery store.\n\nI also have to just mention that food banks, which are the next line  of support, are also under threat because DOGE and Elon Musk and Donald  Trump have cut the food…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans blame President Trump for higher prices--FOX News.\n\nListen to my constituent Tria, who wrote to me from Chicago. After  experiencing the sticker shock at a South Loop grocery store, she said:\n\nNo matter if it's organic or not . . . it's still going to       be an arm and a leg for it. It's like you're spending your       soul on groceries.\n\nAnother…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…because the refuge is not just land.\n\nFor wildlife, it is essential habitat. For many people who live there  and are sustained by its caribou, this place is literally their grocery  store. It is not just a reminder of the past, it is hope for the  future. But that future is at stake.\n\nThe Arctic Refuge is under threat from the Trump administration's  relentless…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…information as we can to make a  reasonable decision to make sure we have clean, sustainable, but ample  and safe fuel for this country in order to get groceries to the grocery  store, either through diesel or gasoline.\n\nPrices matter. It hurts families when their electric bills are high  and when their grocery bills are high because people have to eat…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…materially put a married couple at a disadvantage.\n\nWe have all heard stories of Food Share. If you talk to people at the  local convenience store, talk to people at the local grocery store,  people are taking advantage of these programs. They may be able to buy  food items that the person who is working behind the counter can't  afford.\n\nWe know when it comes…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…and deficit in our  Nation's history. During that same time, Americans have also had to  grapple with hyperinflation and record-high energy costs and grocery  costs at the grocery store.\n\nThis budget will usher in a new golden era that the American people  are yearning for and where free enterprise can flourish, energy  production is unleashed, and our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688066/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Assumption BVM works alongside the Society of St. Vincent de Paul to  assist people who struggle to afford basic necessities. To help ease  these burdens, Assumption BVM collects grocery store gift cards and  other monetary donations for those in need.\n\nTheir outreach also includes the Caring for Friends program, which  provides home-cooked meals to individuals…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…is ever  going to get any better. They are tired of having to pay more, live  worse. They are worried that eventually they are going to have to sell  blood to go to the grocery store.\n\nWhy are they feeling that? It is called inflation. And the inflation  started under President Biden. As we know, it got to 9 percent. I won't  go into the reasons why.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…America because that  bloated spending in Washington, which is money we don't have, by the  way; and it increased inflation to the point where people couldn't even  go to the grocery store to fill up their carts. They couldn't afford to  go to the gas station to fill up their cars. They couldn't afford to  take out a loan to buy a house because interest rates…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…independence a hallmark  of his campaign.\n\nHe did it because he knows about the connection between energy  independence and bringing down inflation. When you go to the grocery  store, we see products all over the shelves that have been brought  there by trucks--trucks that are paying a lot for gasoline and diesel  fuel.\n\nYou see frozen food refrigerators…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…with the bill. You either are going to have to pay for it  through taxes--the debt will always be paid either through taxes or  through inflation and high prices at the grocery store.\n\nGovernment spending and fiscal malfeasance have not only weakened  every American family's purchasing power, but our national economy is  weaker as well. At $37 trillion,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…I rise today not just as a Member of Congress  but as the father of two Jewish boys. I speak for all the Jews across  the country, millions of them, who today go to the grocery store, their  jobs, and school and live their lives afraid of what might happen to  them.\n\nEighty years ago in Germany, Jews were burned in ovens for being  Jews, and on Sunday,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…December of last year, on the day before Christmas Eve,  Greensboro Police Officer Michael Horan was shot and killed while  responding to a call about a man with a firearm in a grocery store. The  murderer fled the scene and led law enforcement on a multicounty chase.  The brave men from multiple law enforcement agencies apprehended the  suspect on Interstate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…real results on our southern border as  illegal crossings and the flow of illicit drugs has dropped  significantly.\n\nFamilies are feeling real relief at the gas pump and grocery store as  their wages are going up and opportunities are increasing. In our  schools and military, the emphasis is, once again, on merit instead of  discriminatory DEI standards.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…or shutter their operations. Those who  stay in business often have to raise prices to stay afloat. And whether  it is through higher utility bills or higher costs at the grocery store  or for other goods, it is the American people who ultimately bear the  cost of these rules.\n\nThat is why this is such an important issue for Republicans. It is  why we…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…disable itself, so the  car dashboard becomes your judge, your jury, and your executioner.\n\nImagine this: We have a snowstorm coming. A mom takes her kids out to  go to the grocery store. It is snowing, and they are trying to get some  groceries before the big storm hits. She swerves for a pothole. The  neighbor's pet gets in the way, and she swerves for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people who work  in the food stores, and they will say that frequently people on the  FoodShare program can afford types of food that the people who are  working at the grocery store feel they cannot afford. Not only do we  have these programs which are conditioned upon not marrying somebody  with an income, but they even have benefits that are sometimes…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…that is adapted  for their use.\n\nThis is an important program and helps disabled veterans in their  daily lives by allowing them to drive to medical appointments, to the  grocery store, and to work. Unfortunately, shipping costs are not  currently covered, creating a financial burden on veterans who want to  make their lives better.\n\nWhile this might…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}]