[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…not little kids anymore; they are growing--through the  course of their upbringing, we have been able to control certain  things, like how we feed our kids. We go to the grocery store, and you  are shopping for what you are going to prepare for dinner. You have  readily accessible information--nutritional information--not just  calorie information, protein…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…of the most  wealthy person in the world, of Cabinet Secretaries, did we speak up?\n\nWhen the American economy, in 71 days--71 days--has been upended;  when prices at the grocery store were skyrocketing and the stock market  was plunging; when pension funds, 401(k)s were going down; when  Americans were hurting and looking up; when the resounding answer…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…communities where neighbors try to look  out for one another.\n\nHowever, too many families are struggling to put food on the table.  They are being priced out of their own grocery store. Food prices have  shot up--meat, milk, bread, eggs--basics that every family depends on.  Households are getting buried under the weight of their grocery bill.\n\nNow, to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…supply can't keep up with demand,  prices go up. That is not just ideology; that is simple economics.\n\nSimilarly, Trump's self-imposed taxes have increased your costs at  the grocery store. You are paying more for the essentials you rely on  most: coffee, produce, meat, so much more. Trump and his billionaire  buddies, who probably haven't gone grocery shopping…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…across this country are already  struggling with the rising cost of living. The price of everything is  going up: groceries, housing, childcare, and rent. When you go to the  grocery store, Mr. Speaker, beef prices are up 16 percent, and coffee  is up nearly 20 percent.\n\nInstead of lowering costs, the President imposed tariffs on Canada,  which is nothing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…of Delaware families  who are still catching their breath after Thanksgiving--a holiday that  should bring joy, not undue anxiety over the cost of a single trip to  the grocery store.\n\nLast week, too many Delawareans told me that the price of their  holiday meal felt heavier this year, and they are right. Delaware  families are paying an average of…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…prices on  everything for American households. The American people are  being squeezed hard every time they try to buy a home, buy a car,  afford health insurance, go to the grocery store, or go shopping for  clothes, toys, tools, and school supplies. It is a reality that our  Nation functions under the weight of unfair global supply chains.\n\nWhile we can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…maneuver reminds me of what they have done on tariffs this  entire Congress that we finally overcame.\n\nEveryone kind of understands now that they are paying more at the  grocery store because of the President's arbitrary tariffs. I know he  likes to say: Oh, other countries are going to pay these tariffs, but  all of the experts, everyone knows, prices…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…create  custom profiles about them. Now, with electronic labels and facial  recognition technology, this information is being used in real time to  charge us more at the grocery store.\n\nImagine if you were at the grocery store right now, and they charged  you a higher price for an item because it used technology to determine  that you were willing to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…don't pay these  tariffs. They know that American families do. The farmers feel it.  Small businesses feel it. Moms and dads feel it every time they see the  prices at the grocery store.\n\nWhat this is, we can go back and forth, but the American people are  watching. They are the ultimate judges. They can see. They can hear.  They know our friend. They…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…economic uncertainty out of  the White House are driving up costs across the country and squeezing  working people who are already stretched thin with higher prices at the  grocery store, higher rent, and stagnant wages.\n\nThat is why, now more than ever, programs like the Low-Income Energy  Assistance Program, LIHEAP, are so critical. Yet earlier this year,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697917/in-support-of-liheap"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…this,  and I have to have hope that our country can find its way again. We  must build the future that our kids deserve, where we are safe at  school, the movie theater, the grocery store, where we can go to a  political rally without worrying about getting shot, and where we can  disagree with the President and the political party in charge without  being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sentiments still remain today, as highlighted by the  President's recent State of the Union. Millions have lost access to  much needed food assistance, while prices at the grocery store continue  to rise. Daycare centers and rural hospitals are closing. Ill- considered tariffs have cost every hardworking family more than $1,750  and caused untold inflation…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700295/president-trumans-words-still-ring-true-today-the-failings-of-the-state-of-the-union"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…as a mother who  knows what it feels like to lose everything to gun violence, and I know  this: Every family in America deserves the right to be safe at school,  at the grocery store, and at home.\n\nThe Trump administration is making this much harder. This White House  has worked to unwind the very protections that are designed to keep us  safe. They…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…thrilled  that they were finally able to get the Social Security benefit that  they deserve and earned. There wasn't anywhere that I could go in the  community: church, the grocery store, the gym, restaurants, someone  always stopped me to thank me for voting for the Social Security  Fairness Act and to tell me a story of how it is going to change lives.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…importance of ensuring families have access to healthy  and nutritious milk products. As a father of seven, my wife and I have  purchased our fair share of milk on trips to the grocery store.\n\nThis legislation has been in the making for a long time, and it is  past due that we send it to the President's desk and make this the law  of the land.\n\nMoving forward,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698181/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…I rise today not just as a Member of Congress  but as the father of two Jewish boys. I speak for all the Jews across  the country, millions of them, who today go to the grocery store, their  jobs, and school and live their lives afraid of what might happen to  them.\n\nEighty years ago in Germany, Jews were burned in ovens for being  Jews, and on Sunday,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…with the bill. You either are going to have to pay for it  through taxes--the debt will always be paid either through taxes or  through inflation and high prices at the grocery store.\n\nGovernment spending and fiscal malfeasance have not only weakened  every American family's purchasing power, but our national economy is  weaker as well. At $37 trillion,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…information as we can to make a  reasonable decision to make sure we have clean, sustainable, but ample  and safe fuel for this country in order to get groceries to the grocery  store, either through diesel or gasoline.\n\nPrices matter. It hurts families when their electric bills are high  and when their grocery bills are high because people have to eat…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…past year, workers in America now have $1,400 more in  each and every one of their pockets than they did before President  Trump took office. From the gas station, to the grocery store, to the  pharmacy, paychecks are going further. Families are feeling financial  relief, and more relief is on the way because there is more work for us  to do.\n\nLet's consider…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have something made  for me.\n\nIn a socialist economy, something that the gentleman who is running  for mayor of New York would like--I guess he would like only one type  of grocery store. There would only be one sort of restaurant because  all the restaurants are run by the government.\n\nFirst of all, since they are owned by the government, they don't have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "John Thune", "party": "Republican", "sentence": "…or shutter their operations. Those who  stay in business often have to raise prices to stay afloat. And whether  it is through higher utility bills or higher costs at the grocery store  or for other goods, it is the American people who ultimately bear the  cost of these rules.\n\nThat is why this is such an important issue for Republicans. It is  why we…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…real results on our southern border as  illegal crossings and the flow of illicit drugs has dropped  significantly.\n\nFamilies are feeling real relief at the gas pump and grocery store as  their wages are going up and opportunities are increasing. In our  schools and military, the emphasis is, once again, on merit instead of  discriminatory DEI standards.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…America because that  bloated spending in Washington, which is money we don't have, by the  way; and it increased inflation to the point where people couldn't even  go to the grocery store to fill up their carts. They couldn't afford to  go to the gas station to fill up their cars. They couldn't afford to  take out a loan to buy a house because interest rates…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to  washing machines, to just about every conceivable product.\n\nVoters in the last election indicated they were fed up with high  prices. Every time Americans went to the grocery store, they were  reminded that inflation and putting food on their family's table was  more difficult and left them with less money for other necessities.\n\nMany pundits say…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…and deficit in our  Nation's history. During that same time, Americans have also had to  grapple with hyperinflation and record-high energy costs and grocery  costs at the grocery store.\n\nThis budget will usher in a new golden era that the American people  are yearning for and where free enterprise can flourish, energy  production is unleashed, and our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688066/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Assumption BVM works alongside the Society of St. Vincent de Paul to  assist people who struggle to afford basic necessities. To help ease  these burdens, Assumption BVM collects grocery store gift cards and  other monetary donations for those in need.\n\nTheir outreach also includes the Caring for Friends program, which  provides home-cooked meals to individuals…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…anyone  who enjoys a steak or a hamburger will be staring at higher prices in  their local restaurant or at the drive-through at their favorite fast- food chain or at the grocery store. Anyone planning a nice Valentine's  Day dinner in a few weeks should listen up and perhaps budget  accordingly.\n\nUnfortunately, the New World screwworm is quickly spreading.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…disable itself, so the  car dashboard becomes your judge, your jury, and your executioner.\n\nImagine this: We have a snowstorm coming. A mom takes her kids out to  go to the grocery store. It is snowing, and they are trying to get some  groceries before the big storm hits. She swerves for a pothole. The  neighbor's pet gets in the way, and she swerves for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…independence a hallmark  of his campaign.\n\nHe did it because he knows about the connection between energy  independence and bringing down inflation. When you go to the grocery  store, we see products all over the shelves that have been brought  there by trucks--trucks that are paying a lot for gasoline and diesel  fuel.\n\nYou see frozen food refrigerators…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}]