[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Argentina and perhaps another $20 billion  in private funding. What he is doing in tariffs has been eclipsed by  all the other stuff, but it hits Americans in their pocketbooks.  Groceries are skyrocketing in price. Americans are finding it more  difficult to put food on the table. Farmers are being crushed by these  tariffs as well.\n\nHealthcare. The tax credits…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…billionaires.\n\nI want to share a story from Rita, a woman in Portland who wrote to  my office claiming if Federal food assistance was cut, she will have to  choose between buying groceries and paying rent, buying groceries or  paying the electric bill.\n\nThis is not an unfamiliar story for me as a physician, who heard my  patients struggling with similar choices.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691769/151-days-without-a-vote-to-lower-costs"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…struggling right  now with wage theft in their workplace. These are all things that we  could actually be fighting for right now for our families, like the  rising cost of groceries, but instead we are wasting time advocating on  behalf of credit card companies, not the people who we represent.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689837/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, every day I hear from my constituents that  they  are struggling to afford groceries, rent, healthcare, and other  necessities. That is why lowering costs has always been priority one  for me. However, it doesn't seem to be a priority for this  administration…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689333/lowering-costs-for-struggling-americans"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…two Thanksgiving  food drives held in my district last week.\n\nFirst, Santa Ana's Nicholas Academic Centers hosted a food drive for  students and their families to pick up groceries and Thanksgiving meals  to enjoy during the holidays.\n\nThe second is, in Anaheim, the YMCA joined forces with the legendary  Frank Garcia to host the annual We Give Thanks…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…economy  an A+++++. That is five pluses that Donald Trump gave himself. But I  think  most Americans right now are giving him an F. Why? I will tell you  simply. The cost of groceries is up. The cost of electricity is way up.  The cost of housing is way up. The cost of healthcare, because of  Republicans, is way up, and they are even going to complicate…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…question, unless you are from a wealthy family, this bill will close  the doors of opportunity for the next generation to access affordable  college.\n\nFamilies will pay more for groceries, gas, insurance, and utilities,  but oil companies and corporate executives will get tax breaks. This  bill will hike the average household electricity bill by about 10…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Madam President, hard-working families in Nevada and all  across this country are struggling to make ends meet because of rising  costs on everything, from groceries to housing, all of which has been  made worse by Donald Trump's tariffs that are driving prices even  higher.\n\nNevadans, our families, we are being squeezed, and they need…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…assistance programs. Their prescription insurance has increased by $119  a month, which is unmanageable on a fixed income.\n\nA Toledo resident told me that everything is going up. Groceries cost  more as well as childcare and rent. Unless Congress acts, health  insurance premiums for us will double. Our family cannot make it. We  don't have an extra $100 per…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696841/rising-healthcare-costs"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…resolution does nothing to deliver on the current needs  of the American people. As inflation continues to grow and threats of  trade wars persist, the cost of necessities like groceries, childcare,  and housing will continue to increase putting a greater burden on  American families.\n\nTheir budget resolution also earmarks $200 billion to supercharge  mass…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…they used to.\n\nAnd making things even worse, Donald Trump's tariffs are coming in at  the worst possible time, and in a few short months, they are going to  raise the cost of groceries. They are going to hurt small businesses  and do untold damage to our economy.\n\nAnd, now, this package suffocates public broadcast. Well, did they  even know when they said…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Joshua Riley", "party": "Democrat", "sentence": "Mr. RILEY. Mr. Speaker, utility bills are crushing upstate New  Yorkers. I have seniors on fixed incomes who are cutting back on  groceries and working parents who are cutting back on school clothes  for their kids just to keep the lights on.\n\nNow the utility monopolies, which are owned by foreign corporations,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695743/high-utility-rates-by-foreign-monopolies"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, as we stand here, workers' rights  are under attack, and working families are struggling to decide between  paying rent and paying for groceries. Instead of lowering costs, this  week, the Republicans are considering proposals that will reduce  workers' wages, adversely affect their retirement savings, and give  corporations…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698950/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…for an incredible career and for being a role model and my  friend. He is always a class act.\n\nI also rise today to speak for the families who are forced to choose  between groceries, rent, and healthcare because prices keep climbing.  Affordability is equal to economic stability. Let me repeat that:  Affordability is equal to economic stability. Americans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the opportunity to stop. We are very close. We urge  our Republican colleagues to join us. Tell the American people you want  to focus on what they care about: the cost of groceries, the cost of  healthcare, the cost of electricity and other goods.\n\nThe contrast between what is happening in the House and Senate today  is glaring. In the House, there…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…very clear. Tariffs are simply  taxes. Tariffs don't punish foreign governments. They punish American  families. When we tax imports, we raise the price of everything from  groceries to smartphones, to washing machines, to prescription drugs.  Every dollar collected in tariff revenue comes straight out of the  pockets of American consumers.\n\nConservatives…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John James", "party": "Republican", "sentence": "…No more games, no more surprises, and no  more $47 aspirin.\n\nThis is bipartisan, bicameral, and commonsense stuff. In literally  every part of life elsewhere, buying a car, groceries, or a cell phone,  you know the price before you swipe your card and before you put your  hard-earned cash on the register, Mr. Speaker. You can shop around,  find a better…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…not be  able to afford the cost-of-living increase. Many disabled veterans and  their families rely on their benefits to help pay for necessities like  mortgage payments and groceries.\n\nI know there are veterans in my district currently struggling to stay  healthy and make ends meet. Personal finances and being able to pay  your bills are a major source…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696760/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Security benefits for senior citizens.\n\nFor the average family of four in North Dakota, this package will  help save an estimated $1,600 in taxes. That buys about 8 weeks of  groceries. This is American money staying with the American family,  which is exactly where it belongs.\n\nThis bill is also pro-business. The one big, beautiful bill also  includes…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…standard  deduction or itemize. It will benefit millions of Americans on fixed  incomes, providing meaningful relief as costs for housing, healthcare,  prescriptions, and groceries continue to rise.\n\nBut our work is not done, Mr. Speaker. To many seniors, they still  see their Social Security benefits taxed. That is why I support  legislation to fully…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the average  taxpayer will see a 22 percent tax hike.\n\nThe average family of four making $80,000 a year will see their taxes  go up almost $1,700. That is 2 months' worth of groceries.\n\nAmericans need certainty that relief is on the way. Workers need  certainty that their taxes won't go up.\n\nMr. Chair, 26 million small businesses need certainty that their…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…jury, and your executioner.\n\nImagine this: We have a snowstorm coming. A mom takes her kids out to  go to the grocery store. It is snowing, and they are trying to get some  groceries before the big storm hits. She swerves for a pothole. The  neighbor's pet gets in the way, and she swerves for that. A first  responder goes by. She pulls over.\n\nHer car…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of a sudden concerned with the costs of  everyday Americans, was nowhere to be found for 2 years in the 118th  Congress, as we fought every day about the costs of gas and groceries  and how it was pinching away because of Biden's inflation and what it  had done to the purchasing power of everyday Americans' accounts.\n\nPeople in probably both of our…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…on Social Security; they are going to be  impacted. People living on a fixed income; they budget down to the last  dollar. They need to pay for rent; they need to pay for groceries; they  need to pay for prescriptions. Democrats don't seem to worry about  that. Oh, they say they can wait.\n\nBecause a Democrat shutdown means that customer service applications…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…saying that she       was having a tough time with things. Some expenses surprised       her, and she was suddenly out of money for the month. She was       okay, as she had groceries, gas, and her bills paid, until       she got a flat tire on the way to a school function. She got       the car to the tire shop.\n\nMr. BARR. Mr. Speaker, I will finish the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…President. Our President promised, in the  campaign and recently in an address to all of us here in Congress, to  make America affordable again; to deal with the high prices of  groceries, of fruits and vegetables, of housing, of housing supplies,  of energy--to deal with high prices. Millions of Americans who voted  for President Trump said they did so out…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Rose", "party": "Republican", "sentence": "…this bill, everyday Americans will see lower income tax rates, a  larger standard deduction, and an expanded child tax credit. That means  more take-home pay, more money for groceries, gas, and healthcare.  Filing will be simpler. Refunds will be bigger.\n\nThis bill doesn't just cut taxes. It makes them fairer. It puts  kitchen-table concerns at the center…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…payment for an important rent or mortgage company  to proceed, thereby allowing American families to take care of  essential needs like that mortgage payment, rent payment, groceries, or  gas before their next paycheck arrives.\n\nOver the last decade, competition has driven financial institutions  to lower their overdraft privilege fees to retain customers.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…executed unarmed men of fighting age and killed people who  unwittingly crossed their paths, whether it was children fleeing with  their families or locals hoping to find groceries or people simply  trying to get back home on their bicycles. The victims of this massacre  were of all ages and professions. This massacre would be deemed a war  crime under…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…at $2 for gasoline right now.\n\nLower gas prices, as the Presiding Officer knows, impact everything  that a family does. It impacts everything in the country: the cost of  groceries, the cost of commuting to work, or keeping going a ranch or  family business. Energy prices affect all of it.\n\nAnd lower prices are happening because Republicans are successfully…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]