[{"senator": "Lori Trahan", "party": "Democrat", "sentence": "House Republicans are forcing a vote this week on the so-called SAVE  Act, a bill that does nothing to stop inflation from driving up grocery  prices, nothing to end Donald Trump's trade war that is pummeling the  stock market, and nothing to protect Americans' retirements.", "title": "Gop Creating Chaos in Electoral System", "date": "2025-04-01"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "We have higher electric prices, grocery prices, and housing prices.", "title": "Hospital Inpatient Services Modernization Act", "date": "2025-12-01"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Let me help paint the picture for President Trump and his Republican  accomplices: Utility bills are skyrocketing across the country, grocery  prices are up, and the cost of buying a new home feels out of reach for  far too many Americans.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "My House Democratic Caucus freshmen colleagues and I are focused on  making life better for the American people and driving down grocery  prices, utility bills, rent and mortgage payments, and childcare and  elder care costs so that hardworking people can breathe easier.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "A people-first agenda should include expanding the child tax       credit for the 17 million children who don't receive the full       credit due to low family incomes, expanding rental       assistance, increasing SNAP benefits to reflect rising       grocery prices and closing the Medicaid coverage gap.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Tariffs are driving up grocery prices  even higher and contributing to price uncertainty.", "title": "Delaware Day", "date": "2025-12-03"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Again, it was so clear to anyone who was actually connected to the  real world that grocery prices were going up and that we had to take  steps to carve out exemptions for the sake of American consumers, our  working families, and the middle class.", "title": "Congress Must Take Action on Tariffs", "date": "2025-11-17"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Grocery prices are up.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "came to Congress, we could have done a  bill to lower grocery prices for Americans.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Meanwhile,  grocery prices are surging, and, of course, monthly healthcare premiums  are skyrocketing across the Nation, thanks to the healthcare crisis  Republicans created by failing to extend the Affordable Care Act's  enhanced premium tax credits.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Grocery prices are up 2 percent, yet the bill freezes SNAP, a cut for  45,000 families in my district, which is an $18 million monthly blow to  local grocers.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "They are asking me to lower grocery prices, lower the  price of healthcare, and make life more affordable.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Grocery prices are  still increasing, housing isn't getting more affordable, and it is  getting harder for families to make ends meet.", "title": "Time to Focus on Costs", "date": "2025-05-05"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Grocery  prices, egg prices, meat prices, fish prices, and poultry prices are  all up even more than ever.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "And by stopping it from  passing, you and your Republican colleagues--well, I am afraid you are  telling the American people that their kitchen table isn't your  priority and that Washington Republicans would rather bow to Trump than  pass legislation to lower at least one section of grocery prices and  make food more affordable for their constituents.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Grocery prices are down.", "title": "-9999", "date": "2025-10-02"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "Grocery prices are  coming down.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}]