[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Republicans are running scared of  a titanic Presidential temper tantrum over releasing the Epstein files.\n\nMy Democratic colleagues and I are here to work to lower costs and  grow our economy, to build healthier and safer communities, and to  ensure strong national security and national defense.\n\nI implore my colleagues on the other side of the aisle to join…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694074/time-to-deliver-results-for-american-people"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…demand for new and reliable power, causing prices to go up and limiting  the electrons that can reach areas that need this electricity.\n\nWe must meet this challenge, grow our economy, and bring down the  energy bills that are rising so quickly and crushing so many of our  constituents today. To do that, we need to build more transmission  infrastructure.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…administration and Republicans continue to ignore the needs of working  families. That is not governing. They have abandoned their  responsibility to bring down costs and grow the economy.\n\nMr. Speaker, this bill was already bad, but now they have added this  corrupt, get-rich-quick scheme to give hundreds of thousands of  taxpayer dollars to Trump-aligned…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…percent cut in funding the Amtrak Northeast Corridor service. This is a  bad business decision that speaks more to politics than any objective  analysis of what will grow the economy and jobs.\n\nIn the congested corridor between Boston and D.C., where major  businesses are headquartered and where we generate major revenue for  this Nation, we don't…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692196/northeast-corridor-amtrak-cuts"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…evidence that trickle-down economics does not work. It  doesn't help the middle class. It doesn't create jobs. It doesn't  increase business investment, and it doesn't grow the economy.\n\nWhat these policies actually do is allow companies and their  shareholders to pocket more profits at the expense of everyone else. It  is because of trickle-down economics…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…for the  future.\n\nI hope that we don't cut ARS funding that USDA depends on. I hope  that we will give hope to our future constituents and the growth that  we need to grow our economy instead of cutting our opportunity.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…to ignore the  needs of working families. That's not governing; it's a cruel and  corrupt abdication of their promise and their responsibility to bring  down costs and grow the economy. Oregonians and Americans deserve  better.\n\nDuring the shutdown I held three town hall meetings--something most  Republicans still refuse to do--and heard from many constituents…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the Biden rules that we shut  down, and people need access when they have loved ones who are in need.\n\nThese tax cuts aren't talk. These efforts aren't talk. They will grow  our economy. Our legislation provides much-needed tax cuts for working  families, unleashes American energy, supports innovation, and  safeguards healthcare for Americans who need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…more energy and  every form of energy when we look at the demands for data processing,  when we look at transportation demands, when we look at demands for  energy to grow our economy and to produce more things here. I don't  think anybody on either side of the aisle would question the fact that  we need more energy and our energy consumption is on…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…invested billions in  clean and emissions-controlled technology. We have reclaimed our lands  and maintained some of the strongest air quality records in the Nation.\n\nWe can grow the economy, power the country, and steward the  environment all at once. That is the American Way, and that is  certainly the North Dakota way.\n\nThe Biden administration failed to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "French Hill", "party": "Republican", "sentence": "…commonsense, bipartisan legislation that our  constituents expect us to pass. To lower costs and encourage companies  to be public is a good thing for our Nation. It will grow the economy  faster. Companies can go public sooner in their growth period.\n\nMr. Speaker, for all the reasons I have explained, I urge my  colleagues to support this bill, and I yield…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time, but it turns out its deficit effects are  more than two times because of the consumption of services.\n\nIt turns out that when someone tells you this is going to grow the  economy, it is not in the economic literature. It may be in your  aspirations, in your heart, or how you feel, but it is not in the  economic literature. Tell the truth about…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, President Trump's One Big Beautiful Bill Act will  dramatically grow our economy and reduce our deficit. It is the largest  tax cut in American history for families, farmers, workers, and small  businesses.\n\nThis bill will help our Main Street businesses…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693183/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…trade deals including with the U.K.,  the EU, Japan, Australia, Korea, El Salvador, Vietnam, Guatemala, and  Malaysia, just to name a few. These trade deals will help grow the  economy, protect the American workers, and reassert our global  standing.\n\nOur friends have selective memory. Let's remember: When President  Biden took office about 5 years…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…that will drive  down costs.\n\nFor Florida, this bill continues funding for critical infrastructure  projects that protect our waterways, help our rural communities, and  grow our economy.\n\nMr. SCOTT FRANKLIN of Florida. Mr. Speaker, this is a huge win for  our national security and for all Americans, and I urge my colleagues  to support it.\n\nMr. COLE.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, my voters and my constituents sent me  here to help solve problems, to help small business, to help employees,  and to help grow the economy. As such, I am proud to support the Tipped  Employee Protection Act. This important bill will help codify changes  we are making in Congress to help tip the scales in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…at $2 trillion of savings, and they  would be good for the economy. They would be good for healthcare. They  would be good for people to be healthier. They would help grow the  economy.\n\nThis is an example of getting policy right to actually take on a  small sliver of the debt because, remember, our baseline debt for the  next 10 years, we are going…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…investments that will make America,  including our small businesses, stronger and more competitive.\n\nOur goal is to reward entrepreneurship, to reward hard work, and to  grow the economy. For small businesses, we permanently increased the  small business deduction to 23 percent. This will impact 67,000 North  Dakota businesses.\n\nThis bill will allow 100…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…but future leaders  across Iowa. Her commitment to innovation has helped position Iowa  State as a national leader in preparing students to solve real-world  challenges, grow our economy, and serve our communities.\n\nIt was always a pleasure to run into Wendy on the early morning  flight from Des Moines to D.C., where she has been a tireless advocate  for…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691609/recognizing-president-wendy-wintersteen-for-her-service-to-iowa-state-university"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…poorer by bringing in people to compete  with your working poor. That is the cruelty of what the last  administration did. They crushed working people's wages.\n\nI want to grow the economy, grow productivity, and make this society  wealthier. We are the only country in the entire industrialized world  that hasn't moved to a talented-based immigration system…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…an amazing bill.\n\nMr. Speaker, I rise today in strong support of the CLARITY Act. The  increasing adoption of digital assets and the use of blockchain  technologies can grow our economy and provide American families with a  new opportunity to grow wealth.\n\nHowever, under President Biden, digital assets were attacked, which  crushed innovation and created…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693773/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…bonus depreciation and other investment  incentives lowered small businesses' tax burden and encouraged them to  invest in themselves, hire more workers, and, in turn, grow our  economy. And that is what happened.\n\nAfter the Tax Cuts and Jobs Act passed, we saw businesses buy new  equipment. They hired new workers. Paychecks got bigger. It was good…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}]