[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this urgent       safety and national security issue and for taking this       opportunity to address it. This bipartisan legislation is       well positioned to tackle the growing occurrence of fires       linked to uncertifIed lithium-ion batteries, and will       ultimately protect lives and ensure public safety.            Sincerely,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…the years ahead.\n\nMr. Speaker, I urge all my colleague to support this bill which will  allow the Securities and Exchange Commission to better understand and  respond to this growing crisis.\n\nI thank Mrs. Wagner for her partnership on this bipartisan  legislation, and I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…inconvenient.\n\nThe league talks about fairness. The league talks about lifting women  up. Pay them what they deserve if you want to lift women up in the  WNBA.\n\nThey talk about growing the game with integrity, but when the stakes  were high, the WNBA didn't protect the game. They manipulated it. They  chose a winner.\n\nHere is the truth: Minnesota didn't…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…fuels are not immune  from failure.\n\nReliability comes from diversification and modernization, not by  clinging to a single fuel.\n\nNext, I hear that clean energy can't meet growing demand. That is not  true either. Electricity consumption hit a record high last year, and  it is projected to continue rising in 2026, according to EIA. AI-driven  data centers,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…come down dramatically. Some 250 gigawatts of installed  solar capacity nationwide now exist. That is enough to power 45 million  homes, making solar an important and rapidly growing part of our  electricity mix.\n\nAs of 2024, the industry employed 280,000 Americans across thousands  of companies including a recent boom in domestic manufacturing jobs.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699172/congratulating-abigail-ross-hopper"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…American half-cent.\n\nIn 1908, the society built a neoclassical building at 155th       Street and Broadway, in the city's Washington Heights       section, to accommodate its growing membership, library and       collection. The numismatic cognoscenti gathered there for       lectures and exhibits, for celebrations of National Coin Week       and debates…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Mr. LEVIN. Mr. Speaker, I rise today to support California's right to  clean air. Growing up in southern California in the 1980s, smog alerts  were a regular part of life. A lap around the track at school and your  chest would burn. We can't go back to those days.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690620/clean-air-isnt-a-partisan-issue"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…anniversary of  serving as the public housing authority for Jefferson County, Colorado.\n\nFirst created in the fall of 1975, Foothills Regional Housing has  worked to meet the growing housing needs of Jefferson County by  preserving existing affordable housing units and developing new ones.  In addition to supporting low-income renters by administering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…their       children and take them to a country they may have never       known, away from the only home they've ever had? Or do       families face separation, with children growing up without       their parents, their stability shattered, and their futures       uncertain? This is not a theoretical issue. These are the       very real questions that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…there  through nutrition programs, education, and public health. If we walk  away now, we are not just abandoning our values. We are surrendering  one of the world's fastest growing marketplaces to China.\n\nLet's be clear: Regions we assist aren't just aid recipients. They  are emerging economies and future trading partners. Pulling back opens  the door…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Another business, Peter Case of Burrows Sports in Brattleboro:\n\nWe love what we do and it's under attack! For 90 years,       Burrows Sports has proudly served Brattleboro, growing with       our community through good times and hard ones. Today's       economic pressures, rising costs, and shrinking margins are       testing small local businesses like…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…corruption  independently, and it should apply to all sectors.\n\nToday, we must focus on regulation and protections for consumers  because, today, one in five Americans, and growing, lack those  protections and lack any guardrails. It is our job to start putting  them in place.\n\nIs this bill perfect? No. Can it be improved upon? Absolutely, and I  encourage…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…accidental. They are the result       of decades of community organizing, research-informed policy,       and consistent engagement with impacted residents. They       reflect a growing national consensus that smart, preventative       investments are more effective than reactionary       criminalization--and they save taxpayer dollars by shifting       scarce…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…coast of Massachusetts, and we  are creating good jobs while we are doing it.\n\nClean energy jobs are now over 40 percent of all the energy jobs in  the United States. They are growing twice as fast as other industries,  but Donald Trump is now trying to unravel all of that progress. Why? In  order to please his big oil and gas donors.\n\nAnd this sham will…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…stability. Given all of that, Mr.  Speaker, I will support H.R. 3682, and I reserve the balance of my  time.\n\nMr. Speaker, at a time when threats to our financial stability are  growing, Congress should be doing more to address these concerns,  including closing oversight gaps regarding third-party vendors,  advancing deposit insurance reform and, yes, holding…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699825/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…assemblies.\n\nWe have repeatedly watched leftist mobs burn our cities, loot  shopkeepers, and assault people on the streets while leftist  politicians egged them on.\n\nWe see the growing physical attacks on law enforcement. The left used  the FBI to suppress debate on critical issues ranging from COVID  lockdowns to Biden family influence peddling to climate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…like  AI, to draft letters and gather documents. That same technology has not  been applied to other types of claims, such as pensions or survivor  benefits. This has led to a growing backlog and, in some cases, missed  benefits altogether.\n\nMy bill takes steps to fix this. It requires the VA to expand the use  of automation tools, ensure that documents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…cleaning up the economic  mess. Real wages and benefits fell 3.9 percent during the Biden-Harris  administration, and through the Working Families Tax Cuts Act, real  wages are growing faster than prices.\n\nWe saw 4.3 percent real GDP growth in the third quarter of 2025. That  is substantial. The average since World War II is 3.1 percent. After  3.8 percent…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…watersheds, strained emergency responders, and  long-term burdens on our economy, infrastructure, and public safety.\n\nThese fires have scarred our lands and endangered our growing  population. For us in Utah, the next major wildfire is not a question  of if but when and how devastating it will be.\n\nThat is why the Utah Wildfire Research Institute Act…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698236/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…regulatory  decisions to attack baseload power sources in favor of expensive and  unreliable wind and solar have handicapped the ability of our bulk  power systems to respond to growing demands for energy.\n\nHistoric projections of increasing electricity demand from domestic  manufacturing, onshoring, and AI data centers have exposed systemic  challenges facing…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…how important it  is to protect our marine wildlife and restore the Bay's ecosystem.  Since their introduction, the blue catfish have become an invasive  species, posing a growing threat to the biodiversity of the region's  waters and inflicting severe economic damage to seafood industries that  rely on the Bay.\n\nThis legislation aims to direct the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…engine of  economic growth in some of the poorest, most rural counties.\n\nEarlier this year, Congress passed the first-ever bipartisan,  comprehensive recreation package aimed at growing, not restricting, our  Nation's $1.1 trillion outdoor recreation economy. The EXPLORE Act  passed unanimously in both the House and Senate, a rare feat that  demonstrates…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…daily  basis.\n\nMr. Speaker, the build-out of interstate natural gas pipeline  infrastructure is essential to ensuring domestic energy can be  transported efficiently and meet growing electricity demands. H.R. 3668  should be an easy ``yes'' vote for Members on both sides of the aisle.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Recognizing Environmental Stewardship in Our Forests\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to support the timber  industry and the harvest of trees in our forests.\n\nWhen I was growing up, my father was a forestry professor at  Washington State University and my uncle was a smokejumper. I served in  the U.S. Forest Service.\n\nYears of fear and hesitation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…Kids Act. Milk  has long been a cornerstone of children's diets in this country. It  provides high-quality protein, calcium, vitamin D, and other essential  nutrients that growing bodies and young minds need to thrive. For many  kids, milk is the most reliable source of vital nutrients they receive.\n\nThis legislation is about common sense and choice.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698184/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…milk does not fit into this category. In fact, many  schoolchildren are at risk of dairy underconsumption, not  overconsumption.\n\nWhole milk provides critical nutrition for growing minds. We need to  follow the science and pass the Whole Milk for Healthy Kids Act.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…``yes'' vote enables us to consider legislation that pays our  guardians in the United States Space Force, investing $1.49 billion to  support 10,400 Active-Duty guardians, a growing force critical to  modern national security.\n\nA ``yes'' vote enables us to consider legislation that gives the  brave men and women who are defending our country a well-deserved…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…continues to shape a future where survivors  are empowered and human trafficking is eradicated. Laurie Swink co- founded Selah Freedom in 2011, with a clear mission to address the  growing crisis of human trafficking and to restore freedom and dignity  to those trapped in it. Since then, her leadership has been a catalyst  for change, and her vision for Selah…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…hate you. We want to take everything  away from you. We won't follow science on this one.\n\nWe have opened the door for predators to abuse women and girls. Our  daughters are growing up with something we never had to distinguish  when our generation was growing up. We are putting our daughters in  imminent danger, in harm's way, and this has to stop.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…spending, but the annual defense budget request from OMB this year  doesn't even keep up with inflation. The fiscal year 2026 top line  won't come close--close--to covering growing costs and requirements,  like the multiyear munitions contracts the Department of Defense  rightly wants to actually sign.\n\nWe should keep the cost and value of America's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]