[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and demanded stronger  environmental protections, and this became the birth of the modern-day  environmental movement and eventually the first Earth Day in 1970,  which has grown in its recognition and celebration.\n\nThat same year, Congress passed the Clean Air Act on an overwhelming  bipartisan basis. That original Clean Air Act authorized the waiver…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Department of Justice and other Federal agencies to compile  a comprehensive report describing every Federal statutory and  regulatory criminal offense carrying penalties. These have grown  substantially over the last four decades, despite several previous  attempts by the Office of Legal Policy at DOJ, the American Bar  Association, and several scholars to determine…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…years ago, Dwight Wilmot petitioned the United  States Postal Service to establish a post office named Evergreen in the  foothills of western Denver. Since then, Evergreen has grown from a  small ranching and logging village only accessible by wagon roads to  the vibrant mountain community that it is today. Originally inhabited  by the Native Ute, Cheyenne,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and effectively ensure       the protection, development and enhancement of the total       environment itself.\n\nThe Government's environmentally related activities have       grown up piecemeal over the years. The time has come to       organize them rationally and systematically. As a major step       in this direction, I am transmitting today two reorganization…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…recognize the  100th anniversary of the Town & County Club in the historic Asylum Hill  neighborhood of Hartford, Connecticut. Over its storied 100-year  history, the club has grown into the premier location for members to  enjoy organized social, intellectual, and artistic gatherings.\n\nOn May 21, 1925, just five years after the 19th Amendment guaranteed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…complex from the U.S. Department of Housing and Urban Development for  one dollar in 1993--a landmark act of community ownership and self- determination. Since then, APSARA has grown into a trusted community  institution offering affordable housing, youth development, health  access, workforce support, and immigrant advocacy.\n\nFor more than 30 years, Ms.…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694721/recognizing-sovanna-koeurt"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…eagle-eyed fans may recognize as the  former Clatsop County jail, which played host to the Goonies iconic  jailbreak scene.\n\nJust as the original Goonies fans and stars have grown and matured  since the film's release in 1985, so has Oregon's film industry. With  its magnificent and diverse natural beauty, Oregon has become a much  sought after location…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…surrounded by her siblings, surrounded by the normalcy and       safety of parents that love her.\n\nSince that day Medicaid has kept up with Leda's needs as       she has grown. A toddler who once needed a walker now sprints       across the yard because the program funded the therapy and       walker that strengthened her legs.\n\nIt's provided her…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…decade, the fund has faced a severe and sustained  crisis. Stemming from changes in prosecution practices, revenues have  plummeted. Meanwhile, the needs of victims have only grown.\n\nIn recent years, we have witnessed the emergence of a devastating  cycle. Annual distributions to States for victim services and  assistance have been cut by 40 percent,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…and firefighters and hard- working Americans who play by the rules each and every day. The average  American isn't afforded that luxury.\n\nAs a result, our Federal deficit has grown, inflation remains high,  and the American people are left with nothing but rising prices,  stagnant wages, and bitter, bitter feelings about being left behind.\n\nFor too long,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…is this the right thing to do, but providing farmworkers  with legal status helps provide stability and keeps our stores stocked  with affordable groceries and domestically grown food, also helping  American growers.\n\nInstead, the Rules Committee blocked my amendment, and not a single  amendment was made in order. We need to do better than this and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Speaker, I rise to recognize and celebrate the  20th anniversary of the Mountain's Edge community in Clark County,  Nevada.\n\nSince its groundbreaking in 2005, Mountain's Edge has grown into one  of the most vibrant communities in the southwest area of the Las Vegas  Valley. Mountain's Edge sits at the foothills of the Spring Mountains,  and was envisioned…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…The Honeycomb Network, a community  empowerment space proudly calling Barrio Boriken home.\n\nWith over two decades of direct social service and educator  experience, Denise has grown The Honeycomb Network to become a beloved  community hub.\n\nIn partnership with therapists, educators, artists, and community  care providers of diverse backgrounds, The Honeycomb…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Dream hasn't slipped away;  it has been ripped away.\n\nI am 40 years old. My generation and those younger than me, the first  generation in a long time, since World War II, have grown up and don't  expect to be better off than their parents.\n\nThat is what the American Dream is all about. It didn't just happen  on accident. There are villains here. Corporate…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…ago.\n\nMeanwhile, community banks have disappeared as the number of banks  declined from more than 18,000 in 1990 to fewer than 5,000 today.  Meanwhile, the biggest banks have grown much bigger through mergers  and, not surprisingly, are charging customers more for banking products  and services.\n\nFor example, the Consumer Financial Protection Bureau found…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR. Mr. Chair, my amendment No. 106 prohibits funds for the  DOD's bioindustrial manufacturing and design ecosystem, or BioMADE,  that funds lab-grown meat and protein products for the military from  feeding our men and women. How disgusting does that sound?\n\nWith a national debt of over $37 trillion, we can't afford to litter…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…trails of Battle Creek Falls and the wooden  castles at Discovery Park, to the family traditions of Hee Haw Farms  and the Christa McAuliffe Space Center.\n\nThough the city has grown, it continues to be a family-oriented town  where residents can learn, explore, and thrive together.\n\nAt the heart of Pleasant Grove is its tight-knit community, people  dedicated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695307/recognizing-pleasant-grove-utah"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…remarkable milestone for the city of Lincoln and the entire State  of Nebraska, the 100th Anniversary of Bryan Health.\n\nSince first opening its doors in 1925, Bryan Health has grown from a  hospital in Lincoln into one of Nebraska's most innovative, trusted,  and patient-oriented healthcare networks.\n\nOver the past century, Bryan Health has expanded its…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…freedom to choose cleaner, more affordable, American-made  fuel at the pump.\n\nThat fuel is E15. E15 is simply gasoline blended with up to 15  percent ethanol, or corn. Ethanol is grown, produced, and refined right  here in the United States, often in towns and communities where  agriculture is the backbone of the local economy, where every dollar  spent at…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699304/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Bumpers and Pryor bill, S. 2125. At the time, I worked for       Senator Tower on the staff of the Senate Committee on       Banking, Housing & Urban Affairs.\n\nHaving grown up in Arkansas and spent many boyhood hours in       the Ozark and Ouachita National Forests, I had closely       followed the House logjam and was eager to help my life-long…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Putin has repeatedly rejected such peaceful  coexistence. Instead, what he has done is he has chosen bloody, neo- Soviet empire-building instead.\n\nTo the extent that NATO has grown, it has been in response to Russian  aggression. If Putin is looking for someone to blame for Sweden's and  Finland's accessions to the alliance, he can simply look in the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Alewel's  Country Meats.\n\nWhat better month to highlight this amazing small business than  National Beef Month?\n\nWhat began as a small downtown grocery store in 1932, Alewel's has  grown into a fixture of Warrensburg's local community.\n\nThis federally inspected meat processing and retail facility  developed old German recipes to create quality fresh meats and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Motorcycle Club of Kentucky. What started out as a  group of firefighters whose main purpose was to strengthen their  brotherhood through recreational motorcycle rides, has now grown into a  club with much greater purpose.\n\nThe Brother's Keepers Motorcycle Club focuses on safety and  motorcycle awareness nationwide. However, realizing the strength of  their…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…true. What is also true is their  volunteers and benefactors are everyday heroes, quietly providing  critical services to thousands of neighbors each year.\n\nAs our community has grown and changed, BEAM has remained a constant  source of light, guiding families through tough times with warmth,  direction, and hope.\n\nToday, we celebrate more than a milestone.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Republican and Democratic administrations. That means our revenue has  continued to grow, but it actually stays consistent as a percentage of  our entire GDP. Our spending has grown, up to 26 percent.\n\nThat is why you see in a Republican reconciliation bill like we  passed a couple of weeks ago that a significant portion of that bill is  spending cuts,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Albano receive a  living, breathing understanding of history and our Nation's story.\n\nBeyond his dynamic and innovative teaching style, Mr. Albano is a  beloved coach who has grown Union Hill's cross-country and track-and- field programs into teams of nearly 90 students in a school of just  700. It is a tribute to the magnetism of his leadership.\n\nHe…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in our country.\n\nWe have been trying to figure out how to express some of this, so I  am going to do it in a couple of different ways.\n\nOver the last 12 months, receipts have grown 10 percent. Spending is  up 4 percent. You say: Shouldn't we be closing the gap? Except the  problem is the spending last year was over $7 trillion, where tax  receipts were…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…water issues in California.\n\nThis is an issue that is important to our whole country. It is not  just important to California because most of the fruits, nuts, and  vegetables grown in this country are in the Central Valley of  California. Without water, you can't grow any of them.\n\nIf we are taking water away from the Central Valley for unnecessary  reasons,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…overcriminalization: vague laws, hidden laws, duplicative laws, and  regulatory crimes that nobody could reasonably expect an ordinary  citizen to find or understand.\n\nThe Federal code has grown so bloated that a person can unknowingly  violate a regulation they have never heard of and the government can  still throw the book at them.\n\nEven former Harvard University…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…2005, Mr. Atsma launched a custom calf raising business--another  example of the family's commitment to innovation in dairy production.  What began with 450 milking cows has  grown to a herd of 1,550, including 1,400 milking cows. That kind of  growth doesn't happen without a deep respect and knowledge of the land  and livestock.\n\nThis June, during the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698674/recognizing-the-atsma-family"}]