[{"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "President, one of the proudest moments of my life  was the first time I ever laced up my boots, put on my uniform, and  raised my right hand to swear my oath to the Constitution as a member  of the Illinois Army National Guard, and I cherished every day that I  got to wake up and call myself a soldier.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Furthermore, the resolution fails to recognize  the premature and escalatory deployment of the National Guard and  active-duty Marines by President Trump to Los Angeles.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-07-02"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "He has federalized and deployed National Guard troops in  American cities against our own citizens in violation of the law.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Among the illegally terminated--and I should stress ``illegally  terminated''--are 2,400 VA employees, many of them veterans themselves,  members of the Guard or Reserves now, caregivers, military spouses.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Instead of listening to us, the people from L.A., the President  escalated this drama, deploying the National Guard and the Marines to  Los Angeles without a request from local law enforcement, the Governor,  or the mayor.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "It requires a  memorandum of understanding with the Army, Navy, Air Force, and Coast  Guard to share safety data, and it directs the Army inspector general  to audit pilot training, maintenance protocols and the compliance.", "title": "Rotorcraft Operations Transparency and Oversight Reform Act", "date": "2025-12-17"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, today, I introduce the District of Columbia  National Guard Commanding General Residency Act, which would require  the Commanding General of the District of Columbia National Guard to  reside in D.C.", "title": "Introduction of the District of Columbia National Guard Commanding General Residency Act", "date": "2025-07-29"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Kaitlyn's charcoal drawing, titled To Light and Guard, will hang in  the U.S.", "title": "Recognizing Kaitlyn Anthes", "date": "2025-06-25"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "Speaker, the images emerging from  California--ICE raids escalating into chaos, immigrant families fleeing  their homes, and the National Guard troops confronting peaceful  protesters--are a chilling reminder of how far we have strayed from my  democratic values that we claim to uphold.", "title": "Ice Raids in California", "date": "2025-06-10"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "They perform year-round and offer a wide range  of programs in percussion, color guard, and other performing arts  disciplines.", "title": "Recognizing the Crystal Lake Strikers for Receiving the Carl E. Wehde Award", "date": "2025-05-08"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Madam Chair, I rise in opposition to this amendment,  which would create broad exemptions from the Endangered Species Act on  military and National Guard lands.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Just  before the weekend, the President spouted off some nonsense about  deploying the National Guard to Portland.", "title": "National Guard in Portland", "date": null}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "military to use lethal force against  individuals who posed no imminent threat of attack and who could have  been stopped thousands of miles from our shore had we interdicted and  arrested those on board just as they routinely are by our Coast Guard.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "More than 100 advanced combat  aircraft were deployed, including F-35s from the Vermont National  Guard.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "They have deployed the National Guard to our cities  and terrorized hardworking immigrants who are following the rules, all  without warning, charges, or due process.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Following Jim's combat service, he served as a guard during the  Nuremberg trials.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "I say ``his latest'' because it was just a couple of weeks ago that  Governor Newsom was unanimously defeated before the Ninth Circuit Court  of Appeals on his National Guard lawsuit.", "title": "Ending Waste of Taxpayer Dollars in California", "date": "2025-07-21"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Master Sergeant Holliday's home unit is the 121st Security Forces  Squadron based at Rickenbacker Air National Guard Base.", "title": "Recognizing Brandan Holliday", "date": "2025-12-09"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "As a former Army Black Hawk helicopter pilot, I had the blessing of  serving with countless men and women across the Active-Duty, Reserve,  and National Guard components of our Armed Forces.", "title": "Benefits That Endure for Lifetimes of Service Act", "date": "2025-05-13"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Coast Guard operations in the  area.", "title": "200th Anniversary of the Town of Cutler", "date": "2026-01-29"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "I also remind everybody, because we get tied up in a lot of stuff,  that, essentially, the Homeland Security bill is the Coast Guard, FEMA,  TSA, Secret Service, Border Patrol, and ICE.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "Army and       Army National Guard during the Iraq and Afghanistan Wars.", "title": "Recognizing the Recipients of Florida's 16th Congressional District Veteran Commendation", "date": "2025-12-03"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "She was, as we all will  recall,  one of the National Guard servicemembers working here in the District  of Columbia.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Speaker, Saturday is the National  Guard's 389th birthday.", "title": "-9999", "date": "2025-12-12"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "In November, the Coast Guard announced it seized 510,000 pounds of  cocaine in the eastern Pacific and the Caribbean since the start of  2025.", "title": "Resolution, to Remove United States Armed Forces From Hostilities with Presidentially Designated Terrorist Organizations in the Western Hemisphere", "date": "2025-12-17"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Last Tuesday night, more than 50 years after his acts of valor,  Brigadier General Paul Sellars, Commanding General of the Washington  Army National Guard, had the honor of presenting the Silver Star to Mr.", "title": "Focusing on Results", "date": "2025-11-18"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "The LC-130 fleet is wholly operated by the 109th Airlift Wing of the  New York Air National Guard at Stratton Air National Guard Base in  Scotia, New York.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Since 1925, this group has united  veterans of the Navy, Marine Corps, and Coast Guard.", "title": "Recognizing the Navy Club of Georgetown, Sc", "date": "2025-07-22"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Speaker, we have got a lot at risk  which is the same reason why President Trump finally had the guts--yes,  I will call them guts--to call in the National Guard to take on the  crime presence that exists in Washington, D.C.", "title": "District of Columbia Judicial Nominations Reform Act", "date": null}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Worst of all, these politicians decided to place the blame for the  violence on our incredible National Guard members, somehow saying it  was their presence there that caused it.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}]