[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…already through this  debate. I want to remind the American people and everybody that it was  local law enforcement that got the situation under control before the  National Guard and the Marines showed up. I know because I was on the  phone with the sheriffs and local law enforcement who said, no, they  don't need anybody, that the situation was under…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…partisan resolution designed to attack elected  officials in California. Furthermore, the resolution fails to recognize  the premature and escalatory deployment of the National Guard and  active-duty Marines by President Trump to Los Angeles.\n\nWhen the House of Representatives passes a resolution regarding  current events, it should do its due diligence…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…diverted military resources away from numerous--numerous-- critical missions for his chaotic and violent mass deportation  campaign. He has federalized and deployed National Guard troops in  American cities against our own citizens in violation of the law.\n\nThat is why just last Friday the Ninth Circuit Court of Appeals  ordered National Guard troops…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…another instance of Donald Trump wildly abusing our  military, trying to blur the lines between our servicemembers and law  enforcement. We saw it when he sent the National Guard to intimidate  peaceful protesters in Los Angeles or when he similarly threatened  Chicago and Portland before he was stopped by the courts. We have even  seen it in this Capital…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…have openly stoked and  institutionalized Islamophobic discrimination.\n\nWe all recall, on November 26, we saw a horrific attack on two  members of the West Virginia National Guard deployed here in our  Nation's Capital. That type of violence has no place in a just society.  But the Trump administration did not meet this attack with targeted,  measured…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…President has played politics with our Nation's military and tried  to use them to advance his authoritarian agenda, be it here at home or  abroad. He has deployed the National Guard to the District of Columbia,  Los Angeles, Memphis, and Chicago and has attempted to deploy the  National Guard to Portland. These deployments are a flagrant violation  of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  National Guard Commanding General Residency Act, which would require  the Commanding General of the District of Columbia National Guard to  reside in D.C. Two Congresses ago, the House Committee…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…as they tried to protect Members of this  body and the Vice President of the United States from harm.  Congressional leaders begged President Trump to send in the National  Guard. He refused. However, Virginia, the birthplace of American  democracy, did.\n\nFour years later, President Trump pardoned the individuals who sought  to harm Members of Congress…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692516/government-of-the-people-not-of-the-king"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…I express support for that, I will associate  myself with the comments of my colleagues for the previous resolution,  condemning the violence against members of the National Guard from West  Virginia and condemning that horrific act that took the life of Army  Specialist Sarah Beckstrom and has left Air Force Staff Sergeant Andrew  Wolfe gravely injured.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…The Crystal Lake Strikers are a drumline that seamlessly integrates  the arts and education. They perform year-round and offer a wide range  of programs in percussion, color guard, and other performing arts  disciplines. Their mission is twofold: to provide high-quality  entertainment to the community and to build confidence in students. By  expanding…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Gerald R. Ford Carrier Strike Group,  and several amphibious assault ships. More than 100 advanced combat  aircraft were deployed, including F-35s from the Vermont National  Guard. And we can estimate that thousands of military and intelligence  personnel were involved in planning and executing the raid that seized  Maduro.\n\nA mobilization of this size…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…of my time.\n\nMs. TOKUDA. Madam Chair, I rise in opposition to this amendment,  which would create broad exemptions from the Endangered Species Act on  military and National Guard lands. In Hawaii, this would be akin to a  taking.\n\nThe idea that protecting endangered species and maintaining readiness  are mutually exclusive is simply false. Across the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…imminent threat of attack and who could have  been stopped thousands of miles from our shore had we interdicted and  arrested those on board just as they routinely are by our Coast Guard.  Instead, the U.S. military used lethal force on four separate  occasions, killing everyone on board.\n\nDespite this breathtaking departure from more than two centuries of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…credits.\n\nBut maybe most alarmingly--most alarmingly--as is visible in the  streets of Oregon, California, Chicago, Los Angeles, is the deployment  of our military, our National Guard.\n\nThe Senator from Oregon has spoken so powerfully and eloquently to  bring a critical lens to this desecration of democracy and the impact  on our military itself, because…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…themselves. They have detained parents on their way to work.  They have kidnapped U.S. citizens. They have tear-gassed people,  including children. They have deployed the National Guard to our cities  and terrorized hardworking immigrants who are following the rules, all  without warning, charges, or due process.\n\nThis administration is abusing its power to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Bronze Star.  Although injured by shrapnel during battle, Jim never received  treatment, thus never receiving the Purple Heart.\n\nFollowing Jim's combat service, he served as a guard during the  Nuremberg trials.\n\nShortly after returning home to Kansas following the war's end, Jim  would marry his wife Marilyn, with whom he would raise their three  children…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…lawsuit.\n\nI say ``his latest'' because it was just a couple of weeks ago that  Governor Newsom was unanimously defeated before the Ninth Circuit Court  of Appeals on his National Guard lawsuit.\n\nYet, this frivolous lawsuit is particularly perverse because the  Governor is now wasting taxpayer dollars suing so that he is able to  continue wasting taxpayer…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693872/ending-waste-of-taxpayer-dollars-in-california"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…leading over 56 security forces members for U.S. Central  Command.\n\nMaster Sergeant Holliday's home unit is the 121st Security Forces  Squadron based at Rickenbacker Air National Guard Base. He also serves  his community as a law enforcement officer, as an emergency management  specialist for the Kettering Police Department, and as a part-time  sergeant and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…illness or accident.\n\nAs a former Army Black Hawk helicopter pilot, I had the blessing of  serving with countless men and women across the Active-Duty, Reserve,  and National Guard components of our Armed Forces. During that time, I  took on many roles, from supporting wildfire fighting efforts to  deploying as part of Operation Enduring Freedom. Mr.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…safety and American national security. Since 1876, the Little  River Lighthouse, with a formidable cast iron tower, has guided  fishermen and has been integral to U.S. Coast Guard operations in the  area. It is now listed on the National Register of Historic Places,  ensuring its existence for generations to come.\n\nIn addition, for 65 years, the Cutler…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…thank them all for their dedication and effort.\n\nI also remind everybody, because we get tied up in a lot of stuff,  that, essentially, the Homeland Security bill is the Coast Guard, FEMA,  TSA, Secret Service, Border Patrol, and ICE. There are other parts in  there, but that is the majority of what we are talking about. Homeland,  what is that? That is…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…time.\n\nBenny Blackshire of Sun City Center who served in the U.S.       Army during the Vietnam War.\n\nJeffery Camp of Parrish who served in the U.S. Army and       Army National Guard during the Iraq and Afghanistan Wars.\n\nJack Carter of Lakewood Ranch who served in the U.S. Marine       Corps during the Vietnam and Gulf Wars.\n\nCharles Conover, Jr. of Sun…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Mr. President, we all remember the tragic murder of SPC  Sarah Beckstrom on the eve of Thanksgiving. She was, as we all will  recall,  one of the National Guard servicemembers working here in the District  of Columbia. We are continuing to pray for the recovery of Staff Sgt.  Andrew Wolfe, who was injured in the shooting. But, of course,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, Saturday is the National  Guard's 389th birthday. Nearly four centuries ago, the National Guard  was founded in the Massachusetts Bay Colony. Since then, the National  Guard has exemplified the spirit of…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…America. Every narcoterrorist killed is an American life,  like Laken Riley or Claretha Daniels, saved. The threat is pressing,  and it is frequent.\n\nIn November, the Coast Guard announced it seized 510,000 pounds of  cocaine in the eastern Pacific and the Caribbean since the start of  2025. This is enough cocaine to harm nearly 170 million Americans.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…ago but never delivered.\n\nLast Tuesday night, more than 50 years after his acts of valor,  Brigadier General Paul Sellars, Commanding General of the Washington  Army National Guard, had the honor of presenting the Silver Star to Mr.  Gilman.\n\nThe Silver Star is the Army's third-highest award for gallantry in  combat, given only to those who display extraordinary…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…United States with a key competitive edge in the Arctic and  Antarctic domains.\n\nThe LC-130 fleet is wholly operated by the 109th Airlift Wing of the  New York Air National Guard at Stratton Air National Guard Base in  Scotia, New York.\n\nBeyond its national security importance in supporting our Arctic  strategy, the LC-130 fleet is also critical in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Georgetown, South Carolina, as it celebrates an extraordinary  milestone, its 100th anniversary. Since 1925, this group has united  veterans of the Navy, Marine Corps, and Coast Guard. From the shores of  South Carolina to all around the world, they've served our Nation with  honor.\n\nFor generations, the Navy Club has remained deeply embedded in the  life…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693998/recognizing-the-navy-club-of-georgetown-sc"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…lot at risk. Mr. Speaker, we have got a lot at risk  which is the same reason why President Trump finally had the guts--yes,  I will call them guts--to call in the National Guard to take on the  crime presence that exists in Washington, D.C.\n\nMembers of Congress have had their cars stolen. We have had Members  of Congress who were assaulted. We have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…frivolous lawsuit that was thrown out unanimously by the  Ninth Circuit.\n\nWorst of all, these politicians decided to place the blame for the  violence on our incredible National Guard members, somehow saying it  was their presence there that caused it. This is deeply offensive, and  our National Guard members are owed an apology.\n\nToday, I hope we can stand…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]