[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "…bill I cosponsored with my Republican colleague from North  Carolina, Representative Addison McDowell, to help the Coast Guard  respond to opioid overdoses.\n\nOur brave Coast Guardsmen are the first line of defense against  illegal drug trafficking on our waters, and this legislation will  ensure that they have the tools that they need to combat opioid…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the need  for this urgent reform and increased congressional oversight.\n\nEarlier this week, the President suggested that he would invoke the  Insurrection Act to deploy more guardsmen in major cities if the courts  or Governors delayed deployment. So I stand here with my colleagues  from Oregon, Illinois, and California, whose constituents are living…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…movie about the loss of all humanity when military action is  unchecked by ethics or the laws of war. And this week, he made good on  his threats, forcing hundreds of National Guardsmen into our city,  against the will of the people of Illinois or its legally elected  representatives.\n\nFor months, Trump has fabricated claims of chaos and crime on  American…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…from community groups, from  citizens across the United States, and, yes, from Members of the U.S.  Senate.\n\nToday, in DC, California, Oregon, and Illinois, these National  Guardsmen are not only patrolling the streets, they are aiding and  supporting ICE crackdowns--again, despite challenges to their legality.  Now, three district courts in California,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…protect  themselves politically from Trump's wrath. They threw our allies and  our military under the bus.\n\nTrump's weaponization of the horrific shooting of the National  Guardsmen, before we had even gathered the full facts, to scapegoat  Afghan allies and immigration communities, has been repugnant. The  administration swiftly suspended asylum decisions,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…and celebrate her historic role as the first woman to hold this rank at  the Delaware National Guard, and I was moved hearing about her  commitment to her fellow National Guardsmen.\n\nBefore her time at the Delaware National Guard, she served as the  first woman chaplain at the National Guard Bureau in Arlington,  Virginia. Her devotion to spiritual…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…imminent threat that Islam poses to our great country.  Unfortunately, that threat turned into reality just a few weeks ago  when a deranged jihadist shot two of our National Guardsmen just steps  from the White House. Just before Thanksgiving, SPC Sarah Backstrom and  SSG Andrew Wolfe were on patrol near the White House when they were  attacked by Biden-imported…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Bars,'' is a lab-grown protein derived from a microbiological  agent similar to fungus.\n\nYummy.\n\nThis is the food that built America? I think not.\n\nWhy do marines, sailors, guardsmen, and coasties need lab-grown meat  when the U.S. is full of delicious beef?\n\nIn fiscal year 2022 alone, the DOD awarded more than $369 million in  U.S. contracts for beef,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Transportation  Subcommittee, I have seen firsthand how vital their service is to our  national security and to our prosperity.\n\nThe Coast Guard Authorization Act gives our guardsmen the tools, the  resources, and the support that they need to meet today's threats,  whether it is stopping fentanyl at sea, stopping illegal migrants, or  responding to natural…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694196/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…our country with  dangerous drugs. It will also give the Coast Guard the parity to police  other armed services with regard to rapid treatment of drug overdoses,  keeping guardsmen safe from accidental exposure.\n\nH.R. 2351 implements changes that will help secure our maritime  border and increase safety on our seas.\n\nMr. Speaker, I urge support of this…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Small Arms Weapons Expert and Squad Designated Marksmanship  programs National Guard-centric courses.\n\nAward the Master Marksmanship Training skill identifier to National  Guardsmen who complete both programs.\n\nIntegrate both programs into the Army Program Objective Memorandum  and consider establishing a modified Table of Organization and  Equipment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695158/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…consider legislation that pays our  airmen in the United States Air Force, providing $38.7 billion to  support 321,500 Active-Duty airmen, 67,500 reservists, and 160,300  guardsmen defending our skies.\n\nA ``yes'' vote enables us to consider legislation that pays our  guardians in the United States Space Force, investing $1.49 billion to  support 10,400…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…thanks  for the blessings in our lives--the night before Thanksgiving--two of  our country's finest were shot down mere blocks away from the White  House. Two young National Guardsmen, who had served their country like  the Presiding Officer, who were doing their jobs of keeping us safe,  were ambushed by a gunman here on asylum.\n\nIt was 20-year-old Sarah…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…parts of the world, including Iraq,  Afghanistan, Qatar, and Germany. Yet through all his overseas  assignments, his heart remained in Iowa, where he guided and mentored  Guardsmen to ensure they were trained, supported, and prepared to  serve. His mentorship, including to myself as a Squadron Commander,  where he imbued his leadership traits upon the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…security, defend  our allies, and fight tyranny and terror from distant shores.\n\nToday, the Army is comprised of roughly 450,000 Active-Duty  servicemen, 325,000 National Guardsmen, and 176,000 members of the  Reserve, making the U.S. Army the largest branch of the military.\n\nI want to thank our brave men and women in uniform for their  sacrifices to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692460/executive-calendar"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…National Guard were targeted. It was an ambush attack, and it happened  just blocks away from the White House. It was an act of terrorism. The  act was not only on our National Guardsmen; it was on our entire  Nation.\n\nOne of the servicemembers was Sarah Beckstrom. She was an Army  specialist from West Virginia. She died on Thanksgiving Day. She was  only…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…deployed  here in Washington, D.C.\n\nI have been fortunate to spend time with these young men and women on  several occasions during their mission. I have shared a meal with the  guardsmen. I visited as they prepared for patrol. I have seen them in  action while on duty.\n\nI also thank the families, spouses, and loved ones back home who  carry the weight while…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…aviation maintenance hangar and operations building and renovate  the existing hangar space at our Shelbyville, Indiana, Army Aviation  Support Facility.\n\nMr. Chair, 900 Indiana guardsmen assigned to the 38th Combat Aviation  Brigade have supported 16 deployments since 2001, including to Iraq,  Kuwait, and Bosnia. Our Shelbyville facility remains a crown jewel…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692960/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]