[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…program.\n\nWhile loan defaults aren't currently a concern for the 504 program,  this bill will provide Congress with valuable information needed to  monitor the program's operation, guard against future risk, and ensure  that the program's zero-subsidy requirement is maintained.\n\nMadam Speaker, I applaud Representatives Tran and Patronis for their  work on this…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699187/504-program-risk-oversight-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…partisan resolution designed to attack elected  officials in California. Furthermore, the resolution fails to recognize  the premature and escalatory deployment of the National Guard and  active-duty Marines by President Trump to Los Angeles.\n\nWhen the House of Representatives passes a resolution regarding  current events, it should do its due diligence…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Senate--what is the  ultimate measure of it when it has the opportunity to reclaim its power  to declare war and it doesn't?\n\nWe are finding ourselves now with the National Guard being sent into  various cities around the country, various States, without a request  from the Governors, without a request from the mayors, without a  request from the officials…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…``Moon'' Halasi- Kun, who has honorably served our Nation for more than twenty-five  years and most recently as the Wing Commander of the 104th Fighter Wing  at Barnes Air National Guard Base in Westfield, Massachusetts.\n\nColonel Halasi-Kun's career is a testament to dedication, leadership,  and excellence in service. Commissioned from the United States Air…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…begged the visitor to pause and flip through a book,       any book: on heraldry or mythology, shipwrecks or excavation.       Then, once past the several locked doors that guard the       vault, Wartenberg Kagan and Peter van Alfen, the chief       curator, shared with glee just the smallest hint of the       society's immense treasure.\n\nIn this sliding…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…acknowledge the leadership of the chair and the  ranking member of the full committee and the subcommittee for their  great, bipartisan work on this initiative.\n\nOne of the Coast Guard's primary missions is search and rescue. In  fiscal year 2025 alone, their efforts saved more than 2,200 people and  $40 million in property. To keep up this important work,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…reforms in       response to the murders of George Floyd and Breonna Taylor       and the need to enact systemic police reform. In the wake of       the deployment of the National Guard and surge of federal law       enforcement in D.C., there has been an increase in instances       of police brutality and unwarranted searches. Congress must       not block…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…certainly possible due to the amount of time--there has not yet been a  decision by the district judge to dissolve the second temporary  restraining order. So the National Guard has not been federalized and  able to deploy.\n\nBut it was going to depend on what happened at midnight last night,  in which the district judge had said: I want to see if the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…I express support for that, I will associate  myself with the comments of my colleagues for the previous resolution,  condemning the violence against members of the National Guard from West  Virginia and condemning that horrific act that took the life of Army  Specialist Sarah Beckstrom and has left Air Force Staff Sergeant Andrew  Wolfe gravely injured.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of  which have also not been adequately explained to Congress.\n\nSecond, the President has circumvented the authority of several state  governors and federalized the National Guard for the purposes of  deploying them in support of domestic law enforcement activities.  Domestic policing is not among the National Guard's core missions, and  the Posse Comitatus…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Gerald R. Ford Carrier Strike Group,  and several amphibious assault ships. More than 100 advanced combat  aircraft were deployed, including F-35s from the Vermont National  Guard. And we can estimate that thousands of military and intelligence  personnel were involved in planning and executing the raid that seized  Maduro.\n\nA mobilization of this size…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…deliberately, cautiously.\n\nAmong the illegally terminated--and I should stress ``illegally  terminated''--are 2,400 VA employees, many of them veterans themselves,  members of the Guard or Reserves now, caregivers, military spouses. In  the DOD, many of them--45 percent--are former veterans. The overall  impact will be disastrous on the 640,000 veterans who…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…imminent threat of attack and who could have  been stopped thousands of miles from our shore had we interdicted and  arrested those on board just as they routinely are by our Coast Guard.  Instead, the U.S. military used lethal force on four separate  occasions, killing everyone on board.\n\nDespite this breathtaking departure from more than two centuries of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…question. That authority has been  challenged, and it will continue under challenge because the courts are  continuing to decide whether Donald Trump has turned the National Guard  into an illegal police force, in effect, to serve his political ends  and personal whims.\n\nBut there is no question as to the fact that members of the military  are in major…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…families of America--not the billionaires,  not the special interests, not the huge lobbyists who seem to dictate  what the Republicans do.                               U.S. Coast Guard\n\nMr. President, on the Coast Guard swastika, earlier this week, the  U.S. Coast Guard enacted a policy downgrading the swastika from its  list of recognized hate symbols.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…successful programs. It is clearer  than ever that VA education programs need to meet veterans where they  are and not the other way around.\n\nAdditionally, this bill would ensure guard and reserves who get  called up on orders during a semester can receive a grade. This bill  would also give school certifying officials, or SCOs, time to prepare  for a required…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…(NCOIC), Platoon Sergeant, First  Sergeant, Army Instructor, and Public Affairs NCOIC. He served in  multiple units, including the 138th Signal Battalion (Indiana National  Guard), Delta Company 44th Signal Battalion, 50th Military History  Detachment, Army Space Command, 91st Training Division, 5th armored  Brigade, 99th Regional Support Command, and…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…pays our soldiers in the United States Army,  providing $54.5 billion in military personnel funding to support  Active-Duty soldiers, 172,000 reservists, and 328,000 National Guard  members.\n\nA ``yes'' vote enables us to consider legislation that pays our  sailors in the United States Navy, delivering $40.5 billion to support  344,600 Active-Duty sailors…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad I been present for the rollcall vote No. 651, on the motion…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "John Thune", "party": "Republican", "sentence": "…fertilizer), academic institutions, and       nongovernmental organizations with relevant expertise.''.\n\n(2) Clerical amendment.--The table of contents in section 2       of the Coast Guard Authorization Act of 1998 (Public Law 105-      383; 112 Stat. 3412; 136 Stat. 1268) is amended by striking       the item relating to section 603 and inserting the following:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…before he wore four stars on his shoulders, General Mingus took  up the call to service, in 1981, in the same way that so many of us  did. He enlisted in the Iowa Army National Guard. It was there that he  learned the mundane tasks of a young soldier, at that time--shining  black leather boots, making sure your uniform was ready for those  weekend drills…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…go to class right now.\n\nWe are hosting the World Cup in a few months, and some security  training for that event is on hold right now because of the shutdown.\n\nCivilian Coast Guard employees won't get a full paycheck at the end  of this week, and thousands more Americans, from disaster response  personnel at FEMA to TSA agents, are worried about potentially…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700181/state-of-the-union-address"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…build our infrastructure. This includes: the  FAA Reauthorization Act of 2024 and other important aviation safety  legislation; multiple water resources development acts; Coast Guard  authorizations; public buildings and Federal office space reforms; and  pipeline safety reauthorizations, just to name a few of the things that  are out there.\n\nIt takes hard…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…directing security efforts all across our great State.\n\nDave's record of service is both extensive, and it is remarkable. He  has served as an honorary commander with the U.S. Coast Guard Base  Charleston through the Joint Base Charleston Program and has made  equally significant contributions to national security policy through  service and working on various…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…deprive our people of fair representation. Yet,  this example shows that we still have the power to fight back and to  win.       California Governor Opposes Use of National Guard Against Crime\n\nMr. KILEY of California. Mr. Speaker, the Governor of California is  outraged at the prospect that National Guard troops might be used in  cities like San Francisco…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Memorial Day, a  time to honor those who gave their lives in defense of our country, I  rise today to recognize the enduring service and sacrifice of the  Washington Army National Guard's 1st Battalion, 161st Infantry  Regiment.\n\nFor nearly 90 years, this unit has called the city of Spokane home.  Once stationed downtown, it now stands watch near the banks…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691526/recognizing-washington-army-national-guard-1st-battalion-161st-infantry-regiment"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize Coast Guard  Auxiliary Clearwater Flotilla 11-1's 75th Anniversary. The U.S. Coast  Guard Auxiliary was established by Congress to support the Coast Guard  with its boat safety mission.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…in her local American Legion  Post, and has served as both Co-Director and Vice President of a local  veterans' resource center. She is an active member of her local honor  guard, where she performs live taps at services and provides honors at  football games, ceremonies, and parades, ensuring that the sacrifices  of our service members are remembered…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…personal inspection, physical fitness team, armed drill team  regulation, and unarmed drill team exhibition. They placed second for  unarmed drill team regulation and color guard. They placed third for  academic team and armed drill team exhibition.\n\nAdditionally, Madelyn Michael won the individual award for most sit- ups for girls, completing a total…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Madam Speaker, I am very pleased to support  H.R. 4275 to ensure that the Coast Guard has the authorities and  resources needed to meet the vital missions that they have.\n\nThe One Big Beautiful Bill Act provides the Coast Guard a much-needed  and historic downpayment…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694193/coast-guard-authorization-act-of-2025"}]