[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…that these lease sales would  bring in $1.8 billion in revenue for the Federal Government and the  State of Alaska.\n\nWell, when the first lease sale finally took place in 2021, guess  what happened, Mr. Speaker?\n\nIt generated less than $15 million, that is around 2 percent, of what  the CBO had estimated. In 2022, two of those lessees actually asked BLM…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the chaos. That is why I introduced a  resolution to end these tariffs, but Speaker Johnson and the majority  don't want to go on record. They are trying to dodge a vote. But guess  what. You can run, but you can't hide from the American people.\n\nSpeaker Johnson, again, ``is using Rules Committee Resolutions,  consummated by majority vote of the whole…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689861/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the budget.\n\nBush--the first President in American history that didn't call for  the common sacrifice to go to war. We spent trillions of dollars in  those foreign wars. And guess what he said. No common sacrifice. Only  about 1 percent of our people will fight in those wars. I am going to  give you a tax cut.\n\nWell, that makes no sense. You are going…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Mr. SWALWELL. The President has our troops sleeping in squalor, not  on the battlefields of Afghanistan or Iraq, but in Los Angeles. I guess  this is what you would expect from somebody who has described our brave  war dead as suckers and losers.\n\nWe were promised that the immigration policy would deport the most…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692336/troops-in-los-angeles"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…represent  districts that are heavily dominated by producers.\n\nOver here, there is a very articulate case on behalf of consumers  because most of Americans--I would hazard a guess that all Americans  are consumers.\n\nBecause when we export natural gas from the United States, we reduce  domestic supply, which pushes up the price. That is why the Natural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the gentlewoman from Georgia. That is it.\n\nI think that is hopeful. It suggests that maybe there is still a  little bit of dignity somewhere in the Republican Conference. I guess  we will see in a few minutes when we start voting on this bill that is  an insult to any serious Member of Congress. It is certainly an insult  to the American people and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…trillions to the debt, and Republicans caved.\n\nModerates said they wouldn't vote for a bill that slashes Medicaid  and threw people off of healthcare, which this bill did, and guess  what? They folded. They folded.\n\nWhere I am from, in Massachusetts, that is what we call a cheap date.  Republicans from across the ideological spectrum caved and got nothing.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…resolution to overturn a local law passed by members of the D.C.  Council who were elected by the people who live here. They claim to  care about the taxpayers of D.C., but I guess they don't care enough to  give them the real representation that they deserve: a vote in the  United States Congress.\n\nThat alone shows us what this is all about. They don't…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…theirs.\n\nMr. Speaker, my ask is very simple, and here it is: Congress must  act. Congress must restore these tax credits and protect affordable  healthcare.\n\nMr. Speaker, I guess the question really is, what do we say to that  family? What is the answer that we say that we cannot negotiate? What  is the answer that we say to them that we cannot bring…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…authority under the Constitution to admit new states, a power       that it has exercised 37 other times since the Constitution       was adopted.\n\nCourts are unlikely to second-guess Congress's exercise of       its constitutional authority to admit the Commonwealth into       the Union. Apart from the fact that the legal objections to       admission of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that you can just cut people off of the ACA program  without trying to provide a more cost-effective solution?\n\nI know my colleagues Senator Crapo and Cassidy are trying. My guess  is they would like to get a solution here. I thought we should have  done it before we opened the government back up because we had the  optimal period of time where people…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…authority under the Constitution to admit new states, a power       that it has exercised 37 other times since the Constitution       was adopted.\n\nCourts are unlikely to second-guess Congress's exercise of       its constitutional authority to admit the Commonwealth into       the Union. Apart from the fact that the legal objections to       admission of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…it came down to: I don't go to the doctor  that often. My kids don't go to the doctor that often. And so, we just  rolled the dice. We will wrap some bubble wrap around us, I guess.''\n\nBubble wrap is not going to help if she has a heart attack. Bubble  wrap is not going to help if she is in a car accident. Bubble wrap is  not going to help those mothers…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and  mental gymnastics as to why all of a sudden overturning the  Parliamentarian is not akin to killing the filibuster. It is a complete  180-degree shift.\n\nBut in one way, I guess, they might be right. No, this isn't the same  as killing the legislative filibuster. This actually goes way, way  beyond that because, first, they are doing more than going…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…that once were there--steak, and a fudge-filled, seven- layer cake, making their cuts to food assistance even more tone deaf  than ever.\n\nA fudge-filled, seven-layer cake? I guess the theme of the White  House event was ``let them eat cake.'' How fitting.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…hemisphere, where we are most directly impacted.\n\nI just heard from the distinguished gentlewoman that these are  fishermen, that these are fishermen in these boats. Really? I guess we  are supposed to not believe our own eyes when we see these boats loaded  with narcotics coming to the United States and going to other  countries.\n\nThese are narcoterrorists…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698239/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Chamber.\n\nFirst of all, even though a lot of the money is already out the door,  President Trump came up against the CHIPS bill. The CHIPS bill was a  public-private partnership, I guess we should call it. Whenever you  hear about a public-private partnership, I think you have to hold onto  your wallet, because that means a private-sector group wants some…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…about just  one aspect in our school systems today. That does not mean we  disregard. We may have different approaches, but I certainly want my  friend to know we hear her. I guess I will leave it there at this  point.\n\nMr. Speaker, H.R. 1069, the PROTECT Our Kids Act, makes clear that  schools receiving funding from the Chinese Communist Party will not…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…judicial tyranny from  harming the American people.\n\nMr. ISSA. Mr. Speaker, I did ask unanimous consent that all Members  be able to place extraneous material in the Record. I guess they are  taking me up on it.\n\nMr. ISSA. Mr. Speaker, perhaps you can just consider that every time  the other side speaks, they will be speaking in violation of our rules…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…want to make it easy to  go to war. They wanted to make it hard to go to war.\n\nSome will argue--they will say that Congress is so feckless. They  will never declare war.\n\nWell, guess what, when we have been attacked, we have been virtually  unanimous. When we were attacked on 9/11, the vote was virtually  unanimous to go after the people who attacked us.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…removed from office.\n\nThere is an old Twitter post from President Biden that said: ``Trump  talks tough on Venezuela, but admires thugs and dictators like Nicolas  Maduro.''\n\nGuess what, Mr. Speaker.\n\nI think President Trump showed in actions, not words, that he was  determined to remove a drug lord, and that is what Nicolas Maduro was,  from power.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the  longer they can keep them scrolling, the more data they collect on that  child. And the longer the eyeballs are trained on that screen, the  richer the data. And then, guess what? The Big Tech company whose value  is based on how many eyeballs they have and how long they have those  eyeballs on that screen, they make more money. Their valuation…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Bible as far as respecting the law. Every country around the  world has immigration laws. They have laws that have to be respected.  Unfortunately, we have some clergy who, I guess, were bored preaching  about the Gospel, bored preaching about God, and they have decided to  adopt the leftwing orthodoxies of let everybody come here. They, of  course, have…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Senate floor, you can speak, you  can vote, or you can be assessing whether you have a quorum. Those are  pretty much the things that you can do on the Senate floor.\n\nSo guess what. If you have a quorum, if you have 51 Senators sitting  on the floor of the Senate demanding action for the American people,  such as passing the SAVE America Act, then…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…will also point out that my colleagues across the aisle voted for a  large portion of this bill last year.\n\nNow, there are various criticisms that they have kind of pivoted I  guess a bit, but when you really look at what we are doing, we are  preventing a tax increase on the middle class. The average American  household, without this bill getting done,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693188/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…believe when you do  the math here, 5 percent of the population are people making stunning  amounts of money. If we want to have a discussion about whether they  should pay more--guess what?--this opens up that discussion because  there are no rates locked in to this. It just creates the capacity to  now have the discussion.\n\nThe fact of the matter is that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that coal and our natural gas even cleaner than we are  doing today, even though we produce electricity cleaner with our fossil  fuels than any other country in the world.\n\nGuess what we can do, Mr. Speaker. If we can continue to move forward  and build new plants and show how this new technology can be used, we  can then be the ones who are exporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…abuse. The GAO led a covert investigation by creating  fictitious ObamaCare applicants with fake documentation where 100  percent of those applicants were accepted and enrolled.\n\nGuess what? A year later, this year, of that 100 percent, 90 percent  were still receiving subsidies. That means that insurance companies  were still being subsidized for fake accounts…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the call--that the  preliminary score right now is $1.84 trillion coming from the people  that will score the legislation.\n\nThat would make it probably, from everything we can guess, the single  biggest reduction in spending in a single bill in probably U.S.  history. Does that give you a sense? When you have people talking about  waste and fraud and misalignment…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…their Fourth  Amendment rights and other statutory provisions that govern privacy  rights and/or that limit Federal law enforcement from pursuing  political witch hunts.\n\nI guess I am just absolutely shocked by my colleague on the other  side who believes that the Federal Government has the right to invade  the privacy and violate the Fourth Amendment…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696923/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}]