[{"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1515) to increase access to agency guidance documents.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1515\n\nBe it enacted by the Senate and House of Representatives…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…certain name brand drugs, such as  Narcan, which can limit usage of other versions that may be more  readily available.\n\nMy amendment would require HHS regulations or guidance documents to  include any opioid overdose reversal drug approved by the FDA when  referring to these emergency drugs. This will expand and ensure better  access to these lifesaving…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691881/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…that are promulgated pursuant to the  Administrative Procedure Act, there exists a vast scope of additional  regulatory documents that impact small businesses. These are guidance  documents, memoranda, bulletins, circulars, letters, and more, which  Wayne Crews, a fellow in regulatory studies at the Competitive  Enterprise Institute, has more properly referred…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…another, and compiled in  the ever-growing Federal Register. The reality is, that is just the tip  of the iceberg. Layered on top of all of that are these so-called  guidance documents. These are memos, Dear Colleague letters, bulletins,  all manner of what is referred to as ``regulatory dark matter.''\n\nWith respect to the ranking member, this is not…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}]