[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…costs  and cuts red tape, and nothing could be further from the truth. We know  there are manufacturers out there that support these standards and  support having consistent guidance from DOE, as opposed to ever- shifting goalposts.\n\nAgain, even if my colleagues on the other side come up with testimony  or documents today that say that the Department of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…and thrive through COVID. Thanks to his hard work,  Madera County played an important part in the reopening of Madera  Community Hospital.\n\nUnder Mr. Varney's direction and guidance, Madera County has seen  significant growth in revenue, housing and business. Capital  improvements flourished under his watch with the Madera County Justice  Center as well…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Congress to pursue avenues such as conducting       hearings or requesting a study from the National Academies of       Sciences, Engineering, and Medicine to provide clear guidance       around the use of force against youth. We are happy to meet       any time with your offices on this issue.            Sincerely,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…administration released its new  National Security Strategy.\n\nAnd some folks may wonder: What is the National Security Strategy  document?\n\nIt is a blueprint that provides strategic guidance for the  administration. It sets priorities and articulates a vision for  achieving them--or at least it should.\n\nTrump's strategy rejects leading with democratic values in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…proud to stand beside him to create sustainable future together. On  behalf of my constituents and my colleagues here in Washington, I thank  His All Holiness for his bravery, guidance, and testimony. I hope that  his visit will bring us together in the spirit of service and encourage  us to live with humility, fairness, and compassion.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…identify themselves through a little hole  through the gate.\n\nHe refused to identify himself. When we told him we were there, do  you know what he said, Mr. Speaker?\n\n``Given guidance by my superiors, I am told that you should send an  e-mail to DHS.gov.''\n\nHe told four Members of Congress, including a Member of Congress who  is the Member of Congress in…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…government shutdown. The  Trump administration has the authority and the funds to keep SNAP  running during this shutdown. Don't take my word for it. Look at the  USDA's own guidance that they removed from their website that justifies  this.\n\nAny failure to do so right now falls squarely on the Trump  administration and Republicans. We could vote on this…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…2025. Some tried to warn us of the dangers  and, well, here we are.\n\nLet's talk about education. Within weeks of taking office, the  Department of Education quietly rescinded guidance encouraging schools  to teach honest, inclusive Black history. Instead, they are attempting  to whitewash history and have begun promoting so-called patriotic  education,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…cities to detect nuclear  and radiological threats. Since then, it has expanded to include  additional cities, offering equipment, training, technological support,  and program guidance.\n\nThe program supports major events by ensuring cities are prepared for  potential threats. However, its reliance on the annual Urban Area  Security Initiative, or UASI, designations…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…serving as a  Court-Appointed Special Advocate and Guardian Ad Litem. In these roles,  he has been a steadfast voice for children in abuse and neglect cases,  offering critical guidance and advocacy. He has also provided  leadership to numerous community organizations, including TriCity  Family Services, the LivingWell Cancer Resource Center, the Community…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…and elevated  the quality of life in our region.\n\nA hallmark of Mr. Gilbert's career has been his commitment to telling  the untold stories of Northern Virginia. Under his guidance, NOVA Parks  made significant efforts to illuminate the forgotten stories of the  many communities that helped shape Fairfax County. Mr. Gilbert's vision  ensured that NOVA…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…city.\n\nIn recent weeks and months, my office has been inundated       with calls, emails, and walk-ins from constituents who are       afraid, confused, and desperate for guidance regarding TPS.       They are asking about legal resources, immigration attorneys,       emergency funds, and whether it is safe to continue going to       work. Many are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Christ.\n\nInstilled with a love of learning, Mrs. Booker graduated from Albany  State College with a Bachelor of Science Degree, a Master of Science  Degree in Counseling and Guidance from Fort Valley State College, and a  Specialist Degree in Education and Counseling and Guidance from Auburn  University.\n\nArmed with the knowledge and skill, Mrs. Booker…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…public service. He has created a  lasting impact in Eagan and across the state of Minnesota. He isn't  just our Chief, but a dear friend. I will continue to seek his input  and guidance on law enforcement and mental health policies. I wish  Chief New the best in retirement.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…Christine returned home to serve  the district that shaped her. Since joining Lodi in 2012, she has grown  from school counselor to supervisor of school counseling, overseeing  guidance and mental health support for students across her district.\n\nWorking with first-generation college aspirants, English language  learners, and students from working-class families,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the qualified individual or by the       qualified individual and the guardian of the qualified       individual, to provide assistance to the qualified individual       or guidance to that qualified individual in understanding       issues, making plans for the future, or making complex       decisions; and\n\n(B) who may include the family members, friends,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…establishing policies concerning spectrum       assignments and use by radio stations belonging to and       operated by the United States) and provide Federal agencies       with guidance to ensure that the conduct of       telecommunications activities by such agencies is consistent       with such policies;\n\n``(3) represent the interests of Federal agencies…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…That is what makes events like demo days  so important.\n\nThese are informational forums where startups share their business  ideas, not investment pitches. Under earlier SEC guidance, even  participating in one of these events could be considered a ``general  solicitation,'' which, in turn, could block the startup from using key  offering exemptions.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…launchers. The M31 Unitary is a solid propellant artillery       rocket that uses Global Positioning System/Precise       Positioning Service (GPS/PPS) aided inertial guidance       provided by Selective Availability Anti-Spoofing Module       (SAASM) or M-Code. It accurately and quickly delivers a       single high-explosive blast fragmentation…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…indictment by a Federal grand jury for assaulting, resisting, impeding,  and interfering with Federal officers;\n\nWhereas Representative McIver is alleged to have challenged guidance  from a Federal officer regarding access to the secure immigration  detention facility;\n\nWhereas Representative McIver is alleged to have interfered with  Homeland Security…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694802/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Purchase:\n\nMajor Defense Equipment (MDE):\n\nUp to four hundred (400) AIM-120D-3 Advanced Medium Range       Air-to-Air Missiles (AMRAAM).\n\nUp to 12 twelve (12) AIM-120D-3 AMRAAM guidance sections,       including precise positioning provided by either Selective       Availability Anti-Spoofing Module or M-Code.\n\nOne (1) AIM-120 AMRAAM Integrated Test Vehicle.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…veterans scam and fraud evasion officer in the  Department of Veterans Affairs who is responsible for all fraud  prevention efforts.\n\nBy providing veterans with more consistent guidance on how to  identify, report, and avoid fraud and scam attempts, we can reduce the  occurrences that are occurring.\n\nI thank Chairman   Mike Bost and all the cosponsors of…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699189/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…prenatal vitamins, formula, and diapers. It also ensures that  TANF dollars can be used to support pregnancy resource centers.\n\nThe Pregnant Students' Rights Act provides guidance and resources to  pregnant students so that no student feels forced to choose between her  education and her child.\n\nLast week, I also introduced the SAFE KIDS Act to prevent…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and has served as a vital engine of  prosperity for generations.\n\nThe Chamber traces its origins to 1925, when local leaders first  organized a community chamber under the guidance of Frederick  Williamson, its inaugural president. Despite the challenges of the  Great Depression, the Chamber persevered and experienced a revival in  1938, led by visionary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…regulatory overreach has put the tipped credit system  at risk, creating uncertainty for restaurant operators. Different  administrations have issued conflicting rules and guidance, producing a  regulatory roller coaster for restaurant owners and their staff. This  instability makes it difficult for owners and operators to make long- term business plans.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…explanations of benefits and  side effects, adherence tools such as pill organizers and synchronized  refills, and convenient delivery options.\n\nPharmacists provide accessible guidance anytime, empowering informed  decisions that promote safety, independence, and healthy aging.           Recognizing Scottish Rite Monuments in Savannah, Georgia\n\nMr. CARTER…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nThree thousand eight hundred forty-five (3,845) KMU-558B/B       Joint Direct Attack Munition (JDAM) guidance kits for the       BLU-109 bomb body.\n\nThree thousand two hundred eighty (3,280) KMU-572 F/B JDAM       guidance kits for the MK 82 bomb body.\n\nNon-Major Defense Equipment:…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…wireless telephony, mass media, other digital services, and       video services;\n\n``(C) coordinate transparent, consensus-based,       multistakeholder processes to create guidance for and to       support the development and implementation of cybersecurity       and privacy policies with respect to the internet and other       communications networks;…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and their dedication.\n\nCindy Nellis was named the 2025 Director of the Year, honoring her  visionary leadership and steadfast commitment to the network's mission.  Cindy's guidance has empowered both her team and the entrepreneurs that  they serve.\n\nJeanne Best received the 2025 Administrative Service Award for her  excellence behind the scenes, ensuring…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692189/recognizing-pennwest-clarion-small-business-development-center"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…for its staff and partners, while  incredibly navigating the volatile worldwide of democratic backsliding,  resulting from years of unchecked authoritarian rule. Under her  guidance, the organization has adapted to these turbulent times while  maintaining its core mission, emerging stronger and more resilient in  its commitment to human rights, freedom…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}]