[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…imposed voter ID requirements. Each election,  Minnesotans turn out at the highest levels in the nation to participate  in elections that are free, fair, and secure.\n\nUnder the guise of election integrity, the Republicans' H.R. 22 would  require Minnesotans and every American to provide burdensome  ``documentary proof of citizenship''--similar to what Minnesotans…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…my eight amendments to  the SAVE Act, which will be offered as the previous question today.\n\nLet me be clear: The SAVE Act is an antiwoman, voter suppression  bill. Under the guise of election integrity, the SAVE Act would  penalize millions of women just for taking their spouse's name,  requiring them to present additional documentation that many women…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…confine my remarks to two things that I know  about.\n\nI am going to take a deep breath right now because to stand here and  have to listen to the gentleman from Louisiana, in the guise of just  asking questions, besmirch one of the finest Members I have had the  honor of serving with, I think, would offend the sensibility of anybody  in this Chamber.\n\nI am…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and probably more need  for childcare.\n\nIf we are serious about supporting families, then Congress should be  expanding access to affordable care, not cutting wages under the guise  of helping workers. We could really do some help by supporting the  motion to recommit and passing the Child Care for Working Families Act.  That would actually lower costs…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…can ignore what this  really is. It is an internment camp. It is a place full of people who  look like me, Latinos, Haitian men, subjugated to inhumane conditions  under the guise of immigration enforcement. It is disgusting. It is un- American. It demands oversight.\n\nMembers of Congress have a legally protected right to conduct  oversight of immigrant…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…time.\n\nMr. Speaker, the American people in my district and in my State have  spoken clearly. This bill is voter suppression, pure and simple.\n\nIt is brought to us under the guise of stopping illegal voting. When  we analyze voting in Westchester County, where I was the county  executive for a million people, we found no appreciable illegal voting.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690010/safeguard-american-voter-eligibility-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…on March 27, President Trump issued  an executive order that took away the collective bargaining rights of  more than a million Federal workers at over 30 agencies under the guise  of protecting our national security. This includes VA employees, food  and safety inspection service workers, health and human service  employees, including those at the CDC…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697868/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…because I am also in the West, in Washington State, and we are seeing  the risk of catastrophic wildfires increasing every year.\n\nBecause all of this is being done under the guise of DOGE, the  Department of Government Efficiency, let me be clear that we all want  our tax dollars to be spent wisely.\n\nLet me also be clear that the people in the Eighth…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…other       jurisdiction, deserve the right to elect leaders who       determine their own laws, public safety policies, and budget.       Yet these bills, introduced under the guise of improving       safety, are part of a broader political effort to impose       ideologically driven federal control on Black-led cities and       to roll back successful…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…PALLONE. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise in strong opposition to this bill. It is a  wholesale attack on clean energy under the guise of reliability.  Americans can see through the nonsense here to the truth, and that is  that Republicans are waging a culture war against wind and solar.  American families…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…intimidation and threatening our universities, supposedly in the name  of anti-Semitism--nobody hates anti-Semitism more than I do, but I  despise using anti-Semitism as a pretext or a guise simply to attack  people or institutions because they disagree with a public official.\n\nWe live in a time when the rule of law is under threat, perhaps as  never before in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…multilevel marketing schemes  and other ``business opportunities,'' like Amway, Mary Kay, and  Herbalife, who regularly target veterans, servicemembers, and their  families under the guise of patriotism, flexible hours, and financial  independence.\n\nI applaud my colleague, Representative Delia Ramirez, for offering an  amendment to require specific trainings…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Republicans have abdicated their constitutional war  powers authority, allowing the Trump administration to carry out  extrajudicial killings off the coast of Venezuela under the guise of  stopping drug trafficking. Meanwhile, Trump just pardoned the President  of Honduras, who was convicted of helping to move 400 tons of cocaine  into the United States.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…vital alliance, the most successful alliance in world  history. They risk setting precedent for authoritarian regimes all over  this world to intervene militarily under the guise of going after  leaders accused of criminal conduct or simply to access valuable  natural resources or critical technologies under their control.\n\nDonald Trump, President Trump,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…alien from a criminal  organization is operating a cell in their neighborhood.\n\nThe Trump administration has already demonstrated to us that they are  comfortable, under the guise of national security and protection,  abusing every tool and system that we have. The administration has  weaponized every well-intentioned tool that this body has authorized…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the American Rescue Plan that took place when  Democrats took control of the White House, House, and Senate. We saw  the worst inflation we have seen in my lifetime under the guise of a  COVID relief package.\n\nThat company, which had some tax pressure removed from their books,  went straight to their employees. They created wage growth  opportunities.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…districts and the impact that it could have there. It is  a disgrace that Americans' hard-earned tax dollars are being used to  support these programs and organizations under the guise of necessary  foreign aid.\n\nIn addition to this, Congress continues to prop up the Corporation  for Public Broadcasting to promote public media stations like PBS and  NPR.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…are being taught.\n\nMillions of dollars of Chinese funds have flowed into America's K-12  classrooms where students are subject to Chinese Communist Party  propaganda under the guise of Chinese language and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across 34 States hosted a Confucius classroom…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…amendment is simple. It would prohibit TRICARE, across the board,  from covering or furnishing the chemical or surgical mutilation of our  warfighters and their dependents under the guise of healthcare.\n\nOur government should not be in the business of mutilating our fellow  citizens, particularly our warfighters, with our tax dollars and with  your tax dollars,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…thousands of tons.\n\nThe new indictment highlights other criminal activity directly tied  to Maduro, including providing fake travel documents to facilitate drug  smuggling under the guise of diplomatic cover and partnerships with the  Sinaloa Cartel boss El Chapo.\n\nThe bottom line is that Maduro is a thug. He is a dictator. He is an  international criminal.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…we are doing here is  working hand in glove with the administration to ensure that the  People's Republic of China is not allowed to meddle with the United  States under the guise of simply doing business.\n\nBut time is running short. We know that China, as I said, has an  interest in reincorporating Taiwan as early as 2027, not 2 years from  now. Now…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…we are doing here is  working hand in glove with the administration to ensure that the  People's Republic of China is not allowed to meddle with the United  States under the guise of simply doing business.\n\nBut time is running short. We know that China, as I said, has an  interest in reincorporating Taiwan as early as 2027, not 2 years from  now. Now…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…WJLA-TV/NEWSCHANNEL 8; Guevara,       Selina: NBC NEWS; Guez, Bertrand: SWISS BROADCASTING; Guild,       Blair: WASHINGTONPOST.COM; Guimier, Clmence: FRANCE 2       TELEVISION; Guise, Gregory: AL JAZEERA ENGLISH; Gunay,       Huseyin: NTV; Gupta, Nilanjana: THE NATIONAL NEWS; Gurisatti,       Claudia: NTN24; Guthrie, Savannah: NBC NEWS; Gutierrez,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]