[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…stay with her parents after her second husband, a military  veteran who suffered from PTSD, died in 2023.\n\nWe will honor her life with action, of course fighting to end gun  violence because what happened yesterday was gun violence, but also to  fight to end ICE's campaign of terror on our communities and our  people.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…transformed unimaginable tragedy into courageous action.\n\nThrough GIFFORDS, the organization she cofounded with Mark Kelly, she  leads the fight for a future free from gun violence, not with  bitterness, but with courage, determination, and with hope.\n\nHer example stands as a rebuke to the cynicism that too often  characterizes our politics. Gabby…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698819/fifteenth-anniversary-of-arizona-mass-shooting"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…resolution which does not include a single quote from Representative  Ilhan Omar (MN-05) and seeks to punish her for comments she never made.  After the unconscionable act of gun violence that took the life of  Charlie Kirk, Representative Omar clearly and immediately condemned  this assassination. She expressed her profound shock, sadness, grief  about this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695762/issues-with-h-res-censure-of-rep-omar"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…mentoring, education,  sports, play, summer day camps, after-school, and peacemaking programs.\n\nIts community-based, hands-on approach has played a key role in  driving down gun violence in our neighborhood of Little Village. New  Life Centers Community Care programs also serve more than 45,000  individuals in need of housing, food, and other necessities.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…McIVER. Mr. Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, I rise today to speak on an issue that has devastated  families and communities across this country: gun violence.\n\nFor years, gun violence has been an unchecked epidemic. In the Black  community, the toll has been heartbreaking and more deadly. Still, very  little meaningful action…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691751/national-gun-violence-awareness-month"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…to do that. In  fact, this bill isn't even tailored specifically to law enforcement. It  changes gun laws in this country.\n\nLaw enforcement uses tasers in all 50 States. Gun violence is already  the leading cause of death for children in our country. This Congress  does not need to be in the business of weakening the laws that we do  have, but we do…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Mr. CASTEN. Madam Speaker, over the weekend, two different countries  experienced gun violence tragedies. In one they targeted a Hanukkah  celebration, and at another they targeted students in an engineering  classroom.\n\nBoth of these countries were founded by Europeans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698407/gun-violence-tragedies"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…they need to re-enter their school.\n\nLike far too many communities across Colorado and the Nation, this is  not the first time the Evergreen community has been touched by gun  violence. Yet, in the aftermath of this tragedy, Evergreen has  demonstrated extraordinary resilience, uniting in support of one  another as the process of healing begins.\n\nOn behalf…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…McClellan, a Democrat from Virginia's Fourth District, for her  outstanding leadership and for leading this incredible hour.\n\nMr. Speaker, I rise tonight during National Gun Violence Awareness  Month not just with sorrow but with a sense of urgency. I rise tonight  during the National Gun Violence Awareness Month to shake the core of  our very beings.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…States have allowed cartels to shoot down police  helicopters, attack military convoys, and undercut public faith in law  and order. My bill would also allow victims of gun violence to sue  manufacturers and dealers who engage in firearm transactions prohibited  under the Foreign Narcotics Kingpin Designation Act.\n\nWe also must provide local and Federal…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…it is the Kirk  family or the families of the kids who were shot in Colorado, it is  gut-wrenching and sorrowful that our Nation continues to go through  this plague of gun violence.\n\nMadam Speaker, it has been 13 years since Sandy Hook in my home State  of Connecticut. It is long overdue for Congress to have a vote.  Universal background checks are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Every single person there will be forever impacted by the violence  and trauma that mass shootings impose on communities.\n\nFor far too long, we have been forced to watch as gun violence  devastates our communities, and we feel unsafe going to the movies or  eating out at a restaurant.\n\nOne thing is clear. These acts of violence and the trauma they  inflict…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690714/mass-shooting-in-glendale-arizona"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…the LGBTQ+ community  and Hispanic. This was armed bigotry, and it was armed hate.\n\nI am oftentimes asked why I don't join moments of silence that  include Republicans for gun violence, and the reason why is because  they refuse to do anything about it. I am not going to be a prop in  some social media video that is posted later to placate constituents…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Governors and mayors for speaking  out against his power grabs.\n\nNow, just imagine if President Biden would have federalized and  deployed troops into Florida or Texas to combat gun violence.  Republicans would be beside themselves. They would be apoplectic.\n\nFinally, when six of our colleagues published a video reminding  servicemembers of their oath to the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…14-year-olds in adult prison.\n\nInstead of taking power away from D.C. residents and our elected  officials, Congress should focus on real national priorities like  addressing gun violence that threatens communities, threatens schools,  and threatens our cities every single day.\n\nFinally, the rules in front of us have been created through the  incredible work…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…know the best way to stop a bad guy with a gun is a good guy  with a gun. In Chicago, criminals do not care about gun laws. They have  the strictest gun laws and the most gun violence by criminals who don't  care about gun laws. We need more good guys with guns on the street,  mostly because Biden's open-border policy brought more illegal  criminals into…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]