[{"senator": "Alma Adams", "party": "Democrat", "sentence": "When the  Department is gutted, when staff are fired, grants are frozen, and  financial aid systems break, it is our most vulnerable young people who  feel it first."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "He was gutted."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Over the last 3\\1/2\\ months, we have seen an unprecedented attack on  our Nation's science and technology, programs gutted, projects halted,  and the world's leading scientists and engineers fired for no reason."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "They have  already gutted a lot of the tools that make energy more affordable,  like clean energy tax credits, like trying to save on energy efficiency  and things like that."}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "NOAA, an organization that helps families across the country prepare  for natural disasters like hurricanes and tornadoes, is being gutted  from the ground up."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Yet, as Republicans slipped a slush fund for Senators into this bill,  they gutted a critical funding protection for veterans."}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "If this decision stands, the Department of Education's Office for  Civil Rights will be shattered and gutted, which means that, within  this office, which was created and implemented to investigate when  students in this country were not treated respectfully or with dignity,  that schools would potentially not be required to provide  accommodations for students with disabilities."}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "Healthcare costs are going to go up as  Medicaid gets gutted."}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "And again  with the ``Big Bad Bill'' that our Republican colleagues just passed,  President Trump signed into law a bill that gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare and food  assistance from millions of Americans, all to cover the cost for their  massive tax cut for billionaires."}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Particularly as this administration has slashed programs that serve  our veterans, gutted staff at the Veterans Crisis Line and Veterans  Health Administration, and made drastic cuts to programs that veterans  and their families rely upon, like SNAP and Medicaid, organizations  that work to support our veterans, like the National Woman's Relief  Corps, are more important than ever."}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "These cuts will disproportionately impact poor folks' access to  reproductive care, since 40 percent of all births in this country are  covered by the very Medicaid services that are now being gutted."}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "The cancer registry is hosted  by NIOSH, and on April 1 and last week, the agency was gutted."}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Speaker, I came here because the American working class has been  gutted, left behind, and excluded from the American Dream, while the  elites grow wealthier than ever."}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Did you speak up when he gutted public education, slashed funds for  pediatric cancer research, fired thousands of veterans who risked their  lives for their country; when he abandoned our allies and our  international commitments at a time when floods, fires, hurricanes, and  droughts are devastating communities across this country; when  countries all around the world are banning together to do something and  he turned his back?"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "In less than a year, he has gutted the  integrity and independence of these Offices."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "That means a gutted  child tax credit."}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "The Senate gutted this provision and reduced it to under $1 billion  annually to protect elite universities that take hundreds of millions  of dollars annually in Federal tax dollars."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "The reality is that many on the other side of the aisle  are beholden to a vocal and uncompromising wing of the environmental  lobby, groups that would rather see American workers laid off,  manufacturing plants shut down, and entire communities economically  gutted than support balanced, commonsense regulatory reforms."}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "President, last week, across America we were shocked,  astonished, gutted."}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "It was a $1.5 trillion mad  spending spree that included things like $200 billion of taxpayer  funding for illegals to get taxpayer benefits, while they gutted the  $50 billion rural healthcare fund that we put in place in the working  families tax cut."}]