[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…real questions.\n\nI hope my Republican colleagues are ready to explain why they gave  the ultrawealthy a $250,000 tax break--you heard that right, a $250,000  tax break--while gutting Medicaid--a gut punch to people who depend on  Medicaid to be able to get the care they need for themselves or for  their kids, maybe some other loved ones; the same Medicaid…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of that.\n\nThis bill is a fraud and a con job. America deserves better. The  world needs better. This is a revote on the reconciliation bill.\n\nVote ``no'' if you are against gutting Medicaid, Medicare, and SNAP.\n\nMr. McGOVERN. Vote ``no'' if you oppose $3 trillion----\n\nMr. McGOVERN. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…healthcare programs  like Medicaid, Medicare, and the Children's Health Insurance Program?\n\nYou can't have it both ways. Donald Trump promised to make America  healthy again, but gutting healthcare for millions of Americans-- gutting healthcare for millions of Americans--rolling back healthcare  for millions of Americans, rolling back support for new mothers,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…offenders but  on prosecuting political opponents, unleashing masked ICE agents on  innocent people, and deporting children and grandmothers.\n\nAt the same time, we have seen the gutting of public health  infrastructure that was built over decades to protect Americans from  pandemics. We have seen emergency preparedness budgets slashed and the  people who…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Medicaid.\n\nDominique is one of the 100,000 Americans who lives with the sickle  cell disease, and she is one of the millions of Americans who would be  devastated by Republicans gutting Medicaid.\n\nWe need to understand that the suffering they are going to create has  a face, and it is Dominique's.\n\nWhen she was just 6 years old, Dominique was diagnosed with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691523/gop-tax-scam-hurts-women-and-families"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…TRAHAN. Mr. Speaker, proponents of Donald Trump's so-called big,  beautiful bill are lying to the American people. They claim it won't  cut Medicaid, but it slashes $715 billion, gutting care for seniors and  children with disabilities.\n\nThey insist moms and kids won't lose food assistance, but this bill  will cut SNAP benefits for over 7 million Americans,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691438/gop-tax-scam-hurts-women-and-families"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…can bring  criminal charges against State and local officials if they believe that  those officials have not adequately safeguarded their computer systems  from harm, despite gutting CISA--the very Agency tasked with assisting  them in safeguarding their computers and software.\n\nTo instill fear in election workers, the administration is doing  everything…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Speaker, what is worse is they  continue to argue that they aren't doing that, but the math doesn't  lie. They can't reach the levels of billionaire tax cuts they want  without gutting vital programs like Medicaid and SNAP, programs that  the most vulnerable in our country rely upon.\n\nRepublicans are publicly claiming that they won't make those cuts, so…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…recognizes that some of the most  talented people in America work at NASA. I know the Presiding Officer  agrees with this, and that we need to be investing in NASA's mission,  not gutting them. During his nomination process, Mr. Isaacman  emphasized the importance of developing a pipeline of future  scientists, engineers, researchers, and astronauts to support…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Senate passed H.R.  1, which is nothing more than one big, beautiful, betrayal for  Americans across the country. This bill slashes healthcare for 17  million Americans by gutting Medicaid and dismantling the Affordable  Care Act. It shuts down rural hospitals, it takes food away from more  than 4 million hungry children, it makes college more expensive…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…ahead with plans  to go forward with their tax bill, which features more bailouts for  billionaires, paid for by kicking millions of people off their health  insurance and gutting programs that kids and families rely on to stay  safe and healthy.\n\nDonald Trump, meanwhile, puts higher taxes on groceries, clothes, and  cars for working families, while…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…them: You  are crazy, and you need to stop thinking that Donald Trump likes you.\n\nNonetheless, here we are today talking about the idea that we are  going to save money by gutting Medicaid; slashing food assistance;  defunding white-collar law enforcement, the police; and exploding  budget deficits so that we can do what Donald Trump told you he wants:…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688021/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…putting American lives and the homeland at  risk.\n\nAnd don't get me wrong. I am all for reducing waste and making sure  that we are spending taxpayer dollars efficiently, but gutting funding  for local stations that communities rely on to keep their families safe  is to cut corners that is absolutely detrimental to public safety.\n\nSo when President Trump--and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, I thank the ranking member for yielding me  time.\n\nMr. Speaker, I rise today to speak in opposition to S.J. Res. 31.\n\nOnce again, Republicans are gutting our most fundamental pollution  regulations.\n\nThis bill overturns air quality regulations for the most polluting  industrial facilities in the country, giving a green light…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…they  are doing in this bill.\n\nInstead of focusing on supporting our veterans, they have added one  of the most reckless giveaways to the gun lobby that we have ever seen,  gutting the National Instant Criminal Background Check System, the very  system that keeps guns out of the hands of abusers, felons, and people  who might be a danger to themselves…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692961/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "John James", "party": "Republican", "sentence": "…you that I am not. This Biden-era waiver  allows California to ram its comply-or-die, zero-emission truck rule  down the throat of the American trucking industry, essentially gutting  the trucking industry all across Michigan and across the country.\n\nIt is a Green New Deal mandate that will crush our trucking industry  and drive costs up on everything…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…madness. It ensures adults face adult  consequences. It repeals judges' abilities to dodge mandatory minimums  for youth crimes. Crucially, it blocks the D.C. Council from gutting  sentencing laws, reclaiming Congress' constitutional oversight over  this Federal District, as it should be.\n\nAs President Trump declared in his March 2025 executive order,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, evidently, this is what gutting Medicaid  looks like. You see it goes up 25 percent over 10 years. This only  happens in Washington, D.C.\n\nMr. Speaker, the difference between the last administration and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690820/cleaning-up-medicaid-rolls"}]