[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…other Federal supports.\n\nIn Charlotte-Mecklenburg, over 70 percent of students benefit  directly from programs administered through the Department. When the  Department is gutted, when staff are fired, grants are frozen, and  financial aid systems break, it is our most vulnerable young people who  feel it first. These are low-income students, first-generation…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…poor performance, despite there being zero  documentation suggesting lackluster work and glowing appraisals from  his managers.\n\nHe was given no severance or benefits. He was gutted. He had never  been fired from a job before, and he loved his work. And more  importantly, he worries about how he will take care of his two  children--both of whom have autism.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…the world with our innovations in food and agriculture.\n\nOver the last 3\\1/2\\ months, we have seen an unprecedented attack on  our Nation's science and technology, programs gutted, projects halted,  and the world's leading scientists and engineers fired for no reason. A  budget delivered to Congress just a couple of weeks ago by the  President that would…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Republicans want to offer  a package of bills that is going to make it worse, add insult to  injury.\n\nThey just can't stop providing solace for polluters. They have  already gutted a lot of the tools that make energy more affordable,  like clean energy tax credits, like trying to save on energy efficiency  and things like that. However, what also adds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…JPL have no idea what their futures hold.\n\nNOAA, an organization that helps families across the country prepare  for natural disasters like hurricanes and tornadoes, is being gutted  from the ground up.\n\nThe NIH, which works on groundbreaking cures for diseases like  cancer, Alzheimer's, and heart disease, has supplied significantly  fewer grants and awards…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the Toxic Exposures Fund.  This is funding, mind you, that President Trump sought in his budget.\n\nYet, as Republicans slipped a slush fund for Senators into this bill,  they gutted a critical funding protection for veterans.\n\nJust so we are all clear, average Americans will see their kitchen  table budget blow up from the health coverage price hikes,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Federal Government would have the backs of every student in this  country.\n\nIf this decision stands, the Department of Education's Office for  Civil Rights will be shattered and gutted, which means that, within  this office, which was created and implemented to investigate when  students in this country were not treated respectfully or with dignity,  that…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…groceries less  expensive.\n\nMr. Speaker, the policies within this big, ugly bill are going to  raise costs and not lower them. Healthcare costs are going to go up as  Medicaid gets gutted. Electric bills are going to go up when clean  energy tax credits are wiped out at the request of the oil lobbyists.\n\nCutting food assistance programs like SNAP are going to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693158/one-big-beautiful-bill-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…passed for summer school and afterschool programs. And again  with the ``Big Bad Bill'' that our Republican colleagues just passed,  President Trump signed into law a bill that gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare and food  assistance from millions of Americans, all to cover the cost for their  massive tax cut…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…charters, and many of them have principal offices and places of  incorporation outside D.C.\n\nParticularly as this administration has slashed programs that serve  our veterans, gutted staff at the Veterans Crisis Line and Veterans  Health Administration, and made drastic cuts to programs that veterans  and their families rely upon, like SNAP and Medicaid,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…disproportionately impact poor folks' access to  reproductive care, since 40 percent of all births in this country are  covered by the very Medicaid services that are now being gutted. These  are matters, as I said before, of life and death for us in our district  and for women across the country.\n\nI was a young mother living in public housing in San Francisco…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…saying: Get a rare blood cancer and find out  there is no firefighter cancer registry. The cancer registry is hosted  by NIOSH, and on April 1 and last week, the agency was gutted.\n\nIn Gresham, Oregon, there was an investigation because we had a  firefighter who spent months in the hospital after surviving a flash  fire, and the investigators were fired…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690904/protections-for-firefighters"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…resentment for our wars that cost thousands of lives, trillions of  dollars, and decades of lost opportunity.\n\nMr. Speaker, I came here because the American working class has been  gutted, left behind, and excluded from the American Dream, while the  elites grow wealthier than ever.\n\nTogether with my colleagues from both sides of the aisle, I came to  Congress,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…billionaires that seem so close to the President  that they sat right on the dais at his inauguration and sit in his  Cabinet meetings at the White House.\n\nDid you speak up when he gutted public education, slashed funds for  pediatric cancer research, fired thousands of veterans who risked their  lives for their country; when he abandoned our allies and our…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…are the ultimate [drainers of the swamp].\n\nOne of Donald Trump's very first acts after taking office was to fire  these independent investigators. In less than a year, he has gutted the  integrity and independence of these Offices.\n\nA few years ago, this body overwhelmingly passed a law to secure the  independence of the inspectors general in government,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…fiscal cliff. If we do nothing, the Trump tax  cuts, the most progrowth tax reforms in generations, will expire.\n\nThat means higher taxes on nearly every American. That means a gutted  child tax credit. That means small businesses will lose the tools they  need to survive and to thrive. That means less take-home pay for  working families that have already…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…would  tax the endowment profits of private, elite universities at 21 percent,  raising an estimated--listen to me--$70 billion to $100 billion over 10  years.\n\nThe Senate gutted this provision and reduced it to under $1 billion  annually to protect elite universities that take hundreds of millions  of dollars annually in Federal tax dollars.\n\nWe were…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693219/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…uncompromising wing of the environmental  lobby, groups that would rather see American workers laid off,  manufacturing plants shut down, and entire communities economically  gutted than support balanced, commonsense regulatory reforms.\n\nMr. Speaker, we are hearing a lot of dramatic words from my friend  and colleague across the aisle about the reconciliation…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Mrs. MOODY. Mr. President, last week, across America we were shocked,  astonished, gutted. The night before our Nation paused to give thanks  for the blessings in our lives--the night before Thanksgiving--two of  our country's finest were shot down mere blocks away…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…an alternative bill. It was a $1.5 trillion mad  spending spree that included things like $200 billion of taxpayer  funding for illegals to get taxpayer benefits, while they gutted the  $50 billion rural healthcare fund that we put in place in the working  families tax cut.\n\nMr. Speaker, anybody who comes up here and says they care about  healthcare is…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}]