[{"senator": "Mike Quigley", "party": "Democrat", "sentence": "…an estimated 75,000 jobs across the  region.\n\nResearch into the Great Lakes fishery provides us with the data and  information necessary to manage fish populations, conduct habitat  maintenance, roll out educational programs, and more.\n\nFor the last 5 years, this program has provided funds for the U.S.  Geological Survey and, more specifically, the Great…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…communities, NGOs, and industry.\n\nIt aimed to limit the disruption and ecological harm from existing  oil and gas development while also designating special areas to protect  habitat for the many species that call this amazing place home.\n\nI respect that there are a variety of views on how to manage our  Nation's public lands, but it won't be possible…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Meadow is one of the largest midelevation meadows in the  Sierra Nevada. It is an ecologically and regionally critical wildlife  corridor, and the scenic meadow is an important habitat for the State  endangered great grey owl and little willow flycatcher, as well as a  suite of additional at-risk wildlife species. In 2016, a coalition of  conservation groups…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…seafloor like an underwater junkyard. Then  the company just wrote a tiny check and left town. It was nowhere near  the cost of the actual damage that was incurred, and the marine habitat  there is still trashed.\n\nMy district is home to one of our Nation's iconic marine sanctuaries.  I can say without hesitation that my constituents don't want to see  these…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…with numerous prestigious awards. In 2015, he was awarded the  Presidential Medal of Freedom, the Nation's highest civilian honor.\n\nI am grateful to have worked with Billy on habitat restoration for  salmon and steelhead. Washington state's tribes and environment are  stronger because of Billy's decades of advocacy and leadership.\n\nBilly was also a veteran…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…populations within  the delta, is an important indicator species for the health of this  vital body of water and our economy. It serves as kind of a red herring  to help alert to habitat degradation across the delta from poor water  quality or diversion of too much water.\n\nUnfortunately, the species population, as the ranking member has  pointed out, has declined…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Nation's most visited wilderness.\n\nIf this resolution passes and the mineral withdrawal is overturned,  toxic sulfide-ore copper mining will contaminate the water and the  habitat in this priceless wilderness.\n\nThe BWCA is a huge reserve of the most pristine water in the United  States, so clean you can directly drink from its lakes or streams. This…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…of reasons. I look to see  where the public land is, and I also look to see where the roads are  because the vast majority of time, that is where the elk aren't.\n\nElk need habitat security. If there is food and water and a place to  securely bed on national forest land in New Mexico, and that spot is a  couple of miles or more from an open road, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…importance of preserving these plants  for both ecological and cultural continuity.\n\nHowever, the survival of these plants is increasingly threatened by  invasive species, habitat destruction and the shifting environmental  conditions brought on by climate change. The native flora of Hawaii and  other parts of our Nation face constant pressure from…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…growing community.\n\nFinally, this legislation expands the Sloan Canyon National  Conservation Area by 9,290 acres to enhance the preservation of the  desert landscapes and habitat unique to southern Nevada.\n\nI call that a win-win-win. It is no wonder that my legislation  received bipartisan support in the House Natural Resources Committee,  and I thank…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Tribes and villages across the Yukon  River Basin. These Tribes served as cooperating agencies in the RMP  development process working to ensure protection for critical salmon  habitat and other interests, and they endorsed the RMP after extensive  consultation. They oppose this resolution, among many others.\n\nMr. Speaker, I do say that it is important to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Estuary  Program makes that possible.\n\nFor more than three decades, NEP partnerships have restored wetlands,  improved water quality, reduced toxic pollutants, strengthened fish  habitat, and built natural buffers that protect homes and businesses  from flooding and storm surge.\n\nThese partnerships unite scientists, local governments, Tribal  nations, fishers…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…with the  Department of the Interior's Fish and Wildlife Service. They do  management plans everywhere.\n\nMilitary lands are already excluded from designation as a critical  habitat  when there are management plans in place for listed species. Wholesale  exempting the Department of Defense and its many contractors from  compliance with the ESA puts our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…global treasure that must be  preserved for future generations.\n\nA growing crisis driven by a range of interconnected threats to our  native species is unfolding in Hawaii. Habitat destruction has  significantly reduced the space where native plants and animals can  thrive. Forests, wetlands and coastal ecosystems--critical habitats for  native species--are…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Speaker, I reserve the balance of my  time.\n\nMr. FIGURES.  Bonamici).\n\nMr. Speaker, to date, the National Estuary Program has restored more  than 2\\1/2\\ million acres of coastal habitat nationwide. The 28  programs, soon to be 29 with the addition of the Mississippi Sound, and  partnerships will work hard to address challenges we are all familiar  with, like…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…1950s, driving beef  prices up more than 14 percent in the last year. By opening more land  and cutting red tape, this amendment empowers ranchers to expand  grazing, manage habitat, control wildfires, and meet market needs.\n\nMr. Chair, I urge my colleagues to adopt this amendment, and I  reserve the balance of my time.\n\nMr. BIGGS of Arizona. Mr. Chair,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…following:\n\n``(f) Grants.--The Trustees''; and\n\n(B) by striking ``this program'' and inserting ``this       section, prioritizing the issuance of grants to facilitate       habitat protection and habitat restoration programs''; and\n\n(9) in subsection (g) (as redesignated by paragraph (2))--\n\n(A) in the second sentence, by striking ``Upon the       expiration…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Act).           Why the 2024 ROD Is Harmful to Kaktovik and ANCSA Rights\n\n2024 ROD:\n\nIgnores the statutory mandate for area-wide leasing.\n\nDisregards congressional limits on habitat closures and       surface disturbance.\n\nUndermines ANCSA village lands specifically conveyed to KIC       for local benefit.\n\nRemoves opportunities that Congress intended…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…endless ESA restrictions that hamstring essential  training and operations.\n\nAt Fort Huachuca in Arizona, for example, the Sonoran tiger  salamanders' designated critical wetland habitat requires strict  protection measures. That means environmental reviews and limits on  land use, construction, and water management. All those delay vital  infrastructure projects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mika Rotunda has made through her work with Habitat  Tampa Bay Gulfside. Born and raised in Brooksville, Mika Rotunda is a  dynamic professional with a background in media and real estate. With  years of experience in broadcasting…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691741/recognizing-mika-rotunda"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Why the 2024 ROD is Harmful to Kaktovik and ANCSA Rights\n\n2024 ROD:\n\nIgnores the statutory mandate for area-wide       leasing.\n\nDisregards congressional limits on habitat       closures and surface disturbance.\n\nUndermines ANCSA village lands specifically       conveyed to KIC for local benefit.\n\nRemoves opportunities that Congress intended…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Charles A. ``Charlie'' Rogers has made through his  work with Habitat Tampa Bay Gulfside. Charlie Rogers has been on  Habitat's Board of Directors since July 2022. A lifelong advocate for  education and health, Charlie has brought that experience…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Arkansas each year to hunt waterfowl in the  pristine flyways of The Natural State. Across North America, NAWCA  projects have conserved nearly 34 million acres of wetland habitat for  migratory waterfowl.\n\nFunds generated under Pittman-Robertson come from excise taxes on the  sale of hunting equipment and firearms. Various State and wildlife  agencies,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…town from destruction during a massive  forest fire in 1985.\n\nIn addition to structural repairs, the dam needed a new fish passage.  The Orange River is designated as Critical Habitat for Atlantic Salmon  and supports herring and other important fish species and wildlife  important to the economy and the ecosystem.\n\nThe people of Whiting stepped forward…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…has been just as remarkable. He has served on  the boards of the Cuero Chamber of Commerce, the Cuero Lions Club, the  Cuero ISD Education Foundation, and the DeWitt County Habitat for  Humanity. For 17 years, he represented the people of Cuero on the City  Council, including 14 years as Mayor Pro-Temp.\n\nMr. Speaker, Bill Matthys represents the very…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…More specifically, it establishes       various land uses for recreation, motorized vehicles, oil and       gas leasing, renewable energy projects, grazing, wildlife       habitat protection, and cultural preservation.\\16\\      Congressional Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…More specifically, it establishes       various land uses for recreation, motorized vehicles, oil and       gas leasing, renewable energy projects, grazing, wildlife       habitat protection, and cultural preservation.      Congressional Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…pounds  of lyngbya algae and detrital materials from the riverbeds, and 590,000  plus eelgrass plants have been hand-planted. The native grasses provide  a natural healthy habitat for fish, birds, and crabs, and are a source  of nutrition for the manatees. Marie's generosity of her time,  guidance, and commitment to educate elementary school children,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691243/recognizing-marie-bienkowski"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…collaborative, science-based program to       assist in making management actions regarding fish stocking       rates, the rehabilitation of important fish species, and       habitat restoration;\n\n(3) the States of Illinois, Indiana, Michigan, Minnesota,       Ohio, Pennsylvania, New York, and Wisconsin and Indian Tribes       in those States, working…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the footprint of development, allowing for greater       consolidation of facilities and the preservation of more       acreage within development zones for wildlife habitat. For       example, as much as 60-plus square miles can now be developed       from a single 12 to 14 acre gravel drill site. New drilling       capabilities are being developed…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}]