[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…anglers, and stop the cycle of loss.\n\nIn the Great Lakes, communities use these funds to intercept plastic  before it reaches open water, cleaning up shorelines, restoring  habitats, and keeping microplastics out of the drinking water systems  that serve millions of people.\n\nThis program doesn't stop at cleanup. It fuels economies and  strengthens resilience.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…ELFRETH. Madam Chair, House Natural Resources Committee Democrats  strongly oppose Biggs amendment No. 29, which seeks to weaken the  Department of Defense's work to preserve habitats crucial for military  readiness and recovering vulnerable species.\n\nThe DOD covers millions of acres, spanning a vast array of natural  habitats and providing that realistic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Performance Data Facility is  completed by 2030.\n\nMy fourth amendment No. 39 emphasizes the important work being  conducted by the U.S. Army Corps of Engineers to create new oyster  habitats in the Chesapeake Bay. Oysters' natural ability to filter  pollutants out of water make them an ideal partner in cleaning our Bay.  The Corps serves as the lead agency for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and  Horseshoe Islands in Walbridge Park on the Maumee River, the largest  river that flows into the Great Lakes.\n\nThis restoration means cleaner water, aquatic and wildlife habitats  renewed, and a healthier Lake Erie. As co-chair of the Great Lakes Task  Force, I am profoundly grateful that our citizens united to restore the  heart of our islands along…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695469/resisting-the-temptation-to-divide"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…decline to a  point where they need Endangered Species Act protections. These plans  provide a comprehensive assessment of the status of States' wildlife  populations, key habitats, and strategies to keep the populations  strong.\n\nEach year, these funds provide States with upwards of $54.4 million  to conserve species and critical habitats. These funds…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…unfolding in Hawaii. Habitat destruction has  significantly reduced the space where native plants and animals can  thrive. Forests, wetlands and coastal ecosystems--critical habitats for  native species--are being cleared or degraded, leaving these species  increasingly vulnerable. As these ecosystems are altered or destroyed,  the species that depend…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Science Center is located in my district. It  meets the Nation's need for scientific information used to restore,  enhance, manage, and protect the freshwater fisheries and habitats of  the Great Lakes. The GLSC helps to protect the freshwater fisheries and  habitats that are invaluable economic and ecological assets for the  entire Great Lakes region.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…this bill ensures that funding continues  uninterrupted through 2033.\n\nThis is conservation funding that works. It is user funded, results  driven, and focuses on protecting habitats that benefit all Americans.  The North American Wetlands Conservation Act has helped to protect  millions of acres of wetlands and grasslands across North America.\n\nI commend…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693494/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…supporting biodiversity to enhancing local ecosystems, native plants  play a crucial role in promoting sustainability and resilience in our  environment. They provide critical habitats for wildlife, including  pollinators like bees and butterflies, which are essential for  agricultural productivity. They also help reduce our reliance on  chemical fertilizers…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…legislation, commonsense  protections. They have proposed a mandatory insurance coverage  requirement, for example. They have also offered off-limits zones for  very sensitive habitats and standard user fees like these oligarchs pay  when they run one of these on land.\n\nOur amendment would have allowed the basics of H.R. 261 to move  forward, allowing an…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Mississippi Sound to the list of estuaries for  priority consideration.\n\nReauthorization ensures continued Federal support for this critical  program, which has protected vital habitats, improved water quality,  and fostered regional resilience since its creation in 1987.\n\nProtecting and restoring Mobile Bay, which is in the heart of my  district, is essential…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…introduction of invasive species, which further disrupts the  ecological balance. The long-term consequences of these practices are  the loss of biodiversity and the degradation of habitats that are vital  to the health of our oceans.\n\nMany of these harmful collection practices occur in international  waters, particularly in regions such as Southeast Asia, where…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…importance of wetlands and waterfowl conservation. The  Junior Duck Stamp curriculum is a program during which students can  develop an understanding of waterfowl anatomy and habitats, culminating  in the Junior Duck Stamp art competition, where participants may draw  or paint a picture of an eligible North American waterfowl species.\n\nThe winning image…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…all permit       applications are reviewed by both federal and state wildlife       agencies to ensure full protection of threatened or       endangered species and their habitats.\n\nI urge you to support the Maintaining Cooperative       Permitting Act of 2025 to ensure Florida's Clean Water Act       404 permitting program is rightfully restored to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, by passing this commonsense legislation,  the House will ensure that we can continue conserving vital waterfowl  habitats for years to come.\n\nThis is important for sportsmen and -women who depend on healthy  wetland habitats for hunting, fishing, and other forms of wildlife- centered recreation.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…program, the       Under Secretary shall prioritize proposed strategies,       technologies, and measures that would, to the maximum extent       practicable--\n\n``(1) protect key habitats for fish and wildlife;\n\n``(2) maintain biodiversity;\n\n``(3) protect public health;\n\n``(4) protect coastal resources of national, historical,       and cultural significance;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…orders for meaningful       consultation.\n\nThe 2020 Coastal Plain Oil and Gas Leasing Program (2020       program) included robust protections for wildlife and       sensitive habitats and was supported by the elected       leadership from the North Slope and Kaktovik. The development       of the 2020 program followed a transparent process that       incorporated…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Dr. Plaut then joined NASA and served as the lead scientist for the  International Space Station Biological Research Project, working with  engineers to build life science habitats for zero gravity.\n\nDr. Plaut joined Purdue University in 2010 and became executive vice  president in 2023.\n\nI wish Dr. Plaut the best of luck and congratulate her on her…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…Florida, was an excellent  endeavor to address the issue of bat endangerment, conservancy, and  awareness in our community. Krysta took action by constructing 26  sustainable bat habitats across Bradenton, North Port, and Ft. Myers to  support endangered bat populations. She led educational workshops for  Girl Scouts and community members on bat conservation…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…orders for meaningful       consultation.\n\nThe 2020 Coastal Plain Oil and Gas Leasing Program (2020       program) included robust protections for wildlife and       sensitive habitats and was supported by the elected       leadership from the North Slope and Kaktovik. The development       of the 2020 program followed a transparent process that       incorporated…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}]