[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…torn  apart with no warning and no plan. Children are afraid to go to school.  Homes are being entered without warrants. Workers are being dragged off  of jobsites by their hair. People are being abducted when shopping for  groceries, going to church, or taking their kids to school. Peaceful  citizens are being pepper-sprayed and shot in cold blood…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…to him.\n\nI can remember, as a child living in Chicago, Illinois, going into a  local Walgreens. I remember standing there with my family, all of them  fair-skinned, with red hair, brown hair, and freckles, and me, the  brownest child in the family, being told I couldn't go sit with my  family because they didn't believe I was a part of my family.\n\nIt…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Particulate matter, defined as follows:\n\nOne type of particulate matter is the soot seen in vehicle       exhaust. Fine particles--less than one-tenth the diameter of       a human hair--[it] pose[s] a serious threat to human health,       as it can penetrate deep into the lungs. [Particulate matter]       can be a primary pollutant or a secondary pollutant…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…infrastructure of America.\n\nThey want to cut $212 million from the DEA. Can you imagine? If a  Democratic President had proposed any of this, they would be screaming,  their hair would be on fire, but Donald Trump proposed it, and they  just mumble along like it is no big deal.\n\nWhat about all of these efforts to defund Federal law enforcement,  like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…learned the value of hard  work and getting involved in his community, and these values shine  through in all he does today. Over forty years ago, Ronnie opened his  own business, Hair Innovations, where he provides salon services and  keeps New Mexicans feeling like the best versions of themselves to this  very day.\n\nKeeping a small business open in today's…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…American officers in the Navy: Jesse Walter Arbor; Phillip G. Barnes;  Samuel Edward Barnes; Dalton Louis Baugh, Sr.; George Clinton Cooper;  Reginald Ernest Goodwin; James Edward Hair; Charles Byrd Lear; Graham  Edward Martin; Dennis Denmark Nelson; John Walter Reagan; Frank Ellis  Sublett, Jr.; and William Sylvester White. The three men who passed  their…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699496/introduction-of-the-golden-thirteen-congressional-gold-medal-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…get  treated? Yes. Will they be able to pay their bills with their health  insurance premiums? Unfortunately, not if they drop coverage.\n\nThat includes my constituent Jess, a hair stylist in Chicago who was  diagnosed with breast cancer last year. Jess said that if the tax  credits go away, as they are supposed to on January 1, she would be  forced to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…picture and that photo with my constituents to say: So if you look like  this, if you are maybe this shape, if you have this degree of melanin,  if this is the color of your hair, or this is the color of your eyes,  or this is what you say, or if this is what kind of accent you have or  not, then you might be safe.\n\nI think the American people need to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…her best life as she is happiest spending time with family and  friends. In her free time, Dina enjoys watching game shows and soap  operas and is always ready for her next hair and nail appointments.  After many incredible years, Dina Boccippio's contagious positivity and  kindness is truly deserving of this body's recognition.\n\nMr. Speaker, once again,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694728/recognizing-recardina-dina-boccippios-100th-birthday"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…in life for him are his day program and eating out. How small are his  desires, and you want to take that away from him.\n\n``He requires much care: bathing, shaving, washing hair, brushing  teeth, dressing, et cetera. His aging parents can do the job required  for this 100 percent of the time. He has great caregivers right now,  and they have been with…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…jeopardy of cancellation. Meanwhile, the political response       detoured around the unique dangers of ICBMs, which (as land-      based missiles vulnerable to attack) remain on hair-trigger,       ``use them or lose them'' alert. Given the long record of       false alarms, such hypervigilance is a possible tripwire for       an accidental apocalypse.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…for public  executions. ICE started by chasing people through the fields and  factories where they work, then deporting U.S. kids with stage IV  cancer, pulling women by their hair down the street, and now just  murdering citizens in daylight. We have an unqualified, masked militia  eager to escalate.\n\nOne lady who I met recently in San Jose asked me:…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699568/no-funding-for-ice"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…MEEKS. Mr. Speaker, we were diplomatically working together. We  were trying to help the people of Venezuela.\n\nIn fact, we can also see how long ago that was. I had all-black hair  at the time. I think I looked good. I got gray. I had all-black hair  because that was back in 2002. I was a new Member of Congress, trying  to work together with diplomacy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "Mr. ZINKE. Mr. Speaker, I rise in tribute of our friend and  colleague, Doug LaMalfa.\n\nWhen I arrived in Congress in 2015, I noticed a large man with long  hair. He was a big man, but the biggest thing about Doug LaMalfa was  his heart.\n\nAs Secretary, I got the opportunity to tour his district that had  been devastated by wildfires.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698739/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…was a  problem.\n\nA few weeks ago, I came here with the MedPAC reports. I don't know if  anyone ever bothers to read them, but you go through there, and it  should light your hair on fire. For the last year, The Wall Street  Journal has done a series of articles basically showing hundreds of  billions of dollars of waste, fraud, misallocation, just misalignment…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sisters who are 65 and up has almost doubled  in that 20 years.\n\nAre we allowed to tell the truth about our brothers and sisters?  Those of us who are baby boomers with gray hair have changed the math  in our country. When I was a kid in the 1970s, for every dollar that  was spent on people 65 and up, there was $7 spent on young people.  Today, that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  outstanding constituent from my district, Jenya Rahazhynskaya. Jenya is  the founder and owner of Beauty Mood, a hair and beauty salon located  in Warminster, Pennsylvania. With her business' mission to enhance  people's natural beauty and provide opportunities to indulge in self- care, Beauty…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…week's CRA to halt the  Biden-era implementation of a natural gas tax that would harm our  Nation's energy producers and consumers.\n\nThe Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However, they have lost sight of the kitchen-table issues affecting  everyday Americans.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…better--let's call it a  credit rating. It is technically not a credit rating, but when Greece  can sell a bond cheaper than the United States, should that actually  raise the hair on the back of your neck?\n\nAre you thinking about the fact that the United States, for the  industrialized countries, is like number 12?\n\nLet's call it the credit stack, the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Speaker, I rise today to bring attention to the  millions of Americans, including many in my district, who live with  alopecia areata. It is an autoimmune disease that causes hair loss and  often comes with significant emotional and mental health challenges.\n\nAlopecia affects people of every age and background, and for many,  the journey can feel isolating…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, may I inquire as to the time remaining.\n\nMr. SCHWEIKERT. Mr. Speaker, my best guess is I will use about 6 or 7  minutes of it.\n\nMr. Speaker, do you remember the hair on fire comments that people  said that mathematically had no basis? They are not actually in the  budget documents. Let's understand the size of these committees are  vastly…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Instead of being afraid of the technology, maybe we should get our  heads straightened up. In our society we have a shortage of young  people. Baby boomers like me with gray hair are getting older, and we  are going to consume a lot more healthcare. Can we embrace the  technology? That technology sets us free when we start to realize the  things that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…18-year-olds coming in and next  year it is going be lower and the next year it is going to be smaller  and the year after is smaller. People like me, baby boomers, with gray  hair, there is a whole bunch of us. We have got to legalize technology.  Is it rational? I will say this a couple times. Is it rational to make  it illegal to automate a port?\n\nI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}]