[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…power.\n\nMany industries, such as construction, agriculture, hospital, and  healthcare, are already suffering severe worker shortages.\n\nEnding TPS for nearly one-half million Haitians and Venezuelans will  devastate these sectors, and the blanket ban on 19 countries will block  the students, nurses, entrepreneurs, and scientists and drive American  innovation…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698089/immigration"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…resilience, and cultural vibrancy of the Haitian community.       Their music has uplifted hearts, provided solace, and       reinforced a shared cultural identity among Haitians       worldwide, making this reunion a truly historic and emotional       event; and\n\nTherefore, be it proclaimed that we, the 20th Congressional       District of Florida,…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…single largest       client group. Twenty-three percent (519/2276 individuals) of       all clients served by Rian in 2025 were of Haitian origin.       Our clients include:\n\nHaitians who have held TPS since the 2010 earthquake in       Haiti that triggered the original Department of State       designation, and who have held that status continuously for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…are preparing  for the worst kind of ICE storm, a storm fueled by hate and racism,  years in the making.\n\nIn 2024, Donald Trump and J.D. Vance, peddled hateful lies about  Haitians in Springfield. Vance even admitted they weren't true. He  said: ``If I have to create stories . . . that is what I am going to  do.''\n\nWell, those stories dehumanized Haitians…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699519/ice-coming-to-springfield-ohio"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…mining.\n\nNo. 86, targeted State and local laws aimed at tackling the climate  crisis.\n\nNo. 87, moved to end lifesaving parole programs for Afghans and  Ukrainians and Cubans and Haitians and Nicaraguans and Venezuelans.\n\nNo. 88, moved to sunset critical environmental regulations.\n\nNo. 89, blocked $2.2 billion in Federal grant funding to Harvard.\n\nNo. 90, froze…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…this is a weekend  for examining our own conscience.\n\nMy office has heard an influx of others fleeing horror, seeking  shelter, scared that they will be sent back somewhere. Haitians who  were here legally and working were scared in Ohio that they would be  sent back to the streets of Port-au-Prince that are controlled by  warlord gangsters and roving…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Reviving the Haiti caucus was a significant priority for       me, because my district represents the third largest Haitian       diaspora in the country. More than 77,000 Haitians call the       Commonwealth their home. Our Haitian neighbors are attorneys,       nurses, social workers, chefs, artists, teachers, pastors,       and elected officials--and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…find safety in the United       States during times when conditions in Haiti have been, and       continue to be, unstable and unable to facilitate the safe       return of Haitians living in the United States. TPS has       enabled Haitians across the country to contribute to the       fabric of our cities, states, and country as a whole. They…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…different way, but the  President revealed what is his motivation.\n\nA few months into his first term, he said in an Oval Office meeting  of top officials that he thought that Haitians ``all have AIDS''--a  despicable and discriminatory lie.\n\nAnd he also said in that same meeting, we should keep Nigerian  immigrants out of the United States because, if they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Temporary       Protected Status (``TPS'') for Haitian and Venezuelan       immigrants. The lawsuit was brought on behalf of three       immigrant advocacy organizations--Haitians Americans United,       Inc. (``HAU''), Venezuelan Association of Massachusetts      (`` VAM''), UndocuBlack Network (``UBN'')--and four       individual TPS holders. Today,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the legacy of the former  chairman of the Committee on Ways and Means, Charlie Rangel, who  championed meeting our moral responsibility to support stability and  dignity for Haitians.\n\nThat is precisely what this bill does today. The Haiti Economic Lift  Program Extension Act provides an economic lifeline to tens of  thousands of Haitian families facing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698851/haiti-economic-lift-program-extension-act"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…soldiers at  war and risked their lives for the American people? This administration  ended their deportation protections on the same day they welcomed  Afrikaners.\n\nFor those Haitians who fled instability and gang violence, why were  TPS and humanitarian parole ripped away from them?\n\nAround the world, we have victims of war, famine, and bloodshed, but…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691340/make-refugee-policy-same-for-all"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…participating members of the Massachusetts       Congressional Delegation,\n\nThank you for receiving this testimony in support of       Temporary Protected Status (TPS) for Haitians. I am a primary       care physician at the MGB Chelsea Community Health Center in       Chelsea, Massachusetts, where I care for adults and children.       I also serve as…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…elite in  Haiti and the criminal gangs that have run roughshod over the majority  of the capital.\n\nEach day, the situation in Haiti gets worse. Approximately 1.3  million Haitians, including more than 700,000 children, have now been  forced out of their homes by gang violence. Just since last October,  gangs have killed more than 5,600 innocent Haitians.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…with criminal gangs to advance       their political and economic interests and agenda;\n\n(5) include a list of each criminal organization assessed       to be trafficking Haitians and other individuals to the       United States border;\n\n(6) include an assessment of ties between political and       economic elites, criminal gangs in Haiti, and transnational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}]