[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…65 wind turbines were already installed  when the Trump administration, just months ago in late August, issued a  stop work order, grinding this project to nearly a complete halt--men  and women on the job in New London, offshore, onshore, stopped from  going to work, out of jobs; investors, construction companies, supply  chain suppliers, all of them…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…has zero additional funding. This is not a minor bookkeeping concern.  The absence of a set aside, or anomaly, to fund construction of SSBN  828, will create serious risk of a halt work order to the production  schedule of the Nation's most critical defense program.\n\nThe legislative chaos of the last two months, with the House shut  down at the Speaker's…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…and years of permitting  approval.\n\nTogether, these projects will bring in thousands of new megawatts of  power to consumers in New England, New York, and Virginia. Trump's halt  work order cited vague, nonspecific national security concerns as  justification for this antiworker, anti-ratepayer, and antigrowth  decree.\n\nLuckily, Mr. Speaker, we have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…spending.\n\nEliminating Head Start would cut childcare and supportive services  for about 80,000 young children in California.\n\nThen let's talk about ag. This proposal would halt funding for the  Rural Energy for America Program. Once again, cutting a billion dollars  in funding for programs that help schools and feed folks through food  banks. Cutting…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…divisions by using this awful  attack as grounds to justify targeting Afghan-American communities in  the United States.\n\nAfter that attack, the Trump administration announced a halt to the  processing of all immigration requests from Afghan nationals,  coinciding with an announcement from the State Department that they  would immediately be halting visa…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Georgia, have been  doing lifesaving work, but this work has been largely halted because  the Trump administration has frozen new orders for RUTF, grinding  production nearly to a halt. This is despite Secretary Rubio and Elon  Musk promising publicly that emergency food aid would be continued.  That has not been the case so far, and relief for starving children…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…matter, this morning, I  am proud to be joining Senators Wyden, Kaine, as well as Senators  Shaheen, Welch, and Senator Paul to introduce another resolution that  would put a halt on all of Donald Trump's global policies. The  resolution we passed dealt with Canada. This deals with all of the  global tariffs. I am very proud to cosponsor this legislation.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689739/resolution"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Nicaragua, Venezuela, Cuba, North Korea, Hong Kong,  Tibet, Burma and, as I mentioned, Iran, NED provides vital resources  for those advocating for freedom. This amendment would halt efforts to  provide citizens with accurate information, exposing corruption and  brutality of some of these regimes and kneecapping protesters who are  pleading for freedom.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699042/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…studies and activities within the NIH relating in any capacity to  the health of LGBTQ Americans, including active research programs, and  President Trump violated court orders to halt funding freezes to  organizations like the NIH.\n\nRepublicans rejected legislation to cap insulin costs for millions of  people with diabetes nationwide. Now they want to raise…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to urge my colleagues to  support the HALT Fentanyl Act when it comes to the floor tomorrow.\n\nFor the past 5 years, I have engaged with law enforcement, public  health experts, and colleagues across the aisle to ensure…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692340/calling-for-permanent-scheduling-for-fentanyl-analogues"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…taxpayer dollars going to masked  Federal agents, warrantless searches, and violence--violence--in their  communities.\n\nDemocrats have been clear. We need legislation to truly halt ICE's  abuses. Otherwise, what Tom Homan says today could be reversed by  Donald Trump, on a whim, tomorrow. Without legislation, Donald Trump  could choose to put a rogue force…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700064/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Madam Speaker, on August 22, the Trump administration,  with absolutely no warning, issued a halt work order to an offshore  wind project off the coast of southern New England that has been in the  works for 9 years.\n\nThe developers of this project have invested close to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…this year. But it isn't just this year. If you look back,  the plummet that happened today is not pretty. Perhaps the President  thinks that putting a pause on tariffs will halt this market crash. I  mean, his proposals have been like this, but I urge this administration  to realize it is uncertainty that the market does not like.\n\nManufacturers cannot…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…in the Senate  doing what I can to help stop those drugs from entering the United  States and to getting help for those who need it. Just last month, the  Senate passed the HALT Fentanyl Act, which is legislation I  cosponsored, along with a lot of my colleagues, which would permanently  schedule fentanyl-related substances.\n\nImposing tariffs against…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President Biden was not sending enough U.S. support to Ukraine. But now  they appear to be standing by silently as facts are erased, as the  pipeline of aid to Ukraine peters to a halt, as the Trump  administration disbands Federal task forces established to seize the  assets of Russian oligarchs and guard against foreign election  interference and disinformation…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…majority of Americans would reject. If now is not the time, I don't  know when is. It will be too late when the investors stop buying our  bonds and everything comes to a dead halt in America. We can't let that  happen.\n\nMr. Chair, these earmarks are against every conservative value that  is known. The intent of these is wrong. The expenditure of these…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…thousands of dollars, adding up  to billions and billions of dollars that are going to be borne by these  businesses.\n\nI am grateful President Trump has taken the decisive action to halt  these rules by having the Department of Energy postpone the effective  date of these standards, providing breathing room for businesses.  However, more work needs to be done;…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…hundreds of billions of their  dollars have gone to illegal aliens and politically connected NGOs who  facilitated this recent invasion.\n\nPresident Trump's swift actions to halt illegal crossings and to  deport illegal aliens in his first 100 days has made one thing  painfully clear: The Biden-Harris administration was never working to  fix our immigration…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…divided and controlled by the  chair and ranking member of the Committee on Oversight and Government  Reform or their respective designees.\n\nMr. Speaker, starting with S. 331, the HALT Fentanyl Act, important  legislation that the House considered back in February when 98  Democrats supported it, this bill would permanently classify all  fentanyl-related substances…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…considered schedule I substances,  but only because of a series of temporary scheduling orders, and that  order is now set to expire on September 30 of this year.\n\nThat is why the HALT Fentanyl Act, led by myself and my friend, the  gentleman from Ohio (Mr. Latta) in this House and then Senators Cassidy  and Heinrich in the Senate, is critically needed.\n\nThis…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…this issue.\n\nI have a hard time listening to opposition to this bill. Our  colleagues on the other side of the aisle for the last 4 years have  continuously voted against the HALT Fentanyl Act and have stood in  opposition to any effort to curb the opioid crisis in this country,  which up until recently was killing 100,000 people every single year.\n\nThat…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…to  fentanyl poisoning. Nobody should have to experience this pain.\n\nEarlier this year, the House took a critical step to get illicit  fentanyl off our streets in passing the HALT Fentanyl Act, which was  led by my friend, Congressman Morgan Griffith.\n\nI am proud today to lead the reauthorization of the SUPPORT for  Patients and Communities Act. By passing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…voted on.\n\nThere is this norm of voting in favor of rules, which I have always  done, because if you don't do that, Mr. Speaker, then the business of  the House grinds to a halt.\n\nThe only times in which I haven't done that are when the form of a  rule, the mechanism of a rule, is abused for some purpose that actually  impacts policy.\n\nThat is what…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "John Thune", "party": "Republican", "sentence": "…majority leader, in consultation with the  Democratic Leader, during Thursday's session of the Senate.\n\nMr. THUNE. Mr. President, just over 2 weeks ago, the Senate passed  the HALT Fentanyl Act with bipartisan support. As I said at the time,  this bill joins other efforts to combat the fentanyl crisis that is  taking so many lives in our country.\n\nBut…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for the families and the friends of the kids.\n\nWe must ensure that law enforcement has the tools it needs to address  these threats, and that is what we are doing today. The HALT Fentanyl  Act will permanently schedule fentanyl-related substances as a class I  drug. This is long overdue.\n\nI know my good friend, Mr. Griffith, and also Mr. Latta, have…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise in strong support of S. 331, the  HALT Fentanyl Act.\n\nMr. Speaker, opioid overdoses have become an epidemic in this  country. Last year, over 100,000 Americans lost their lives to  overdose, and fentanyl poisoning…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…rogue activist judges  accountable, H.R. 1526; bring transparency to institutes of higher  education, H.R. 1048; make changes to our border with the Laken Riley  Act and the HALT Fentanyl Act; and to repeal the Biden-era harmful  environmental regulations by passing what we call Congressional Review  Acts to undo the damage of the Biden administration.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…14 nationwide injunctions that  happened. In fact, President Biden's Solicitor General--the one who  actually argues to the Supreme Court--warned that nationwide  injunctions halt legal government actions and policies.\n\nSee, this is not a Republican-Democrat thing; this is a  constitutional thing. This is the U.S. Constitutional structure to say:  What…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…immigration enforcement, to kneecap ICE. They lost the issue on the  front end of the election. Now they want to make it so hard for ICE to  do their jobs that deportations come to a halt. That is the truth, and  anybody in this town who tells you otherwise is just spinning.\n\nThey don't want people deported because they are importing a voter  base that they think…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, I rise today in strong  support of the HALT Fentanyl Act, critical legislation to crack down on  the criminals who produce, traffic, and sell fentanyl and fentanyl- related substances.\n\nEarlier this year, we were able…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}]