[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of people and the heritages that  make up these great United States.\n\nWhile we joyfully celebrate this month, it is the second JAHM that we  commemorate under the shadow of Hamas' October 7 attack on Israel. This  was the deadliest day for Jews since the Holocaust.\n\nSince that fateful day, the United States has witnessed a historic  rise in anti-Semitism,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…by President Trump in 2018.\n\nToday, Iran is closer to obtaining a nuclear weapon than ever before.  The Iranian regime, through its backing of terrorist organizations like  Hamas and Hezbollah, continues to wreak havoc throughout the Middle  East.\n\nWe must ask ourselves: Under what circumstances can Congress envision  abandoning our sanctions infrastructure…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Following the attacks on October 7, 2023, Israel had  every right to go after Hamas, but how they do so matters.  Indiscriminate bombing with massive casualties, women and children, is  horrific, completely unacceptable. Blocking food and medicine with the…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, the mass starvation in Gaza must end. The  forced displacement of 2 million Palestinians in Gaza must end. We all  condemn Hamas. We support a Jewish independent democratic state. We  want a cease-fire, and we want the hostages home. But a colleague in  the other body stated what needs to be said. It…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you that I, just as early as this morning, had tears well  in my eyes when there was a story about the Israeli babies who were  returned after they had been held hostage by Hamas.\n\nHamas did a dastardly thing in taking babies as hostage. Israel has  done nothing that would warrant Hamas to take babies as hostages. Then,  for those babies to be returned…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Lives, which was  heinously targeted by this terrorist. This is an organization that has  been working every week to peacefully call for the release of the  hostages held by Hamas in Gaza.\n\nMr. Speaker, I am simply asking for this House to consider my  resolution. This terrible attack happened in my district. I have no  doubt that if Republican leadership…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Gaza is starving. Children are  starving.\n\nThese photographs are very difficult to look at, but I ask you to  look because this is a man-made famine. We are 698 days into the Hamas- Israel war, which we all understand, but it has been nearly 200 days  since Prime Minister Netanyahu barbarously blocked all food, water, and  medicine into Gaza.\n\nThere are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694981/gaza-is-starving"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Semitic content compared with other social media platforms. This  amplification observed in the context of a major geopolitical events,  such as the portrayal of the Israel-Hamas conflict, and such hashtags  ``I stand with Israel'' or ``Pray for Israel'' were unrepresented. That  means they weren't represented at a ratio of six to one.\n\nAccording to…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…take  part in a peaceful walk and vigil as they have done every week for the  past 2 years, to call for the release of the hostages that were  kidnapped and are being held by Hamas in Gaza.\n\nWe pray hard, Mr. Speaker, for the 15 victims of this heinous attack,  my constituents. Several of these victims are people I know personally.  They are friends.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…the tool is  overwhelmingly used for crime.\n\nThe Russians use crypto to evade sanctions and fund their war in  Ukraine. The North Koreans use it to fund their nuclear program. Hamas  used it to fund their October 7 attack. Fentanyl traffickers use it to  get paid. All, 100 percent, of ransomware attacks get paid in crypto.\n\nThat is a really good argument…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…systems, between the United States and Israel. As a strong critic of  Prime Minister Netanyahu, I am appalled at the way he has prosecuted  the Israeli military campaign against Hamas terrorists that has led to  catastrophic death and destruct in Gaza. With a fragile ceasefire in  place, we should be focused on ensuring the continuation of a peace  process…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the things  which we are discussing this evening.\n\nWe asked him why Israel was not providing humanitarian aid in Gaza.  He said: That is not true. We were providing it, but Hamas was stealing  it from us and using it to buy weapons and to make them stronger.\n\nThen he went on to say--when we asked him about the children  starving, the images we had all…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…together was cut  short when a man yelling, ``Free Palestine,'' murdered them.\n\nThis past weekend, 12 people who gathered weekly to bring attention  to the hostages held captive by Hamas were firebombed by an anti- Semitic terrorist in Boulder, Colorado. Committing violent acts and  murder against Americans living their everyday lives is not justifiable  protest.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691921/rise-of-anti-semitism"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Israel, the United States, and the world. Under the Ayatollahs, Iran  has been the largest state sponsor of terror in the world. It has  financed, trained, and directed Hezbollah, Hamas, Palestinian Islamic  jihad, and the Houthis. For the last 30 years, Iran has marched forward  in the pursuit of nuclear weapons, all while chanting: ``Death to  Israel, death…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…Alexander, from Tenafly, New Jersey, is an all- American kid who graduated from Tenafly High School and swam on the  swim team. He could be anyone's son.\n\nAfter being kidnapped by Hamas terrorists on October 7 and held for  584 days, I am thrilled to announce that Edan has finally come home.\n\nThrough it all, the strength of the Alexander family and the New…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693449/welcoming-home-edan-alexander"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…beginning of 2023,       rates of piracy in the Western Indian Ocean subsided.\n\n(3) Houthi attacks against commercial vessels in the Red       Sea and Gulf of Aden since the Hamas terrorist attack against       Israel on October 7th have impacted global shipping markets.\n\n(4) There has been a surge in Somali pirate attacks,       beginning in the fall…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…invaded Ukraine, escalating a war that had  started back in 2014 and continues today with massive casualty figures  on both sides now ranging into the millions. October 7, 2023, Hamas  terrorists,  who are Iranian proxies, launched the deadliest attack in history  against the nation of Israel.\n\nAnd all the while, China prepares for war. They have actually…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Speaker, I rise today to honor the many families still  grieving from the heinous assault that claimed 1,200 innocent lives on  October 7, 2023.\n\nLast Monday marked 500 days since Hamas terrorists perpetrated the  unprovoked and truly evil attack. It was the deadliest assault on  Israel and the Jewish community since the Holocaust.\n\nI commend President Trump…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688087/500-days-since-october-7-attack"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Immigration      Reduce by Less      None.............  ....................                                   Benefits for        Than $500K.                                   Hamas Terrorists                                   Act of 2025, as                                   amended. H.R. 225.......................  HUD Transparency    None..............…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…safer place because of what  Donald Trump ordered and what our military carried out this past week.  The Western Hemisphere cannot be a safe space for China, Russia, Iran,  Hamas, Hezbollah, or the other terrorists that were being given safe  haven in Venezuela.\n\nSpeaker Pelosi in 2019 ended her round table comments with a  resounding: ``It is clear…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…graduate of  the University of Kansas who cared deeply about the shared human  dignity of all people.\n\nThen, just days ago, at a peaceful pro-Israel demonstration in  Colorado, a Hamas sympathizer threw Molotov cocktails into a crowd and  injured more than a dozen people while yelling: ``Free Palestine.''\n\nAudrey and I are deeply grieved by these senseless…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Republicans and Democrats agree that we need durable,  long-lasting, and long-term pressure on Iran.\n\nOn October 7, the world witnessed the horror of Iran-backed terrorism  as Hamas brutally murdered over 1,200 innocent people in Israel.\n\nIran has been sponsoring Hamas for years. They were sponsoring  terrorists on the battlefield that I and many of our…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to take up. I have been talking to  some people who wonder why we have demonstrations in this country  hostile to Israel, and even more bizarre, demonstrations favorable to  Hamas and people who live in the Gaza Strip.\n\nIt has been my belief--and I give this conversation privately to  people, but I should make my case more public--that when people take…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…is alive and  well.\n\nPresident Donald Trump is the President of peace, ending eight wars  in 8 months. Tell me who in history has ever done this.\n\nThe war between Israel and Hamas is over. The hostages were returned  home. The Iranian nuclear program has been set back for decades, and  the Middle East is more stable than it has been in years.\n\nTo gain…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, last Monday marked a somber  milestone. It was 500 days since the horrific attacks on October 7,  2022, when Iranian-backed Hamas terrorists launched the most harrowing  assault on Israel and the Jewish people since the Holocaust.\n\nWe witnessed an unprecedented act of violence that shocked the world…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…October 7, 2023, will probably go down  in history to Americans like December 7, 1941, Pearl Harbor Day.\n\nOn October 7, 2 years ago, Israel experienced a surprise attack from  Hamas. As those under attack rushed to safe rooms and to bomb shelters,  the terrorist group infiltrating the country began firing on homes and  killing Israelis at random.\n\nThose…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…opposing ideologies not allowing       for urgently required unity at times of grave danger, such as       during the Holocaust. The prosecution of the Gaza War       following Hamas's barbarism both united and divided Israelis       with a backlash of antisemitism in the United States and       Europe. It is evident that events in Israel affect the Jewish…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…held its ground. Israelis certainly weren't  enthused about a ground war in Gaza. Their leaders knew that war would  be difficult. But they knew it was unavoidable so long as Hamas  terrorists still refused to release its hostages. They also knew  lasting security meant changing Iran's calculus, not just responding to  attacks from proxies.\n\nSo Israel…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…ballistic  missiles, and nothing to rein in terror proxies. Years down the line,  the sanctions relief Iran received from this deal directly funded  Iran's terror proxies and led to Hamas's October 7 attack on Israel.\n\nIran's ejection of the International Atomic Energy Agency from its  facilities marked the latest in a long chain of violations of Iran's  nuclear…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…would reinstate the  failed policies of the Biden administration and would abandon America's  closest ally in the Middle East.\n\nLet's remember, the conflict between Israel and Hamas and the need  for the military assistance for Israel is the fault of Hamas. It is not  Israel's fault. It is not America's fault. It is the fault of Hamas. It  is the result…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694433/providing-for-congressional-disapproval-of-the-proposed-export-of"}]