[{"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…school, two separate provisions of Article I of  our Constitution allocate what is known as the power of the purse to  Congress. As articulated by James Madison and Alexander Hamilton in the  Federalist Papers, our Founders made the spending power the bedrock of  the Constitution's allocation of powers in our government. They sought  to ensure that the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…of Justice and the Government Accountability Office  have said so. Over 200 years of American history say so. Our Founding  Fathers designed our government so.\n\nAlexander Hamilton said: ``But where the purse is lodged in one  branch, and the sword in another, there can be no danger.'' The power  of the purse resides in the United States Congress.\n\nThis…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impeachment, the former President of the United States of America,  because there are some people who have read the Federalist Papers. I  have read them. I have read the words of Hamilton, the words of Jay,  the words of Madison. I have read them.\n\nThey now have come to these lofty conclusions about what impeachment  is. I am going to tell you the truth of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…are supercharging the private-sector deals. The  problem is that is not going to build the communities that have been  hollowed out.\n\nWe know what builds communities from Hamilton to Lincoln to FDR. We  need a government that says: If you make it in America then we will buy  it. That is what we did, by the way, for SpaceX. That is what we did  for Intel.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…families in  our community. By focusing on these initiatives, participants can  develop the necessary skills needed to thrive today.\n\nFounded in 2001 by Baldwin and Crystal Hamilton, It's About the Kids  Mentor Program began outreach in Marietta, Georgia, then following the  Hamiltons' move to Dallas in 2012, they expanded their reach to Dallas  and most…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Gomez, Kaily       Grabemann, Patrick Green, Nicholas Greene, Mariah Greenlee,       Haley Griffiths, Maddisen Grimm, Khenadi Grubb, Andrew       Guernsey, Ella Gunn, Caroline Hamilton, Hannah Hancock,       Wesley Harkins, Laurie Harris, Austin Harrison, Grace       Harrison, Michael Hart, Daniel Hartl, John Hatfield, Wesley       Helms, Holly Hendrix,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…again.\n\nIn Federalist No. 65 of the 85 articles of essays contained within  the Federalist Papers, written to promote the ratification of the  Constitution, the great Alexander Hamilton explains that the subject of  the Senate's jurisdiction for trials of impeachment are those offenses  which proceed from the misconduct of public men or, in other words,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "Mr. LIEU. Mr. Speaker, I rise to congratulate the work and dedication  of Carol Hamilton, who is retiring on May 1, 2025, from her role as  Group President for Acquisitions, Business Development, and West Coast  Headquarters at L'Oreal. Carol has been a business…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690596/congratulating-the-work-and-dedication-of-carol-hamilton"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford Crenshaw\n\nSuperior Service Award: Brian Bond\n\nService Pins: Gerald Hamilton, 55 Years; Howard Foard Jr.,       50 Years; Gerald Curry, 45 Years; Robert Drummer, 40 Years;       Julius Reynolds, 40 years; Earl Smith Jr., 40 Years; Shun       Williams,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…from all over the world to be inspired by the beauty of  its roaring water.\n\nAdditionally, our Great Falls are unique as both a historical and  national landmark. Alexander Hamilton used the power of the falls to  help start the industrial revolution right in the heart of Paterson,  New Jersey.\n\nOverlook Park is the center of our national park. This part…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…and artists who entertain live audiences in every  state across the country: the theatrical chorus. I am pleased to  recognize 2025 as ``A Chorus Year.''\n\nFrom Oklahoma! to Hamilton, some of the greatest art to come out of  the United States has been musical theatre, and a staple of this art  form is the chorus.\n\nThe chorus has always been more than a…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694729/recognizing-2025-as-a-chorus-year"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…dictators running the  place, taking a cut of everything, but instead it is the President of  the United States doing it.\n\nOur Founders said this should never be allowed. Hamilton noted the  reason that there is an emoluments clause in the Constitution. In  Federalist 22, he  said ``many mortifying examples of the prevalency of foreign corruption  in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of the Constitution is  more wisdom to be found than in the clause which confides the question  of war and peace to the legislature, and not to the executive  [branch].''\n\nHamilton, who didn't always agree with Madison or Jefferson, wrote  that ``the Legislature can alone declare war, can alone . . . transfer  the nation from a state of Peace to a state…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "French Hill", "party": "Republican", "sentence": "…from First District, Bill       Alexander (D-AR) to request the Forest Service to delay any       development in the potential areas. ACC members, Bill       Coleman, Don Hamilton, and Tom McClure toured the state with       an informative slide presentation supporting the larger ACC       proposed list of areas. In February 1982, Arkansas Governor…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…III  of Fleming Island, Florida, marks his 100th birthday, a century defined  by faith, family, and devoted service to our Nation.\n\nDr. Mitchell graduated valedictorian of Hamilton County High School  before entering the Navy in 1943. Recognizing his talent, the Navy  placed him in the B-12 program at Emory University, where he again  graduated valedictorian…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…heard people being talked about here on the Senate floor. I want  to mention a few names that no Democrat will ever utter: Laken Riley,  Rachel Morin, Jocelyn Nungaray, Kayla Hamilton. These are American  daughters, American sisters who were murdered by illegal aliens.\n\nBy the way, Laken Riley's murderer wasn't a previously convicted  violent criminal.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…1789, which sought to generate revenue by placing a 5-percent tax on  all imported goods and was signed into law, after passage by Congress,  by George Washington.\n\nAlexander Hamilton's ``Report on Manufacturers'' is well known.  According to Professor Douglas Irwin of Dartmouth College, every tariff  recommendation put forth in the report was adopted by…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…He went on to recite this poem perfectly, and I thought: Wow, I would  like to be able to do that. I learned one poem--that one.\n\nBut I remember him quoting Robert Browning Hamilton when he said:\n\nI walked a mile with Pleasure; She chatted all the way; But       left me none the wiser For all she had to say. I walked a       mile with Sorrow; And ne'er…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…residents have made  Tontogany an outstanding example of American ingenuity.\n\nTontogany's long history dates back to the first settlers to settle  in the area, Samuel and Eliza Hamilton. The village's name comes from  the Ottawa Native American Chief Tondoganie. When it was officially  incorporated in 1895, the town was an agricultural village, populated…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Christopher: CBS NEWS; Halpern,       Jared: FOX NEWS RADIO; HALPERT, MADELINE: BBC; Ham, Eric: AP-      BROADCAST; Ham, Tiana: MBC-TV KOREA (MUNHWA); Hamburg,       Daniel: WDCW; Hamilton, James: AL JAZEERA ENGLISH; Hamme,       Koji: NHK; HAMPSON, IONA: BBC; Hampton, Olivia: NATIONAL       PUBLIC RADIO (NPR); Hamza, MOHAMMAD SAMER: SKY NEWS ARABIA;       Handel,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…The border was wide open. Americans were getting killed.  Americans like Jocelyn Nungaray, Americans like Laken Riley, Americans  like Rachel Morin, and Americans like Kayla Hamilton. I can keep going  down the list of dead Americans at the hands of the foolish,  incompetent, and dangerous policies of the Biden administration that my  colleagues on the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Cat;       Kalenborn Canada Inc.\n\nSuperior Fuel Company; Baldwin Supply Company; Dodge       Industrial; Baldwin Supply; Avivid Global Water; Vics Crane &       Heavy Haul; Hamilton Monroe & Co; Electric Power Door; Duncan       Co.; Victaulic; General Equipment and Supplies, Inc.; LRL       Construction; Contour Inc.; Borealis Fuels & Logistics;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…administration, the Biden  administration was completely what I would call willfully blind to the  threat posed by people coming unvetted across our borders.\n\nFrom Laken Riley, to Kayla Hamilton, to Jocelyn Nungaray, the victims  of illegal aliens are numerous and must not be forgotten. What makes  these tragedies so heartbreaking is the knowledge that many of these…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "Mrs. SPARTZ. Mr. Speaker, I rise today to recognize Hamilton County  Sheriff Deputy Jeff Larkin, who is retiring after 16 years of service  with the Hamilton County, Indiana Sheriff's Department.\n\nPrior to his time with the Hamilton…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…communities, like TDA and MS-13,  that lead directly to the death of Americans, death of Americans like  Jocelyn Nungaray, like Laken Riley, like Rachel Morin, like Kayla  Hamilton; Americans that are no longer with us because of the policies  of our colleagues on the other side of the aisle, because of wide-open  borders, and because of tolerance of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…here, we have  victims of dangerous illegal aliens that were in the United States of  America. Over here, we have five Americans who are no longer with us.\n\nWe have Kayla Hamilton, a 20-year-old woman with autism living in  Aberdeen, Maryland, who was savagely strangled to death by an illegal  alien, an MS-13 gang member released by Biden at the border.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…with the law or stop it when it isn't.\n\nThe antics of some of Yosemite's employees dishonor the silent  majority at the park, who are genuinely devoted to public service.\n\nAs Hamilton said: ``Here, sir, the people govern.''\n\nAll 2.4 million employees in the Federal workforce exercise powers  delegated by the President through our Constitution by virtue…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}]