[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "In March, Shaheen and members of the New Hampshire Congressional Delegation vowed to fight the President's efforts to cut funding for the program."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "Accordingly, we urge you to develop and rapidly make available a single website to serve as a clearinghouse for all new housing policies and tools that homeowners and renters can avail themselves of to get through this crisis.\"\n\n \n\nSenator Hassan and the New Hampshire Congressional Delegation pushed for significant support for affordable housing in the CARES Act."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "In January, Senator Shaheen, a senior member of the Senate Appropriations Committee, and Senator Hassan sent a letter with the New Hampshire congressional delegation calling on the Trump Administration to boost funding for the Older Americans Act in his budget proposal to Congress for fiscal year (FY) 2021."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "Additionally, the Senator joined the New Hampshire Congressional Delegation in urging the Small Business Administration and U.S."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "\"I will continue to work with the New Hampshire Congressional Delegation to prioritize investments like these that support communities and our environment.\"\n\n\"Climate change poses a serious threat to our environment and our economy in the Granite State, and public transportation can play an important role in reducing carbon emissions,\" said Congresswoman Kuster."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "Earlier today, Senator Hassan and the New Hampshire Congressional Delegation requested rapid assistance to ensure New Hampshire health care providers have the supplies needed to address the surge of COVID-19 cases the state is experiencing."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Ahead of President Trump's budget announcement earlier this month, Shaheen sent a letter with the New Hampshire congressional delegation calling for the administration to appropriately fund Coronavirus prevention efforts in the President's budget proposal for fiscal year (FY) 2021."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "\"This additional federal funding will help Community Health Centers ramp up their testing capacity, and I will continue working with the rest of the New Hampshire Congressional Delegation to ensure that our frontline workers have what they need to safely combat this deadly virus and keep people safe.\"\n\n\"Expanding the availability of reliable COVID-19 testing is key to combating this public health crisis,\" said Congresswoman Kuster."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "People, health care facilities, and small businesses across our state need relief now, and we will keep doing everything in our power to ensure that the administration delivers emergency resources quickly and effectively.\"\n\nEarlier this week, the New Hampshire Congressional Delegation called on President Trump to approve the major disaster declaration."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "For several weeks, our New Hampshire congressional delegation has pressed the Trump administration to propose more resources to support state governments' coronavirus responses."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "The New Hampshire congressional delegation has fought to secure additional funding and supported numerous efforts to help the state in its response to the COVID-19 outbreak."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I will continue working with the rest of the New Hampshire Congressional Delegation to get additional resources and funding to those on the front lines to help combat this deadly virus and protect public health.\"\n\n\"Community health centers in New Hampshire play a crucial role in our state's collective response to the COVID-19 outbreak,\" said Congresswoman Kuster."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Federal funding for public health in New Hampshire -- from COVID-19 to the substance misuse epidemic -- is more important than ever, and I will continue to work with my colleagues in the New Hampshire Congressional Delegation to secure support and resources for our state.\"\n\nSenators Shaheen and Hassan are leaders in Congress in combating the substance use disorder epidemic."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "Senator Hassan recently joined the rest of the New Hampshire Congressional Delegation in announcing $164.5 million to New Hampshire health care providers as a result of the Coronavirus Aid, Relief, and Economic Security (CARES) Act that was recently passed by Congress and signed into law."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Our nation's founders intended for the Postal Service to serve the entire nation equally and fairly--under no circumstances should the Postal Service be radically restructured for political purposes.\"\n\n Last month, Senator Shaheen led the New Hampshire congressional delegation in a letter to congressional leadership, urging them to include relief for the U.S."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "Senator Collins led a letter with the entire Maine and New Hampshire Congressional Delegations to USDA today, urging the agency to provide price stabilizing assistance for New England dairy farmers."}]