[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…alongside Malcolm X during the civil rights  movement.\n\nDuring Black History Month, we are reminded that the civil rights and  Asian-American movements have always gone hand in hand in seeking  justice against systemic racism.\n\nAs we celebrate our progress this Black History Month and fight back  against the Trump administration, we must remember that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687997/black-history-month-and-the-alliance-between-the-black-and-asian-community"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to find a  bipartisan path forward, Republicans are simply giving up. I think this  is incredibly damaging to the House as an institution. Republicans  could have worked hand in hand with Democrats here and in the Senate,  and we could have then all worked together to find a path forward.  Instead, bullied into submission by President Trump and the MAGAs,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Month with my Congressional Asian  Pacific American Caucus colleagues.\n\nThe coalition of Asian American, Native Hawaiian, Pacific Islanders,  and Black Americans has worked hand-in-hand for generations to advance  racial equality. That coalition was on full display during Martin  Luther King, Jr.'s historic march from Selma to Montgomery in 1965 when  he…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688016/aanhpi-history-and-black-history-bonded-together"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…the values we hold dear. As a  communicator, Emma is second to none.\n\nAs Chair of the New Democrat Coalition, and before that Vice Chair  for Communications, I have worked hand-in-hand with Emma to find new  ways to address the challenges facing our country, adapting to a  constantly evolving media environment to connect with the American  people and earn…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…stable, prosperous, and interconnected Central Asia, one  that contributes to global security and economic opportunity. The  United States stands ready to continue working hand-in-hand with our  partners across the region to turn this vision into lasting results.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…neighbors.  Recently, they expanded their work to support seniors in Delaware.\n\nOrganizations like the Wilmington PAL remind us that public safety  and public opportunity go hand in hand. I am proud to stand with them,  and I will keep working with my colleagues on both sides of the aisle  to expand the resources that make their mission possible.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692994/wilmington-police-athletic-league"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…living, and they want to  treat patients. So we are going to have a provider issue in my State.\n\nI don't know if that is an issue for Michigan, but it is something  that goes hand in hand with Medicaid cuts because I hear from my  providers as well.\n\nMs. SLOTKIN. Yes. We talked about rural hospitals. I think, again,  even if you are not on Medicaid, you have…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Republican colleagues recognize this very real  truth, having voted against this exact language and understanding that  responsible conservation and strong national defense go hand in hand.\n\nMadam Chair, I urge my colleagues to reject this amendment, and I  yield back the balance of my time.\n\nMs. ELFRETH. Madam Chair, I demand a recorded vote.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Their mission focuses on several things, including disaster relief,  rehabilitation, family services, women's empowerment, health, and  education.\n\nIn Virginia, Sewa works hand in hand with local organizations to  strengthen our communities. They support the big September 11 National  Day of Service which will be happening again this year.\n\nThey offer…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…paying homage to its nearly 150 years of contributions to  American history and society. Virginia Murray Bacon then established  the Bacon House Foundation which worked hand in hand with the  Diplomatic and Consular Officers, Retired (DACOR) Education and Welfare  Foundation to establish the DACOR Bacon House Foundation which was  tasked with caring…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…brought the African American and Mexican communities together.  There was a time--before the word Hispanic was created--we knew Chuy as  a Mexican American. Chuy walked hand in hand with us in Chicago. In  1997, while he was the State senator serving alongside then Senator  Barack Obama, Chuy Garcia was the chair of the Black Caucus of the  Illinois…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…The bill would maintain full compliance with Federal environmental  standards, including NEPA and FLPMA, ensuring that responsible growth  and environmental stewardship go hand in hand.\n\nFinally, the bill would simplify mineral sales during land grading,  cutting delays when competition is not feasible while protecting  Federal interests and upholding…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…that he would actively engage toward working  to get the city of Green a unique ZIP Code. I promised the mayor at the  State of the City Address that I would work with him hand-in-hand after  several unsuccessful attempts to do so. We are now closer to that  reality upon the passage of H.R. 3095.\n\nThe city of Green currently operates under five different…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…act.\n\nAs a physician and mother, I know what is at stake. Every child  deserves to explore our parks without wheezing from smoke or smog.\n\nClean air and healthy parks go hand in hand, and they are worth  fighting for.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693644/clean-air-and-healthy-parks-go-hand-in-hand"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…president's cup winner christendom college\n\nMr. CLINE. Mr. Speaker, today, I rise to honor Christendom College,  which has, once again, shown that excellence on the field can go hand  in hand with achievement in the classroom.\n\nThe United States Collegiate Athletic Association named Christendom  the winner of the 2025 President's Cup, recognizing the Nation's…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…result of being a victim of human  trafficking.\n\nTo ensure that these opportunities are only available to true victims  of trafficking and not criminals, we have worked hand in hand with law  enforcement to include appropriate safeguards in the bill. The  legislation allows for additional evidence to be considered, including  the sworn testimony of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…accountable service to the  American people. We must ensure that collective bargaining agreements  already in place remain, as well as ensuring that good government goes  hand in hand with that.\n\nMr. Speaker, I was proud to join colleagues across the aisle as being  the 218th signature to advance this bill forward.\n\nI thank Congressmen Fitzpatrick and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697983/protect-americas-workforce-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…narcoterrorists, then oppose this resolution. It is plain and simple.  If you stand shoulder to shoulder with MS-13, Tren de Aragua, and  Sinaloa Cartel, and the dictators who work hand in hand with them, like  Nicolas Maduro in this photo, then this resolution is for you. Vote for  it.\n\nWe know exactly where some of my colleagues stand. You can look to  see where…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…That is why I have called on the Speaker to set up a bipartisan  commission to end gerrymandering in this country once and for all.\n\nBy the way, I think that should go hand in hand with a requirement  for voter ID in elections across the country so that we can finally  have fair elections in the United States.\n\nThe reality is that Americans of all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…behavior there.\n\nThe men and women of the El Paso County Sheriff's Office, the  Colorado Springs Police Department, the Drug Enforcement  Administration, and many others worked hand in hand to make sure that  the citizens of my community stayed safe through that all.\n\nI also thank the men and women of the United States Capitol Police,  whom I walk past every…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…despite that honor, he was never  officially presented the award.\n\nEarlier this year, Mr. Gilman contacted my office. Through the  persistent efforts of my staff working hand in hand with Army Personnel  Command, we confirmed that his Silver Star had been authorized decades  ago but never delivered.\n\nLast Tuesday night, more than 50 years after his acts…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Teshekpuk and Western Arctic Caribou Herds. All in  all, it was a phenomenal achievement by some very dedicated BLM  employees and an example of Federal Agencies working hand-in-hand with  Alaskans to understand our unique conditions, producing results that  protect both our environment and our way of life.\n\nHowever, following the 2020 election, President…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…month.\n\nBefore turning it over to my colleagues, I want to note two things.\n\nOne, I want to say thank you to Senator Cantwell for her partnership.  She and I have worked hand in hand on this. I am grateful for the trust  we have with each other and for the work ethic displayed by Senator  Cantwell and by her staff, who have worked very hard on this matter.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…bill was introduced by the gentlewoman from Iowa (Mrs. Miller-Meeks),  my friend and colleague.\n\nThe bill is a powerful reminder that mental health and physical  health go hand in hand. This bill extends authorization for the Staff  Sergeant Parker Gordon Fox Suicide Prevention Grant Program.\n\nHouse Republicans created the Fox grant program to expand the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…truly an honor and a privilege for me to join  my colleagues in honoring the life and the legacy of our good friend,  Doug LaMalfa.\n\nThroughout my time in Congress, I worked hand in hand with Doug on  the many issues that face the American West. He had a love for his  work. He had an understanding as a fellow farmer in the value of the  rural way of life,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that will advance and focus the mission of  Immigration and Customs Enforcement while protecting our officers and  protecting the public.\n\nHowever, such reforms must go hand in hand with a commitment to stop  jurisdictions like Minnesota and California from releasing dangerous,  wanted individuals as some sort of act of defiance, thereby forcing  immigration…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699574/consolidated-appropriations-act-2026"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Fortunately, the United States is home to some of the world's most  advanced financial technology firms and data analytics companies.\n\nJust this spring, the FBI, working hand in hand with blockchain  forensics firms, seized $1.5 billion in stolen digital assets from the  North Korea-affiliated Lazarus Group. That is why I am so proud to be  able to work…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693942/ofac-licensure-for-investigators-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…his actions would have been criminalized in full.\n\nAs technology evolves, so must our laws. We need to keep pace, there  is no question. We must. We must continue working hand in hand with our  law enforcement partners to stay ahead of these emerging threats and  safeguard our most vulnerable.\n\nI urge my colleagues to join me in voting in favor of S.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}]