[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…President Trump, Elon Musk, and their billionaire buddies have pushed  a budget that is nothing short of a war on working families. While  Trump and House Republicans push for new handouts for the wealthy, we  have massive cuts to Medicare, Medicaid, Social Security, and SNAP. The  same man who claims to champion the forgotten American is cutting  healthcare…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gone.  Suddenly, America can't pay for it.\n\nIf my friends on the other side of the aisle are okay with that, we  do not share the same values. If they think it is fine to give handouts  to billionaires, while stealing healthcare from regular people, we do  not have the same moral compass.\n\nThe bottom line is this country has a Republican Congress that works…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…a year versus tax cuts  for the wealthiest corporations and individuals.\n\nThat is the math. I know how fond you are of math. That is the  arithmetic.\n\nLet me tell you, the handouts to the wealthiest will come on the  backs of the least of us, from affordable healthcare through the ACA  and Medicaid, veterans healthcare, nursing home coverage, food  assistance,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688030/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…money. And  instead of ``no new wars,'' this President has plunged us into a  quagmire--paid for by the American taxpayer--seemingly, with the  primary goal of giving expensive handouts with respect to oil.\n\nWhy should the American people foot the bill for this misadventure?  Why should our tax dollars fund private interests in Venezuela? Why  should American…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…for the wealthy must be explicitly written into the text  of the Republican reconciliation bill.\n\nIf Republicans want to increase prices on hard-working Americans to  give handouts to billionaires, then own it.\n\nYou should not be allowed to hide behind President Trump as you do  it. Be transparent. Be honest. Put these price increases into the bill.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…now to  maximizing corporate profits, even in our most fragile landscapes like  America's Arctic.\n\nAmericans want clean air, clean water, and accessible public lands,  not handouts to polluters. Overturning balanced, forward-looking BLM  plans in Wyoming and Alaska is a colossal mistake.\n\nAcross the Federal land management agencies, plans like these…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…saw the gaggle of billionaires sitting behind Donald  Trump on Inauguration Day earlier this year. The driving force behind  this entire legislative effort has been to grant handouts to those same  billionaires and special interests all at the expense of hardworking  families.\n\nMr. Speaker, I hope my colleagues on the other side of the aisle will  stop…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693236/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…your policies and the people who  preceded you.\n\nOur Nation and the world are experiencing record levels of income  inequality, and the impacts of Citizens United and other handouts to  the obscenely rich and powerful are only making it worse.\n\nIt is past time that we change course and correct what has created  this inequality. Compare it to the years…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…``it would cost more than half my paycheck.''\n\nMedicaid gave her family access to lifesaving care. SNAP made sure  her kids didn't go to bed hungry. These programs aren't ``handouts,''  she says. ``They are lifelines.''\n\nNow, because her income barely crossed the threshold, she has lost  SNAP. ``It doesn't mean we can suddenly afford groceries,'' she…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691491/gop-tax-scam-hurts-women-and-families"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…have to show for it? A complete and total brain drain.\n\nWe are losing talent and expertise in our Federal Government, all  while the administration prioritizes tax cuts and handouts to the  biggest corporations.\n\nTo my constituents impacted by these cuts, I will continue to demand  answers, and I will continue to fight to hold this administration  accountable.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…responsibility to ensure that families like Karisa's  can focus on healing instead of having to focus on the bills they can't  afford.\n\nLook, New Mexicans aren't looking for handouts. They work hard. They  care for one another. I know it because I have lived it. When I was a  kid, we moved in with my grandparents, Celedon and Nestora Lujan. I  didn't understand…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…this Republican plan, how do they address it? They double down  on the policies that will widen the growing wealth gap of this Nation  by giving billionaires trillions in handouts and providing pennies to  the middle class.\n\nAccording to the Treasury Department, the top 1 percent of Americans,  those making over $750,000 a year, can expect to get an…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…bigger profits for their fossil fuel buddies--buddies  who contributed to Trump's campaign and have gotten paid out big time  in return, with more than $4 billion in brandnew handouts from the  government this year alone.\n\nLet's call Trump's energy agenda what it really is: oil above all,  not all of the above.\n\nTrump's energy agenda is killing American…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…funding, and I will fight to  protect them.\n\nThe Trump-Musk administration and Congressional Republicans seek to  demolish the educational foundation of our country to fund tax handouts  for the wealthiest individuals and companies. I am especially appalled  by the President's myopic focus to write race, gender, and ability out  of history. We must remind…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…budgeting, fine. Let's be  serious. Let's look at where the waste, fraud, and abuse runs rampant.\n\nLet's audit the Pentagon. Let's go after corporate welfare and Big  Oil handouts. Let's close the loopholes that let billionaires pay zero  in taxes. But let's not pretend this bill is about any of that.\n\nThis bill is a fraud and a con job. America deserves…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…can't make this stuff up. It is stranger than fiction.\n\nOur colleagues across the aisle showed their true colors by voting  for taxpayers to continue paying for government handouts to folks who  shouldn't really be in this country in the first place, but for the  open border policies of the Biden administration.\n\nOne accusation I find particularly ironic…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Mr. Chair, I rise today in support of Representative  Norman's amendment, which would prevent my constituents' hard-earned  taxpayer dollars from funding woke earmarks and handouts to leftist  NGOs that undermine President Trump's agenda and, alarmingly, support  taxpayer-funded transgender surgeries for children.\n\nBuried in the minibus package is $14.3…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…should not be forced to subsidize a leftwing  media operation like NPR and PBS. These cuts are more than symbolic.  Mr. Speaker, they are structural. They target woke U.N. handouts,  failing to keep the peacekeeping efforts, and Biden's DEI and climate  propaganda campaigns masquerading as humanitarian aid.\n\nLet me be clear. This does not cut defense.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…families  struggling to pay both their bills and their taxes.\n\nNow, this waste is enabled by two classes of expenditures that we  should foreswear forever. One is grants, cash handouts to political  favorites with little accountability or oversight, whether directly or  through agencies like USAID. The other is subsidies that replace the  judgment of consumers…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692548/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…died in 1949 of cancer. When my dad, a 7-year- old, had polio and my grandmother was a single mom in west Texas  raising him and did all the tough things, didn't ask for any handouts,  took two jobs, helped my dad go on to be the first to go to college--my  dad is 82 years old. He is still alive. He is 82 and still manages to  walk, barely.\n\nMy dad talks…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, if FOX News or talk radio or any  other conservative media outlet came to me and asked us if we should  provide them with taxpayer-funded handouts, I would say no, and I  believe that most of my colleagues would as well.\n\nI certainly think that far-left propaganda outlets like NPR should be  defunded. Remember, this…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692538/rescissions-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…chemical and surgical  abortions even after 20 weeks.\n\nI realize some argue these dollars are not directly paying for  abortions or gender surgeries, but when we give taxpayer handouts like  these, we free up resources for these exact practices.\n\nI do not know how any Republican can support keeping these special  handouts in this bill. While I wish my original…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…ago, President Trump left Joe Biden a blueprint  for success, and then Democrats proceeded to open our borders,  undermine American energy, and spend trillions of dollars on handouts  to the wealthy.\n\nThey created the highest inflation in 40 years that made it  impossible for working families to survive. That is why the American  people sent Donald Trump…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…to the United States from Greece in the 1970s  in search of an opportunity and a better life for their family. They  arrived in America with no connections, no government handouts, no  safety net to rely on, and worked their way forward step by step. With  them, they brought a deep respect for the values of faith, family, and  hard work.\n\nWhen the Katergaris…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demographics, we start to hit going  back to the mean. It is only like 1.8 percent GDP growth.\n\nWe cannot make it if we grow at anemic rates, but you can't do it  through a bunch of handouts and subsidies. It has to be from unleashing  markets. It is why I am concerned, seeing things going on where we are  taking ownership interests in companies.\n\nLook, this one…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…suburbs, are  struggling with these same issues. Governors, mayors, town boards, and  everyday citizens have raised their voices pleading for a solution.  They are not asking for handouts or special favors. They are asking for  the basic recognition of their community's existence, that they matter,  and that they deserve the same tools for success as their…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]