[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…men in those longboats was offered  by the King--over $100,000 in today's money.\n\nAnd officials were sent from England to go and put on a trial. Find  these men, try them, and hang them. No one would talk.\n\nAbout 60,000 people lived in Rhode Island back then, but it was a  close community, gathered mostly around the shore, a very prosperous  community…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…respect the rule of law. This was supposed to be up 2 years ago.\n\nMr. Speaker, forgive my passion, but I was there. I was here on  January 6, 2021. I heard them chanting: ``Hang Mike Pence.'' ``Hang  Mike Pence.'' The words are still echoing in my mind from that day.  They were looking for Nancy Pelosi. They were quoted as saying they  wanted to assassinate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…authoritarian regimes, just this week, Trump  said Democrats in the House and Senate had committed ``seditious  behavior, punishable by death'' and reposted a post saying: ``hang  them.''\n\nWe should be working as Congress to denounce these horrific words,  not beloved government programs like Medicare and Medicaid.\n\nJust as those authoritarian regimes…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hurt people. It is  going to hurt almost everybody in this country except if you are well- off and well-connected. If you are a billionaire, if you are a big  donor, if you hang out at Mar-a-Lago, you are doing fine, but not  everybody else.\n\nThe other thing that Republicans are doing is cutting medical  research, cutting NIH. If you want to talk about…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…on the table, to get to doctor's appointments, to afford medication.\n\n``Every day at our clinic, I hear it: `I'm scared. I feel hopeless. I  don't know how much longer I can hang on. . . .'\n\n``This is the health crisis we're living in and this bill would make  it worse.''", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the  ultrarich and powerful, those who never have to worry about access to  reliable healthcare.\n\nThese cuts are more than numbers on a balance sheet. These are lives  that hang in the balance. For western New York, this will make it  harder for Roswell Park Comprehensive Cancer Center or the University  of Buffalo to advance their lifesaving work.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…their lives. They paraded Confederate  and Nazi symbols through these Halls, as the whip observed as well.  They erected gallows. They erected gallows on the Capitol lawn to hang  the Republican Vice President of the United States, and so stated.\n\nUnlike the past few months, the National Guard was nowhere to be  found. Donald Trump had every opportunity…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…The livelihoods of our communities are on the line, not  poker chips in one of his Atlantic City casinos.\n\nThese are farmers, ranchers, working people, families whose lives  hang in the balance.\n\nIn New Mexico, our farmers are being crushed under the weight of  these tariffs, losing export markets, watching the USDA programs, that  once purchased homegrown,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…groups that came and led the attack on the  Chamber and then gave bloody instructions to the rest of the mob about  how to treat police officers in their effort to go and ``hang Mike  Pence.'' That was the chant. I can still hear in my mind, ringing off  the walls of the Capitol: ``Hang Mike Pence.'' ``Hang Mike Pence.''  ``Where's Nancy?'' ``Where's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…fact-checked me. Good for him. I disagree, which I will get to in  a second, but he fact-checked me.\n\nWhat their amendment does is it doesn't allow that. It just allows it  to hang out there. They can't fact-check it.\n\nThe facts are recruitment picked up a year before Trump came back in  office. We all know this. Recruitment improved for a long time. There…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President DJT.'' In another, he wrote of the lawmakers:  ``SEDITIOUS BEHAVIOR, punishable by DEATH!''  Dangerously and unconstitutionally, he reposted a third party's post:  ``HANG THEM GEORGE WASHINGTON WOULD!!''\n\nPresident Trump's call for the execution of lawmakers is a reckless  and flagrant abuse of presidential power that promotes extra-judicial…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…on the phone with  January 6 insurrectionists and President Trump and his associates who  were trying to block the certification of the election as people were  chanting, ``Hang Mike Pence.'' There were a lot of phone calls, a lot  of traffic going on.\n\nIn fact, that is why our Republican colleagues dealt themselves a  million-dollar cash payoff bonanza…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…of two Muslims  in the House of Reps.'' Rioters also targeted my fellow Hoosier, Vice  President Mike Pence, erecting a noose and gallows on Capitol grounds  with calls to ``Hang Mike Pence.''\n\nThat hellish day, the Capitol Police and first responders put their  lives on the line to save ours, and they deserve our endless thanks.  Today, my Democratic…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…an ideological abandonment  of our Federal law enforcement officers and there are more than 137,000  of them, not just the Capitol Police.\n\nSpeaker Johnson still refuses to hang a simple plaque honoring those  officers as is required by Federal law. The bill mandating the creation  and placement of the plaque, H.R. 2471, was signed into law on March…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…recognize my district's  2025 Congressional Art Competition winner, Kaitlyn Anthes as my  Constituent of the Week.\n\nKaitlyn's charcoal drawing, titled To Light and Guard, will hang in  the U.S. Capitol representing Virginia's Seventh District for the next  year.\n\nHer artwork was so impressive that when we received her piece, my  district director initially…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692977/recognizing-kaitlyn-anthes"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…credits permanent, sharpening our  competitive edge and incentivizing capital investment.\n\nThe table is set for growth. However, nearly $1 trillion in annual  interest payments hang over our heads.\n\nHere is where the Fed's actions can make an enormous difference. Due  to the Biden administration's highly inflationary policies, we saw  inflation soar to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just to sort of walk through the reality of the math because  so much of this body is about theater and not about facts.\n\nAs my wife a decade ago said: David, you get to go and hang out in a  math-free zone.\n\nLet's have some fun with facts and math.\n\nMr. Speaker, next year, the 2026 fiscal year, 3 weeks away, take a  guess: For every dollar of tax collections--for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…food stamps from 42 million Americans, defunding WIC, and not paying  our troops, our Federal employees, and our air traffic controllers. It  is a disgrace, and you should all hang your heads in shame.\n\nVote ``yes'' to pass the bill and reopen the government.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Colorado as a sanctuary State and falsely  represents that there were law enforcement contacts with the  perpetrator when the only information we have is that there were some  911 hang-ups that traced back to an address where the perpetrator was  living, to argue that somehow this is a reflection of our immigration  system uses Jews as a partisan pawn.\n\nIt…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…summer when we came back into session because he was  restoring a De Tomaso Pantera, and I would ask him: Doug, what progress  did you make on the Pantera this summer? He would hang his head and  say: Nothing.\n\nOn this playing Galaga with him, a little known fact about Doug  LaMalfa, he was a fierce competitor at Galaga. Above all, I will miss  our conversations.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698729/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…because of  birthright citizenship, which is not even intended under our  Constitution.\n\nWe must not fall for the idea that all a person has to do is sneak  across the border and hang around here and not commit a felony and,  therefore, they come in here.\n\nI feel so sorry for our great President Trump. He was left with such  a mess when Joe Biden let in 10…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698706/fixing-the-immigration-crisis"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…years. It is in that bag  over there. It is a metal seal that says: ``Member of Congress.''\n\nWhen I leave here and I go back to my office, it will be the first  thing that I hang. That is because God has a plan for us all. He has a  plan for all of you. He has a plan for me. He has a plan for every  member of my family, and He has a plan for every person…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}]