[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…matches their current legal name. Millions and millions of rural voters  would have to travel long distances to try to register to vote.\n\nWe don't have to guess what would happen if this bill were to pass.  In 2011, Kansas had a proof-of-citizenship requirement.\n\nMs. BONAMICI. Mr. Speaker, in Kansas, more than 30,000 U.S. citizens,  12 percent of everyone…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690002/safeguard-american-voter-eligibility-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…business. None of them were breaking  the law.\n\nThis is bigger than any one of us or any group of us. It is bigger  than any person's religiosity. It is bigger than where you happen to be  at a given time. This is about the right to life and the right to speak  freely. It is about what the Constitution affords all of us in this  country and about the necessity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American family--$2,000 more out of their pockets,  their hard-earned dollars that they are struggling to stretch. And now  another added increase, all that didn't have to happen, because Donald  Trump is imposing tariffs on Canada and Mexico.\n\nIt has been clear that in the past, when applied intelligently and  precisely, tariffs can be a useful tool…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…no reason other than he was doing his  job. The way agents treated Senator Padilla is what you see in  totalitarian regimes.\n\nIt is outrageous that Secretary Noem let this happen and then lied  about the incident after the fact. Neither the Senate, nor any member  of government, can tolerate a Member of this Chamber being treated in  this way. Secretary…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692588/alex-padilla"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…neighbors, but you find a way to live next  to your neighbors. You find a way to work with them. And what is so  unfortunate about what is going on tonight is that it didn't happen  here. There was no crossing over the fence with some coffee for the  neighbors to try to have a meeting, to try to work this out.\n\nIn fact, it was Senator Schumer and Leader…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…their applause because Donald Trump's announcement is  little more than a photo op masquerading at reform, just as he said he  would bring down costs on day one, and it didn't happen--the same thing  here. ``Almost immediately''? Give me a break.\n\nIn case Donald Trump has forgotten, this announcement is like what he  already tried to do in 2020, with little…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690954/prescription-drugs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…think the Republicans and the Congress, in  1977, at the height of Jimmy Carterism, were giving him unlimited  authority to be able to impose tariffs?\n\nYou know that did not happen. He doesn't have the legal authority to  do this, and I can tell you because I was there on the floor of  Congress when it happened in 1977. I know there was no debate on this.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…criminally corrupt  scandal are horrible to look at and think about, but we don't have to  be divided. Together, we can be the solution and send a message that we  will not let this happen again.\n\nHere is my demand: Release the files, every name, every deposition,  every page, unredacted, except to protect the survivors. No more  excuses. No more delays, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…the President wishes to go to war, he must come to the people,  explain his rationale, and get their consent. He is not doing that now.  When he doesn't do that, bad things happen. Bad things are happening  today.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698451/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…generation in a long time, since World War II, have grown up and don't  expect to be better off than their parents.\n\nThat is what the American Dream is all about. It didn't just happen  on accident. There are villains here. Corporate power and corruption  have been eating away at the American Dream.\n\nHedge funds, speculators buying up houses, jacking up the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…of Homeland  Security into this world just two decades ago. We also have the ability  and the authority to build a world without it, and I will work every  day to make that happen.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…unfunded  mandate would cost States a whopping $19 billion each year.\n\nMr. Speaker, where the hell are States going to come up with this  kind of money? They can't. What will happen is, people will get kicked  off of food assistance, and they will go hungry.\n\nState after State has written to Congress begging us not to pass this  awful bill. They have made…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Trump undermining Congress  through his attacks on the bipartisan appropriations process? And when  he does that and the majority--the Republicans in Congress--allow this  to happen, how do the American people lose?\n\nMs. BALDWIN. Thank you.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…since  Kristi Noem became the head of DHS. Although they are not household  names, their lives are no less valuable, and we cannot forget them just  because we didn't see it happen.\n\nBeing detained in an ICE facility should not equal a death sentence.\n\nI recently conducted an oversight visit in Tacoma, and I met with  four of my detained constituents.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…get an in-person  appointment to receive at least an interview about her Social Security  benefits. You would think that we would be delighted that appointment  is going to happen in a couple of days, but this is also bad news  because she had actually reached out to our office in February and is  now getting an appointment in January.\n\nThat is 11 months…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…this violence. There are  countless families and individuals living with the scars of that day.  It is our duty to honor their memory and ensure that attacks like this  never happen again.\n\nWe must remain vigilant against the threats posed by extremist groups  and continue to champion freedom and democracy around the world. We  must also work to strengthen…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…not the billionaire.  If you say ``billionaire'' enough, maybe that shift worker won't know  what you are doing, but Mr. Speaker, they do know. They do know what is  about to happen because everybody is watching this vote. That is a good  thing because that shift worker deserves the extra money back.\n\nIt might not seem like a lot to somebody who deals…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…going unaddressed. Whether it is the Pennsylvania's  Governor's mansion; a couple in Washington, D.C.; or peaceful protests  in Boulder, Colorado, these attacks should not happen, and it is a  tragedy that they continue to happen.\n\nI can speak directly to that as a cop and a soldier for 22 combined  years. I spent the better part of a year in a combat…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…that is, Representative Roy? I have the definition  right here. That is sedition is what that is. That is exactly what it  is. No one wants to say it, but we are seeing it happen.\n\nThis is among Americans in our country. These are our neighbors.  These are people right here in every town who somehow think that,  suddenly, it is okay. Now, there unfortunately…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…have written to Secretary of Health and Human Services, Robert F.  Kennedy, Jr., to ask for an investigation into what happened in  California, into how this was allowed to happen and to any illegal  violations that may have occurred. Specifically, I am asking Secretary  Kennedy to investigate whether Covered California violated  HIPAA or any other laws,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…necessary, as it removes our Armed Forces from hostilities against  a country where there have been no hostilities. The War Powers Act has  no legal bearing on actions that could happen in the future. Yet that  is exactly what this concurrent resolution attempts to do.\n\nTo date, there are no confirmed U.S. servicemembers engaged in combat  with Venezuela.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of open space has been preserved, and the Township is  consistently recognized as one of the best places to live in  Pennsylvania,\n\nMr. Speaker, these accomplishments do not happen by chance. They are  the product of years of thoughtful leadership, careful use of public  resources, and an unwavering commitment to the people of Buckingham  Township. Paul's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698361/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…to go up  on the families across this great country. I don't want the taxes to go  up on the families who I represent in the Fourth District of Ohio. I  don't want that to happen.\n\nI want the borders secured. I want to reduce spending because I know  we are running deficits in the trillions, and we have piled up $36  trillion in debt. I want to help…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…it committee hearings on drugs,  be it committee hearings on depressants, be it committee hearings on  people not doing well at school, they always look for how does this  happen; but they never address the obvious reason why kids do less well  in school or why kids end up committing crimes. They do it because of  the total breakdown in the family.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…the tax rate for the wealthiest Americans did not change. I  want to make sure that it echoes through the next few years, that they  recognize the folks who are working and happen to be earning the most  money will stay at the same exact tax rate.\n\nWhat we did do is help out folks who were hardest hit the last 4  years by higher prices: grocery stores,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…began.''\n\nThat was Chuck Schumer in 2020.\n\nWhat is Chuck Schumer saying today? ``This is reckless. And the  American people are just, this morning, in fear of what is going to  happen here.''\n\nLet me tell you something. The world is a safer place because of what  Donald Trump ordered and what our military carried out this past week.  The Western Hemisphere…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…administration is ostensibly trying to destroy could exploit.\n\nJust as our misguided interventions in the Middle East led to the  proliferation of terrorist organizations, this could happen in  Venezuela, but this time with the proliferation of organized crime. We  could swell the ranks of the cartels with new recruits. Remember what  happened in Iraq, the de-Baathification…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…of grantees  helps keep the door open for veterans seeking mental health services.  The reality is this program is set to expire in September, and we  cannot allow this to happen.\n\nDelay jeopardizes this program. We have big problems to solve. Adding  qualified mental health providers will only help.\n\nI can appreciate the fact that the Senate has a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…at home. Within the next 30  years, after Lyndon Johnson and the Great Society, that 4 percent  increased to over 40 percent. Many other problems came with it.\n\nWhy did that happen? It happened because, right now, we have  approximately 90 programs that you are not eligible for if you are not  in poverty. In other words, for a mother or a father at home…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…happened in  1776. It happened throughout Europe in the darkest days of the 20th  century. It happened in the movements for justice and equality on our  own soil, and it can happen again for the people of Iran.\n\nMr. Speaker, that is our prayer. That is our thought for today. I  yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}]