[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…let's cut it with  the bonus check and bring back the full tax credit and work to expand  opportunities and protections for all mothers, not just this Sunday but  every day.\n\nHappy Mother's Day to all mothers.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690873/being-a-mom-in-trumps-america"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…assistance.\n\nAs we stand here today, Russia's illegal invasion, which is now in  its fourth year, is intensifying to the highest levels of the war,  despite all of the oily, phony, happy talk coming from Vladimir Putin  about seeking peace.\n\nOn Saturday, Russia launched the largest drone assault of the war,  with 805 drones and 13 cruise missiles, killing 5…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…San  Diego to the oldest veteran in our communities, we say thank you. Thank  you for your service. Thank you for your sacrifice. Thank you for never  wavering as a marine.\n\nHappy birthday, U.S. Marine Corps.\n\nSemper Fidelis.\n\nI am happy now to yield to my colleague and friend from Alaska and  fellow marine, U.S. Senator Dan Sullivan.\n\nMr. BLUMENTHAL.…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…many years since George W. Bush was  President, but we estimate that we have saved 25 million lives with  this PEPFAR Program. I am a loyal Democrat and proud of it but was  happy to vote with the Republicans and George W. Bush on that program.  That program was going to be eliminated by this bill that was  considered. It was taken out at the last minute.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Americans lose their health insurance, when they do  nothing to extend the Affordable Care Act tax credits that millions of  Americans are depending on, at a time when they are happy to throw  millions of people off of Medicaid coverage, they decide to change the  subject in order to vilify and demonize a small minority.\n\nThat is a time-honored tactic in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this  President.\n\nDepartment of Justice lawyers, in briefs filed during the case,  promised more than once to repay the tariffs if they lost. We have that  in writing. I am happy to share it with the gentleman and any of my  Republican colleagues. They stated: ``If tariffs imposed on plaintiffs  during these appeals are ultimately held unlawful, then…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…with my comments that they are great poetry, even  though you tell very bad jokes. That is now in the Record forever.\n\nBut we had to choose. There must be winners. I am very happy that  we--Katie and I--through much grueling work, chose some winners. So  there are three categories I am going to give you.\n\nThere is one honorable mention. There is another…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…was at Trump's wedding. We know that Epstein  once called Trump his ``closest friend for 10 years.'' And we have seen  that Trump wrote Epstein a birthday card and said:\n\n``Happy Birthday--and may every day be another wonderful secret.''\n\nAnd the real kicker, we learned yesterday that Trump is in the  Epstein files, and he knows it. The truth is coming…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…this being a  ``disability.'' This is about folks who can drink milk having access to  milk, and it is about honoring our dairy farmers for the work that they  do.\n\nI am really happy to be here with my colleague. I understand Senator  Alsobrooks may have some questions, and I will yield to her for that  purpose.\n\nMr. WELCH. Mr. President, I want to thank…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…will  remember, again, for the rest of their lives. They all brought home a  championship, and they did it with teamwork and pride. They made us all  incredibly, incredibly happy that day.\n\nThey made their school and community and so many smile, so I  congratulate the Falcons.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…mob?\n\nThat is not a partisan point because the Republicans denounced it at  that time as terrorism, as an attack on this institution, as  intolerable, as unacceptable.\n\nI am happy to share with my colleague, who I know wasn't in Congress  at the time, all of the statements made by Republican leaders at that  time begging Donald Trump to send in the National…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…growth.\n\nMr. Speaker, Laredo is a city of hardworking families, a city rich in  heritage, and a city that stands as a testament to the enduring promise  of the American Dream.\n\nHappy 270th birthday to Laredo. May we continue to thrive for  generations to come.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…thrive,  Edith is worthy of the highest praise. Mr. Speaker, I respectfully ask  that you and my other distinguished colleagues join me in wishing Mary  Edith Brown Coleman a very happy 109th birthday.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…discussion of anti-Semitism and the contributions of Jewish  Americans is not an appropriate time to talk about anti-Semitism in the  government, I wonder what is.\n\nI would be very happy to pursue with my new colleague the subject of  Ed Martin. I don't know exactly where he stands on Ed Martin, whether  he opposed the President's withdrawal of his nomination…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…doing.\n\nWe hear all day about the regulations supposedly weighing down our  economy and all about the red tape. Without a doubt--I sit on the  Committee on Small Business--I am happy to talk about red tape, but  these are basic safety standards.\n\nWhat do I know, right? I am here to represent the people of New  Jersey's 10th Congressional District. I don't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…here in Congress to support this initiative and  ensure that it delivers real results for the families and those  suffering with addiction across our country.                Happy 90th Birthday to Sister Paula DelGrosso\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to celebrate the  90th birthday of Sister Paula DelGrosso.\n\nSister Paula's religious…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…time, I was a Member of  the House and appreciated C-SPAN's mission to foster civic engagement  and let the sun shine in on the people's business.\n\nSo, today, I wish C-SPAN2 a happy birthday and thank those who are  dedicated to its mission to bring the people's business to the people  of our country.\n\nC-SPAN does not receive one penny of taxpayer dollars.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I am happy to be here today as a  freshman Member. I didn't know Doug long, but I met him on one of our  first days in the orientation sessions and the planning sessions for  Congress.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…and desert valleys, Pinal County is home to the Casa  Grande Ruins National Monument, Picacho Peak, and way, way more.\n\nIt is an honor to represent Pinal County in Congress. Happy 150th  birthday to Pinal County.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Josie's quick thinking and faith in God will carry her very far in  life. On behalf of everyone in Wisconsin's Eighth District, I want her  to know how proud we are of her and how happy we are that her mother is  doing okay.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debates here. It is about subsidies on top of subsidies. It is  financial engineering. Now, it is healthcare. Why it is healthcare is  because it is easy. It makes the lobbyists happy. It makes the people  receiving the money happy because no one gets cut. No one has to do a  new design. No one has to actually stop new technology. No one has to  fixate on…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…that all the Democratic members and all the Republican members of the  Energy and Water Development Subcommittee have worked out our  differences. It doesn't mean we are all happy, but we have worked them  all out. We also worked out our differences with the House--the  Republicans and the Democrats in the House who sit on what we call  Energy and Water.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…U.S.C. 650).\n\n(9) The term ``simplified acquisition threshold'' has the       meaning given that term in section 134 of title 41, United       States Code.\n\nMr. Speaker, I am happy to support H.R. 872, the Federal Contractor  Cybersecurity Vulnerability Reduction Act.\n\nMr. Speaker, this bill will require Federal contractors to have a  vulnerability disclosure…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…$14.7 billion to the State's economy.\n\nMr. Speaker, I thank our American dairy farmers who work around the  clock to provide nutritious and delicious milk to all Americans.\n\nHappy National Milk Day.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698847/national-milk-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Commerce and the Rocklin community at large.\n\nTherefore, on behalf of the United States House of Representatives, I  join the Rocklin community in wishing Robin Trimble a very happy  retirement and thanking her for her 20 years of contributions to the  Rocklin business community.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…55th  Wing have never wavered in their mission to fly, fight, and win. It is  my great honor to recognize their achievements and salute their history  today. Once again I say, happy birthday to the men and women of the  Fightin' Fifty-Fifth.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…dying every single year. That is pretty sad. That is where the  price is paid.\n\nMr. MAST. Mr. Speaker, before I yield to my colleague, Mr. Issa, I  would ask my colleague--I am happy to yield a moment--would you like to  say 5,000 deaths in New York is an emergency?\n\nCrickets.\n\nWould you like to respond: 5,000 deaths in New York is an emergency.\n\nMr. MAST.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…couple more versions of this in more  detail. I am blessed to also chair the Joint Economic Committee, so I  have people who are much smarter than I am.\n\nMy colleagues will be happy to know that all of our economists now  bathe. It is a running joke, particularly if Members know economists.\n\nWe work through the math that said what would happen if you did…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Mr. Speaker, as he marks a century of life, service, and devotion to  family and country, I am proud to join his loved ones and neighbors in  wishing Mr. Robert Holland a very happy 100th birthday and thanking him  for his steadfast service to our Nation.                Congratulating Warren County Middle School FFA\n\nMr. CLINE. Mr. Speaker, for the first…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, Happy New Year. Congress has a full  plate of issues to work on this year. I look forward to rolling up my  sleeves and continuing my work for the people of Iowa this year, as I…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698485/healthcare"}]