[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the same page, the U.S. does not  need to invade Greenland to protect America. We already have a U.S.  military presence there, and Denmark has basically said that they are  happy to partner with us even further, because our militaries already  work very closely, to make sure that Russia or China doesn't gain a  foothold in the Arctic, so his own justification…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…mob?\n\nThat is not a partisan point because the Republicans denounced it at  that time as terrorism, as an attack on this institution, as  intolerable, as unacceptable.\n\nI am happy to share with my colleague, who I know wasn't in Congress  at the time, all of the statements made by Republican leaders at that  time begging Donald Trump to send in the National…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…millions of Americans and prevent many from losing  healthcare.\n\nMr. Speaker, we speak about life, liberty, and the pursuit of  happiness. We can't be free, it is hard to be happy, and lives are cut  short with no healthcare.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…do this themselves if they  could, because they know that this takes away our strength and our  relationships, and then they will try to jump in. They are laughing.  They are happy because they see us surrendering, because that is what  this is. This is a surrender.\n\nWe cannot be fooled by this budget talk. You know what? Look at it.  These funds really…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…businesses are going  under. American families are worried they won't be able to keep the  lights on, keep food on the table, and keep a roof over their head, but  they are happy about Gulf of America. That will do it.\n\nMillions of Americans risk losing their health insurance if  Republicans' Medicaid cuts go through. Yet, Republicans think this  juvenile…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690942/gulf-of-america-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…program that  helps provide long-term care for a lot of middle-income families in  this country.\n\nMr. Speaker, the notion that we can make all these cuts and don't  worry, be happy, come on. Come on. People can figure this out. The math  is undefeated.\n\nMr. McGOVERN. Mr. Speaker, the gentlewoman essentially, once again,  called me a liar, so I am going…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…lose access to healthcare if the Republican budget  passes. I want to tell you about Alicia and her daughter, one of them.\n\nAlicia's oldest daughter is 11 years old. She is a happy, active, and  confident fifth grader. She has also faced a lifetime of medical  challenges including an immune disorder, a blood disorder, and a spinal  condition.\n\nAlicia…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691465/gop-tax-scam-hurts-women-and-families"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…was at Trump's wedding. We know that Epstein  once called Trump his ``closest friend for 10 years.'' And we have seen  that Trump wrote Epstein a birthday card and said:\n\n``Happy Birthday--and may every day be another wonderful secret.''\n\nAnd the real kicker, we learned yesterday that Trump is in the  Epstein files, and he knows it. The truth is coming…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, happy birthday to the greatest State in the  Union. Mr. Speaker, 175 years ago, California was admitted as the 31st  State in the Union.\n\nFor 175 years, California was built by people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…prohibited this  bill from taking effect until Congress reauthorized the pipeline safety  bill.\n\nUnfortunately, Republicans blocked it from coming to the floor.  Apparently, they are happy to talk about removing environmental  protections for gas pipelines, but are still, I would think, ashamed to  talk about how they are letting vital safety provisions expire.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…package that the House  cleared last week in an overwhelming vote, which contains the CJS,  Energy and Water, and Interior funding bills. In each of these bills, I  am very happy that we protected critical funding and fought off poison  pill riders.\n\nIn the CJS bill, we rejected Trump's plan to slash funding for  scientific research and the National…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bipartisan package that we had hoped would be passed last December but  for Elon Musk.\n\nThis bill is important. I know that back in Asbury Park, in  particular, they will be very happy to know that our Congress is paying  so much attention to American music tourism.\n\nMr. Speaker, I ask for support on both sides of the aisle for the  legislation, and I yield…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…lot of problems. Perhaps that is good. Nonetheless, the fiscal  discipline here is simply not available.\n\nWe now have a $400 million 747-8. I assume the President will be  happy with his new jet when he retires, which cannot happen soon  enough, in my view.\n\nBy the way, we are putting in three divisions that are always ready  to go.\n\nMr. GARAMENDI.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…of all Americans. These mass  firings are a direct affront to that mission.\n\nThe building that houses the Department of Health and Human Services  is named for Minnesota's ``Happy Warrior,'' Vice President Hubert  Humphrey. It has been that way through Democrat and Republican  Presidents. He was a champion for expanding access to healthcare.  Inscribed…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…will  remember, again, for the rest of their lives. They all brought home a  championship, and they did it with teamwork and pride. They made us all  incredibly, incredibly happy that day.\n\nThey made their school and community and so many smile, so I  congratulate the Falcons.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…sacrifice.\n\nI thank him; his wife, Tawny; and his children, Dallas, Ashlynn, and  Teagan, for making sacrifices so our Nation can prosper.\n\nChief Jason, Aim High and have a happy retirement.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…missed by many of us, including  me. We love his family, and we are grateful to him.                        Birthday Wishes To Trey Tenney\n\nMs. TENNEY. Mr. Speaker, I wish a happy birthday to my son, Trey,  today, and congratulate him for being a major in the Marine Corps.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, the basic premise of this bill,  which I am happy to cosponsor, is that we should not have secret laws  in the United States.\n\nA major opportunity that we have right now is to modernize our  government and to rein in the inexorable…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…State Senate. Her dedication to the  healthcare community has left a permanent mark on Minnesota.\n\nMr. Speaker, I thank Mary for her decades of service, and I wish her  a long, happy, and well-deserved retirement.                      Recognizing Richard ``Dick'' Pesek\n\nMrs. FISCHBACH. Mr. Speaker, I rise today to recognize a  distinguished member of the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698583/recognizing-mary-krinkie"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…apartment, which I think is the most generous giveaway of all.\n\nNow, I don't know that it is good that we have created a situation in  which a young person getting pregnant should be happy because of all  the government benefits they are eligible for, but if you look at the  eligibility requirements for every one of these programs, they are  based on what we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…you are a noncitizen in a Federal  election. I tell them, as I said earlier, it is already illegal to  evade Border Patrol and to come into this country, but Joe Biden was  happy not to enforce the law. Millions of illegal immigrants have come  into the United States of America.\n\nThe National Voter Registration Act, as drafted by this body, if you…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…woven into the fabric of our Nation, is nothing short of remarkable. I  urge my colleagues to join me and all of Michigan's Seventh  Congressional District in wishing her a very happy 100th birthday.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…our country and a lifetime of hard work,  faith, and devotion to his family, his community, and this great  country of ours. I ask my colleagues to join me in wishing him a happy  100th birthday and thanking him for a legacy of service that will long  endure.\n\nMr. Stevens, here is to many more. God bless you, and God bless  America.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…overtime. They need to stay on the job. They do that. No tax on  overtime now--that means more money in their pockets to take home.  Firefighters, the nurses in Wyoming--they are happy with what we have  done.\n\nChuck Schumer, who was just talking about it, voted against it. The  Democrats wanted to raise taxes by $4 trillion. How is that going to  help our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, Happy New Year. Congress has a full  plate of issues to work on this year. I look forward to rolling up my  sleeves and continuing my work for the people of Iowa this year, as I…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698485/healthcare"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…congratulate Penn State wrestling, the 2025 NCAA Division 1 national  champions.\n\nContinuing their dominance of NCAA wrestling, the Nittany Lions  brought  their 13th national title to Happy Valley.\n\nUnder the leadership of Coach Cael Sanderson, his team has won 12 of  the last 15 NCAA championships.\n\nPenn State's two individual champions are a testament to the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689222/congratulating-penn-state-wrestling"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I am happy to be here today as a  freshman Member. I didn't know Doug long, but I met him on one of our  first days in the orientation sessions and the planning sessions for  Congress.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…even daily to keep in  touch. She is a social animal who loves being with people and is a  wonderful friend, aunt, and, most of all, mother.\n\nMr. Speaker, I wish Eileen a very happy 100th birthday.                       Honoring the Life of Bob Sekerak\n\nMr. MILLER of Ohio. Mr. Speaker, I rise today to honor the life of  Bob Sekerak, a proud Clevelander.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…person in addition to  a political figure, I understood why people were so attracted to him:  the sheer decency of the man, the sheer authenticity of the man, and,  frankly, the happy warrior style that he approached every single issue  with.\n\nI don't think I have ever been so shocked in my life when I learned  that we had lost him because I knew he was…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698731/9999"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Senate amendment to H.R. 5371, the Continuing Appropriations,  Agriculture, Legislative Branch, Military Construction and Veterans  Affairs, and Extensions Act, 2026, and I am happy to say that it will  end the government shutdown.\n\nThe rule provides 1 hour of debate on the motion equally divided and  controlled by the chair and the ranking member of the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]