[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Bessent said there are actually 18 so-called priority  countries, and those talks would take about 90 days.\n\nIf nobody in this administration can even agree on what is happening  right now, how can they negotiate smart trade deals with nearly every  nation on Earth?\n\nAnonymous White House aides continue to say that Donald Trump is  working to deescalate…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…am here in support of Senator  Kaine's effort to get this body to take a public view on President  Trump's mad declaration that we have a border emergency with Canada  happening right now.\n\nI can tell you that if I go home to Rhode Island and ask people what  the emergency is in their lives, I wouldn't get one person who said:  Oh, we have got a real…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…to the Constitution of article I,  as well, that lays out what our job is, that that is very much under  threat right now.\n\nI feel for my colleague. I don't know what is happening right now. I  hope that we are able to get greater clarity about that, but what we  see and what we saw on that video transpire, I hope that is something  that every American…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…be devastating.\n\nJust earlier last week, I had a townhall at UC-Irvine which I  represent. As many people around the country are beginning to realize,  a lot of what is happening right now is threatening our economic  present but also our economic future.\n\nThere are massive cuts being made to science and research funding for  universities which have…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…Mr. Speaker, the SAVE America Act is back  before the House today, and right along with it is yet another attempt  at voter suppression. It is no coincidence that this is happening right  before the midterm elections.\n\nIn January, the FBI raided the Fulton County election office, my home  county, where I am a voter. That raid was a bold attempt to intimidate…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700000/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…jobs across our region's manufacturing belt, in the  automotive industry, in the energy sectors. The significant harm to our  economy cannot be undone overnight, and it is happening right now as I  speak.\n\nThe regions' economies are intertwined across the Great Lakes, with  iron ore and steel, auto parts and finished vehicles, crude oil and  refined gasoline…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…require more  investigation based on a dynamic assessment of the security situation.\n\nNow, DHS does not publicly release who is getting enhanced screening  or where it may be happening right now, simply because: First, merely  being singled out for enhanced screening does not necessarily mean an  individual poses a threat or has done something illegal; and,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. America, continue to be courageous because what is  happening right now is not normal: The dismantling of agencies,  including today the Department of Education, the firing of teachers,  veterans, military, hacking your personal data,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688627/this-is-not-normal"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…for their billionaire  donors, and for the greedy corporations who write their campaign  checks. Mr. Speaker, if you ever needed proof, then look no further  than what is happening right now.\n\nThey are desperate--desperate--to distract from their own failings.  They are desperate to distract from their betrayal of the middle class.  They are so desperate…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…dollars a year. Across the country, more than 4 million Americans have  already lost or are at risk of losing their healthcare coverage  entirely.\n\nThis isn't a theory. It is happening right now. In Canton, AultCare,  a regional insurer tied to Aultman Hospital, stopped offering some  individual family and small business ACA plans before December 31. That…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…to urge  the Senate to substantively and strategically improve clean energy tax  credit provisions included in the House-passed reconciliation bill.''\n\nI mean, what is happening right now? This may be beyond the  legislative process.\n\nIn this letter, it goes on to say, in relationship to a bill that  every signatory signed and voted for: ``Our position…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…rescissions package continues a destructive Republican  pattern: Cut now and ask questions later. The same thing that is  happening with FEMA and the National Weather Service is happening right  here. Again, use that chain saw; cut, cut, cut--whether it is waste or  whether it is sinew and bone--and then later, say: Oh, maybe we  shouldn't have done that.\n\nAnd…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…this matter and  determining whether there needs to be forward-looking changes. In fact,  I would support some of those forward-looking changes. But that is not  what is happening right here. Instead, without any thoughtful  consideration, this body approved a provision to retroactively rewrite  the law and set up the opportunity for special financial…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…to uphold law enforcement and the rule of law,  and right now we are just seeing a level of sheer criminality and  lawlessness that is unprecedented in history. What is happening right  now makes the Teapot Dome scandal and all of these scandals we read  about in history look like penny-ante stuff.\n\nThe Trump administration is doing everything it can…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…waiver  revoked. That tells me they put together very competent proposals and  that the Nation supported their effort to clean up their air.\n\nBut something different is happening right now. Senate Republicans  are using the Congressional Review Act in ways that Congress never  intended. Of course, the Congressional Review Act says if a rule is  implemented…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to highlight a  remarkable act of kindness happening right here in the State of  Georgia.\n\nGeorgia Tech faculty and staff opened their homes to students who  could not travel home for Thanksgiving. Through a program called Home…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697596/georgia-tech-thanksgiving"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Right now, it can take months and months for the IRS to issue a  replacement for a stolen refund check. That is a long time. Due to the  frequency of mail theft that is happening right now across this great  Nation, many taxpayers are having their replacement checks stolen, as  well. This is truly not acceptable. These outdated IRS regulations are  partially…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…the United States of America.\n\nSome Americans see what is happening in Europe, and they think, would  that ever happen in our country? The reality is, yes. It is happening  right now, right before our very eyes. The enemy is now inside the  gates.\n\nThere are plenty of Muslims that come here, love this country,  assimilate into American culture, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…issue if we are working on a healthcare policy. I have a  big issue if we are working on taking the life of an innocent child.\n\nThere is also an ongoing debate that is happening right now over  chemical abortions--``mifepristone'' if you want to use the medical  term, and there are several generics that are out there as well. This  is an abortion drug…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…brought  American critical mineral mining to its knees and allowed China to take  over.\n\nChina's global mineral dominance is not a threat. It is a reality.  This is what is happening right now because of that philosophy of not  in my backyard, not in our backyard.\n\nThere is a philosophy that it is better in our backyard. We do it  better than anybody. Look…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I bring good news today talking about  what is happening right here in our great House.\n\nFirst and foremost, what I am most pleased about is, isn't it  refreshing that when politicians talk during election time, they  actually for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}]