[{"senator": "Al Green", "party": "Democrat", "sentence": "…They were enslaved. They have never  been given the honor and respect that they merit.\n\nWe have respected days in this country that I appreciate and respect.  We respect Pearl Harbor with a Pearl Harbor remembrance. We respect 9/ 11 with a 9/11 remembrance. We respect the Holocaust; we have a  Holocaust remembrance. We need a Slavery Remembrance Day to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…that has been racked with trauma:  Columbine, Aurora Theater, Club Q, Boulder, and, most recently,  Evergreen High.\n\nI came here because, like so many of my fellow veterans, I harbor  deep resentment for our wars that cost thousands of lives, trillions of  dollars, and decades of lost opportunity.\n\nMr. Speaker, I came here because the American working class…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…MARAD supports 13 public and 50 commercial ports across the Great  Lakes and the St. Lawrence Seaway.\n\nIn my district in northwestern Ohio, the Port of Toledo and Sandusky  Harbor connect us to global markets for energy, metal, farm  commodities, and more.\n\nIn 2024, South Bass Island and the Put-in-Bay Port Authority received  $10.3 million from MARAD…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "Mr. KEATING. Mr. Speaker, I rise today in honor of Freeman Johnson, a  resident of Centerville, Massachusetts and the oldest survivor of the  attack on Pearl Harbor.\n\nBorn on March 11, 1920, Johnson was raised in Waltham, Massachusetts.  After graduating high school, Johnson attended Massachusetts Nautical  School in Boston, presently…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696706/recognizing-freeman-johnson"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…vulnerable constituents isn't just the  right thing to do. It is the smart thing to do.\n\nThe Chronic Disease Flexible Coverage Act codifies IRS guidance to  expand the safe harbor for high deductible health plans offering  predeductible care for chronic conditions. It lets employers offer  first-dollar access to care for patients with diabetes, asthma,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…weight behind Haftar in a bid for       port access and other shares of the country.\n\n``The UAE has this sickness of wanting to control harbors.       They came to buy New York Harbor one time,'' Sahad said.       ``The control of the Libyan harbors, some of them is to be       part of the Libyan oil industry, and to be part of the       financial sector,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…communities.\n\nTribal health clinics, federally qualified health centers, rural  hospitals, and independent providers are facing challenge upon  challenge upon challenge. At Grays Harbor Community Hospital, I saw  firsthand how tariffs are driving up costs for medical devices and  supplies, adding financial strain to already stretched rural  facilities.\n\nThe…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…intelligence is ignored,  manipulated, or kept from those who need it most. In 1941, the U.S.  Navy intercepted communications showing that Japan was planning to  attack Pearl Harbor. That knowledge ended up being of little use  because it was not communicated to the people who could have taken  action to protect the fleet. The result was the devastating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…her.\n\nNow, the episode got rather lost to history. I will put it in a time  context. This is June 9 of 1772. This is more than a year before the  Boston Tea Party up in Boston Harbor. On that occasion, Massachusetts  Colonials painted their faces and boarded a civilian vessel and pushed  tea bags off it into Boston Harbor. That was Massachusetts.\n\nRhode…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…economies and saves lives.\n\nCaptain Dan Jordan, a Columbia River bar pilot, sees this every day.  He said: ``Ships crossing the Columbia River bar face one of the most  dangerous harbor entrances in the world. . . . bar pilots rely on  weather forecasts, real-time buoy data along with wave and current  models . . .'' to safely cross the bar.\n\nI agree with…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Drury as Ohio's 13th Congressional  District Champion of the Week.\n\nJoseph was recently awarded a $50,000 prize for his school's skilled  trades program as a winner of the 2025 Harbor Freight Tools for Schools  Prize for Teaching Excellence. He is 1 of just 25 teachers around the  country to be honored with this award--a true testament to his  determination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…facilities. The       exchange counts as Medicaid spending by states and entitles       them to extra reimbursements from Washington.\n\nThe federal budget bill decreases the ``safe harbor       limit''--or the rate at which states can tax hospitals--from       6 percent to 3.5 percent by 2031, with a phased-in reduction       beginning in 2028.\n\nEven though…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…colonies, and then our Founders decided to form a more perfect  Union where enforceable guardrails would check executive greed. They  pushed those chests of tea into Boston Harbor; they fought a  revolution; they did the hard, messy work of forging a democracy  because they knew that a man who believes he wields all the power but  fears no consequences…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…highest Heroism Award. He has recently been recognized with the  Distinguished Executive Award by the New York City Federal Executive  Board and was inducted as a Hero of the Harbor.\n\nMr. Speaker, please join me in congratulating Joseph Seebode on his  retirement. It is my privilege to recognize his remarkable  contributions to our Nation and offer my…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…$10.4 billion in the indefatigable Army Corps of Engineers.  That is $3.8 billion more than the Trump administration's shortsighted  request.\n\nIt includes more dollars for harbor maintenance. It ensures that our  Great Lakes stay vibrant, our ports on all coasts stay open, and our  water infrastructure is built to last for Mother Nature's complexities…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…rise to recognize Mr. Scottie Cook, a career  and technical education teacher in the Alexander County School System.\n\nIn September, Mr. Cook was recognized as a winner of the Harbor  Freight Tools for Schools Prize for teaching excellence. Mr. Cook was 1  of only 25 winners throughout the entire Nation and the only teacher in  North Carolina to receive…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…operational capacity, and ensuring long-term service to the region.\n\nThe Lakes Pilots Association maintains a close partnership with the  City of Port Huron and other local harbor stakeholders. Their ongoing  collaboration helps preserve the city's identity as a historic port  city, enrich its maritime legacy, and contribute meaningfully to its  economic…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…919) to codify Internal Revenue Service guidance  relating to treatment of certain services and items for chronic  conditions as meeting the preventive care deductible safe harbor for  purposes of high deductible health plans in connection with health  savings accounts.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…overstated. In Idaho, civilian women  worked and volunteered at the Farragut Naval Training Station located  in North Idaho, which was built shortly after the attack on Pearl  Harbor and became the second-largest naval training base in the  country. Their presence was felt across every state, in countless  shipyards, factories, farms, and ranches.\n\nDespite…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697728/world-war-ii-womens-memorial-location-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, October 7, 2023, will probably go down  in history to Americans like December 7, 1941, Pearl Harbor Day.\n\nOn October 7, 2 years ago, Israel experienced a surprise attack from  Hamas. As those under attack rushed to safe rooms and to bomb shelters,  the terrorist group infiltrating…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…TAYLOR. Mr. Speaker, I rise today to recognize the Waverly High  School marching band. The Waverly band recently had the opportunity to  travel to Hawaii and play in the Pearl Harbor Memorial Day Parade. This  parade is an annual event that honors veterans, survivors of the Pearl  Harbor attack, and the men and women who actively serve in our  incredible…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…we have been virtually  unanimous. When we were attacked on 9/11, the vote was virtually  unanimous to go after the people who attacked us. When we were attacked  at Pearl Harbor, once again, the vote was virtually unanimous to go to  war.\n\nJames Wilson, one of the Founders, assured Americans at the  Pennsylvania Ratifying Convention that the proposed…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…project  reflects Steve's commitment to the everyday quality of life for  residents, business owners, and visitors alike.\n\nUnder his leadership, the city also advanced the Harbor Road Advanced  Wastewater Treatment Plant and established the city's first  Community Redevelopment Agency, major infrastructure and policy shifts  that will benefit the community…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…colleagues, after  we returned to the floor that same night, after being taken and hidden  out for a few hours, was that this was the worst disaster and was even  worse than Pearl Harbor. By the way, that was a real attack that killed  2,403 Americans.\n\nAnd I thought at that time: Are you kidding me? What are we talking  about here?\n\nThen almost immediately…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Stevens continued his service, which concluded  in 1945 in the Pacific theater, where he personally witnessed the  signing of the Japanese Instrument of Surrender in Tokyo Harbor,  bringing World War II to its official end.\n\nAfter the war, Mr. Stevens returned to his home in west Texas, where  he worked as a carpenter, helping to build the firehouse…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize the Harbor Beach  High School football team for winning the Michigan Division 8 State  championship last week.\n\nThe Harbor Beach Pirates took home their second State championship in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697371/recognizing-harbor-beach-football-team"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…later than 3 days       after the last day of the period of delay (including any       extension of such period) requested by the law enforcement       official.\n\n(4) Safe harbor applicability.--An online dating service       provider is not liable to a member, a banned member, or a       former member for a claim based on an online dating service…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…stepping up  as a young leader with ideas that will strengthen our community and our  country. Her achievement makes all of Iowa proud.                               Pearl Harbor Day\n\nMrs. MILLER-MEEKS. Mr. Speaker, I remark that Sunday, December 7, is  the 84th anniversary of Pearl Harbor Day, the day that will live in  infamy.\n\nLike 9/11, we must…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…transaction, evaluating a borrower's ability to pay a relatively small  amount. This would be both impractical and inefficient.\n\nThe alternative proposed by the Bureau, a safe harbor charge cap of  $5, would force many banks to exit this product altogether. Credit  unions would also discontinue this service. This would price out the  very consumers who…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…that we return to a posture of strength to defend  America and our citizens. We must clearly and effectively send a  message that the  United States will no longer be a safe harbor for violent foreign  terrorist organizations like Tren de Aragua.\n\nMr. Speaker, I urge all of my colleagues to join me in supporting  this important legislation.\n\nMr. GOLDMAN…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}]