[{"senator": "Nelida Pou", "party": "Democrat", "sentence": "…bill and  block Americans from seeing how it raises their electric bills.\n\nI came to Congress to lower high costs, and I will not stop working  to lower energy costs for hardworking Americans.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694884/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…farms, especially across the American heartland and  communities I represent. Seven of the eight counties I represent in  northwest Ohio are predominantly rural and home to hardworking farmers  who produce the nutritious food that feeds and fuels our Nation. They  deserve our unwavering support because what America makes and grows  makes and grows America.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…they have  to say about what it means to their fiscal well-being. Listen to  constituents. The numbers are staggering.\n\nBy voting for this cruel bill, they are betraying hardworking  Americans by raising costs for all those already struggling to make  ends meet. The President said he was going to reduce the cost of  living. He didn't. He said he would…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688094/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…people who are not the  hardened criminals. Obviously, we are going to be prosecuting rapists  for rape and murderers for murder and so on. He talked about people who  are hardworking immigrants, the kind even President Trump described  when for a moment he said there wouldn't be immigration raids on farms  because the agricultural sector is in crisis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…across our state. In 2025, she  was honored as a ``Legislator of Distinction'' by the league of  Minnesota Cities for her effectiveness and dedication.\n\nSenator Rest is a hardworking, resilient person and an accomplished  legislator. She is also a diehard Twins fan and a devoted grandmother.  Her legacy is felt not only in her legislative achievements,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697262/recognizing-state-senator-ann-rest-for-her-service-to-minnesota"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…refused to extend the  ACA enhanced premium tax credits to help lower healthcare costs for  everyday people. Today, we have a chance to right that wrong and help  out our hardworking Americans.\n\nMr. Speaker, Republicans may not want to admit it publicly, but they  know that the ACA has resulted in historically low insurance rates,  helped millions of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…close, and it adds $5 trillion  to the national debt.\n\nOn behalf of the 750,000 Alabamians that I represent in Alabama's  Seventh Congressional District and the 5 million hardworking  Alabamians, I say  vote ``hell no'' on this bill, and I urge my colleagues to do the same.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693197/one-big-beautiful-bill-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…unique small businesses, small  manufacturers, innovators, entrepreneurs, and training centers. The  innovation story is powered by Michigan's incredible workforce, our  hardworking men and women, and those large concentrations of engineers  that we have. They are from Grand Rapids, Flint, Saginaw, Lansing, and,  of course, all over southeast Michigan,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…describing the place  to be searched, and the persons or things to be seized.''\n\nYet, all across America, from Maine to Minnesota to California and  everywhere in between, hardworking, law-abiding people in the United  States, American citizens, are living in fear of exactly this. They are  afraid to go to work, afraid to go to church, afraid to go to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699310/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…addressed in conference.\n\nDespite Republicans claiming to support farmers and rural  communities, their bill cuts investments in rural America, including  grants that help hardworking Americans buy homes in rural areas and  programs to help build drinking and wastewater infrastructure in rural  communities that need it most.\n\nHouse Republicans are using…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…independent, full lives.\n\nLast week, the Trump administration made it harder for our healthcare  providers to deliver the services that Americans rely on by terminating  10,000 hardworking members of the Department of Health and Human  Services workforce. Under this administration, a total of 20,000 HHS  employees have been illegally fired, putting Americans…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electricity and  engage in prudent resource planning.\n\nWho loves this? Oil and gas companies love it. Investor-owned  utilities love it. They will profit at the expense of hardworking  Americans. Energy generated by wind, solar, and stored in batteries is  often cheaper. It should make up a substantial portion of our  electricity portfolio.\n\nMadam Speaker,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…consider the implications of       hinging the budget reconciliation bill's fate on removing       health care access for millions of our nation's patients.       These are hardworking families, children, seniors, veterans,       and disabled individuals who rely on essential care services.\n\nWe ask the House to construct a path forward that protects…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…differences. Recognize that this is a bill you already supported as  recently as last month. Recognize that it is going to  have a dramatic and consequential impact on a lot of hardworking  Americans in the rural parts of our country. Vote in the affirmative on  the override.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…grants and justice assistance grants.\n\nThe Federal workers I represent know firsthand the disruptions and  uncertainty that come when lawmakers fail to govern responsibly.  Hardworking Americans understand that if you don't do your job, you  don't get paid. Congress should be no different.\n\nI am proud to work with Congressman Fitzpatrick on a bipartisan…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688714/members-of-congress-should-show-up-to-work-without-pay-during-a-shutdown"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…internationally over the next 6 months.\n\nFor Iowans, agriculture isn't just a way of life. It is the backbone  of our economy, and I am deeply committed to supporting Iowa's  hardworking farmers and producers.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Mr. FONG. Mr. Speaker, I rise today in strong support of H.R. 3109,  the REFINER Act.\n\nThis legislation is critical to unleashing our energy potential,  lowering costs for hardworking families, and protecting our national  security.\n\nU.S. refineries are vital to our energy ecosystem. They convert crude  oil into fuels and countless products, ranging from…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…are a core part of my  district and the great State of North Carolina. I am honored to be  their advocate in Washington.\n\nI know firsthand that they are salt-of-the-earth, hardworking  patriots who deserve access to Federal services like their Tribal  counterparts.\n\nWe must take legislative action to fix this problem and amend the  1956 law that currently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…countless regulatory measures that hurt families  and businesses alike.\n\nI believe in America First. That means a Federal Government that gets  out of the way and allows hardworking people to succeed.\n\nRepublicans put America first when we passed the largest tax cut in  American history. We delivered no tax on tips, no tax on overtime, and  tax relief…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…doing that.\n\nThey tried in the 1960s. There were bombings, and there were anti- Vietnam protests, but they failed to bring down America because  Americans themselves are hardworking, and they realized the middle- class lifestyle in America would be like a wildly wealthy lifestyle  everywhere else in the world.\n\nThey failed. They thought: Let's educate…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…included 14,111 convicted criminals, including 1,155 criminal gang  members.\n\nWe cannot allow those kinds of folks who are in our country illegally  to take money away from hardworking Americans who are applying for SBA  taxpayer-backed loans.\n\nI am thankful to see that the tide is now turning and that we have a  new day here in America, but it is important…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…paying for it, Mr.  Chairman. Don't have any illusions about that.\n\nMr. PERRY. Mr. Chairman, there are a lot of things I agree with the  gentlewoman from Ohio about. We have hardworking people. Whether they  are in Harrisburg or in Ohio, they are working-class people. I am one  of them, having spent most of my life turning wrenches, laying in  ditches,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Americans' homes, dictating what  appliances Americans can use or cannot use.\n\nNews flash: This is America. The government has absolutely no  business making these decisions for hardworking families. Consumers,  not Washington bureaucrats, should decide what works best for their  homes and for their families.\n\nYet, thanks to Biden's mandate on his way out the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688295/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…conducted 1,656 people-plant interactions and 287 pet therapy sessions  between April 2021 and March 2023.\n\nThis wasn't emergency aid. It was five-star treatment funded by  hardworking American families, families that are struggling to pay  their own rent and put food on their own table, much less providing  themselves with music, plant, and pet therapy.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…we delivered on President Trump's domestic agenda and provided the  largest tax cut in American history. That is because, as Republicans,  we believe this money belongs to hardworking Americans, not to  Washington bureaucrats.\n\nI couldn't be prouder of this Conference and the Trump administration  for working together in the interests of American citizens…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…one more time that in  Medicaid reform, people with substance use disorder and mental health  issues are exempted from having to comply with the work requirement so  that hardworking taxpayers who go to work will provide the categories  we were just talking about today with Medicaid. They are not going to  provide for the able-bodied. There is an exemption…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…of Pennsylvania to Minnesota, communities across  the United States play a vital role in supporting the HDT industrial  base. This amendment will continue to support the hardworking Americans  who build these trucks.\n\nMadam Chair, I urge my colleagues to support this commonsense  amendment to ensure our servicemembers have the most up-to-date  technology…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…government spending. We have seen it over and over and over again.\n\nEvery time we have tried to get our economy back on track to put more  money in the pockets, by the way, of hardworking families, as we just  succeeded in doing with the One Big Beautiful Bill Act, every step of  the way, the only people trying to block that effort have been  Democrats in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…universal mandate. It even applied to areas known to have no  archeological risk.\n\nThis is about forcing an extreme agenda that weakens our energy  independence and hurts hardworking Americans. The result: higher costs  at the pump, fewer jobs in the energy sector, and a direct hit to our  economy.\n\nThat is why I am proud to stand up today for the American…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…$36  trillion of debt. That is going to be put on the backs not only of our  children and grandchildren, but it is going to be put on the backs of  us as Americans today.\n\nHardworking Americans are watching what we are doing. They are  working hard.\n\nAre we working hard for them?\n\nWe need to come to the table with this reconciliation package. I want…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}]