[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "So everyone in this room has, in  their State, hard-working immigrant families who do not appreciate  being demonized by the President and his policies.", "title": "-9999", "date": "2026-02-03"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "All records are made to be  broken, but it is hard to even imagine any other school's team that  could come close to 12 national titles.", "title": "Congratulating Uconn Women's Basketball Stars", "date": "2025-04-07"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "And this will make lumber and electrical equipment that we need to  build housing--at a time when housing is already in short supply--it  will make them more expensive and harder to find.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, that Republicans have,  working hard to take healthcare away from the American people, than our  vision.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Pete's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.", "title": "Recognizing Pete Rapa", "date": "2025-04-02"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "I thank my fellow Appropriations  Committee members and staff for their extraordinary hard work making  this bill happen.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-08"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "The 28  programs, soon to be 29 with the addition of the Mississippi Sound, and  partnerships will work hard to address challenges we are all familiar  with, like harmful algal blooms, coastal erosion, and runoff pollution.", "title": "Enhancing Science, Treatment, and Upkeep of America's Resilient and Important Estuarine Systems Act", "date": "2025-12-15"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "The Republicans are stealing the hard-earned tax dollars of  Oregonians and Americans to line the pockets of people like Elon Musk.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Instead, their  policies and their failure to act are making life more expensive for  hardworking Americans during a time when inflation and a rise in  grocery prices make it harder for people to get by.", "title": "Protecting Snap From Budget Cuts", "date": "2025-06-04"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Speaker, I am    ========================= END NOTE =========================       honored and proud to represent the people of Pennsylvania, good,\n\nhardworking, patriotic people who are pretty frustrated.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "I am hard-pressed to find somebody out there who is a  billionaire who says he really needs another tax cut.", "title": "Providing for Consideration of H.R. Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, Providing for Consideration of H.R. Special Interest Alien Reporting Act of Providing for Consideration of H.R. Jeremy and Angel Seay and Sergeant Brandon Mendoza Protect Our Communities From Duis Act of and Providing for Consideration of H. Res. Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-24"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "When the truth changes constantly, it is hard to believe that there  is anything true any longer.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "I appreciate so much  the hard work that has gone into this by all of the people who stand  around me for being able to get this to the floor for consideration.", "title": "Procurement and Placement of Statue of Benjamin Franklin in the United States Capitol", "date": "2025-02-26"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Elijah's hard work, determination, and perseverance  at Mandalay Middle School and is clearly just the beginning of a bright  and promising future.", "title": "Recognizing Elijah Stimpfl", "date": "2025-05-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "This award  is a testament to Javier's hard work, determination, and perseverance  at Drake Middle School and is clearly just the beginning of a bright  and promising future.", "title": "Recognizing Javier Rangel", "date": "2025-04-10"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "I thank  Chairman Hill and Chairman Flood for their hard work in getting it to  the floor today where it passed on a bipartisan basis by a vote of 390- 9.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "I am sad as an American to see the defense of these crazy,  divisive, and dangerous ideological programs that my taxpayers in west  Texas are spending their hard-earned money for.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I commend perioperative and procedural teams in hospitals across  Texas' 21st Congressional District for their hard work and dedication  every day to ensure safe environments for procedural and surgical  patients.", "title": "Recognizing National Time Out Day", "date": "2025-06-11"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "It  will be hard for us to track the right kind of people we want to be  able to fill those positions in law enforcement.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Confusing, convoluted, and hard to follow.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low Nox Regulation; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "John Carter", "party": "Republican", "sentence": "His life and career reflect hard  work and selfless service to his nation and Central Texas\n\nEnlisting in the Army after graduating from high school, COL Wilson  honorably served on Active Duty for 29 years and the Texas National  Guard for 3 years.", "title": "Saluting the Service of Colonel Terry Wilson", "date": "2025-04-01"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Speaker, I congratulate Kadyn on her hard work and dedication to  the FFA and the community.", "title": "Congratulating Kadyn Kulzer", "date": "2025-05-20"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Hard-working families are already dealing with the  high cost of everyday goods and services, and they cannot afford this  regulation.", "title": "Providing Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-05-22"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Kacee exemplifies the values  of hard work, dedication, and service, making a profound and lasting  impact on Cass City and beyond.", "title": "Recognizing Kacee Gray As Cass City's 2025 Junior Citizen of the Year", "date": "2025-04-07"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Freedom includes  protecting the rights of others, even when it may be hard and  challenging.", "title": "Recognizing Winners of 2025 Fourth District Congressional Speech Competition", "date": "2025-05-20"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Like many of my colleagues, I want to see Americans rewarded for  their hard work and ensure they are paid what they earn.", "title": "Tipped Employee Protection Act", "date": "2026-01-13"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "The One Big Beautiful Bill Act is for the people who don't have  lobbyists in this town: the farmers; the welders; the waitresses; the  nurses who are pulling double shifts; the truck drivers who are hauling  goods across this country; and the folks who work hard, play by the  rules, and ask only for a fair shot and a government that works for  them, not against them.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Veterans on this Honor Flight from Oregon are: Russell       Bronson, Joyce Button, JoAnn Compton Taplin, James Dahl, Chad       Davenport, Thomas Davis, David Ford, Jerry Fraley, Thomas       Garland, Larry Grow, Eldon Hendrix, Orville Houston, John       James, William Kendrick, William Koreger, Walter Lindner,       James Little, Kenneth Montgomery, Dennis Paul, Richard       Seehawer, Patrick Smith, Gelacio Valdez, Walter Vaughan,       Robert Verlezza, and Allen Ayers.", "title": "Recognizing the Honor Flight of Southern Oregon", "date": "2025-05-15"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "I really hope they cherish  this memory and all of the hard work that they dedicated this season.", "title": "Recognizing Harbor Beach Football Team", "date": "2025-12-03"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "We are fighting for hard-working  Americans.", "title": "-9999", "date": "2025-12-09"}]