[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…is at stake. Allowing Haiti HOPE/HELP  to lapse would not only undercut one of the few functioning economic  pillars in Haiti, but it would also push families deeper into hardship,  increasing migration pressures, and eliminating a key source of  stability in our hemisphere.\n\nCongress must act now. Businesses rely on this critical program both  in Haiti…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…that providing billions of dollars  in tax breaks for a few millionaires and billionaires is worth ordinary  Americans bearing, as Elon Musk put it last year, some temporary  hardship. That hardship brought about by this budget will come in many  forms and may not mean much to the richest man in history, but it will  certainly mean a lot to ordinary people.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is a loaded gun. It is the heart of the family and  their ability to carry on. This just can't happen. It can't happen. We  are the body that has the option of ignoring the hardship and the  catastrophic consequences of this on the families we represent or  sparing them and allowing them to continue having access to healthcare  they depend on.\n\nMr. WELCH.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…district, which proudly boasts the largest population  of ethnically Vietnamese people of any city in the world outside of  Vietnam.\n\nHelen's journey was filled with horror and hardship, but rooted in  hope, hope for a life with freedom and opportunity. We must honor her  hope by living up to the promise of America, by fulfilling our  democratic values, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…longer distances: to Albany, to New Haven, or  to the south Bronx at greater expense, in some cases 4 hours one way on  public transit.\n\nThis is a financial and logistical hardship for people already  fighting for support. With the Westchester County government, my office  and I have identified sites in White Plains close to the current office  that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…chapter of  economic prosperity.\n\nFor Virginians, and millions across the country, that promise remains  unfulfilled. Instead of prosperity, Americans are facing economic  hardship and uncertainty.\n\nThis administration's steep tariffs are taking a real toll here in  Virginia.\n\nI heard from a constituent, like the one who started his own small  business…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…prevention efforts, expanding access to lifesaving screenings, and  working to close gaps in care, we can honor those we have lost and help  spare other families from the hardship of a cancer diagnosis.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…education, a secondary school, or an education program       described in section 3(b)(1)(D)(iii), shall not count toward       the time requirements under this clause.\n\n(2) Hardship exception.--The Secretary shall remove the       conditional basis of an alien's permanent resident status and       grant the alien status as an alien lawfully admitted for…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…into adulthood where they can get jobs. So many of these things  that help to propel these children would be undermined. Just  transportation services going away would create hardship and  devastation on families.\n\nSo here we are in America, when costs are going up, housing is going  up; we are about to have these awful tariffs where the price of  vehicles…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…After such a tragic event, the team rallied together and made the  decision all on their own to play on for Manny and for their injured  teammates. Amazingly, in the face of hardship that came far too early  for those so young, the Santa Clarita Flyers ended up taking home the  championship after a nail-biting final that ended 1-0 in overtime.\n\nHere is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700079/santa-clarita-lady-flyers-tragedy"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…scheme that hurts  middle-class and working-class families and seniors to pay for tax  handouts to billionaires. When Americans already face increased prices  and economic hardship from the President's chaotic policies, Mr. Trump  threatens Social Security--the leading assistance program that 73  million Americans depend on for monthly assistance. This…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…hardworking Americans from falling victim to check theft.\n\nEach year, countless Americans are targeted by criminals who steal  and fraudulently cash their checks, causing financial hardship and  eroding the trust in our banking system. It happens not just in tax  refunds, as my colleagues have indicated. Increasingly, Social Security  and SNAP benefits are also…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…canceled clean energy projects that could have powered  13 million homes, destroying 165,000 jobs in the process.\n\nBehind every statistic is a family that is now experiencing hardship  due to these reckless and painful policies. I recently toured the  Community Food Bank of Southern Arizona, where I heard directly from  staff and volunteers about what these…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and for his  moral clarity and always for his leadership, especially during these  deeply consequential times.\n\nMr. Speaker, every parent hopes that no harm, heartbreak, or hardship  finds their child. We want our children, especially when they are  babies, to know safety, warmth, full bellies, and a peaceful slumber.\n\nWhen they are young, especially…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…than ever and veterans losing their  jobs, I am at a loss--total, absolute loss--to understand how he can  cancel a critical program that helps veterans undergoing financial  hardship to stay in their homes.\n\nI challenge the Secretary of the VA; I challenge the President of the  United States; I challenge my colleagues across the aisle: Instead of  saying…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…churches who saw  people needing a hand up.\n\nToday, I rise to celebrate the 40th anniversary of Beaches Emergency  Assistance Ministry, BEAM, a lifeline for families facing hardship in  eastern Duval County, places like: Mayport, Jacksonville Beach, Neptune  Beach, Atlantic Beach. From keeping the lights on to filling the  pantry, supporting seniors and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "French Hill", "party": "Republican", "sentence": "…capacity for self-initiative, entrepreneurship, and  risk-taking. For those who have concerns about the resolution, I just  invite them to read it.\n\nIt outlines the pain and hardship experienced by millions around the  world who have suffered under socialist regimes. This is something that  the sponsor of the resolution, Congresswoman Salazar of Florida,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…dead mother.  Trump wants Americans to deny what we can see with our own eyes: the  killing of a mother, Renee Nicole Good.\n\nIn the face of all this pain, chaos, and economic hardship, the  American people expect Congress to do something, to ask hard questions  of the administration, to be the check and balance that we were taught  about in school, conduct…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…the very  best of America: faith, family, humility, duty, and service. His life  stands as a living reminder of the generation that answered the call,  endured unimaginable hardship, and secured liberty for generations that  they would never meet.\n\nOn behalf of the people of Florida and a grateful nation, I  congratulate Mr. Duane Brewton on his 109th…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…extends the HOPE and HELP trade preference programs  which provide trade preferences for certain apparel and textile imports  from Haiti.\n\nHaiti has endured years of profound hardship, political instability,  economic collapse, and repeated natural disasters. As our bill author,  Dr. Murphy, shares from his time serving as a medical missionary in  Haiti,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…told them that courage, unity, and faith  could rebuild an entire nation from the brink of ruin.\n\nMr. Speaker, today the Iranian people are living through their own  era of hardship--economic collapse, political oppression, and constant  fear. Yet, they continue to stand, continue to march, and continue to  hope. When the free world faced aggression in…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…local response efforts and guiding recovery planning. His ability to  bring people together, communicate clearly, and keep the public  informed helped Avery County navigate hardship with resilience and  unity.\n\nPhillip's service has been widely recognized for his leadership and  impact. In 2017, he was named Mayland Community College's Distinguished…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…become a real business for criminal organizations and enterprises and  the fraudsters who are preying upon American citizens.\n\nIt is very unfortunate that we are seeing this hardship and stress  placed on the intended recipients who have had to endure seeing their  checks being stolen and then they have to wait months to sometimes see  their replacement…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have declined.\n\nFor many farmers, hemp has proved to be a lifeline, a new cash crop.  Farmers turn to growing hemp to mitigate the losses they endured during  this season of hardship. But that lifeline may soon be extinguished by  this very legislation.\n\nThe effective hemp ban included in this spending package is a result,  we are told, of bad actors skirting…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…consequences are even more  serious. Many of these men and women live hours away from the nearest  VA provider. For them, the exemption has meant timely care without the  cost and hardship of traveling hundreds of miles for a single  appointment.\n\nMr. Speaker, this is not just a matter of convenience. It is a matter  of necessity. It is about ensuring that every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…commitment to his duties, demonstrating an exemplary work  ethic that inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's  dedication never faltered--his presence was a certainty, ensuring that  his community received their mail with the efficiency and reliability  that only a true…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…simply gives  rural communities more time and flexibility to repay the Federal  Government. It extends the repayment period and lowers the interest  rate in cases of economic hardship. It prevents hundreds of millions of  dollars from being stranded mid-construction. It lets communities doing  their part and repaying the government finally access clean…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…greatest Nation in the world should  function. Today that changes.\n\nThe legislation before us reopens the government, restores critical  services, and puts an end to the needless hardship Democrats have  inflicted on the country.\n\nThis bill supports our troops. It pays Federal workers. It fully  funds SNAP benefits until September 30 of next year. It compensates…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…will not be forgotten, and  our local communities must play their part to support nonprofit  organizations that serve Gold Shield families during their time of  grief and hardship.\n\nH. Res. 364 encourages Gold Shield families to turn on these trusted  groups for connection, care, and healing as they navigate life after  loss. This resolution was inspired…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…imperative that we step up and help uplift Haiti out of the present  circumstances.\n\nSince their President was assassinated just a few years ago, the  Haitian people have endured hardship. They have endured political  unrest, and they have endured gangs engaging in kidnapping. The Haitian  people need hope, and they need support from the American people.\n\nThe…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698848/haiti-economic-lift-program-extension-act"}]