[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Madam President, hard-working families in Nevada and all  across this country are struggling to make ends meet because of rising  costs on everything, from groceries to housing, all of which has been  made…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…just stealing money. What I  mean by that is, in New Mexico, if these tax credits go away, it is  going to cost people about $7,000 a year--7,000 bucks--for hard- working, middle-class families. That is taking from their pockets.\n\nIn addition to that, when they go to the grocery store--well, let me  even back up a little. Remember when the President…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…does  not respect State lines.\n\nWe are all in this together to protect our air, water, and human  health. The Trump administration is taking us backwards and hurting  hard-working families in the process.\n\nI firmly oppose the Trump EPA's misguided plan and will continue to  join Senator Whitehouse and my other colleagues in pushing back against  this…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…jobs,  where they are losing--many of them--the funding streams that help  seniors and children to eat, the very least we could do would be to  provide information to hard-working families, like the one I grew up  in, answers about how these tariffs will, in fact, affect them.\n\nAgain, I don't believe that we have to consider the false choice  about whether…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…they refuse to come to the table,  they refuse to have a conversation, and they refuse to work in a  bipartisan way to stop a massive spike in healthcare costs for hard- working families--for all of you. And that is it. That is it. This is  why Trump is about to shut down the entire Federal Government.\n\nYou know, my dad often said: If you don't have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…million people access to  healthcare so they could fund, again, those tax breaks for the  wealthiest, for corporations.\n\nWork requirements only increase the redtape of hard-working families  already burdened by working multiple jobs, caring for children, and  more. They are simply increasing the redtape working families have to  go through to obtain affordable…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…truth is that Republicans are happy to make  permanent massive tax cuts for billionaires in their ``Big Ugly Bill''  but refused--refused--to make permanent tax credits hard-working  families rely on to get their healthcare.\n\nMisplaced priorities are nothing new for Republicans. I was in the  House when we passed the Affordable Care Act--the ACA--which expanded…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…around with--an ``H'' for  healthcare--on their forehead, because they are just going to be  branding themselves, as opposed to providing the healthcare for all  these hard-working families across our country.\n\nAnd when the backbone of our economy, small businesses, can no longer  afford their premiums, they will make tough decisions about hiring,  about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…more Americans suddenly had the peace of mind of  having quality healthcare.\n\nBut faced with high costs, from expensive medications to specialty  treatment, too many hard-working families  are struggling to keep up with the high price of healthcare.\n\nI have heard my colleagues on the Republican side, who didn't support  the bill when it was created,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…supposed to lower prices on day one. Well, we are a lot further than  day one.\n\nI want to be clear about what these tariffs really are. They are an  additional tax on hard-working families, and they increase prices  across the board. Just look at housing. Due to Trump's tariff taxes,  the price of construction materials, appliances, and furniture have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…helping the  government find efficiencies and reduce spending, because if we reduce  spending, two things happen: Either we reduce the taxes that are taken  from the hard-working families and produce the revenue by which  government operates or we eliminate or reduce the amount of debt that  the Federal Government accrues, which right now is at an unsustainable…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…operator costs  increase, fleet upgrades would be impacted, and interstate commerce  would be disrupted. And American consumers would bear the brunt of  increased costs. Hard-working families are already dealing with the  high cost of everyday goods and services, and they cannot afford this  regulation.\n\nLet me be clear. This action is necessary to stop…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]