[{"senator": "Laura Friedman", "party": "Democrat", "sentence": "…House floor, united with every single  House Democrat, to stand in opposition to the Republicans' slash-and- burn budget scheme that will take critical programs away from  hardworking Americans that so many of us rely on, particularly in these  difficult times.\n\nNow, was this done by the Republicans out of a sense of fiscal  responsibility?\n\nWell, I have…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…have watched  markets around the world plummet, prices spike, and our trading  partners hit back with tariffs on American goods that are attacks on  the American people.\n\nHardworking Americans are paying more for food, clothes, cars and  trucks, electronics, and other essential goods. Estimates are that the  Trump tax will cost the average American family…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…expect this Congress to meet the moment with integrity, responsibility,  and the basic respect for the people who we serve. What Republicans did  was an insult to every hardworking taxpayer who plays by the rules and  expects honesty from their government.\n\nRepublicans could have voted it down. They could have passed an  amendment to remove that provision…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…fee, which is designed to control  wasteful methane from the oil and gas industry.\n\nThis resolution is another attempt by Republicans to put corporate  polluters ahead of hardworking American people. Much like their budget  adopted last night, it is a handout for billionaires and large  corporations.\n\nDespite President Trump's promise to cut energy costs,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688185/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…across our state. In 2025, she  was honored as a ``Legislator of Distinction'' by the league of  Minnesota Cities for her effectiveness and dedication.\n\nSenator Rest is a hardworking, resilient person and an accomplished  legislator. She is also a diehard Twins fan and a devoted grandmother.  Her legacy is felt not only in her legislative achievements,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697262/recognizing-state-senator-ann-rest-for-her-service-to-minnesota"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the affordability crisis is real. In fact, he recently said:  ``Affordability is a Democrat scam.'' That is what he actually said.  The President should tell that to the hardworking families who are  facing skyrocketing prices across the board. It is a crisis, and  Republicans are simply ignoring it.\n\nThis bill is basically a thinly veiled attempt by…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…reason? Because the problem they claim to be solving simply doesn't  exist.\n\nWhy are we here today? Why are we debating a bill that addresses a  nonexistent problem while hardworking American families are struggling  with rising costs and economic insecurity? Because Republicans in  Congress don't have real solutions. Rather than addressing the issues…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to say that Americans deserve  a whole lot better.\n\nWe understand that the impact of the big, ugly bill passed a couple  months ago is going to raise the cost of living on hardworking families  across the country. There has been a lot of attention on healthcare  costs in the State of Florida because the Republicans would not  reinstate the cost-saving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…on this framework by waiving entrance, standard amenity, and day-use  fees at over 2,000 Federal recreation sites for law enforcement  officers and firefighters.\n\nThese hardworking Americans put their lives on the line to protect  and serve our communities every day. An America the Beautiful pass is a  small but hopefully meaningful token of appreciation…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Washington should concern every single American in this country.\n\nCongress and the Trump administration should be doing more to lower  costs and improve outcomes for our hardworking families.\n\nAs I have continued to do since I first came to Congress, I have been  committed to addressing the concerns of the families who I am very  honored to represent.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…independent, full lives.\n\nLast week, the Trump administration made it harder for our healthcare  providers to deliver the services that Americans rely on by terminating  10,000 hardworking members of the Department of Health and Human  Services workforce. Under this administration, a total of 20,000 HHS  employees have been illegally fired, putting Americans…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…President Trump has declared bogus international emergencies as a  pretext to tax imports from Canada, Mexico, and then the whole world,  passing these costs right to the hardworking American people. He wanted  to protect his friend, as Mr. McGovern said, former President  Bolsonaro, so he then announced another pseudo emergency to impose yet  more tariffs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695525/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…consider the implications of       hinging the budget reconciliation bill's fate on removing       health care access for millions of our nation's patients.       These are hardworking families, children, seniors, veterans,       and disabled individuals who rely on essential care services.\n\nWe ask the House to construct a path forward that protects…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…with their  own ears, which is the complete corruption of their government from the  inside out.\n\nThe Trump administration's pay-to-play schemes are literally ripping  off hardworking American taxpayers as we speak. We see the evidence  everywhere: A $10 billion payout that Donald Trump, the President of  the United States of America, now demands from…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…grants and justice assistance grants.\n\nThe Federal workers I represent know firsthand the disruptions and  uncertainty that come when lawmakers fail to govern responsibly.  Hardworking Americans understand that if you don't do your job, you  don't get paid. Congress should be no different.\n\nI am proud to work with Congressman Fitzpatrick on a bipartisan…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688714/members-of-congress-should-show-up-to-work-without-pay-during-a-shutdown"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…internationally over the next 6 months.\n\nFor Iowans, agriculture isn't just a way of life. It is the backbone  of our economy, and I am deeply committed to supporting Iowa's  hardworking farmers and producers.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…$260 million for the Federal Treasury.\n\nThis CRA helps the U.S. remain energy dominant and will lower prices  for families, strengthen our economy, and boost real wages for  hardworking men and women. I urge my colleagues to stand with Wyoming,  stand with American workers, and stand for energy security by  supporting this resolution.\n\nMr. WESTERMAN. Mr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…has a seat at the table  again.\n\nAll we are doing is rolling back the senseless and unending  bureaucratic red tape ushered in under the previous administration that  harms hardworking Americans and small businesses.\n\nIn fact, the Department of Energy estimates that these standards on  commercial refrigerators and freezers will cost approximately $8  billion,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689128/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…teachers, and parents, and they are being  crushed by the costly and out-of-touch policies from Washington.\n\nThere is no doubt EV mandates only add further financial strain to  hardworking Americans, especially in my district.\n\nHave you seen an electric tractor, baler, or plow? I haven't because  they  don't work on farms or in the real world. In fact, the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…massive  benefits that my constituents in Indiana and all Americans will reap  thanks to the passage of the working families tax cuts.\n\nI am so pleased we are able to put hardworking taxpayer dollars back  into the pockets of deserving Americans. Mr. Speaker, because of this  important legislation, the critical savings they will now receive can  be poured…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695724/supporting-working-families-tax-cuts"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…are a core part of my  district and the great State of North Carolina. I am honored to be  their advocate in Washington.\n\nI know firsthand that they are salt-of-the-earth, hardworking  patriots who deserve access to Federal services like their Tribal  counterparts.\n\nWe must take legislative action to fix this problem and amend the  1956 law that currently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…to consider possible Fourth Amendment violations during  Operation Arctic Frost.\n\nThat deserved scrutiny. That deserves answers. It doesn't merit  restitution paid for by hardworking waitresses, truck drivers, and  small business owners. Hardworking taxpayers shouldn't be punished to  put millions of dollars into the pockets of a select group of Senators.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…infrastructure and  uphold the gold standard of American aviation.\n\nThe One Big Beautiful Bill Act strengthens our social safety net  while better stewarding the tax dollars of hardworking Americans.\n\nAmericans are generous people, but we cannot allow the government to  abuse that generosity. Programs like Medicaid and SNAP were intended  for the most vulnerable…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…see the largest tax increase in  American history. Just days away from tax day, this is as important a  time as any to put the American people first. We cannot fail the  hardworking Americans who are trusting us to get this done or the small  businesses that rely on consistency in our tax code.\n\nPresident Trump has fully secured our border and eliminated…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…with the Lord in the early morning hours of May 24th.\n\nPeter was the very best of us--a devoted husband to his beloved Grace  for nearly 69 years, a U.S. Army veteran, a hardworking father,  grandfather, and public servant, and a man whose quiet faith was lived  out in every act of service.\n\nFrom the shipyards of Pascagoula to the halls of the Jackson…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691931/special-recognition-of-the-life-of-ae-peter-pierce"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Mr. Speaker, it is a new day in America. Once  again, House Republicans are standing up for hardworking Texans and  Americans by rolling back another harmful rule pushed through by the  Obiden administration.\n\nMr. Speaker, I call him ``Obiden'' because I think he is Obama's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688183/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…inflation caused by the Biden-Harris administration's spending spree,  the Home Appliance Protection and Affordability Act takes important  steps to provide necessary relief to hardworking families. Decisions  about home appliance should be left to American families, not  bureaucrats in Washington.\n\nThe Home Appliance Protection and Affordability Act institutes…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…once the Army Corps of Engineers grants  authorization.\n\nSection 404 of the Clean Water Act exists to safeguard our waters,  not empower radical environmentalists to harass hardworking Americans  with legal hurdles years after permits are granted.\n\nLet me be clear. The days of radical environmentalists holding our  Nation's projects hostage with their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…conversations and friendship that I had with her then and throughout  the 20 years since.\n\nWhen I look at my time serving alongside her, Melissa embodied the  spirit of the hardworking people of Minnesota. She came from a blue- collar upbringing and had a work ethic that drove her to always seek  out solutions rather than seeking out a spotlight for a…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the substance of this bill, let me highlight some  good news. The government is open and funded. SNAP benefits are being  funded. Air traffic controllers, TSA agents, and hardworking people are  getting paid.\n\nOf course, Mr. Speaker, if the Democrats had their way, the Federal  Government would still be shut down. People wouldn't be receiving their…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}]