[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Republicans are now pushing a funding bill that would abandon even  more veterans like Mr. Park. It shifts critical care from the VA to  private corporations and makes it harder for women and immigrant  veterans to get the services they need\n\nThis bill isn't efficiency. It is cruelty. I will not stand by while  Republicans turn our veterans into bargaining…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…mental health, most of  it directed toward kids' school-based mental health, but there were  also significant investments in school safety--just hardening schools  to make it harder for a shooter to get inside and community anti-gun  violence initiatives, which is the work that local community groups are  doing in North Carolina and Connecticut and all…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…less reliable grid with higher  costs because that is what this year has produced. Republican energy  policy is creating a less reliable environment for businesses, making  it harder for companies to invest in America.\n\nJust yesterday, Ford announced they were laying off all 1,600  employees at their battery manufacturing plant in Glendale, Kentucky.  In…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…right thing to do, but it is also  the smart thing to do for the United States. I want to read a quote  from someone who I think understands that. ``It is going to be a lot  harder to recruit someone to anti-Americanism, anti-American terrorism,  if the United States of America was the reason why they are even alive  today.'' This quote, Mr. Speaker,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…humor programs that are fun to  listen to, and others are good music programs. But a lot of it is good  news programs--things deeply appreciated throughout the State but often  harder to access in rural Oregon. So I am concerned about this  concerted attack on rural America.\n\nFirst, my colleagues across the aisle say: We are going to make it  very, very…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…register to vote simply because they changed  their last name after they got married.\n\nWe need to pass legislation to stop billionaires from buying our  elections, not making it harder for the American people to vote. I am  going to vote ``no'' on this bill. I did it last term, and I am going  to do it again. Shame on those who continue to support this kind…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…opportunity to vote on a single  meaningful bill that would help achieve those goals. Grocery prices are  still increasing, housing isn't getting more affordable, and it is  getting harder for families to make ends meet.\n\nYet, we are voting this week on the Gulf of America Act, a bill that  does nothing to lower costs. It has been the same story week after  week.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690692/time-to-focus-on-costs"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it is wildfire season in Oregon, and the  Trump administration is making it harder for fire crews to do their  jobs. I met with them, some of whom voted for the President. They told  me that the funding cuts are a problem, and they don't have the  resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694775/fighting-fire-with-fire"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…employment opportunity complaints without accurate data. Employees will  also have inconsistent records and incorrect gender markers in  Department of Defense systems, making it harder to access health  services.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Garcia (IL)      Garcia (TX)      Gill (TX)      Gillen      Goldman (NY)      Gomez      Gonzalez, V.      Goodlander      Gray      Green, Al (TX)      Grijalva      Harder (CA)      Hayes      Horsford      Houlahan      Hoyle (OR)      Huffman      Ivey      Jackson (IL)      Jacobs      Jayapal      Jeffries      Johnson (GA)      Johnson (TX)…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…better days lie ahead.\n\nThe more I hear from the working people I represent, they are  frustrated with politics. They don't think either party represents  them. They are working harder than ever and are having a hard time  paying their bills. They certainly can't afford to save money.\n\nThey see billionaires on Wall Street and in Silicon Valley get richer…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…services that the  American people rely upon. Here are but two examples:\n\nEarlier this year, Trump tried to shut down Social Security offices  across the country, making it much harder for recipients of Social  Security benefits to call Social Security, find out the information  they needed, and to access their benefits. So Social Security reversed  course…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…President, before I yield my time to the Senator  from Texas, I just want to say this is great news for Nevada. Our bill  just passed. Our hospitality and service staff are working harder than  ever while being squeezed by rising costs. This bill is not the be-all  and end-all, but it is going to offer immediate financial relief while  the Senate continues to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…resurrecting the past.\n\nWhen my mother got disappointed in me when I was a boy--when I was 10  years old--my mother would just say: Eddy, you have to learn how to  work smarter, not harder. Otherwise, your father and I are going to  donate your brain to Harvard Medical School as a completely unused  human organ.\n\nAh, and what did she mean? She meant that you…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…People are struggling more than ever because Trump's economy sucks.  They are making it easier for the elites, easier for the billionaires,  easier for the Epstein class, and harder for everybody else.\n\nMaybe that is why even Republicans are finally acknowledging MAGA was  all a lie. Of course, their members only acknowledge that after they  leave. Let's…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…people are tired of a government that treats every  voluntary interaction between an employer and employee as a potential  crime. They are tired of the 80-20 rules that make it harder for small  businesses. They are tired of joint employer standards that were  designated by union lawyers in Washington to destroy the franchise  model that has provided a path…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…CBO projected when we did the 2017 tax reform, 2018, 2019, just  before the pandemic, they were like 99.5, 99 percent accurate. Don't  tell anyone because it will make it harder for us to lie around here.  Then you get Members saying: But over the next 5 years, they weren't  accurate at all.\n\nDoes anyone remember there was this little thing called…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…child whom they  exploit is unaware. The harm is real. The intent is clear. This  loophole weakens 18 United States Code, section 2251(a), and related  statutes, making it harder to prosecute offenders and easier for  exploiters to walk free and then exploit others and create more  victims.\n\nThe Child Predators Accountability Act of 2025 closes this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Garcia (IL)      Garcia (TX)      Gillen      Golden (ME)      Goldman (NY)      Gomez      Gonzalez, V.      Goodlander      Gottheimer      Gray      Green, Al (TX)      Harder (CA)      Hayes      Himes      Horsford      Houlahan      Hoyer      Hoyle (OR)      Huffman      Ivey      Jackson (IL)      Jacobs      Jayapal      Jeffries      Johnson…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…every one of our communities.  They are often mixed with other illicit drugs, and users are  often unaware of the presence and potent effects, which makes the  danger even harder to stop.\n\nPeople hear stories on a regular basis where kids go out and party.  They shouldn't be using recreational drugs, but they don't deserve to  die. I heard the example…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…supermajority in California is  a conscious decision to put the entire solvency of our system at risk,  to diminish access to care for our own residents, and to, in fact, make  it harder to get appointments because now there is a whole new  population that is looking to get into the system and doing so in a way  that has no precedent anywhere else in the country.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…forced to fight through layers of red  tape just to keep their doors open. Every day, small businesses deal  with outdated, duplicative, or unclear regulations that make it harder  for them to hire, grow, and innovate.\n\nSince 1976, the SBA Office of Advocacy has served as a voice for  small businesses across the country. The Office of Advocacy works…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…while maintaining full investor protections.\n\nThis is a smart and targeted update to our securities laws. It honors  the original intent of the JOBS Act: to make it easier, not harder, for  innovative companies to enter the public markets.\n\nMrs. WAGNER. Mr. Speaker, Mr. Nunn's ELEVATE Act is a smart, targeted  update to our securities law.\n\nI urge all my…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…applying for higher  education financial aid, the assets tied up in the family farm or the  small business should not count against them.  Our bill makes their lives easier, not harder, by leveling the playing  field for these students and families while protecting the American  Dream for every student, regardless of their parents' careers.\n\nOur farmers were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…screening and treatment have improved, we have also learned more about  the accuracy of mammogram tests. However, if you have what is called  dense breast tissue, it can make it harder for the radiologist reading  the mammogram to see the breast cancer. So last year, the Food and Drug  Administration started requiring that all mammogram reports sent to  patients…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that time, given George Gilder's upbringing,  he thought that would be cause for concern for the couple. They would  have to get married right away. They would have to work harder to  support the child.\n\nIt was to George Gilder's surprise and shock that, as he followed  this young couple around, they were thrilled that the woman got  pregnant out of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…them back? Well, Mr. Speaker,  it is quite simply a deck that has been stacked against them by SEC  rules that make accessing investment capital complex, more expensive,  and harder for those who don't live on the East or West Coast who snap  up the lion's share of investment dollars before it can even get to the  heart of the heartland.\n\nIowa's businesses,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…prices drop, jobs flourish, and we become a  net energy exporter.\n\nMr. Speaker, that is the kind of future we should be fighting for,  not where Washington bureaucrats make it harder for American businesses  to succeed.\n\nLet's send a clear message: We stand for affordable energy, good- paying jobs, and an America that leads, not one that follows bad  policies…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688631/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Michigan that Michigan is such a beautiful State. It has got one of the  longest freshwater coastlines of any State. That may be a trivia fact,  but no one is going to fight harder for Michigan's environment than the  people of Michigan. This amendment gives them that authority back, and  so I would ask her to reconsider her opposition.\n\nMr. Chair, I…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…down this  unsustainable path, American families will be forced to deal with even  higher inflation, confiscatory tax rates, rising interest, and a weak  economy. It will be harder to find a job and provide for your family  because the deals made in the Halls of Congress always stick the  taxpayers with the bill. You either are going to have to pay for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}]