[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…stake.\n\nSo, yes, when we hear the Speaker of the House talking about how this  funding--that these are Democrats that are trying to cut resources from  FEMA or make it harder for people to get care through WIC, the program  for women, infants and children--well, look, it is just deception  because what we already know is that the reconciliation bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…entire offices that are  responsible for collecting data on mental health and substance use and  helping people locate treatment services. These actions will only make  it harder for people who are seeking treatment to find care.\n\nThe Trump administration is also eliminating SAMHSA altogether  without congressional reauthorization. It will be combined with…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…have not brought  one single bill to the House floor that would lower energy costs for  hardworking families.\n\nElectricity bills are skyrocketing. It is getting harder and harder  for people to pay their utility bills. Now Republicans and the Trump  administration are making it worse. They have passed the big, ugly bill  to rip away savings and rebates…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Jersey. This is  coming from law enforcement officers that have said that we have  created such a climate of fear in our country that just solving crimes  is getting harder and harder because people are afraid to come to the  police.\n\nSo, yes, we have policies that say there are certain things we won't  do to maintain a community of trust within our communities.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…like ``Groundhog Day'' because, notwithstanding all the  economic turmoil, the conflicts across the globe, the various ways in  which this administration is making life harder for the people of  Colorado, for folks across our country, notwithstanding all the  challenges that our country is grappling with, House Republicans have  decided to spend this week…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…These rules would have made clear that plans cannot use more  restrictive prior authorization, or other medical management  techniques, or narrower networks to make it harder for people to access  mental health and substance use disorder benefits than their medical  benefits.\n\nThese rules would also have closed loopholes and required more than  200 additional…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…billion from Medicare.\n\nThe Senate Republicans released text last night that doesn't just  support these cuts but makes them actually worse, and their changes  would make it harder for people to stay on their insurance. It would  create more paperwork for patients to fill out. It would make it more  difficult for States to fund their healthcare programs, and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I thank the ranking member for yielding.\n\nThis big bonanza bill for billionaires will make life harder for the  people of northwest Ohio and America.\n\nUnemployment is already up in Toledo, hovering around 6 percent. Mr.  Speaker, 1,000 Jeep Gladiator workers in Toledo are idled, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693166/one-big-beautiful-bill-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Instead, their  policies and their failure to act are making life more expensive for  hardworking Americans during a time when inflation and a rise in  grocery prices make it harder for people to get by.\n\nMr. Speaker, let me tell you about Tylynn. Tylynn is a single mother  of four from Wilmington, California, in my district. She fell on hard  times. Tylynn…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…hard time to go into  fields like nursing and teaching.\n\nYet somehow, this administration found a way to make our workforce  shortages in these areas worse and make it harder for people in  professional fields facing shortages.\n\nThe administration just announced a plan that would remove  professions like nursing, teaching, and social work from their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…would impose, they seek, burdensome work requirements for people  on Medicaid. The last proposal coming from Republicans of that work  requirement has one goal: to make it harder for people to qualify for  Medicaid, to slash benefits, and deny up to 36 million people access to  healthcare so they could fund, again, those tax breaks for the  wealthiest, for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the most: kids,  our parents, our neighbors who rely on skilled nursing, and people with  disabilities who especially rely on Medicaid. It is wrong, and it makes  life harder for people back home. It makes their lives more expensive.\n\nPeople want answers, but Republicans have refused to hold townhalls.  Many of them will not even answer the phone. At…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…ANSARI. Mr. Speaker, I rise in firm opposition to the Republican  passage of the so-called SAVE Act, an act of legislative voter  suppression that will make it much harder for most people to vote, the  cornerstone of our democracy.\n\nThis bill, which just passed the Republican House, is designed to  combat a nonexistent problem. Noncitizens are already…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690056/opposing-legislative-voter-suppression"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…millions of Americans. But now, Trump and Musk are threatening to tear  all of that down. They are firing staff. They are plotting to close  down offices. They are making it harder for people to get help over the  telephone.\n\nTrump's pick to head up Social Security, Frank Bisignano, will  rubberstamp Trump and Musk's attack on Social Security. He will let…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…see their taxes increase by more than $1,500. That is higher  taxes on more than 265 million Americans. Instead of making life more  affordable, this is going to make it harder for people to get by.\n\nFor all the talking that Republicans do about cutting the deficit,  with more than $4.5 trillion in tax breaks for the ultrawealthy, this  is an upside-down…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, there is no doubt that  affordability and the cost of living are increasingly salient issues  for many people in this country.\n\nIt is becoming harder for many people to get by, and there are many  reasons for that. I have proposed, and in fact passed, legislation in a  number of areas related to the cost of energy and the cost of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…lab in the trunk of  a car or an abandoned barn or an old house. We dealt with that, as a  matter of public policy, by putting Sudafed behind the counter. We made  it harder for people to pilfer Sudafed and go out and cook up their own  meth. We knew that that was going to cut down the number of clandestine  laboratories, but it wasn't going to decrease…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}]