[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the most of their education, like Devonte, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Devonte's hard work, determination, and perseverance  at Oberon Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Devonte Bonggas-Ellenburg…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691185/recognizing-devonte-bonggas-ellenburg"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…are under attack, and Donald Trump is to blame. We  will not be silent while Trump and his cronies try to slash the  benefits that our seniors have earned over a lifetime of hard work.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691162/threats-to-social-security"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Port Chester-Rye, James Henderson III.\n\nI also recognize other leaders such as Minister Mark McLean, Reverend  Frank Coleman, and Reverend Margaret Fountain-Coleman.\n\nTheir hard work and principled advocacy for equal rights, economic  justice, and education warrants recognition on the floor of the House  of Representatives.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the most of their education, like Alfonze, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Alfonze's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Alfonze…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690988/recognizing-alfonze-romero"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…also continue to look the other way as the Trump  administration and Elon Musk undermine Social Security, threatening the  benefits seniors have earned over a lifetime of hard work. Instead,  they are focusing on refrigerators.\n\nMr. Speaker, I don't know what else to say.\n\nMr. Speaker, I am not trying to disrespect the sponsor of the  resolution. He…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…heading into the workforce, trade school, college, or  embarking on their service at institutions like the Air Force Academy  or Virginia Military Institute, the values of hard work and  determination that they learned as a Falcon will always be with them.\n\nI congratulate the class of 2025 at Fauquier High School.\n\nRecognizing Rappahannock County High…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…result of  these crazy tariffs, and when families are left behind.\n\nI urge my colleagues to reject these bills, to reject the politics of  distraction, and start doing the hard work the American people sent us  here to do. People want us to fight for them. They want us to be  focused on their priorities, on making their lives better; not on the  priorities…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the most of their education, like Crystal, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Crystal's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Crystal…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690329/recognizing-crystal-lozano-gutierrez"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…job--it is my       calling.\n\nI have lived here peacefully, attending church,       participating in community activities, and raising my       children responsibly. Through hard work and sacrifice, I was       able to purchase a home and a car so I could care for my       family and fulfill my responsibilities.\n\nSince this past summer, however, I have…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to recruit local and diverse talent  while building career pathways for educators as a solution to  addressing teacher shortages in communities across the country. Their  hard work and commitment to producing driven teachers is remarkable and  essential to the development of a student's academic success.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688484/recognizing-the-10th-anniversary-of-educators-rising"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…success.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate the Applewood Seed Company on their 60th  anniversary and for their hard work and lasting impact in our  community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695842/recognizing-applewood-seed-company"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…make  the most of their education, like Noah, develop crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Noah's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Noah…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691078/recognizing-noah-trask"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…the most of their education, like Nathan, develop crucial skills and a  work ethic that will guide them for the rest of their lives.  This award is a testament to Nathan's hard work, determination, and  perseverance at Wheat Ridge High School and is clearly just the  beginning of a bright and promising future.\n\nIt is my honor to congratulate Nathan Angel…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691983/recognizing-nathan-angel-perez"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Rodriguez is our Santa Ana chief of police. He fulfilled  a lifelong dream of being an American and serving his great country.\n\nHe inspires our community. I thank him for his hard work. God bless  him and God bless Santa Ana.                       Recognizing Goodwill Industries\n\nMr. CORREA. Mr. Speaker, I rise today to recognize Goodwill  Industries of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…has transformed its small but vibrant  downtown through Delaware's innovative Downtown Development District  program, started by our former Governor, Jack Markell. Through hard  work and dedicated investment, Seaford's Main Street has gone from 90  percent vacancy to more than 90 percent occupancy.\n\nAt the center of the next phase of Seaford's revitalization…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Speaker, I thank Chairman Cole, Ranking Member DeLauro, and  Chairman Rogers for their steady leadership throughout this process,  and I thank the subcommittee staff for their hard work on this  legislation.\n\nMr. Speaker, I urge all Members to support this bill. Our time is  now.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Alaska Native  Vietnam era veterans land allotment program for an additional 5 years.\n\nMr. Speaker, I thank Representative Begich for sponsoring this  legislation, for his hard work on behalf of Alaska Native veterans, and  for ensuring that we keep our promises to those who fought for this  country.\n\nMr. WESTERMAN. Mr. Speaker, this legislation, again,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…thrilling straight-set sweep of 25-20, 25-23,  and 27-25, capping an extraordinary 35-1 season. This victory wasn't  just a win on the court but the culmination of years of hard work,  perseverance, and belief.\n\nLed by veteran Coach Tom Peterson, who has now guided three different  programs to NCAA titles, the Knights embodied excellence in every  sense.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…have served this country in every branch of the  military. They contribute to our society. The Lumbee have a strong  faith in God. They are good friends who value education, hard work, and  community.\n\nI am proud to stand with the Lumbee and urge this body to vote today  to end a decades-long wrong.\n\nMr. ROUZER. Mr. Chair, I yield back the balance of my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…administration, millions of illegal immigrants poured into our country,  threatening the security of our communities and threatening our  elections.\n\nWhile President Trump is hard at work securing our border, it is now  time for Congress to secure our elections from noncitizen voters. This  week, the House will vote on the SAVE Act, legislation that strengthens…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…say they don't have workers like they used to have  workers because they used to have workers who were raised on a dairy  farm, and there is nobody who knows the value of hard work more than  somebody on a dairy farm.\n\nI will tell you that, more recently, other groups have weighed in  since 1937 and said June is their month. It is not their month. June…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692161/june-is-national-dairy-month"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…collaboration, and growth which have led to lowered office referrals,  boosted teacher effectiveness, and 20 percent growth in enrollment.\n\nDr. Morris exemplifies commitment, hard work, and an unwavering  passion for academic success. His recognition as Superintendent of the  Year is not only an incredible personal milestone, but a reflection of  the great…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695857/recognizing-nathan-morris-2026-arkansas-superintendent-of-the-year"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…performance earned him First Team All- Conference honors.\n\nMitch's journey is a powerful reminder that we should never give up  on our dreams. Through dedication, determination, and hard work he made  his vision a reality.\n\nMr. Speaker, I congratulate Mitch on being signed to the NFL. I wish  him the best of luck and continued success with the Seattle Seahawks,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692195/recognizing-mitch-van-vooren"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…While the end of this football season wasn't what the Pioneer team  really had hoped for, each and every one of the football players on  this team should be proud of the hard work that allowed them to reach  the State championship. Their dedication in every game is an  inspiration to their school and community.\n\nI also thank the parents, teachers,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698081/recognizing-pioneer-high-school-football-team"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…staying focused in school, these athletes, trainers, managers, and  coaches showed dedication, strength, and an unwavering commitment to  victory.\n\nI am proud that their hard work has paid off. As these talented  students prepare for their next endeavors, I wish them the best of luck  and blessings for an even brighter and more victorious future.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Mr. Sola is committed to fostering the Central Valley's next  generation of farmers. He spends his time teaching his son, Vin, about  the family business, emphasizing the hard work and dedication needed to  run a successful farm. It is because of farmers like Mr. Sola that the  Central Valley thrives, and I want to thank him for his commitment to  our…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697013/recognizing-vincent-sola"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…their second straight state football  championship. The members of this very special team have shown that  their sport requires an individual effort for a team result. Their hard  work and dedication, both on and off the field, in achieving this  accomplishment, is truly outstanding.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698001/recognizing-avon-high-school-on-winning-the-division-ii-state-football-championship"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…I did above it. Actually,  I really enjoyed that.\n\nI am going to talk first about Stillwater County. In Stillwater  County, the miners of the Sibanye-Stillwater Mine are hard at work  producing the only platinum and palladium that is mined in America.  Years of feckless trade policy on the part of the Biden administration  has allowed malign foreign…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I thank Chairman Cole for yielding.\n\nMr. Speaker, the fiscal year 2026 Homeland Security appropriations  bill is the culmination of the hard work of our committee and our staff  and provides critical investments to protect the American homeland.\n\nAs a member of the Subcommittee on Homeland Security, I know that  this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…recipient of the  Westerman Award--a quarterly honor given to students who demonstrate  outstanding character, leadership, and service.\n\nJayden is a shining example of what hard work, humility, and  dedication to others can achieve. At Cass, she serves as the shop  foreman in the paint trade department, where she leads by example and  fosters excellence…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}]