[{"senator": "Al Green", "party": "Democrat", "sentence": "I applaud your leadership and legal acumen in       recognizing the futility of the claims brought against Texas       under the Biden-Harris administration."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Speaker, number one, Congress has an important role to play in  repealing the Biden-Harris administration's EV mandates and other rules  that are damaging the lives of the American people."}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Time and time again, the Biden-Harris administration imposed new  standards with high price tags."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Americans struggled under crushing inflation driven by the Biden- Harris administration's outrageous spending."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Speaker, as we have heard today, the Biden-Harris administration  DOE's final rule for commercial refrigeration equipment will have a  detrimental impact on small businesses and the consumers."}, {"senator": "Roger Williams", "party": "Republican", "sentence": "For 4 years under the Biden-Harris administration, the SBA approved  loans for illegal immigrants despite their ineligibility."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "In 2023, under the Biden-Harris administration, more than 107,000  people died of drug overdoses, roughly 75,000 of whom died from  synthetic opioids, largely illicit fentanyl, or fentanyl-related  substances."}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "The country rejected the  chaos sowed by the Biden-Harris administration for the past 4 years and  voted for the candidate that could lead our country and make America  strong again."}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "The Biden-Harris administration, as we all know, in many of these  agenda-driven regulations pushed out of Agencies, was a disaster for  American families, businesses, and industries across our Nation."}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Last Congress, the Biden-Harris administration, during an election  year, created VASP instead of implementing a partial-claim program."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "35 to repeal the Biden- Harris administration's natural gas tax."}, {"senator": "Brad Knott", "party": "Republican", "sentence": "The Biden-Harris administration cycled through repeated falsehoods:  claiming the border was secure, claiming they did not have what was  needed to stop this invasion, claiming that they were helpless and  needed Congress to take the lead."}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "The Congressional  Review Act is in response to the Biden-Harris administration's last- minute, overreaching attempt to ban natural gas water heaters."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "42 to repeal yet another  Biden-Harris administration rule that only serves to increase red tape  and costs to manufacturers."}]