[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…potential closing,  and people could die. This is a life-and-death discussion, Mr. Speaker.  All of this is to pay for severe tax cuts for the very wealthy.\n\nThe bill will require harsh work requirements for Medicaid  recipients. It will force people who are ill or sick to go to work to  receive the benefits that the program offers that will terminate  coverage…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of Justice that the certainty of being  caught and quickly punished, not the severity or length of the  sentence, is what deters criminal conduct. Increasing and mandating  harsh, lengthy sentences will not deter illegal reentry, but  strengthening the border will do that.\n\nAccording to The Washington Post, the administration is actually  pressuring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…criminalization and incarceration are not the       answer to complex societal challenges rooted in poverty,       inequality, and disinvestment. True public safety comes not       from harsh punishment, but from transforming the criminal       legal system, investing in community-based supports, and       reimagining safety in ways that are fair, effective, and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to deliver bigger medical bills  to their constituents while President Trump continues to ignore his  promise to cut costs for everyday Americans.\n\nBecause these cuts weren't harsh enough for the Senate, they also  slashed hundreds of billions of dollars in critical support that keep  hospitals and nursing homes open, especially in rural and underserved…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…Chair, I have spoken directly with senior DOD officials who have  shared with me the potential benefits cultivated meat could bring to  readiness. This includes from operating in harsh bases to sustaining  missions where supply lines are contested or disrupted.\n\nKeeping the option open for DOD research and evaluation ensures we  remain competitive and ensures…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…like many other criminal justice reforms, did not happen  overnight. Some Federal judges were in favor of a probationary system,  seeing it as an alternative to the sometimes-harsh penalties they felt  constrained to impose. Other Federal judges were against probation,  believing it too lenient. Congress could not reach agreement on a  national plan.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688628/100th-anniversary-passage-of-the-federal-probation-act-of-1925"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…those  American citizens who were injured, denied medical care, prevented from  contacting their families or lawyers, some of them for days on end,  while detained under very harsh conditions. And it was graphic; it was  gripping. But it was only 4 or 5 examples of 22 individuals we  interviewed who themselves were only a subset of hundreds of American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…amounting to tens of thousands of  potential victims. These crimes have deadly consequences.\n\nNCMEC has identified 36 teens who took their own lives after being  subjected to harsh and incessant harassment from callous perpetrators  of sextortion. The problem is everywhere.\n\nLast May, the U.S. Attorney's Office for the District of Maryland  announced…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…pages who are sitting down and cannot  eyeball me, please join the other pages who are standing so we can have  a better look. I want to look into your eyes just in case my harsh  words make any of you cry.\n\nThat is much better. That is much better.\n\nMr. President, we had a poetry competition. I want you to know this  poetry competition was different…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…the very history  that this day honors is now under attack by the current administration.  While we mark Juneteenth with prayers and proclamations, we must also  confront a harsh and unsettling truth: the significance of this day and  African American history is being erased. Across our Nation, we are  witnessing the systemic losses of our hard-fought…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…families worse off.\n\nWhen manufacturing jobs disappear as costs rise, Ohio families feel  it. Lost jobs and rising costs are not an abstract economic theory for  us. They are a harsh reality. Thousands of families I represent have  been touched. Another company just closed in Fulton County.\n\nMr. Speaker, let's make manufacturing more competitive, not less.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699062/manufacturing-jobs-lost-due-to-trump-tariffs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…current law by  making permanent resident green card holders deportable for a single  infraction even where no one is hurt and no property is damaged. This  will lead to some very harsh results.\n\nIn Arizona, sleeping in your car while drunk without even starting  the car can get you convicted of a misdemeanor DUI. Under this bill, a  single conviction for…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…immigration judges expected  to make their own legal case with a plushy toy.\n\nTrump is also trying to mass cancel protected status for people who  came here who were fleeing harsh conditions and dictators. Trump is  sending Christian refugees and women back to live under the Taliban  where they will face near-certain persecution.\n\nTrump is sending ICE…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Https://www.americanprogress.org/ article/residents-in-at-least-41-states-and-washington-d-c-are-facing- increased-electric-and-natural-gas-bills\n\nMr. Speaker, the big, ugly bill is having a very harsh impact on the  bottom lines of hardworking families, and now Republicans want to offer  a package of bills that is going to make it worse, add insult to  injury.\n\nThey just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…some role in it. Certainly, I       have. Sometimes, I have let my passion rule my reason.       Sometimes I made it harder to find common ground because of       something harsh I said to a colleague. Sometimes I wanted to       win more for the sake of winning than to achieve a contested       policy.\n\nIncremental progress, compromises that each side…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…responsible resource and infrastructure development.  Our oil fields on Alaska's North Slope offer a world-class example of  what it means to responsibly produce energy in a harsh and demanding  environment. The environmentally conscious way in which Alaskans have  applied cutting-edge technology is second to none, utilizing ice roads  and a winter construction…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…that this is the case.\n\nEvery family in the Baltics knows someone shot by the Soviets or sent  to Siberia to die. They have had this experience. The Baltic people  know the harsh reality of living under the Russian thumb and know they  could be next if Ukraine falls.\n\nThe Baltics lead the way on defense spending. They spend more on  defense per GDP…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…in sight than support a basic principle  that if you are able to work, you should.\n\nNow, Mr. Speaker, we have heard noise from across the aisle, words  like ``cruel'' and ``harsh,'' and all the hyperbole you could expect to  be thrown around to score political points from their base. Let me be  clear. Those labels belong not to those fighting for reform…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Michigan--especially  the area's most vulnerable individuals, including those with medical  needs, families with children, and the elderly--remain safe and warm  throughout harsh northern winters. Simply put, these cooperatives help  deliver a quality of life to rural areas that might otherwise be left  behind.\n\nMr. Speaker, it is my honor to recognize…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690150/thanking-northern-michigan-electric-cooperatives-and-linemen-for-restoring-power-throughout-northern-michigan"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…affordable living is being made more difficult  to navigate, and it is American families who are paying the price.\n\nAs one of the fastest growing States in the Nation, this is a harsh  reality for Utahns. We face one of the most expensive housing markets  in the Nation, and too many families are being priced out of the  American Dream.\n\nThe truth is simple.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Hyde amendment in Federal Medicaid programs and other HHS programs.\n\nIt is time to add the Hyde amendment to the ACA.\n\nI believe it is time, as well, for all of us to face the harsh  reality of what abortion does to children and look beyond the slogans  and the surface appeal arguments.\n\nThe so-called abortion pill, mifepristone, is baby poison. It kills…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…this rule and expressed my disapproval last year during the public  comment period. Like many of the rules handed down by the Biden  administration, this effort will have a harsh economic impact while  failing to achieve its own stated goal.\n\nDOE estimates that the rule would carry a minimum price tag of nearly  $1 billion with minimal energy usage…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}]