[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…self-improvement  through meditation based on slow movements and regimented breathing.  For over two decades, Falun Gong practitioners have suffered from  detention, torture and organ harvesting at the hands of the Chinese  government.\n\nWe must fight to raise awareness of those persecuted in China who  cannot raise awareness themselves. On May 5, 2025, the House…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691790/supporting-the-falun-gong-practitioners"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…support of H.R. 1540.\n\nLike H.R. 1503, the Falun Gong Protection Act also imposes sanctions  on individuals who knowingly and directly engage in or facilitate the  involuntary harvesting of organs within the People's Republic of China  while strengthening reporting requirements regarding this heinous  crime.\n\nThese steps are vital to address the forcible…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…most vulnerable in our communities, especially our  seniors, rely on to pay their bills. This will mean more water shutoffs  and more stories of families melting snow and harvesting rainwater to  shower and cook with.\n\nOur policy has to meet our principles. Water must be a human right in  the United States of America.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…for economic profit.\n\nThe State Department's 2023 Human Rights Report highlights troubling  allegations regarding the Government of the People's Republic of China  forcibly harvesting organs from prisoners of conscience, including  religious and spiritual adherents.\n\nMr. Speaker, I worry deeply about the administration's proposed State  Department reorganization…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…promised to protect only a few months before.\n\nThis photograph, taken only a few days ago, is the result of an  illegal Israeli settler beating a 55-year-old woman who was harvesting  olives on her family's ancestral lands, beating her with that club  without mercy, without restraint. Her name is Afaf Abu Alia. She is a  mother, and she is a victim of…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…year-round, family-sustaining jobs, and these are  people without whom we all suffer.\n\nThere is another worker from my district who was fired who was  actually working on harvesting timber. That timber is then sold and  actually makes money for the Federal Government, but those workers were  let go.\n\nI mean, that is not efficiency. It is definitely not…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…administered title I, part C grants, which have been around  since the 1960s, support migrant students. These grants help children  of mobile farmworkers and fishers, people who are harvesting our crops  and putting food on our tables, meet academic standards and graduate  from high school, preparing them to become responsible citizens and  productive employees.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 1540) to provide for the imposition of sanctions with  respect to forced organ harvesting within the People's Republic of  China, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…we had. This PLO withdrew 225,504 acres--that is  nearly a quarter of a million acres--in the Superior National Forest,  which is a working industrial forest where timber harvesting and mining  are desired activities. This ban was a 20-year ban, where, I will note,  again, the Forest Service plan states mining and timber harvesting are  desired activities.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…section of the community and  included businessmen and professionals associated with and directly  involved with the major regional economic activities of mining and  timber harvesting.\n\nThe outbreak of World War II had a profound impact on the activities  of the Rotary Club as many of its members were called to serve in the  U.S. Armed Forces. Those who…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1503) to combat forced organ harvesting and trafficking in  persons for purposes of the removal of organs, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that would carefully       select areas within existing federal lands and define them as       wilderness--areas would be off limits in perpetuity to roads,       timber harvesting, mining and oil/gas exploration and other       commercial activities--and, more importantly in today's       culture, all motorized vehicles: no ATV's or 4-wheelers. But,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…United States, spanning nearly 1.8 million acres  across Arkansas and Oklahoma.\n\nManaged by the U.S. Forest Service, it is a true multiple-use forest,  supporting timber harvesting, wildlife conservation, and a wide range  of outdoor recreation opportunities, such as hiking, hunting, camping,  and fishing.\n\nArkansans take great pride in this forest,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Resources Revenue, and Office of Surface  Mining Reclamation and Enforcement.\n\nIt considers appeals dealing with grazing, mining, energy  development, wildfire management, timber harvesting, trespass, and  more.\n\nThe IBLA's stated mission is: ``to provide an impartial forum within  the Department of the Interior for the fair resolution of disputes  involving…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…have received a share of Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental regulations, has drastically affected county  revenue, creating very real economic impacts in its wake.\n\nFranklin, Garland, Hot…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Gong.\n\nThis popularity triggered a brutal response from the CCP, unleashing  a campaign of illegal detentions, forced labor, torture, and most  horrifically, forced organ harvesting, a practice that amounts to mass  murder.\n\nOn July 20, 1999, the CCP detained hundreds of thousands of Falun  Gong practitioners and banned their practice outright. Since…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…created, nearly 200 million  acres of rural America have been put aside for conservation,  recreation, and responsible natural resource development, like mining  and timber harvesting.\n\nWhen these acres were put aside, rural communities lost their access  to this land for settlement and economic development. To compensate  these communities, they were…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…colleagues in both the House and the Senate  to pass this legislation so that President Trump can end this mandate  and save our American auto industry.                    Harvesting Critical Mineral Resources\n\nMr. JOYCE of Pennsylvania. Madam Speaker, for years, my colleagues  and I in the House and Senate have been sounding the alarm on China's  control…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…noticed and in effect in accordance with''.\n\n(c) Fishing.--Section 2(6) (16 U.S.C. 973(6)) is amended--\n\n(1) in subparagraph (C), by inserting ``for any purpose''       after ``harvesting of fish''; and\n\n(2) by amending subparagraph (F) to read as follows:\n\n``(F) use of any other vessel, vehicle, aircraft, or       hovercraft, for any activity described in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…managing our national forests is critical for both forest  health and the economic health of our rural communities. Congress has  long recognized that responsible timber harvesting is essential for  encouraging that stewardship.\n\nSince many communities throughout the United States, including  Pennsylvania's 15th Congressional District, are located within…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…left has torn down these  safeguards. Mail-in ballots where there is no chain of custody,  counting ballots weeks after election day, counting ballots in secret,  ballot harvesting, same-day registration, turning election day into  election month, and forbidding proof of identity all make cheating easy  and destroy the public's confidence in the process.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…are meant to be collaborative approaches to land management that  balance multiple uses, including energy and mineral production, outdoor  recreation, grazing, and timber harvesting. When done correctly, RMPs  help guide public land management in a way that provides fuel, food,  and fiber for the Nation and conserves our natural resources.\n\nRMPs manage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]