[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…their  lights on. We have farmers across the country but also farmers in  Vermont who are incredibly worried about whether they are going to be  able to make it into the next harvest. We had a drought. We had early  floods. And now we have these tariffs that are increasing the input  costs. I know, Mr. President, as a Senator from Indiana, you are very…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Government  owns over 3 million acres of forestland that pays no taxes to our local  government. Generations of families built their lives and livelihood  around Federal timber harvest, and counties relied on revenue shares  from those sales to fund public services. When the timber industry  collapsed, the revenue shares also disappeared.\n\nCongress made…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697662/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…school meals. Dozens of schools in Westchester and the  Bronx rely on these programs as a way to provide healthy food to  students. Similarly, Feeding Westchester and City Harvest do yeoman's  work to provide food for families and kids in need at the best value.  If fresh food is no longer available, our community will suffer.\n\nThese cuts must be reversed…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…one of three researchers awarded the Nobel Prize in  Chemistry for ``the development of metal-organic frameworks'' that  could be used to help scientists do everything from ``harvest water  from desert air'' to ``capture carbon dioxide'' to ``store toxic gases  or catalyse chemical reactions.''\n\nTogether, each of these Nobel Prize awards represents not…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…pastor, a prophet, a builder, and  a beloved servant whose life of faith, intellect, and action made our  communities stronger and kinder. We mourn his passing, we celebrate his  harvest, and we pledge to carry forward his work of healing, justice,  and spiritual formation.\n\nMay his memory be for a blessing. May his family find comfort in the  countless lives…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…are all fortunate enough to live in the United States of  America, a nation that is rich; it is abundant. A nation that is rich  in agricultural tradition can be abundant in harvest.\n\nNow, in a nation blessed with such abundance, allowing our fellow  Americans to go hungry is, sadly, right now, a policy decision--I would  argue a political decision, not…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…like  America's Arctic, and you dream that someday you or one of your  children can hunt wild ptarmigan on the Coastal Plain, catch an Arctic  char on the Canning River, or harvest caribou in the Brooks Range, you  should vote against these bills and honor the voices of the indigenous  communities and American citizens who depend on this land for survival.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…and visited with the northwest Indiana farmers and  members of the Indiana Soybean Alliance and Indiana Corn Growers  Association.\n\nAt that time, they shared with me during harvest time their grave  concern for skyrocketing input costs, such as insecticides,  fertilizers, and nitrates. These rising costs of goods and services  driven by tariffs and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695660/supporting-farmers"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…without restraint. Her name is Afaf Abu Alia. She is a  mother, and she is a victim of violence. This just happened days ago.\n\nBy the way, October marks the start of the olive harvest season  across the West Bank. Since the start of the harvest, where folks have  to go from their homes to the fields, illegal Israeli settlers have  reportedly staged 158…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "John Thune", "party": "Republican", "sentence": "…opportunities to improve monitoring of       harmful algal blooms and hypoxia, with a particular focus on       waters that may affect fisheries, public health, or       subsistence harvest;\n\n``(F) to evaluate adaptation and mitigation strategies to       address the impacts of harmful algal blooms and hypoxia;\n\n``(G) to support the resilience of the seafood…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Bridgeport Ranger  District, helping maintain campgrounds for the benefit of residents and  visitors alike.\n\nRemarkably, even as he approaches his 100th birthday, he continues to  harvest and donate firewood each winter to neighbors in need, quiet  acts of kindness that say as much about his character as any medal ever  could.\n\nHis legacy of service lives on…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…on internet connections to share data.\n\nIn fact, farmers use information in real time to make smarter  decisions on how to optimize inputs and whether and when to plant or  harvest. When terrestrial or cellular networks are not available,  satellite broadband steps in to make these technologies work.\n\nHowever, it is not just advanced satellite broadband…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…steward our national forests.             Recognizing Environmental Stewardship in Our Forests\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to support the timber  industry and the harvest of trees in our forests.\n\nWhen I was growing up, my father was a forestry professor at  Washington State University and my uncle was a smokejumper. I served in  the U.S. Forest…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…percentage of revenue from timber sales previously alleviated  tax shortfalls, shifting land management priorities in Washington,  D.C., have led to significant declines in timber harvest.\n\nThe Secure Rural Schools program was created to bridge the gap for  our rural communities that continue to be impacted by decades of agency  mismanagement, Federal overregulations,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…of feeding America and the world isn't easy, but I know our  farmers and ranchers take a lot of pride in what they do. They know  they are not just working toward the next harvest; they are keeping a  heritage alive, a way of life that none of us can live without.\n\nI appreciate the work the Appropriations Committee has put in to  support our farmers…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…industry that is the  lifeblood for many of our communities.\n\nFor generations, Arkansas counties with large swaths of Federal  forest land have received a share of Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…China's Secret Solution to Its Dissident Problem,'' has testified  more than half a dozen times in our hearings. Mr. Gutmann has pointed  out that in 1994, the first live organ harvest of death-row prisoners  was performed on the execution grounds of Xinjiang in northwest China.\n\nHe points out that over the years it just kept building and growing,  and then…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…has played a vital role in events such as making chowder,  managing the kitchen for the Gun Raffle, assisting with Fire  Prevention, and supporting Company Field Days and the Harvest Moon 5K.\n\nGary's guidance, leadership, and readiness to help in any capacity  have made him an indispensable member of the Wendelville Volunteer Fire  Company.\n\nMr. Speaker,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…pulp and paper, biomass,  and so much more.\n\nThe U.S. forest products industry employs more than 925,000  Americans, generating a payroll of nearly $80 billion nationwide.\n\nHarvest on national forestland is also critical for supporting rural  school districts through county payments derived from timber sales.\n\nOur forests also provide countless recreational…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…reliance on countries like China  and Russia.\n\nNow, President Trump is finally setting us on the right path by  signing an executive order to expedite our Nation's ability to harvest  the deepsea bed mineral resources that are just off our shorelines.\n\nThis executive order will expedite the review process for exploration  permits and implement a cross-government…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Federal  Government anything. This is a top priority for farmers in my State and  across our Nation. E15 provides an immediate, strong, domestic market  for their bountiful harvest.\n\nE15 is homegrown energy. Year-round E15 eliminates regulatory  uncertainty that prevents the industry from flourishing. It will add  $25.3 billion to the U.S. GDP and support…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699351/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Sending one letter informing these stakeholders of a       rulemaking effort followed by a lack of adequate consultation       and doing so during an importance subsistence harvest period       without granting numerous extensions of time requests from       these same stakeholders fails to comply with the law and       department policy. The BLM Management…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…particularly true, for example, for soybean farmers in  my State of North Dakota, where we export 90 percent of what we grow--a  lot of that going to markets like China.\n\nWith harvest season underway, the Trump administration continues to  fight for better markets for our farmers and ranchers, but in the  meantime, our producers need a bridge to stronger…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}]