[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…elected leaders help to solve.\n\nI can tell you, Mr. Speaker, the one topic that has never come up at  a single townhall that I have held in my career: undersea cables. It  just hasn't come up.\n\nMaybe my colleague in New York has a different experience. I don't  know. I don't know if he hosts townhalls. I would encourage him to do  it. Maybe undersea fiber…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…surely the Trump administration does, as well. Yet, the  Trump administration has let the National Coal Council languish for 3  months. They reestablished it back in June. It hasn't met. No one has  been appointed to lead the council. Remember, those positions don't  require a Senate confirmation or even consultation with the Office of  Presidential Personnel.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…large  industrial facilities like chemical plants, refineries, and pesticide  manufacturers. It is especially troubling because--and I think Mr.  Pallone would agree that this hasn't gotten a lot of play--in that  billionaire boondoggle bill, the big tax giveaway package that is  ruminating here in the Rules Committee right now, the American people  need…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…districts and sell the fertilizer that they have to feed their  constituents, voters, Americans, the fertilizer coming out of this  administration designed to harm everyone that hasn't bent the knee.\n\nMr. Speaker, with that, I yield to the gentleman from the great State  of Rhode Island (Mr. Amo).\n\nMs. KAMLAGER-DOVE. Mr. Speaker, I thank the gentleman from…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…them come to the Senate floor and make that argument. Let  us have this debate. Let us not hide behind some parliamentary maneuver  to even avoid a conversation here.\n\nThere hasn't been a single hearing in committee, an open hearing, on  this subject, not a fulsome debate over the use of our military power.  Let us do so now.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…House Republicans,  that they were going to lower the high cost of living for everyday  Americans. In fact, we were told that Republicans were going to do it  on day one, and it hasn't happened.\n\nPresident Trump and House Republicans told us that they were going to  deliver the golden age of America. Over the last several months, we  haven't witnessed the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…takes  effect immediately. What if States take months or years to amend their  systems? What if they never do it?\n\nYou might have someone interested in voting, but their State hasn't  acted. They have no way of proving that the name on their birth  certificate, which differs from the name on their ID, is because they  got married. They would be unable…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…State--obviously, least of  all, the State that I represent. But what I worry about more than  anything is that this is going to become a normal practice around here,  which it hasn't been until now, where Presidents reward the States that  support them and punish the States that haven't politically.\n\nThat is not how we should run this democracy. That is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to get very serious about that.\n\nIt is not something that the Iranians even have to test. We did not  test the Hiroshima weapon. It was obviously going to work. The physics  hasn't changed in the 80 years since then, so we are at a very  uncertain position on that, and we shouldn't pretend otherwise.\n\nWe have also recently been hearing a lot of calls…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…This is no entitlement. All one has to do  is go to their pay stub where it says FICA, Federal insurance  contribution. Whose money is that? It is your money.\n\nYet, Congress hasn't acted on it. However, we want to give that  opportunity to everyone to act on it.\n\nWhat is especially alarming, Mr. Speaker, is now Mr. Musk--an  unelected official who operates…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Representatives itself publishes on a public website a schedule of its  committee hearings.\n\nI close with a question and a plea. If Republicans support police  officers, why hasn't Speaker Johnson installed the plaque honoring the  brave police officers, including D.C. officers, who defended this  Capitol on January 6? Federal law requires its installation…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are they  looking for?\n\nWhat about the Epstein files? There has been no transparency there.  We had to force a vote in Congress. He reluctantly signed the bill, and  he still hasn't released all the files. Less than 1 percent of the  files have been released. What the hell is taking so long? What is he  so afraid of? What is he hiding?\n\nIt has been clear…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…us. If  this happens, it is on us.\n\nMr. WELCH. I will yield to the Senator.\n\nMr. WELCH. Well, if you are a billionaire, it works out. The fact is,  it can't be explained. It hasn't happened yet. This is about to go into  effect if we don't act as the Senate.\n\nMr. WELCH. Yes.\n\nMr. WELCH. It is the actual imposition of the premium increase. The  only way…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, crypto week has been going so well, hasn't it? Mr.  Speaker, that is because bailing out billionaires is hard work.\n\nI look at how hard Republicans worked to strip healthcare from 17  million Americans, shutter rural…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…can't catch a break, who see life as too  expensive.\n\nPeople are right. The American people understand our economy has been  rigged against so many. I say the American Dream hasn't slipped away;  it has been ripped away.\n\nI am 40 years old. My generation and those younger than me, the first  generation in a long time, since World War II, have grown up…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Congressional Stock Trading Act to  level the playing field and restore public trust in Congress. Every  time I go back to east Tennessee, I get asked by my constituents: Tim,  why hasn't Congress done anything to stop this?\n\nMy answer is simple. It says in my notes that Congress doesn't have  the stomach--but the reality is we don't have the guts, Mr. Speaker--to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Schumer, the Democratic leader, who will be on this  floor in a few minutes, came to this very floor in 2020 and complained  about President Trump, saying President Trump ``hasn't brought an end  to the Maduro regime.''\n\nSenator Chris Van Hollen from the Foreign Relations Committee, a  Democrat from Maryland, told MSNBC just last year--he said:\n\n[T]he…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…were going up under President Biden, thanks to  the new economic policies adopted by the Trump administration and the  Republican Congress.\n\nOne of the things, though, that hasn't come down in price is housing.  I don't need to tell the American people. It is just breathtaking. The  average first-time home buyer in America today--let's just think about…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…giving opportunity to in this  bill? Again, if you are going to vote ``no,'' this is what the ``no''  vote will take away. We actually create something unique in this bill.  It hasn't been talked about yet, but it is in the bill. I am really  proud of it. We create opportunity in school choice for every--not  billionaire--low-income family. Every low-income…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…deal with these consequences.\n\nI am talking about everything from crime against small businesses  forced to close their storefronts to the death of innocent Americans,  and it hasn't stopped, as evidenced by the tragedy in Boulder,  Colorado, earlier this week.\n\nThankfully, President Trump is taking action to restore the rule of  law with executive orders…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692097/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…colleagues to vote ``yes.''\n\nMr. Speaker, it has been an interesting debate.\n\nFrankly, as a couple of my colleagues have suggested, a lot of the  rhetoric on the other side hasn't had much to do with the legislation  in front of us. My friends chose all on their own to shut the  government down 43 days ago.\n\nDuring that time, soldiers have had to worry…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the power of community. We thank him  for the lives he's uplifted, the jobs he's created, and the example he  continues to set for what local leadership should look like.\n\nHe hasn't just carried forward a legacy--he's forged one of his own.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just did this.'' Show them the math  that you just covered about 30 minutes of borrowing, and they look at  you angrily because, my belief is, the political class for so long  hasn't told the truth.\n\nLet's go on our truth binge. Anyone I am making unhappy, grab your  phone, grab your computer, and go hit DOGE.gov. It is right there. It  is live right now.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…with grit and determination. I couldn't be  prouder that, as a community, we have come back together, not as  individuals, but as neighbors, friends, and family.\n\nRebuilding hasn't been easy, but very few things that are worth doing  are easy.\n\nCome Helene or high water, western North Carolina will rebuild. I am  so proud of the resiliency of the people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695797/hurricane-helene"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…number was doubled. We said to middle-income filers,  lower-income filers that we want to give you a significant deduction  and we are going to double that standard deduction. It hasn't been done  for a while. We need to increase this to a really healthy amount. That  simply means that individual and married filing jointly can look at  their tax bill and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…plan would not only  devastate Wyoming's energy workforce but it would raise prices  nationwide.\n\nWe are in a competition. We are in a competition with China that  certainly hasn't backed off on building coal-fired plants. As a matter  of fact, they are building at a rate of about one every 2 or 3 days  coming online because they know they need reliable…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Thune", "party": "Republican", "sentence": "…accomplish when we make appropriations a priority,  when we put in the work, make tough choices, and put it up for a vote.\n\nAppropriations is one of our core responsibilities, but it hasn't  always been treated like the priority that it is. In too many cases in  the past, massive omnibus bills were being written behind closed doors.  That is not how I want to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698828/appropriations"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…deserve to know where every single dollar is spent. That is all DOGE is  doing, in addition to making recommendations on how we can actually  save money.\n\nIn case everyone hasn't noticed, we are running a deficit of $1  trillion, let alone over $36 trillion in overall debt. When I hear the  other side talk about these different adjustments that might…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…use tax dollars to pay  for abortion. That was 50 years ago this year.\n\nIt is amazing to think about how many things have changed in American  attitudes in 50 years. But what hasn't changed is we still haven't come  to an  agreement about abortion. We still haven't been able to resolve that  issue.\n\nNow, science has resolved that issue, but we in American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…for their support.\n\nMr. COMER. Mr. Speaker, I have no further speakers, and I am prepared  to close.\n\nMr. COMER. Mr. Speaker, just to respond to our new colleague here who  hasn't worked in Congress very long, this bill passed constitutional  muster with the House Legislative Counsel, CRS, and various outside  stakeholders. None of our Democrat colleagues…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}]