[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…elected leaders help to solve.\n\nI can tell you, Mr. Speaker, the one topic that has never come up at  a single townhall that I have held in my career: undersea cables. It  just hasn't come up.\n\nMaybe my colleague in New York has a different experience. I don't  know. I don't know if he hosts townhalls. I would encourage him to do  it. Maybe undersea fiber…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that he said: ``The evidence is clear.'' The evidence  is not clear that these standards for commercial refrigerators are  actually worse or a burden on small businesses. He hasn't cited  anything that says that.\n\nHe says that we should have change. That is what we voted for in  November but not change that is going to hurt people or that is  actually…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Party  influence, will be fundamental.\n\nHowever, this bill just doesn't do it. As I said before, it is a  sneaky, sneaky little bill.\n\nIt was introduced the last Congress. It hasn't gone anywhere because  it doesn't solve any problem. It doesn't get to the heart of the  matter.\n\nMr. Speaker, if you look at what they want to do, they say: We are  going…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…districts and sell the fertilizer that they have to feed their  constituents, voters, Americans, the fertilizer coming out of this  administration designed to harm everyone that hasn't bent the knee.\n\nMr. Speaker, with that, I yield to the gentleman from the great State  of Rhode Island (Mr. Amo).\n\nMs. KAMLAGER-DOVE. Mr. Speaker, I thank the gentleman from…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…them come to the Senate floor and make that argument. Let  us have this debate. Let us not hide behind some parliamentary maneuver  to even avoid a conversation here.\n\nThere hasn't been a single hearing in committee, an open hearing, on  this subject, not a fulsome debate over the use of our military power.  Let us do so now.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…full-time work, starting a real estate business, and still  being there for our three other children. It has been overwhelming at  times, and finding the right support for her hasn't always been easy,  but Medicaid has provided therapy and services that have made a world  of difference in her life.\n\n``These therapies have helped her make progress, feel…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…takes  effect immediately. What if States take months or years to amend their  systems? What if they never do it?\n\nYou might have someone interested in voting, but their State hasn't  acted. They have no way of proving that the name on their birth  certificate, which differs from the name on their ID, is because they  got married. They would be unable…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…State--obviously, least of  all, the State that I represent. But what I worry about more than  anything is that this is going to become a normal practice around here,  which it hasn't been until now, where Presidents reward the States that  support them and punish the States that haven't politically.\n\nThat is not how we should run this democracy. That is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to get very serious about that.\n\nIt is not something that the Iranians even have to test. We did not  test the Hiroshima weapon. It was obviously going to work. The physics  hasn't changed in the 80 years since then, so we are at a very  uncertain position on that, and we shouldn't pretend otherwise.\n\nWe have also recently been hearing a lot of calls…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…comprehensive proposal with regard to Social  Security to help everybody across the board, including a 2 percent  overall increase in Social Security--again, something that hasn't been  done since Richard Nixon was President of the United States.\n\nWe also want to make sure that no one receives a below-poverty-level  check from Social Security. Currently,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Representatives itself publishes on a public website a schedule of its  committee hearings.\n\nI close with a question and a plea. If Republicans support police  officers, why hasn't Speaker Johnson installed the plaque honoring the  brave police officers, including D.C. officers, who defended this  Capitol on January 6? Federal law requires its installation…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…anyone in the richest country in history should not have access to  good, quality healthcare.\n\nHow long have we heard that the Republican healthcare plan is coming?  It still hasn't materialized. The reality is that, in the meantime,  reversing the massive premium increases that families across this  country are grappling with is the bare, bare minimum…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…us. If  this happens, it is on us.\n\nMr. WELCH. I will yield to the Senator.\n\nMr. WELCH. Well, if you are a billionaire, it works out. The fact is,  it can't be explained. It hasn't happened yet. This is about to go into  effect if we don't act as the Senate.\n\nMr. WELCH. Yes.\n\nMr. WELCH. It is the actual imposition of the premium increase. The  only way…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, crypto week has been going so well, hasn't it? Mr.  Speaker, that is because bailing out billionaires is hard work.\n\nI look at how hard Republicans worked to strip healthcare from 17  million Americans, shutter rural…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…can't catch a break, who see life as too  expensive.\n\nPeople are right. The American people understand our economy has been  rigged against so many. I say the American Dream hasn't slipped away;  it has been ripped away.\n\nI am 40 years old. My generation and those younger than me, the first  generation in a long time, since World War II, have grown up…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Schumer, the Democratic leader, who will be on this  floor in a few minutes, came to this very floor in 2020 and complained  about President Trump, saying President Trump ``hasn't brought an end  to the Maduro regime.''\n\nSenator Chris Van Hollen from the Foreign Relations Committee, a  Democrat from Maryland, told MSNBC just last year--he said:\n\n[T]he…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…doing so, they are not protecting the very  programs they claim that they are fighting to protect.\n\nAgain, with the CBO, according to the White House press secretary,  there hasn't been a single staffer in the entire Congressional Budget  Office that has contributed to a Republican since the year 2000, but  guess what? Many of the staffers within the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…with grit and determination. I couldn't be  prouder that, as a community, we have come back together, not as  individuals, but as neighbors, friends, and family.\n\nRebuilding hasn't been easy, but very few things that are worth doing  are easy.\n\nCome Helene or high water, western North Carolina will rebuild. I am  so proud of the resiliency of the people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695797/hurricane-helene"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…were going up under President Biden, thanks to  the new economic policies adopted by the Trump administration and the  Republican Congress.\n\nOne of the things, though, that hasn't come down in price is housing.  I don't need to tell the American people. It is just breathtaking. The  average first-time home buyer in America today--let's just think about…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the power of community. We thank him  for the lives he's uplifted, the jobs he's created, and the example he  continues to set for what local leadership should look like.\n\nHe hasn't just carried forward a legacy--he's forged one of his own.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…assets, banned central bank  digital currency.\n\nThat is why my colleague from Minnesota (Mr. Emmer) has moved a bill  to ban central bank digital currency. Unfortunately, it hasn't gotten a  vote on the floor of this House this term in the House of  Representatives, and it doesn't have a clear path through the Senate.\n\nWhile it is the creepiest surveillance…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…use tax dollars to pay  for abortion. That was 50 years ago this year.\n\nIt is amazing to think about how many things have changed in American  attitudes in 50 years. But what hasn't changed is we still haven't come  to an  agreement about abortion. We still haven't been able to resolve that  issue.\n\nNow, science has resolved that issue, but we in American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Mr. MANN. Mr. Speaker, I am proud of the work our Republican  majorities are putting in to deliver American families the largest tax  cut in American history. This process hasn't been easy by any means,  but it is worth every single debate we are having to get it over the  finish line. If we fail to get this bill passed and on President  Trump's desk,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…railed about is why I think he supported the Affordable  Care Act a.k.a. ObamaCare. I thought it was supposed to fix all this  stuff that he wrote about, and we figured out it hasn't. It has wrecked  the system. It is unaffordable for the American people. Yet it was the  Democrats that sold us or sold the American people on it--not us, not  Republicans,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…plan would not only  devastate Wyoming's energy workforce but it would raise prices  nationwide.\n\nWe are in a competition. We are in a competition with China that  certainly hasn't backed off on building coal-fired plants. As a matter  of fact, they are building at a rate of about one every 2 or 3 days  coming online because they know they need reliable…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…strength.\n\nSince the end of the Cold War, the United States' defense industrial  base has severely atrophied, and the Pentagon's overburdensome and  bureaucratic acquisition process hasn't kept up with the speed needed  to procure and field the cutting edge technology.\n\nAs we have seen from conflicts in Ukraine and the Middle East, our  adversaries are not wasting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695150/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…crushed working people's wages.\n\nI want to grow the economy, grow productivity, and make this society  wealthier. We are the only country in the entire industrialized world  that hasn't moved to a talented-based immigration system so that we can  grow and compete.\n\nI am slightly off the rhythm I wanted to use.\n\nIn the 1970s and 1980s, the world competed for…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…going to be tough on crime and tough on  criminals. That is what the theme of this legislation is, Mr. Speaker.  That is our way to reduce crime in Washington, D.C.\n\nTheir way hasn't worked. We are going to do it our way if we get the  support in the Chamber today.\n\nMr. Speaker,\n\nAgain, we are talking about violent crimes, violent crimes. What we  have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…conspiracy  theories. Sixty years after JFK's assassination, we still have  questions being asked. Unfortunately, there are still aspects to that  shooting where the government hasn't been transparent.\n\nThe Biden administration stonewalled my oversight requests. I  strongly urge the new administration to let all the facts breathe,  unlike the last administration.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that will determine how the big, beautiful bill is sent to  President Trump.\n\nOne of those debates involves the State and local tax deduction.\n\nAnother of the debates, which hasn't been as highlighted, involves  President Trump's proposal to reduce the marginal rate on manufacturing  to 15 percent. President Trump is, rightly, obsessed with America being…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}]