[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "One of the things he could do to increase having community banks that  relate to the neighborhoods and relate to the people in the communities  is to stop allowing these big mergers to take place.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act", "date": "2025-05-20"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "I am proud to be an original cosponsor of the resolution, and I thank  my colleague from New York for having the moral courage to offer it.", "title": "Resolution, to Remove United States Armed Forces From Hostilities with Presidentially Designated Terrorist Organizations in the Western Hemisphere", "date": "2025-12-17"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "The terror that inflicts my colleagues  on the other side of the aisle so that they find it impossible to  muster the courage to speak out when they see something wrong and hear  something wrong and, you know, everything going against their morals-- they know it is wrong, but yet they can't speak out--they are  victims of this reign of terror, although I don't absolve them of  responsibility for having no courage.", "title": "Attacks and Threats on Democracy and Rule of Law", "date": "2025-04-29"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Others are facing       the immediate loss of income because their work permits have       expired and they are legally barred from working, despite       having jobs and employers who need them.", "title": "Community Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Speaker, I cannot think of a more critical and all-American cause  or more of a win-win than having the backs of our fire firefighters and  our servicemembers.", "title": "Filling Firefighter Positions on Military Installations", "date": null}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Speaker, I will start just by asking my friend from  Ohio whether he is referring to me when he uses the word ``you'' or if  he is referring more generally to some other people because I would  categorically deny having done any of those things.", "title": "Expressing Support for Local Law Enforcement Officers", "date": "2025-05-13"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "For example, some people were waiting at bus stops and having coffee  when they were then surrounded by ICE agents in unmarked vehicles that  sped up in their direction.", "title": "Weaponization of Ice", "date": "2025-07-16"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "And I have seen the importance of always having a plan for the day  after, something this administration clearly did not do.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "We support having a robust and strong police force and work       closely with MPD leadership to provide them with the tools       they need to make the city safe.", "title": "Prohibiting Voting By Noncitizens in District of Columbia Elections", "date": "2025-06-10"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "The American people gave the MAGA movement a narrow majority 6 months  ago, but now they are having second thoughts.", "title": "Trump's 100 Days", "date": "2025-04-30"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "I am proud of our work because I know what a lifeline our rural  hospitals are for Wisconsinites, from emergency care to having a place  to get regular checkups.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Why are we having two different  standards?", "title": "Genius Act", "date": "2025-06-16"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "This bill not only prevents us from ever having a digital dollar; it  prevents us from even studying a digital dollar.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "That is all people are asking for right now, and we are going to  fight to make sure that every single American can go to bed at night  not having to worry about the answer to that question.", "title": "Stories From Home: the Human Cost of Expiring Healthcare Tax Credits", "date": "2025-11-17"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "This resulted in shower systems  with more than one nozzle having a lower flow rate compared to  individual showerheads.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "Three-fifths of the Senators duly chosen and sworn not having voted  in the affirmative, the motion is not agreed to.", "title": "Cloture Motion", "date": null}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Let's get on our  way to having some accountability for the American people and codify  President Trump's spending reductions into law.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "John Rose", "party": "Republican", "sentence": "Throughout our service on the House Ag Committee, I appreciated  having a partner with similar perspective and values as we worked to  set ag policy.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Now, we are having a big debate, America, on what we should do in  this so-called reconciliation process.", "title": "Fiscal Responsibility", "date": "2025-05-01"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "She will be spending far more time with  family while still having some time for her favorite hobby: helping  with campaigns.", "title": "Recognizing Debbie Luper's Tenure As District Director for the Fourth District of Kansas", "date": "2025-04-30"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "The rules are in place to prevent  a President, at one point in time, from running amok and having  millions of our soldiers strewn around the world.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Their chapter house, a landmark on West  Maple Street, stands as a symbol of tradition and transformation,  having evolved to meet the needs of a growing and dynamic membership.", "title": "Recognizing 100 Years of the Gamma Nu Chapter of Kappa Kappa Gamma", "date": null}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Then there are actually more jobs because  those are jobs associated with the economic activity that results from  having something useful when it comes to transportation.", "title": "Ten Radical Failed Policies of Governor Newsom", "date": "2025-06-06"}, {"senator": "John Rose", "party": "Republican", "sentence": "It enabled them to seek  $500,000, per occurrence, for having their phone data seized by the  Biden FBI.", "title": "Repeal of Senate Payday Provision", "date": "2026-02-04"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Maybe having him watch this distinguished debate  between me and the chairman of the Armed Services Committee has  convinced him to bow to the inevitable, and that is the confirmation of  the Chairman of the Joint Chiefs.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "I think it is just unacceptable that so often they would choose  between finishing their education and having their baby, despite the  Title IX protections that are already in place.", "title": "Pregnant Students' Rights Act", "date": "2026-01-22"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "Having said that, I do think this is pretty clear, Mr.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "It will reduce financial strain on States and local districts,  preventing them from having to cut other essential programs.", "title": "Supporting Our Nation's Children with Disabilities", "date": "2025-04-07"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "There is a lie at the heart of the debate that we are having today  that I have to correct.", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}]