[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…when we expanded Medicaid in Virginia. Part  of why we did it was because we recognized that just because you don't  have health insurance doesn't mean you don't get sick. Not having  health insurance does mean, though, you are less likely to get your  preventative screenings, less likely to go to your primary care doctor  or even have a primary care doctor,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…because political  disagreements, even vast ideological differences, never justify  violence.\n\nThe assassination of Charlie Kirk is a reminder of the imminent  threat that having so many guns in our society poses to all of us, not  just to our immediate safety, but to our freedom and our democracy.  Violence cannot heal division. History teaches us…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…economic gains because of all the back-and-forth  and travel, trips from Canada to the United States are down roughly 20  percent from last year. Towns in the United States are having to put up  signs that say ``We love you, Canadians'' because they feel so dissed  by this administration.\n\nThey are saying: What is happening? We were the first ones on the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…President's words in the Record because the American people  deserve to hear them.\n\n``Dear Jonas, considering your country decided not to give me the  Nobel Peace Prize for having stopped eight wars plus, I no longer feel  an obligation to think purely of peace.''\n\nNow, let's listen to that again. Since he didn't get the prize, the  President of the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…appointed Elon Musk in the role related to DOGE, DOGE was created as a  temporary organization.\n\nElon Musk was appointed as a special government employee, and this  was to avoid having any kind of Senate confirmation or congressional  creation of the agency or any confirmation of Elon Musk.\n\nMr. Speaker, I will remind you that the entire time that Elon Musk…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…Amendment,  that I received the right to vote. It wasn't until 1920, through the  passage of the 19th Amendment, that women received the right to vote.\n\nDespite all men and women having the full Federal right to vote by  1920, States still devised schemes to impose draconian restrictions to  prevent voter registration for people of color.\n\nThese restrictions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…was  nothing there, will not allow for material to be disclosed.\n\nThe Senate said the House shouldn't get involved with the $500,000  that each Senator should get for simply having a phone call noted--not  listened to, not documented, but noted. It is $500,000 for nine  Senators.\n\nThat money should go to the Epstein victims. Truth spoken. Justice  should…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Director Todd Lyons and border czar  Tom Homan.\n\nIn fact, I will say that when I visited my ICE facilities in Santa  Ana a few weeks back, I was repeatedly lied to, including having ICE  government relations people tell me that there had been zero  warrantless raids in Orange County by ICE, DHS, or CBP and that zero  complaints had been filed or litigation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Social Security. This impacts  all 435 congressional districts.\n\nMadam Speaker, you have 161,000 Social Security recipients in your  district. I know that you do not stand for having their personal  information gone through, looked over, and utilized for anything that  was unintended, let alone having been taken from its secure position in  Social Security…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…implements, interprets, or prescribes       law or policy. Therefore, the withdrawal of the Reporting       Requirements satisfies the APA definition of a rule      CRA Exceptions\n\nHaving concluded that the withdrawal of the Reporting       Requirements satisfies the APA definition of a rule, we must       next determine whether any of CRA's three exceptions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…in acts of  violence because, in so doing, you can harm the actual protest movement  itself.\n\nThey were there, unarmed, marching peacefully from Selma to  Montgomery. After having been told by the officers that they must turn  back and peacefully marched on, they were then beaten--clubs, men on  horseback. They were beaten all the way back to the church…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…will struggle financially. We will       not be able to get Will the support he needs to be       independent, get a job, and go to college. It could even mean       one of us having to leave our full-time employment which       could hurt even more. Please don't cut Medicaid.\n\nI also heard from Brooke in Thorp, WI. She shared that because of  Medicaid…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…decision to unilaterally withdraw from the JCPOA in  2018 enabled Iran to advance forward in its nuclear program to the  point that the regime was weeks, if not days, from having sufficient  enriched uranium for multiple nuclear bombs.\n\nSome have assessed that Iran could have built up to 10 nuclear bombs  within a few months or even a few weeks. The…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the snap of their fingers, muster $100 million to try to change the  impact of an election on public policy.\n\nThe last point I want to make is this: This fight that we are having  now in which only Democrats care about changing our campaign finance  laws, in which Republicans almost to a person have no interest in  trying to decrease the influence of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…families, ensuring that no one goes hungry.\n\nI want to personally thank the Neabsco Baptist Church and all the  volunteers for their unwavering commitment and generosity. Having had  the opportunity to join them alongside my team to pack food boxes, I  have witnessed firsthand their compassion and dedication.\n\nMr. Speaker, I ask my colleagues to join…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696800/recognizing-the-neabsco-baptist-church-for-serving-families-in-need"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…consensus.  This is an issue that liberal thinkers and conservative thinkers have  both said is a problem that we ought to address.\n\nJustice Kagan has been quoted widely as having said that it just  cannot be the case that a single district court judge can hold up  Federal policy for the lengthy period of time nationwide that it takes  for the ordinary…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…disagree with my colleagues across the aisle on, yet we  know we can disagree without turning to violence. Charlie Kirk was an  example of this. He did things the right way, having healthy debates  with people who saw differently than him and sparking a movement that  transformed an entire generation. Charlie believed in the promise of  America, and his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…or consider the mass  abduction of Ukrainian children. Thousands of Ukrainian children have  been deported to Russia since the start of the full-scale invasion,  with many having been adopted into Russian families or sent to camps,  where they are subjected to ideological indoctrination designed to  erase their Ukrainian identity.\n\nThe bombing of Ukraine's…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, I thank the Chairman for having this Special  Order here tonight and also for the introduction of the special  resolution that lays out the justification and why we took out Nicolas  Maduro.\n\nMr. Speaker,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…believed when it comes to states of emergency.\n\nWhen I was in the legislature in California, and even in the early  days of COVID, I was very much opposed to the legislature having no  role in determining whether we were in a state of emergency. I  introduced a resolution many times on whether or not the state of  emergency should continue. Therefore,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the hands of the American  people. By doing that, creating health savings accounts where money  flows into the health savings account, the individuals control rather  than having it controlled by the insurance companies. Now, you still  get your insurance in the Marketplace, but now you would have more  dollars at your discretion to decide how you are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…is not helping the American  consumers. That is not helping the American economy, and it is  certainly not helping America on the world stage. It is ridiculous that  we are having to come here and do Congressional Review Acts on horrible  policies that were put in place by the previous administration, but  thank goodness we have the tool to do that.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Chair, I move that the Committee do now  rise.\n\nThe motion was agreed to.\n\nAccordingly, the Committee rose; and the Speaker having assumed the  chair, Mr. Ellzey, Acting Chair of the Committee of the Whole House on  the state of the Union, reported that that Committee, having had under  consideration the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695271/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…its most environmentally unfriendly gas.\n\nMr. Speaker, on top of all of that, while all of these taxes are  supposed to be going toward our roads, we are routinely rated as having  among the very worst roads in the entire country. This is the  extraordinary price that Californians pay for political failure.\n\nMr. Speaker, to try to provide at least some…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…message. Democrats may tolerate crime, but Republicans do not.\n\nMr. Speaker, every American should be able to walk down our streets  without fear of being murdered or raped or having their car broken  into. Every parent should be able to put their child to bed without  wondering if their home is going to be broken into.\n\nMr. GILL of Texas. This bill restores…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Speaker, I certainly thank our  distinguished chair of the subcommittee, Mrs. Wagner of Missouri, for  her daily leadership of our agenda to make America more competitive by  having the most liquid, competitive capital markets in the world. These  bills certainly take a step in that direction to support that goal. I  thank my friend from California (Mr.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692774/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…distinguished  County Commissioner of the Year award from the Indiana County  Commissioners Association.\n\nMike was the architect of many projects that bettered our region such  as having the Auburn Waterloo Trail become part of the Poka-Bache  Connector trail between Angola and Bluffton, Indiana, and the creation  of the Auburn Main Street which collaborates…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689233/recognizing-the-life-of-dekalb-county-commissioner-mike-watson"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…met Father Kelly, I asked him where he is from because  he has an interesting accent, or brogue. He told me: ``I am from the  Holy Land, and I live in the Promised Land.''\n\nHaving served at the Notre Dame of Jerusalem Center for more than a  decade and now serving as the vice director of the Magdala Center,  Father Kelly's work in the Holy Land has impacted…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697127/welcoming-reverend-eamon-kelly"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the perfect example but because they know  the profound human hunger for freedom--the legislator from Burma now  serving in exile; the legislators from Ghana and from Poland having  worked hard to resist corruption, oppression, state power, looking,  yes, to America's example but, frankly, charting their own course  because they know that the future for…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…nights, their annual cheer competition  and during the final matches of the historic Corey Hill Memorial  Wrestling Tournament. As an Athletic Director, Coach Kupcik shares that  having a consistent announcer locked in is always a plus. It's one less  thing to worry about. But having a consistent, amazing, professional- level announcer that transforms a relatively…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}]