[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…geographic  isolation leads to higher costs for goods and services. Their economy  is heavily reliant on tourism, which can ebb and flow with the economy  and natural disasters.\n\nHaving access to affordable credit gives small businesses the ability  to weather the storms and economic uncertainty and fully prepare for  the next opportunity.\n\nThe extension of the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699175/northern-mariana-islands-small-business-access-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…with Senator Warnock, in working with us to try to  get through this so that there is no question about this being a  ``disability.'' This is about folks who can drink milk having access to  milk, and it is about honoring our dairy farmers for the work that they  do.\n\nI am really happy to be here with my colleague. I understand Senator  Alsobrooks may have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…is about getting our message out in  Ukraine, this is about countering the Government of China's propaganda  in the Indo-Asia Pacific, and this is about people in Iran having  access to the internet through VPNs that we helped them to get.\n\nAnd so some of these programs--if you are just a tech guy and you  have been assigned to find things to cut and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…presentation  about a common concern that we have--Republicans and Democrats--and  that is that we do no harm when it comes to the profound insecurity  people are feeling about having access to healthcare for themselves,  for their partners, for their kids.\n\nAnd we have got real differences in this Chamber. Little introductory  remarks about the One Big Beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…The UAE wanted advanced AI chips in order to have an advanced AI  center in the United Arab Emirates.\n\nWell, what did we see transpire?\n\nThe UAE repeatedly advocated for having access to these chips that  the United States had previously said were a security risk.\n\nThen a company closely associated with the UAE buys $2 billion of  Trump's USD1 stablecoin.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Police Department uses these tasers. The Hastings Police  Department uses these tasers. The Brooklyn Park Police Department uses  these tasers.\n\nThis is not about police not having access to this taser technology.  They have it, and they can use it. It is not about that. Please focus  on the bill.\n\nMr. Speaker, I thank the gentleman from Arizona for making…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…including children, pregnant  women, parents, seniors, and individuals with disabilities. Any effort  to reform Medicaid should not inadvertently prevent patients from  having access to the healthcare that they deserve. Danielle, I hear  you.\n\nJudith: She goes right to the point.\n\nPlease stop Trump. Please stop Trump now. He is going after       Medicaid.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…exchange for favorable treatment when he  became President.\n\nNow, he has already given them a lot of favorable treatment, but,  boy, this would be a coup--the oil industry having full access to the  world's largest petroleum reserves.\n\nBut, today, this morning, in our briefing, we did learn that there is  another objective.\n\nYes, Trump wants control of the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…that we do not  leave underserved and rural communities behind. I represent a district  that is geographically predominantly rural. We still struggle with  issues like not having access to the internet in many counties that I  represent.\n\nYou cannot participate in or leverage the benefits of a digital  economy if you can't get on the internet. That is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693778/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…billionaire buddies.\n\nEvery day for the last 6 weeks, we have heard horror stories of mass  firings across the Federal Government, funding freezes, and Elon Musk  and his minions having access to every American's private, personal  financial and healthcare information. This is what I hear about when I  go home. The list goes on. Now, there is a looming government…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike provisions that prevent Americans in rural       communities from having access to Wireless Emergency Alerts       or presidential emergency alerts.\n\nMr. Bennet moves to recommit the bill H.R. 4 to the       Committee on Appropriations with instructions…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…also see kids who are sick and had the promise of getting healthcare,  cancer treatment, women who need maternity facilities or basic  medicines and treatments still not having access to them.\n\nThe Netanyahu government cannot be allowed to, once again, turn on  and off the supply of food and medicine and use it as a military tool.  Withholding fruit…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…need help in our country or are we OK with the  poorest among us, the weakest among us--those who are disabled, those  who are elderly, those who are children--just not having access to  care?\n\nAs the Senator said, when you look around at the math--right?--this  isn't a political statement. The math of needing to find $880 billion  with a ``b''--the…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…personal data and records.\n\nTo all Social Security recipients and all Americans out there that  are tuned in to this, understand what this is about. This is about DOGE  having access to the more than 70 million Social Security recipients  and everybody who, in fact, is on Social Security, which will include  basically the whole Nation.\n\nWhy they need…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…expansion of ObamaCare actually put 90 cents on the dollar for able- bodied adults. They robbed our most vulnerable--our disabled, blind,  and pregnant fellow Americans--of having access to healthcare, reducing  the quality of outcomes over the years. That was a policy of the  Democrats, and there are many others that need to be reversed.\n\nMr. ARRINGTON.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…of contractors working on  behalf of Federal departments and agencies. The Federal Government  awards over 11 million contracts annually, with many of those  contractors having access to Federal systems and vast amounts of  sensitive information, including personally identifiable information of  American citizens.\n\nMy bill, the Federal Contractor Cybersecurity…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…equivalent nondairy options, to be served in schools.  This corrects a decades-old policy made here in Congress that  consequently created over 10 years of kids without having access to  whole milk in schools and, indeed, created a whole generation of young  Americans with weak bones.\n\nPassing the Whole Milk for Health Kids Act through the Senate is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}]