[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…William County Board of Supervisors  starting in 2023.\n\nA husband and a father of three, Bob dedicated the past two decades  to serving his community. He served terms on the Haymarket Town Council  and Planning Commission and over 2 years on the County Board of  Supervisors, all focused on empowering his constituents in Prince  William County to demand…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…continuing to support them as  they continue to grow their businesses in one of the best places to do  business in the country: Northern Virginia.                  Recognizing Haymarket Gainesville Library\n\nMr. SUBRAMANYAM. Madam Speaker, I rise to recognize and thank the  Haymarket Gainesville Library for having a new collection of books in  Nepali.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…boarded-up businesses. Not much of that  past is left there today, except for a few brick buildings and  Chicago's largest addiction and mental health treatment facility,  Haymarket Center, which is celebrating its 50th anniversary this year.\n\nWhen Haymarket Center was founded in 1975, not many people would  venture to the West Loop. Many locals were…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…insecurity. They have been giving out hundreds of thousands of meals,  very rarely ever turning away anyone.\n\nThe ones in my community include ones like Dulles South Food Pantry,  Haymarket Regional Food Pantry, Mobile Hope, Northern Virginia Food  Rescue, Creating Foundations for Hope, House of Mercy Food Pantry, and,  of course, Loudoun Hunger Relief. They…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696984/recognizing-food-pantries"}]