[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Mr. Speaker, I thank the gentleman for  yielding.\n\nMr. Speaker, I rise today in strong opposition to this bill. I am a  ``hell no'' vote on any legislation that strips healthcare away from  millions of Texans.\n\nIn my district, nearly 100,000 of my constituents rely on the  Affordable Care Act's tax credits to pay for their coverage. Without  these lifesaving…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696691/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…agenda was sinking  here in the House, as Elon Musk was taking to Twitter for days trying  to take down his signature bill, his big abomination of a bill that  would strip healthcare away from millions of Americans, Medicaid and  Medicare, that would take food out of the mouths of millions of  American children, that would cut programs that people across…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…extreme anti- abortion agenda.\n\nIf Republicans truly cared about pregnant women and families, we  would be debating how to undo their $1 trillion cut to Medicaid, which  rips healthcare away from millions of pregnant women, new mothers, and  children, and how to help the millions of women seeing their health  insurance premiums skyrocket due to months of Republican…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…what is really  happening here. And if I were them, I would be ashamed of it and trying  to hide it too.\n\nBut they can't hide from the fact that they are about to take  healthcare away from children. It is really that simple. And so why?  Why are we cutting access to healthcare? A human  right to 1.3 million children in Georgia, quarter of a million…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…next,  you will admonish him for the language he uses.\n\nMcBride).\n\nI don't want to close, but I am prepared to close.\n\nMr. Speaker, this bill is a moral failure. It rips healthcare away  from millions. It pushes more families into hunger, and it leaves  seniors stranded all so billionaires can keep more of what they will  never spend.\n\nRepublicans say:…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…we can summon the political will to do it.\n\nA will has been so sorely lacking since this President arrived on the  scene. The Senate should not pass a budget that rips healthcare away  from millions of Americans--60,000 of whom live in my State--just to  give tax cuts to billionaires, but that is what this budget will do. It  is un-American, and it…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…we were supposed to lower the cost  of goods. I thought we were supposed to make healthcare more affordable  for Americans.\n\nWell, let me tell you this: When you strip healthcare away from  290,000 New Mexicans, many of which are in my district, including  132,000 children and 26,000 seniors, can anybody on the other side of  the aisle tell me how is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…had to rely on emergency care at the hospital  because she was uninsured. Because she has Medicaid, she can have the  surgery she needs and see again. Don't take Gloria's healthcare away.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691506/gop-tax-scam-hurts-women-and-families"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…United States did what  amounts to a car commercial for the richest man in the world right in  front of America's house, the White House?\n\nWhen the President tried to take healthcare away, where were you? Did  you speak up? Threatening a program called Medicaid that helps people  with disabilities, helps expectant mothers, helps millions upon  millions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…losing health insurance.  In my district, tens of thousands are going to be paying more for  healthcare.\n\nToday, the fact is that we can do our jobs and, rather than take  healthcare away, we can actually help fix it. I commend all of my  Democratic colleagues and, yes, even a few on the Republican side that  signed the discharge petition and will vote…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698808/breaking-the-gridlock-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…attempting to distract from the fact that last  month they passed the largest cuts to healthcare in American history as  part of their big, ugly bill. Republicans are stripping healthcare away  from 16 million Americans so they can give giant tax breaks to  billionaires and big corporations, two groups that don't need any help  right now.\n\nNow, Mr. Speaker,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Nation by hundreds of dollars; this bill that merits debate and  discussion because it is so violative of our common values; this bill  that takes food away from the hungry, healthcare away from the sick,  and takes working people and makes their challenges harder, all to give  more tax cuts to billionaires and drives up our deficit by the  trillions--that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…responsible, bipartisan way.\n\nThis summer, Congressional Republicans eliminated $1 trillion in  spending for Medicaid. It is a different but related issue. This will  take healthcare away from 11 million Americans and threaten rural and  intercity hospitals. But in also refusing to extend premium tax  credits, 22 million Americans may see their health premiums…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…poor seniors, for working people, for disabled people,  for people that are living in nursing homes that have no other options.  It is their healthcare.\n\nIf you take this healthcare away, people are just going to get  sicker. It is going to cost the society more. People are going to fill  up these emergency rooms. We know that because people will try to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…more hospitals and clinics  across the country. Republicans are choosing to make even more of our  country into maternal care deserts. Republicans are choosing to take  healthcare away from moms and babies.\n\nIt does not have to be this way. As we celebrate Women's History  Month, I implore the Republican majority to make their policy match  their profamily…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689164/womens-history-month"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…gets us. It is allowing the $60 billion a year  in waste in Medicaid and fraud in Medicaid to continue. That is the  theft of hardworking taxpayers' money. That is taking healthcare away  from the disabled who need it.\n\nLet's actually get back to having these programs work for the people  who funded them, who paid into them, who deserve to be on them,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…American people.\n\nWhile Trump defies the law and damages our economy, what are House  Republicans doing? This week and into the next couple, Republicans are  plotting to rip healthcare away from millions of Americans to fund tax  cuts for 759 billionaires. Republicans will sacrifice healthcare for 72  million children, pregnant women, seniors, and people…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]