[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…Diego, where longstanding operational and  maintenance failures have allowed raw sewage to flow from the Tijuana  River into San Diego's beaches. This has created a public health crisis  that strains local resources, poses significant environmental risks,  and forces our servicemembers to train in polluted sewage water.\n\nUnder current law, Federal agencies,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…it is because we had rural hospitals that were about  to close. We had so many people who were not getting preventative care,  and it was leading an already bad maternal health crisis to get worse.  It was leading an already bad infant mortality crisis to get worse. It  was leading a preterm birth crisis to get worse.\n\nBy getting people connected to…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…maternal health outcomes for Black women, ensuring that all mothers  receive equitable, respectful, and high-quality healthcare.\n\nThe United States continues to face a maternal health crisis, with  Black women experiencing significantly higher rates of pregnancy- related complications and maternal mortality compared to their white  counterparts. These tragic…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…problem the GOP has created. We still  have to reverse their cuts to Medicaid and Medicare. We still have to  stop the closure of rural hospitals and deal with the maternity health  crisis and work together--yes, work together--to create a healthcare  system that is affordable and accessible to everyone.\n\nToday, we can begin. Today, the people's House has…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698792/breaking-the-gridlock-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…calls accounted for a growing percentage of the 9-1-1 calls. The fire  department was spending less time putting out fires--and more time  responding to people in mental health crisis. Some residents were  dialing 9-1-1 regularly--several times a week--because they were facing  underlying mental health needs. This cost the city money. It strained  resources.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…couldn't provide health insurance.\n\nLuckily, she survived. Great people did great favors for our family  that I will never forget. I have never forgotten when there is a health  crisis or health issue that is debated on this floor.\n\nAll of us want good health insurance, and to cut the programs for no  reason other than to give tax breaks to the wealthiest…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Ms. SEWELL. Mr. Speaker, I thank my colleague for yielding.\n\nJust like the rest of America, we in Alabama are facing a health  crisis caused by the Republican Party. Thanks to President Trump and  Republicans in Congress, more than 58,000 of my constituents in  Alabama's Seventh Congressional District…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…people are  expected to die 11 years earlier than White people living on the North  Side, and sometimes it is higher than that.\n\nLet us not forget gun violence, a public health crisis and emergency  in our country. Black people die from gun violence at 2.7 times the  rate of White people. While guns have been the leading cause of death  for all children…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and expertise is to address       mental health and substance use disorders. Given the current       opioid public health emergency, and our nation's ongoing       mental health crisis, we are confused and troubled by this       proposal. SAMHSA's work is lifesaving, helping ensure       communities have access to mental health and substance use…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…to the  care many in our rural communities need. Because of these cruel cuts,  Oregonians will lose out on lifesaving mental and behavioral health  care, and the mental health crisis will only get worse.\n\nAs a founding member of the Bipartisan Rural Health Caucus, I know  that our rural neighbors often travel long distances to access care.\n\nI have a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…of both Republicans and  Democrats under the Bipartisan Safer Communities Act, was created in  response to the Uvalde school shooting to address the growing youth  mental health crisis.\n\nI think we all remember the Republican talking point at the time that  we don't have a gun problem. We have a mental health problem. Well,  fine. With this grant, the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692131/crystal-lake-mental-health-program"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…months after  birth, which we did here at the Federal level, as well. We looked at  expanding Medicaid under the Affordable Care Act and how would that  address the maternal health crisis. We did expand Medicaid in Virginia,  and we began to see that for many Medicaid expansion patients they  ended up healthier because they were connected to medical help,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…help  children.\n\nMedicaid pays for nearly half of the births in the United States. The  United States, as I said earlier, has a shameful distinction of a  massive maternal health crisis. We have the highest rate of maternal  deaths of any high-income nation. I am going to say that again: America  has the highest rates of maternal deaths--women dying in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Americans and--you guessed it--added $2 trillion to the  national debt. And like the Bush tax cuts, it left us unprepared as a  country when we faced a generational public health crisis. The COVID-19  pandemic left our country in shambles, with millions of people losing  their jobs and shuttering hundreds of thousands of businesses all  across our country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…in Western  Massachusetts.\n\nNo. 63, eliminated the Institute of Museum and Library Services.\n\nNo. 64, wiped the Surgeon General's advisory calling gun violence a  public health crisis--wiped.\n\nNo. 65, called for the firing of judges who have disagreed with him,  which clearly would violate the U.S. Constitution.\n\nNo. 66, illegally fired the Democratic…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…mental health counseling. By the  end of that, at the age of 18, they had the option to transition or  not. Ninety percent or more did not transition.\n\nWe have a mental health crisis in this country. Instead of addressing  it, we are cutting people's body parts off. I rise in strong support of  this legislation.\n\nMr. MOORE of Alabama. Madam Speaker,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…and reports data on the causes of death among veterans with a  particular emphasis on accurately identifying when suicide is a primary  or contributing factor.\n\nThe mental health crisis among America's veterans has reached an  alarming level. Suicide is now the second leading cause of death for  veterans under the age of 45.\n\nDespite ongoing efforts, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…(2) The manner in which the Coast Guard has managed       treatment for recruits, cadets, officer candidates, or other       personnel who may be experiencing a behavioral health crisis       at the location (including individuals who have transferred       to other buildings or facilities within the location).\n\n(3) The extent to which the Coast Guard…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…urgently be addressed. The good news is that, with the right  management, we can do so much more to improve the health of our forests  and combat the wildfire and forest health crisis head-on.\n\nThis means using all of the tools in the toolbox. That includes  mechanical thinning, prescribed fire, and cross-boundary authorities.  That also includes expanded…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…that come with  the job.\n\nToday, we face a nationwide shortage of nurses, especially in rural  areas like many in Iowa. This isn't just a workforce issue. It is a  public health crisis.\n\nWe must do more to strengthen nursing by expanding training  opportunities, reducing burnout, and investing in the future of care.\n\nNurses don't ask for recognition,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Control and Prevention, there  were more than 72,000 fentanyl-related overdose deaths in 2023, the  last year available. This number represents a tragic national public  health crisis.\n\nThe intention of this resolution may be to stop the attacks on the  drug boats, but by refusing military action against presidentially  designated terrorist organizations,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698245/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]