[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "They have completely ignored rising costs and the needs of real  people, instituting the largest cuts to healthcare and food assistance  in American history, all to give tax breaks to the wealthiest people in  this country.", "title": "16th Annual March for the Food Bank", "date": "2025-12-09"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "156 offered by  Leader Jeffries, which strikes all provisions that will cause millions  of Americans to lose healthcare and food assistance.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Speaker, I rise in strong opposition to the House  Republican budget resolution, a blatant attempt to strip healthcare and  food aid away from everyday Americans.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Instead, they are trying to take away healthcare and food from  our kids.", "title": "Ill-Conceived Budget Resolution", "date": "2025-02-25"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "During  the 2024-2025 school year, 698 students participated in concurrent  enrollment, earning over 10,218 college credit hours, and 243 students  earned industry-recognized credentials in construction management,  welding, engineering, automotive technology, healthcare, food service,  and business software.", "title": "Recognizing Canon City High School", "date": null}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "We repeatedly tried to offer an amendment, both in the Committee on  Rules and on the House floor on behalf of the American people to strike  every single provision that would cause the largest cuts to healthcare  and food assistance in history, which will result in 17 million people  or more losing health coverage and jeopardizing nutritional benefits  for about 42 million Americans who might otherwise go hungry.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Instead of fighting for the American people, President Trump and  Republicans have spent the past year seeking to strip millions of  Americans of healthcare, food assistance, student loan support, and  much more that is vital to their quality of life and, for many of them,  their very survival.", "title": "Healthcare", "date": "2025-10-28"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "Nor will we be able today to roll back the tax cuts for billionaires  and Republicans' GOP donors that they funded by gutting those  healthcare and food programs.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "These  companies are awarded government contracts worth billions of dollars,  yet their facilities are notorious for cutting corners on healthcare,  food, and safety in order to maximize shareholder profits.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Across the nation, this damage is in  addition to his erratic  and senseless tariffs and the dramatic reductions or eliminations of  essential supports for housing, healthcare, food, and education and so  much more.", "title": "Opposition to President Trump's and Elon Musk's Theft of Social Security to Pay for Handouts to Billionaires", "date": "2025-04-21"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "Are these your priorities, tax cuts for the rich paid for by taking  healthcare and food assistance away from everyone else?", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Taking healthcare and food away from people isn't bringing down  prices for families.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "So let's pass this bill without playing politics, without taking away  healthcare and food assistance from families who need it the most.", "title": "No Tax on Tips Act", "date": "2025-05-20"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Unsatisfied with stealing our healthcare and food out of the mouths  of millions of children, they are now coming for our public lands,  lands we fish, hunt, and camp on, lands that have been sacred to our  Tribes since time immemorial, lands that are integral to our  communities and our land grants, lands that have nurtured us and make  us who we are as Americans.", "title": "Stealing Our Public Lands", "date": "2025-06-23"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "Speaker, I rise today to speak out against the big,  ugly bill, which even Elon Musk has called a ``disgusting  abomination.''\n\nThe big, ugly bill undermines the programs millions of Americans rely  on to survive, like healthcare and food assistance.", "title": "Big, Ugly Bill, Clean Energy Tax Credits.", "date": "2025-06-04"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "From hurricane recovery to  improving healthcare and food security, the program embodies  resilience, compassion, and connection.", "title": "Recognizing Ann Wilkinson", "date": "2025-04-24"}]