[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…addressing a war nor to address a  recession but, instead, for the lofty purpose of enriching the richest  Americans.\n\nI must say that driving 16 million people off of healthcare to give  tax breaks to megamillionaires and billionaires may make the  megamillionaires and billionaires who are serving in this Chamber quite  happy, but it doesn't make America…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Another couple, from Butternut, WI, told me their premiums are going  from $400 per month to over $5,000 per month. That is $55,000 more a  year. As they wrote to me, ``healthcare tax breaks are not just numbers  on paper. They are a lifeline that allows us to sleep at night, knowing  that we won't lose everything if one of us gets sick.''\n\nBehind every…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Madam President, I call up my amendment No. 1602 and  ask that it be reported by number.\n\nMrs. SHAHEEN. This bipartisan amendment supports extending vital  healthcare tax credits for working families.\n\nTwenty-two million Americans rely on premium tax credits to get the  healthcare they need, but those tax credits are supposed to expire this…", "date": "2025-04-04", "source_url": "https://justfacts.votesmart.org/public-statement/1689568/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…simple and plain. And I will be very blunt:  It is not everything I would have wanted. Like the Senator from  Wisconsin, my friend Senator Baldwin, I would have wanted the  healthcare tax credits to be permanently guaranteed. I would have  wanted a guarantee as well that there be no rescissions or impoundments  of funds, as this President has done repeatedly.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…table  to negotiate an extension of the enhanced Affordable Care Act tax  credits before the end of last year.\n\nLast Thursday, the House passed legislation to extend these  healthcare tax credits for 3 years. Seventeen Republicans joined  Democrats. You think about it, they could have done that months ago-- months ago. We were willing to negotiate with them…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…standing in the gap for families who can't  afford for Congress to look the other direction.\n\nMr. Speaker, I rise to share the human cost of allowing the  Affordable Care Act healthcare tax credits to expire. I rise on behalf  of the families of the Third Congressional District that I serve in the  great State of Ohio.\n\nI rise on behalf of the families across…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…for eight Republican Senators.  If anyone else in government gave themselves millions in taxpayer  money, they would go to prison. For Americans trying to afford  healthcare? Not $1 in tax credits.\n\nHouse Democrats are united against this corrupt bill and will keep  fighting to protect America's healthcare.\n\nMr. Speaker, I urge my colleagues to reject…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696719/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to insurance companies and saying: I am going to afford  this plan. But many Americans will find no plan affordable if we fail  to provide for them an extension of the healthcare tax credit that has  enabled them to afford health insurance up to now under a measure that  we passed and the President signed.\n\nMy Republican colleagues continue to ignore…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…$18,000 more per year for  coverage. A family of four in Tulare County earning $64,000 a year will  pay $2,500 more.\n\nThis is not fiscal responsibility. This is a Republican healthcare  tax hike on working families, imposed in the richest country in the  world. I think it is unacceptable. These are not just numbers on a  page. These are real people.\n\nIt is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…them. Without the tax credit, their health insurance premium will go  from about $320 per month to $3,000 per month. That is outrageous.\n\nRepublicans ripping away that healthcare tax credit means that Linda  and her husband now have had to go to an insurance plan that does not  provide the same coverage. It doesn't provide prescription care. They  are…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…grocery prices, high utility bills, and soaring costs for holiday  gifts. Families can't afford to pay double for their healthcare.  Republicans cut $1 trillion from healthcare to give a tax break to  their billionaire donors. Americans of every party stripe are being  hurt, and they have had enough.\n\nThis morning, four Republicans joined every Democrat…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698390/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Democratic colleagues and I are fighting to restore  healthcare in this upcoming budget bill. Right now, healthcare access  for more than 20 million Americans who benefited from healthcare tax  credits are at risk, as I just noted. As a result, a record number of  Americans, 24 million people, have been enrolled in this Affordable  Care Act, but all of them are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…John McCain did his courageous act, that here we are years  later--almost a decade later, a few years less--and they are doing the  same thing again, cutting people's healthcare to give tax breaks to the  wealthiest people? Isn't it true that John McCain saw the suffering of  people who wouldn't get healthcare and urged people to come together on  a bipartisan…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…affordable  for them.\n\nSo I will just tell you, in conclusion, what Democrats are going to  offer tomorrow. It is going to be a simple, straightforward extension  of the healthcare tax credits these families depend on, so that  families like this don't have to rely on hope alone.\n\nAnd my Republican colleagues, they are going to have a different  plan.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that  will raise costs and threaten access to healthcare for many Minnesotans  if Congress does not act.\n\nIf the President and congressional Republicans do not extend the  healthcare tax credits, the health insurance premiums of millions of  Americans will double next year. This premium increase will be felt by  many, including families, small businesses…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…alternative had  better actuarial distribution, but they have tried to turn healthcare  into financial engineering.\n\nWhat you have done is, is financing, is subsidies healthcare. Well,  we will tax these people and we will subsidize this population. Listen  to the debates here. It is about subsidies on top of subsidies. It is  financial engineering. Now, it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Utility District for their 75 years of unwavering dedication to the  region and to the protection of a national treasure that is Lake Tahoe.                    Restoration of Healthcare Tax Credits\n\nMr. KILEY of California. Mr. Speaker, I rise today to urge prompt  action on a matter that could make life a lot more difficult for  millions and millions of people…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…conduct oversight, lower prices, and protect our  healthcare.\n\nSo what are Republicans doing?\n\nLast week, following the invasion of Venezuela and the expiration of  the healthcare tax credits, their priority was a bill about  showerheads. This week it is worse. They are actively putting their  thumb on the scale in favor of big corporations and against…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]