[{"senator": "Steven Horsford", "party": "Democrat", "sentence": "…this Chamber want to make this about  politics. The reality is this is life and death. It is life and death  for the 15 million Americans who are at risk of losing healthcare,  while Republicans found the time and the money to give tax cuts to  billionaires but no time to give relief to middle-class families.\n\nMr. Speaker, I thank Leader Jeffries and Democrats.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698785/breaking-the-gridlock-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…American families are being squeezed by high  grocery prices, high utility bills, and soaring costs for holiday  gifts. Families can't afford to pay double for their healthcare.  Republicans cut $1 trillion from healthcare to give a tax break to  their billionaire donors. Americans of every party stripe are being  hurt, and they have had enough.\n\nThis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698390/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…In 2025, Republicans gave ICE $75 billion, a nearly 300 percent  increase in its annual budget, at the same time that they stripped  millions of Americans of their healthcare. Republicans now want to give  ICE and Border Patrol even more money.\n\nWe are asked to fund an agency that does the following: sends masked  agents into communities like my neighborhood…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…expire.\n\nThis isn't me saying it. This is the CBO saying it, that the  majority's bill is going to throw millions and millions of our fellow  citizens off of their healthcare. Republicans are doing it and are  going forward with it like it is no big deal.\n\nAt the same time, my colleagues on the other side of the aisle are  giving a tax break to billionaires.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…centerpiece of Republican attempts to repeal  the Affordable Care Act for decades.\n\nIt doesn't work.\n\nThe plan also creates a backdoor ban on abortion and reproductive  healthcare.\n\nRepublicans have shown they have no agenda to address healthcare  affordability and access. As Americans stare down notices that their  healthcare costs will increase by tens…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…misleading title.\n\nAfter spending the last few weeks threatening access to childcare  support and doing literally nothing to help millions of Americans  afford their healthcare, Republicans want to direct taxpayer dollars  away from helping families afford necessities like food, rent, and  childcare to crisis pregnancy centers that prey on vulnerable…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Representative Kelly Morrison had an amendment that strikes the  defunding of Planned Parenthood, which provides access to lifesaving  cancer screenings and reproductive healthcare.\n\nLast year, Republicans, Mr. Speaker, promised that reproductive  healthcare and reproductive freedom was a State issue. President Trump  promised that reproductive healthcare and reproductive…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Donald Trump this  year--dare I say, abusive. I hope you will consider this a Republican  intervention. For the record, these are not attacks. They are just  facts.\n\nHealthcare: Republicans cut $1 trillion from Medicaid with their big,  ugly bill, threatening their own vulnerable constituents, when three- quarters of Medicaid enrollees are in red States,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…either  lose healthcare or see their premiums increase.\n\nAll the Federal workers that Elon Musk and DOGE decided to fire for  no justifiable reason will also lose their healthcare.\n\nRepublicans represent millions and millions of Americans who rely on  Medicaid and CHIP, and none of them, not a single one, voted with these  constituents in mind.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688258/american-families-will-pay-for-republican-tax-cut"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Republicans' attacks on Medicaid means Americans, including millions  who are already struggling to keep up with the rising cost of living,  will be forced to pay more for healthcare.\n\nRepublicans continue to show that they have no plans to make life  easier for anyone who is not a billionaire. In fact, while the rest of  the country gets sicker and poorer,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republicans are doing nothing--nothing--to solve the  problem.\n\nIt is no surprise because the Republicans have harbored an ancient  animosity toward all these Federal healthcare programs. The Republicans  voted no on Social Security in 1935. They voted no on Medicare. They  voted no Medicaid. They voted no on the Affordable Care Act. Today,  they are trying to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…know that there are changes coming, and then vote on it just  hours later. It is a bill that adds trillions to the deficit and kicks  millions of people off their healthcare.\n\nRepublicans once bragged about requiring 72 hours to review  legislation.\n\nMr. Speaker, do you remember that?\n\nNow Republicans are ready to toss that promise in the trash to serve…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…veterans, our  working people who go to work every single day who make just a little  bit too much money to access Medicaid, but not enough money to pay for  their healthcare.\n\nRepublicans' failure to extend the ACA tax credits will hurt  Louisianians and Americans across this country. It allows premiums to  skyrocket for tens of millions of Americans…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the Affordable Care Act tax credits which are  scheduled to expire at the end of this month.\n\nFor months now, Democrats have made clear that we have a broken  healthcare system that Republicans continue to destroy. They have  exacerbated our healthcare crisis month after month after month,  including with the one big, ugly bill, with the largest cut…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698365/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…protect the senior  in rural New Mexico who has to drive hours just to see a doctor and  will have to drive hours more when their Medicaid cuts destroy our  world healthcare system. Why? So Republicans can hand out tax cuts to  billionaires.\n\nDo the millionaires and billionaires you are protecting really need  more? They already have so much. They will drown…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. Speaker, when it comes to healthcare, Republicans are focused on  lowering costs and expanding choice for all Americans. That is 347  million people, not just 7 percent of the population, which is all you  are going…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…ask hard questions  of the administration, to be the check and balance that we were taught  about in school, conduct oversight, lower prices, and protect our  healthcare.\n\nSo what are Republicans doing?\n\nLast week, following the invasion of Venezuela and the expiration of  the healthcare tax credits, their priority was a bill about  showerheads. This…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]