[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…abortion would make her infertile and, ultimately, mentally ill.\n\nUltimately, she was coerced into carrying a pregnancy to term. After  giving birth, she lost her job and health coverage, and the so-called  clinic never offered real medical care or follow-up support.\n\nThis is why the American Medical Association and the American College  of Obstetricians…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…District and across the country are already paying the  price for Republicans' inaction on healthcare. The enhanced ACA premium  tax credits expired December 31, 2025, and now health coverage is more  expensive and families are already feeling the impact.\n\nIn my district, 90 percent of the 32,000 people who get ACA coverage  rely on those subsidies. Four out…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…the floor, pass it in the House,  and send it over to the Senate this week. President Trump must sign it  into law. If we don't, here is the reality: Families will drop health  coverage to put food on the table, gambling with their lives. Medical  debt will bury them bill by bill, week by week. They will keep waiting  for the Trump healthcare plan that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…disabilities.\n\nIn Texas, these healthcare cuts will be catastrophic. We already have  the highest uninsured rate in the country, with nearly 5 million people  in Texas lacking health coverage. Mr. Speaker, one in four Texas  children rely on Medicaid or CHIP, and more than one-half of Texas  births are covered by Medicaid.\n\nThese cuts would gut funding for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…FamilyCare who will lose their coverage; some parents of  the nearly 100,000 children in Representative Smith's district who are  at risk of losing their NJ FamilyCare health coverage; and some of the  11,000 seniors in Representative Kean's district who are worried about  their nursing homes having to shut down.\n\nWhat I heard from all of those constituents…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…legislation that would  restore some common sense by banning the President from imposing  tariffs without congressional approval, capping the cost of childcare,  expanding health coverage, creating new pathways to  homeownership, raising the minimum wage, and expanding tax deductions  for working-class people.\n\nMr. Speaker, after Thanksgiving season, where…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the Affordable Care Act. It fails to extend vital  enhanced premium tax credits, forcing more than 22 million Americans to  pay, on average, twice as much to buy the same health coverage they  have today.\n\nAs I said, an estimated 4 to 5 million could become entirely  uninsured, and everybody else will pay higher healthcare costs.\n\nThis proposal increases…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I rise to oppose this Republican  charade and to stand up for my neighbors back home who deserve quality  and affordable health coverage. That includes over half a million of my  hardworking neighbors across the Tampa Bay area.\n\nMr. Speaker, 4.7 Floridians, or one in five who live in the Sunshine  State,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698388/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…consider a bill that contains the largest cuts to Medicaid in our  country's history. This outright assault on healthcare will result in  13.7 million Americans losing their health coverage, including many of  the 370,000 Medicaid beneficiaries in my district.\n\nThis includes people like Yvette from Van Nuys who said that she  wants to retire without spending…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691409/gop-tax-scam-hurts-women-and-families"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Forty States, plus the District of Columbia have adopted the Medicaid  expansion--\n\nhelping adults with low incomes become healthier and more       financially secure. Health coverage through expansion       improves people's access to--\n\nSomething that makes so much economic sense. It--\n\nimproves people's access to preventive and primary care,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…would have a real  impact. That would send a great sign to folks back home who are  struggling with the rising cost of living and are wondering how they  will pay for their health coverage next year. That would really help  our neighbors back home. Alas, we are not doing that.\n\nAt a time when prices are up, inflation is up, and despite the  Republican promises…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…country,  and they are going to tip them upside down and shake the money out of  their pockets, 2 days before Christmas, and make them pay more money in  order to get the health coverage that their families need.\n\nSo the Republicans just care more about ``wealthcare'' than they do  about healthcare. They care more about caring for the wealth of the  richest…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…political talking point, it is the wall between a bearable,       if difficult, life and complete financial and medical ruin. I       relied on the ACA's Marketplace for my health coverage, the       only way I could secure a policy that didn't deny me for my       age, that capped my out-of-pocket costs, and that allowed me       to maintain my own health.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…visits and his insulin.\n\nA single father without a high school degree, Isaiah is concerned  that the bill's cuts and changes to Medicaid will result in his losing  his health coverage. And if Isaiah loses Medicaid, he will no longer be  able to afford his insulin and other medications. He may face a  diabetic complication or coma or even suffer a stroke.…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…middle-class families.\n\nThis is an outrage. We can't allow this to happen. Democrats believe  we must address this healthcare crisis before millions of people lose  their health coverage, see their costs spike, and their hospitals  close.\n\nMr. Speaker, I call on my Republican colleagues to join us in ending  the chaos. This has to be addressed in this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…bargaining power when it comes to negotiating  lower insurance costs for their workers. Since 2010, the share of small  businesses with fewer than 50 employees offering health coverage has  dropped from 39 to 30 percent.\n\nSmall businesses have ranked the cost of health insurance as their  number one problem for 32 straight years. For nearly four decades,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…their workers. Expanding what services can be  provided under these plans, specifically to help treat chronic  diseases, will only make this a more affordable and useful health  coverage choice for patients.\n\nI encourage my colleagues to support the passage of the Chronic  Disease Flexible Coverage Act, and I yield back the balance of my time.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…million enrollees, or 35 percent of all exchange enrollees in       2024, do not use their benefits at all. For these enrollees,       known as zero-claim enrollees, health coverage did not       translate to health care. Many zero-claim enrollees are known       as ``phantoms''--people who are enrolled but not practically       in the market because…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…First, it provides more freedom and flexibility through CHOICE  Arrangements, empowering small businesses to offer tax-free benefits so  that their employees can find health coverage that works for them.\n\nThis levels the playing field for small businesses, putting them on  equal footing with large employers when competing for workers. These  arrangements…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…starting this new year, there  is certainly no shortage of issues to be talking about. You and I have  been engaged in fruitful discussions, I believe, about how we address  health coverage for millions of Americans that are looking at  dramatically higher costs, in many cases, and recognizing that there is  a pretty short window here in front of us. In fact,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…lose coverage are actually not citizens  in the first place, which is another category of ineligible  individuals. So Congress has never authorized federally subsidized  health coverage for noncitizens.\n\nI don't think the American people who voted overwhelmingly for  President Trump last November did so because they want to see taxpayers  subsidize illegal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}]