[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…should be made only by the pregnant student, not by  Members of Congress.\n\nIn the wake of Dobbs, many States have prohibited or tried to  prohibit healthcare providers and health plans from offering or  covering certain reproductive healthcare services. These anti-abortion  efforts have disproportionately harmed some students whose access to  services…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Mental  Health Parity and Addiction Equity Act of 2008 sought to correct the  imbalance between the benefits afforded mental health and substance use  disorders under group health plans and general medical and surgical  benefits typically afforded under such plans.\n\nMr. Speaker, 15-plus years later, we still are seeing major gaps in  access and affordability…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Premiums for All Americans Act.\n\nThis package includes two partisan proposals marked up in the  Education and Workforce Committee. First, it recklessly expands  association health plans which would allow small employer groups and  individuals to join associations to offer health insurance that are  subject to fewer regulations than traditional plans in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…now, we can  open up the government, and we will talk about it.\n\nWhat does ``talk about it'' do to my constituents? Because, last  week, window shopping for next year's health plans actually started in  my home State, and, this week, open enrollment begins nationwide. I am  hearing from families in my State today who are panicked.\n\nWhile Republicans…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…lose their health insurance  coverage because of H.R. 1 is 10 million, 7.5 million people on  Medicaid and another 2 million people who get their insurance through  private health plans on the exchange.\n\nThey also calculated the debt impact in terms of H.R. 1 because of  the massive giveaway to billionaires and the top 1 percent of this  country. They determined…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…American people, let  us not forget how people get drug treatment. It is from the Medicaid  program that has already been cut by a trillion dollars and the ACA  marketplace health plans.\n\nThe Republicans' failure to act is literally going to kill people  across this country. They let deadlines pass, premiums rise, and  coverage disappear. That is not leadership.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…We are not bringing  together the world's most deliberative body to focus on how to solve  these problems.\n\nMichael Tuffin, the president and CEO of AHIP, America's Health  Insurance Plans:\n\nMedicaid is indispensable to low-income people and working       families. If their Medicaid coverage is disrupted, these       Americans will lose access to primary…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…negotiations, we have always worked on extensions so  that we can address issues together in a bipartisan manner.\n\nMillions of Americans are already receiving those notices of health  plans where the price is going to skyrocket. I get stopped on the  streets where people tell me what they are seeing when they open those  bills, and they are drastic. For some,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…just the  right thing to do. It is the smart thing to do.\n\nThe Chronic Disease Flexible Coverage Act codifies IRS guidance to  expand the safe harbor for high deductible health plans offering  predeductible care for chronic conditions. It lets employers offer  first-dollar access to care for patients with diabetes, asthma, high  blood pressure, and many…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…program  for low-income families, children, seniors, and people with  disabilities.\n\nOne of the most important tools is called a provider tax. That is  when hospitals or health plans agree to pay a small tax to keep  Medicaid running. In return, the Federal Government matches those  dollars. It is a Federal-State partnership that keeps hospitals open,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…they are written on.\n\nAmericans are fed up with high healthcare costs, and yet Republicans  now want to double down on misery and, once again, allow these Swiss  cheese health plans that don't cover healthcare like chemotherapy or  prescription drugs.\n\nThis morning, the mask is off. It is clear Republicans haven't been  serious about holding premiums…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699115/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…increases premiums for millions of Americans by funding  cost-sharing reductions, causing hundreds of thousands of people to  become uninsured. It expands so-called association health plans that  put comprehensive and affordable care for small businesses and workers  at risk. This has been the centerpiece of Republican attempts to repeal  the Affordable Care…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…visibility  underground, as I mentioned about the construction sites, as well.\n\nAs we speak, Trump is working to give more control to mine operators  about their safety and health plans, even when we know that injuries  and deaths will follow.\n\nWe know what keeps miners safe, but this administration doesn't think  we should let the Mine Safety and Health…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…for All Americans Act offers  commonsense solutions to America's broken healthcare system.\n\nIt lowers premiums through choice and competition. By expanding  association health plans, we give small businesses and self-employed  workers the buying power of large employers, cutting premiums by as  much as 30 percent.\n\nIt gives families control over their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…black box and causing drug prices to rise. We are  bringing transparency into the commercial market for PBMs under this  bill.\n\nThe bill also expands access to association health plans, which allow  small businesses and self-employed workers to band together and  purchase health insurance. One of the biggest complaints we hear from  businesses, especially…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…time.\n\nThis bill lowers premiums through pharmacy transparency and cost- sharing reductions. This legislation improves options for workers by  expanding access to associated health plans. It also ensures that small  and midsize employers can offer more tailored, affordable care, and it  codifies and strengthens CHOICE arrangements, permitting employees to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…They want our family,  friends, and neighbors to suffer further pain as opposed to joining us  and fixing the problem as opposed to extending it.\n\nMy bill, the Association Health Plans Act, allows small businesses  and self-employed Americans to band together, like large companies, to  lower costs and deliver high-quality coverage. The CBO report today…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Means,      House of Representatives.\n\nThe Patient Protection and Affordable Care Act (PPACA)       provides premium tax credits to those who purchase private       health insurance plans and meet certain income and other       requirements. Individuals may have the federal government pay       this credit to their health insurance issuers in advance…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…easier for small businesses--something  that I know something about after 35 years in business--to offer  healthcare coverage. It gives individuals more options to choose health  plans that work for them.\n\nCHOICE accounts put individuals in the driver's seat when it comes to  picking their healthcare plan and lets their employer financially  support their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698397/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…that happens, I will eat my words.  I hope I can eat my words because there is no joy in having a bill pass  and see people lose their doctors of choice, lose choice in health  plans because it is consolidating, lose choices in healthcare because  it is consolidating, and see their premiums skyrocketing.\n\nTalking about how much the premiums are skyrocketing,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…attempt to respond to the affordability crisis created by  ObamaCare, Democrats leveraged a public health emergency to shovel  hundreds of billions of dollars to big health insurance plans to mask  the risk of rising unaffordability of coverage. First, in the American  Rescue Plan of 2021 and then again in the Inflation Reduction Act of  2023, Democrats…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…their  employer's healthcare coverage. My bill allows employers to offer  predeductibility on 14 different chronic diseases, especially for those  who are on high deductible health plans.\n\nWith 6 in 10 Americans living with at least one chronic disease, it  is clear to me that we need to have many more options. The cost for  chronic diseases in the American…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688478/chronic-disease-flexible-coverage-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Persist\n\nThe Patient Protection and Affordable Care Act (PPACA)       provides premium tax credits to those who purchase private       health insurance plans and meet certain income and other       requirements. Individuals may have the federal government pay       this credit to their health insurance issuers in advance…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…arrives.\n\nWe expanded eligibility for these health savings accounts to  individual bronze market and catastrophic plans starting in 2026. We  also ensured that high-deductible health plans cover telehealth and  other remote access or virtual healthcare services before the  deductible kicks in, while remaining HSA-eligible.\n\nI know we are all concerned about…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…haven't got ads on  TV saying the list price of the drug--I don't have an opposition to  just doing something like that--but it is much more complex. Vertically  integrated health plans, pharmacy benefit managers, and other  intermediaries suppress competition, pocket valuable drug discounts,  and increase prices for consumers--all unrelated to the list…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…The last point, to that point, when our Republican  colleagues, in particular, and other colleagues talk about all these  things--we need transparency, we need association health plans--I  support that. I support transparency, right? We need to fix some  particular technical thing with our existing plans, right? Whatever  these little solutions are--PBMs,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…guidance  relating to treatment of certain services and items for chronic  conditions as meeting the preventive care deductible safe harbor for  purposes of high deductible health plans in connection with health  savings accounts.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 919…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}]