[{"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Research Triangle Park, to share the story of a Federal scientist, in  their own words, who was fired by President Trump and Elon Musk.\n\nI worked for the Department of Health and Human Services. I       was responsible for leading technical oversight over the       Organ Procurement and Transplantation Network in order to       ensure patient safety,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…care. They still need access to their mental  health support, and we are going to cut that. In my mind, that is just  so unchristian.\n\nThen, we are talking about cutting Health and Human Services so that  if we are trying to make sure that folks don't get tuberculosis, that  we keep measles at bay, that we keep HIV at bay, well, if you are at  risk, you…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…nonpartisan--used by Democrats and Republicans in Congress-- has made it clear that this would have to involve cuts to Medicaid. Add  that to the firings at the Department of Health and Human Services that  will undercut health services and research.\n\nI just met with a man this weekend from a small town right close to  Brainerd, MN, whose wife had just died…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "Mr. QUIGLEY. Mr. Speaker, I rise today to demand the resignation of  Robert F. Kennedy, Jr., as Secretary of Health and Human Services.\n\nSince taking office, RFK Jr. has failed to recommend the measles  vaccine for children, even after the deaths of two children. He said  pregnant women should…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692028/demanding-resignation-of-robert-f-kennedy-jr"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…massive $900 billion military spending bill.\n\nThis legislation gives more money to the so-called Department of War  than to our Department of Education, Transportation, and Health and  Human Services combined.\n\nMr. Speaker, can you ask my Republican colleagues to get serious  about helping the American public? I know you seem to be judged by the  content…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698052/opposition-to-the-military-spending-bill"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…efforts that have been repeatedly rejected, not even heard by the  Republican majority.\n\nIgnoring my legislation and other proposals that have been offered  from the Health and Human Services Office of Inspector General, another  inspector general that was fired by President Trump, Republicans  instead offer this minor bill that does little to address…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…spending  on advertising contracts with minority-owned businesses by five federal  agencies--the Department of Defense, the Department of the Treasury,  the Department of Health and Human Services, the Department of the  Interior and the National Aeronautics and Space Administration--and  found that only five percent of the $4.3 billion available for  advertising…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…get bone grafts and have no idea,  including the doctor that did a bone graft on me, that they even needed  to worry about this.\n\nThis bill requires the Department of Health and Human Services to  conduct research and education campaigns to prevent TB outbreaks caused  by contaminated human cell and tissue product donations.\n\nThrough the markup process,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692765/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to address the dangerous  actions of the Health and Human Services Secretary in regard to  vaccines.\n\nVaccines play a critical role in protecting our entire population in  the United States. They are the most powerful tool we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…million Federal workers at over 30 agencies under the guise  of protecting our national security. This includes VA employees, food  and safety inspection service workers, health and human service  employees, including those at the CDC and the FDA.\n\nThese workers now have had their voices silenced and have no  whistleblower protection if they report about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697868/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today in opposition to these two deceptively  titled bills: H.R. 6945, the Supporting Pregnant and Parenting Women  and Families Act, which allows Health and Human Services funds to be  sent to crisis pregnancy centers, and H.R. 6359, the Pregnant Students'  Rights Act, which unfairly limits the information it requires colleges…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…anthropologist,  renowned humanitarian, pioneer of global health--I read his book  ``Mountains Beyond Mountains.'' In another one of his books,  ``Pathologies of Power: Health, Human Rights, and the New War on the  Poor,'' he wrote:\n\nIf access to healthcare is considered a human right, who is       considered human enough to have that right?\n\nI think,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…That is why the Trump administration's  actions to gut staffing at the Department of Education and move the  Office of Special Education programs to the Department of Health and  Human Services is so devastating. HHS does not have the structure, nor  the staff, to administer the $15 billion a year that this office is  responsible for.\n\nThe administration…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…adoption.\n\nAfter returning to North Carolina, Phyllis first worked at the Wake  County Department of Social Services before moving to the North  Carolina Department of Health and Human Services, where she was  promoted to Program Coordinator of Community Child Protection Teams  across the state. In this role, she traveled to all 100 of our state's  counties.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…his 2026 budget, Trump is proposing to eliminate funding for the  Administration for Community Living, which supports older and disabled  Americans; the Department of Health and Human Services' Prevention and  Public Health Fund; the Patient-Centered Outcomes Research Trust Fund;  the Pediatric Brain Tumor Consortium, an association of 16 academic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…flexibility  allowed VA doctors and specialists to reach veterans where they are  through secure, effective telemedicine. The Department of Justice and  the Department of Health and Human Services have continued to extend  this waiver. Yet, without further action, it will expire at the end of  this year.\n\nMy bill would permanently extend the exemption for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…against in organ transplant eligibility. It gives  families a mechanism for timely intervention, time that oftentimes  families just don't have, through the Department of Health and Human  Services, when medical decisions are clouded by bias rather than  compassion and science.\n\nI am proud to work once again with my colleague and friend  Congresswoman Debbie…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has ridden this  nonexistent train, which raises the question: Where has all of this  money gone?\n\nEven an audit during the Biden administration from President Biden's  Health and Human Services agency found that California improperly  claimed $52.7 million in Medicaid reimbursement for noncitizens, which,  of course, raises many questions about how pervasive…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Chair, I rise in strong support of H.R. 7148, which  contains the Defense, Labor-Health and Human Services-Education, and  Transportation-Housing and Urban Development appropriations bills.\n\nThis is a strong package, and as the vice chair of the Subcommittee  on Transportation,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…President Trump's  negotiations and direction to avoid a long-term partial shutdown and  keep the government operating without further disruptions.\n\nAs chairman of the Labor, Health and Human Services, Education, and  Related Agencies Subcommittee, I am honored to work with the ranking  member of this subcommittee, Ms. DeLauro, who also serves as ranking  member…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…funding package that is before us. It includes full-year funding for  the following bills: the Department of Defense; Financial Services and  General Government; Labor, Health and Human Services, and Education;  National Security; Department of Defense; Transportation, Housing and  Urban Development.\n\nColleagues, when we pass this package and when it…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…by striking ``the assessments       under paragraph (2)(B)'' and inserting ``the assessments       required under paragraph (1)(A)''.\n\n(b) Guidance.--The Secretary of Health and Human Services,       acting through the Commissioner of Food and Drugs, shall--\n\n(1) not later than 12 months after the date of enactment of       this Act, issue draft guidance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…$100,000 for climate  resilience in Ghana; cut $360,000 for gender nonconforming, nonbinary,  two-spirit farmers in New York; cut $24 billion to USAID; cut $22  billion from Health and Human Services to provide housing and cars for  illegal aliens; cut $45 million for diversity, equity, and inclusion  scholarships in Burma; cut $8 million to promote LGBTQ…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…come to the Senate floor to raise concerns and  warnings about how immigrant children called unaccompanied children are  handled by Republican and Democrat Departments of Health and Human  Services. When immigration people don't have the capabilities or  probably the legal right to determine where unaccompanied children  should be handled, they are turned…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…One of these patients was Shandra Eisenga, who tragically passed away  on August 10, 2023, from tuberculosis, or TB.\n\nThis bipartisan bill requires the Department of Health and Human  Services to conduct public awareness campaigns to assist in preventing  TB outbreaks caused by contaminated human cell and tissue product  donations.\n\nShandra's death…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692767/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Committee has worked  well. We have passed out of committee a significant number of major  bills by big bipartisan margins--26 to 3 in the case of our bill and  the Labor, Health and Human Services bill. But there is a stark  contrast between the real progress we are making on appropriations and  the lack of progress on addressing the core issue of can Americans…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…workforce solutions.\n\nThat is why I have respectfully requested in a letter that I am  sending today that the Appropriations Committee and its Subcommittee on  Labor, Health and Human Services, Education, and Related Agencies  provide robust funding for AmeriCorps in the coming fiscal year.\n\nMr. Speaker, I am urging my colleagues on both sides of the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…(1) SCF.--The term ``SCF'' means the Southcentral       Foundation located in Anchorage, Alaska.\n\n(2) Secretary.--The term ``Secretary'' means the Secretary       of Health and Human Services.       SEC. 3. CONVEYANCE OF PROPERTY TO SCF.\n\n(a) In General.--As soon as practicable, but not later than       2 years, after the date of enactment of this…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…health insurance plans       through the marketplaces established under PPACA. The Centers       for Medicare & Medicaid Services (CMS), within the Department       of Health and Human Services (HHS), is responsible for       maintaining the federal Marketplace and overseeing state-      based marketplaces. Under PPACA, states may elect to operate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…subject to a violation of this       section by a covered entity may bring a claim regarding the       allegation to the Office for Civil Rights of the Department       of Health and Human Services, for expedited resolution, as       appropriate.\n\n(2) Rule of construction.--Nothing in this subsection is       intended to limit or replace available remedies…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}]