[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…She then  studied at Harvard University and then earned her Ph.D. from the  Claremont Graduate University.\n\nDr. Montiel has dedicated her professional career to public health  and education programming. Today, Dr. Montiel is a faculty fellow at  Claremont Graduate University.\n\nMr. Speaker, I thank Dr. Montiel for her dedication to our community.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…notice and       public procedure thereon are impracticable, unnecessary, or       contrary to the public interest.''      Richardson Waiver\n\nIn 1970, the Secretary of Health, Education, and Welfare       (the predecessor to HHS) issued a policy statement directing       agencies and offices in the department that issue rules       relating to public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…promote minimum State requirements for the  prevention and treatment of concussions caused by participation in  school sports, and for other purposes; to the Committee on Health,  Education, Labor, and Pensions.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…organization committed to serving those in need.\n\nTheir mission focuses on several things, including disaster relief,  rehabilitation, family services, women's empowerment, health, and  education.\n\nIn Virginia, Sewa works hand in hand with local organizations to  strengthen our communities. They support the big September 11 National  Day of Service which will…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…help seniors live safely, independently, and with  dignity in their own homes and communities. From meal delivery and  transportation assistance to caregiver support and health education,  the Agency plays a pivotal role in addressing the needs of our aging  population.\n\nEach year, the Broward Senior Hall of Fame honors exemplary residents  aged 60 and…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…backwards attempt to  cancel $9.8 billion in funding that had already been passed into law.  It cuts critical investments in lifesaving programs that support  reproductive health and education.\n\nIt also slashes funding for the U.S. President's Emergency Plan for  AIDS Relief, also known as PEPFAR. This bipartisan initiative has been  supported by both parties…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692564/rescission-package"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the teachers, the occupational therapists,  and the school staff who work with Natalie. It includes the assistive  technology that Natalie uses to communicate. Federal health and  education funding give Natalie her voice. It also includes the  transportation that Natalie receives to and from school each and every  day.\n\nNatalie's disability does not preclude…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Service Officers to the region.\n\nFurther, the BLUE Pacific Act supports regional economic and social  development by providing assistance in multiple sectors such as public  health, education, infrastructure, environmental resilience, digital  connectivity, disaster mitigation and more.\n\nFinally, the bill promotes shared values like freedom of the press,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Ms. LEE of Nevada. Mr. Speaker, I rise to recognize the week of March  24th to March 28th of 2025 as National Area Health Education Centers  Week, or AHEC week.\n\nSouthern Nevadans are facing a dire shortage of health care  providers, which means longer wait times, fewer choices, and less  access to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689206/recognizing-national-area-health-education-centers-week"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Blumenthal):\n\nS. 3797. A bill to amend the Federal Food, Drug, and Cosmetic Act to  establish new prohibited acts relating to dietary supplements; to the  Committee on Health, Education, Labor, and Pensions.                                  S. 3797\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…education also left an  indelible mark beyond our borders. As the top Democrat on the  Subcommittee on State and Foreign Operations, she championed critical  global health and education initiatives.\n\nMr. Speaker, Nita was more than a colleague. She was a mentor and a  friend to many of us. She was a voice of compassion and reason. She  believed in the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689210/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Padilla, and Mr. Schatz):\n\nS. 1276. A bill to prioritize funding for an expanded and sustained  national investment in basic science research; to the Committee on  Health, Education, Labor, and Pensions.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…as President  and Managing Director of CNBC Europe. Earlier in his career, he served  the federal government as Executive Secretary at the United States  Department of Health, Education, and Welfare and as Special Assistant  for Renewable Energy at the United States Department of Energy. Across  every role, he demonstrated a  rare ability to navigate…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Mr. President, I rise today to recognize this week as  National AHEC--Area Health Education Centers--Week.\n\nThe AHEC program, originally authorized in 1971, began by working in  conjunction with other Health Resources and Services Administration  programs to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…have seen people who could not afford their insurance  and who therefore take the risk that they will not get sick. We should  not have that in our country.\n\nIn July, the Health, Education, Labor, and Pensions Committee--the  HELP Committee, which I chair--discussed affordability across the  entire commercial insurance market, trying to find out why costs…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…ObamaCare to  help a few.\n\nI will add, for as much as they talk about healthcare, the Democrat  shutdown is defunding important healthcare programs.\n\nAs chairman of the Health, Education, Labor, and Pensions Committee,  I led a bipartisan effort to protect Americans' access to affordable  over-the-counter drugs. The members of my committees worked together…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…XXVI, paragraph 5(a), of the Standing Rules of the  Senate, the following committees are authorized to meet during today's  session of the Senate:             COMMITTEE ON HEALTH. EDUCATION. LABOR, AND PENSIONS\n\nThe Committee on Health, Education, Labor, and Pensions is authorized  to meet during the session of the Senate on Thursday, July 17, 2025, at…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693750/authority-for-commitees-to-meet"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Committee on Education       and Workforce of the House of Representatives and the       Committee on Homeland Security and Governmental Affairs and       the Committee on Health, Education, Labor, and Pensions of       the Senate a national school security strategy (in this       section referred to as the `strategy'). The Secretary, in       consultation…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…departments, to establish a grant program to provide self-harm  and suicide prevention services in hospital emergency departments, and  for other purposes; to the Committee on Health, Education, Labor, and  Pensions.", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Authority............................................          25.392         121.706         241.572     Outlays.....................................................          23.858         120.549         237.629 Health. Education, Labor, and Pensions     Budget Authority............................................          58.247         281.354         537.451     Outlays.....................................................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…retired Exceptional  Student Education (ESE) teacher and current Board Secretary of NAMI  Hernando since 2017. In these roles, she has been a dedicated champion  for mental health education and inclusion. As the mother of an adult  son living with schizophrenia, Joanne brings both personal insight and  professional experience to everything she does. NAMI…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…4,099.418         22,698.075          52,311.217     Outlays...........................................          4,086.918         22,655.942  52,239.742-------- Health, Education, Labor, and Pensions:--------     Budget Authority..................................             58.247            281.354             537.451     Outlays...........................................…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694525/budgetary-revisions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the       Secretary of Health and Human Services shall submit to the       Committee on Energy and Commerce of the House of       Representatives and the Committee on Health, Education,       Labor, and Pensions of the Senate a report on the Secretary's       efforts, in coordination with industry, to ensure       implementation of the amendments made…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…issue, except for  doctors out of State now were mailing abortion pills to women my State,  intentionally going around our State laws--intentionally.\n\nThis morning, the Health, Education, Labor, and Pensions Committee,  chaired by my friend Dr. Bill Cassidy, held a hearing talking about  mifepristone.\n\nOne of the witnesses that was there was the attorney…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…fight to  reauthorize this important legislation alongside my good friend and  colleague Mr. Bill Cassidy, Senator from Louisiana and chairman of the  Senate Committee on Health, Education, Labor, and Pensions.\n\nI will continue to fight for the reauthorization of the Older  Americans Act to ensure it is available to provide this same life- affirming support…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693849/recognizing-the-60th-anniversary-of-the-passage-of-the-older-americans-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…DURBIN (for himself and Ms. Murkowski):\n\nS. 3707. A bill to provide for a wage differential program to support  new nursing school faculty members; to the Committee on Health,  Education, Labor, and Pensions.                                  S. 3707\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…strategic growth, and supporting long-term sustainability. His  leadership helped expand outreach efforts and foster new collaborations  that increased access to mental health education and support. Tommy's  commitment to advocacy inspired the creation of the annual Strike Out  Stigma fundraiser, an event that continues to unite the community in  support…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…XXVI, paragraph 5(a), of the Standing Rules of the  Senate, the following committees are authorized to meet during today's  session of the Senate:             COMMITTEE ON HEALTH, EDUCATION, LABOR, AND PENSIONS\n\nThe Committee on Health, Education, Labor, and Pensions is authorized  to meet during the session of the Senate on Wednesday, January 14,  2026,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699122/authority-for-commitfees-to-meet"}, {"senator": "John Thune", "party": "Republican", "sentence": "…(for himself, Mr. Gallego, Mr. Heinrich, and Ms.          Hirono):\n\nS. 2446. A bill to amend the Public Health Service Act to provide for  a behavioral and mental health outreach and education strategy to  reduce stigma associated with mental health among the Hispanic and  Latino population, and for other purposes; to the Committee on Health,  Education,…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694217/statements-on-introduced-bills-and-joint-resolutions"}]