[{"senator": "George Latimer", "party": "Democrat", "sentence": "…White  Plains, New York for his outstanding leadership and contributions as  President of the American Association of Nurse Practitioners (AANP).\n\nDr. Ferrara is a dedicated health care leader with over two decades  of experience, including extensive work as a practicing nurse  practitioner, health policy advocate, and academic leader. In addition  to his…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…``no,'' as I will.\n\nMr. DAVIS of Illinois. Mr. Speaker, I rise in strong opposition and  could never vote for this Big, Bad, Inhumane, and Ugly bill because it  will wreck health care delivery, take food from hungry children,  sentence seniors to early deaths, eliminate jobs, and destabilize our  economy just to give the super rich and wealthy more influence,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…1975, KYCC has grown into a leading multiservice  organization in Koreatown, serving more than 12,500 people each year.\n\nFrom youth development and counseling, to housing, health care, and  economic empowerment, KYCC has met the evolving needs of families  across Koreatown\n\nAnd we have seen KYCC give back year after year.\n\nDuring the pandemic, during…", "date": "2025-12-30", "source_url": "https://justfacts.votesmart.org/public-statement/1698473/recognizing-the-50th-anniversary-of-the-koreatown-youth-and-community-center"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…wrote:\n\nThe Catholic Church teaches that human life is sacred, and       all people have inherent dignity and worth. As Catholic       bishops and organizations that provide health care and social       services on behalf of the church, we firmly believe that all       people have the right to those necessities needed to live,       found a family and flourish.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…lifesaving, urgent services for the most  vulnerable among us. The cuts to Medicaid, Medicare, and the  Supplemental Nutrition Assistance Program (SNAP) alone will take health  care and food assistance away from millions of veterans, seniors, and  families across the country.\n\nCongressional Democrats offered many amendments to ensure that  critical…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Peoples.\n\nThis common history, knowledge and approach, in such key areas as  preservation of unique cultures, sustainable use of our natural  resources, and advancement of health care, offers all of us not only a  wealth of expertise on their own challenges but on those we all face.  To better coordinate focus on indigenous peoples worldwide and engage…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…face: long  travel times for medical care, unreliable transportation, and a system  that too often overlooks them.\n\nHis advocacy directly shaped my New Mexico Rural Veteran Health Care  Access Act, which will redraw the Veterans Integrated Service Network  lines. This change will allow veterans in Otero County and Eddy County  to receive care at a closer…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…help address upstream suicide  risk factors and provide services to support veterans' needs. It was  never intended to directly provide clinical care, particularly mental  health care.\n\nCombined with my existing concerns about the bill's lack of  requirements to strengthen data collection and demonstration of  effective outcomes, I remain extremely concerned…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…rising cost of living.\n\nNearly 1.3 million Minnesotans--about one quarter of our state--are  covered by Medicaid. A cut of this magnitude would have severe  consequences for health care access for the families, seniors, people  with disabilities, and especially children who rely on this coverage.  That includes 172,000 of my constituents here in the Fourth…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…training for  teachers and expanded crisis and early intervention services. Thanks to  Sue's unwavering commitment to expanding culturally responsive, person- centered mental health care, our communities are safer and healthier.\n\nMr. Speaker, I am grateful for her years of service, and I hope she  has a wonderful retirement.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Speaker, we are going to adjourn and not do the  peoples' business because we have thus far gotten an ``F.'' An ``F''  for the work of the people in this Congress. We have taken health care  away from hundreds of thousands of people. We have taken SNAP payments  and nutritional sustenance, away from tens and hundreds of thousands of  people. We have made injuries…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…opportunity to prevent, detect, treat, and survive  cancer.\n\nSpecifically, he has worked to advocate for better screening to  prevent late-stage diagnosis, improving access to health care and  treatment, clinical trials, and funding for research for those battling  cancer. He is passionate about ensuring all Americans have access to  the medical care that…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…nonprofit organization  dedicated to serving veterans, active-duty service members, first  responders, caregivers, and their families through comprehensive  housing, behavioral health care, wellness, and community support  services.\n\nEndeavors has demonstrated commitment to the El Paso community  through the establishment of the Endeavors Health & Wellness…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696519/recognizing-the-grand-opening-of-the-endeavors-health-wellness-center-in-el-paso"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Department of  Veterans Affairs to approve the request from northwest Ohio to expedite  the dual affiliation of the University of Toledo Medical Center and the  VA Ann Arbor Health Care System. Our VA community clinic in Toledo  stands ready to support this effort, and over 83,000 veterans in the  northwest quadrant of Ohio deserve the convenience of access…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…from their healthcare--including 173,000  Minnesotans.\n\nWhat will happen when those Americans delay preventive care and  treatments they can't afford because they have no health care?\n\nThe ugly consequences of this bill include tens of thousands of  premature deaths a year.\n\nThis bill will also force millions more Americans to pay higher  premiums, higher…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…more than a  figure. They are missed appointments, endless long waits, and  canceled procedures.\n\nAmerican heroes' lives are at stake. Back home in Arizona, the  Phoenix VA Health Care System covers 100,000 veterans. The Southern  Arizona VA Health Care System covers yet another 170,000. Every one of  them deserves access to qualified providers.\n\nArizona's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…University of California, Los Angeles--School of  Public Health where he received his Master of Public Health degree. He  also attended UCLA Anderson School of Management's Health Care  Executive Program.\n\nSince 1993, Jeffrey and his colleagues at the Association of Asian  Pacific Community Health Organizations have dedicated their time and  energy to…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Mr. GRIFFITH. Mr. Speaker, I rise today to commemorate a landmark  moment in both American aviation history and rural health care  innovation: the 10th anniversary of the first Federal Aviation  Administration (FAA)-approved drone delivery, which took place in Wise  County, Virginia, on July 17, 2015.…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I rise today in strong support of my  bill, the Lower Health Care Premiums for All Americans Act, a bill  rightfully named because that is exactly what it does.\n\nRepublicans want to lower healthcare costs and premiums for all  Americans,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…making Pasco County's achievement especially noteworthy. Pasco County  is proud to once again be among this distinguished group, with  recognition for its Behavioral Health Urgent Care Center (UCC)--the  first Behavioral Health UCC in the State of Florida, This innovative  project was developed to address a critical gap in access to urgent  mental health…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Guard research,                development, and innovation program. Sec. 602. Comptroller General review of quality and availability of                Coast Guard behavioral health care and resources for                personnel wellness. Sec. 603. Comptroller General study on Coast Guard efforts to reduce                prevalence of missing or incomplete…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…physician for a period of not more than       one year at a time. A physician assigned to serve as a       traveling physician under this section may be assigned to       provide health care to veterans residing in American Samoa,       Guam, the Commonwealth of the Northern Mariana Islands, the       Commonwealth of Puerto Rico, the Virgin Islands of the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695431/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Medical Center. Her performance earned her early promotion  and selection as a laboratory journeyman, leadership school graduate,  and eventually, instructor at the School of Health Care Sciences. In  1989, she transferred to Sheppard AFB as a lab instructor and married  fellow Airman, TSgt. Robert Rene Ybarra, in 1990.\n\nIn 1990, both were reassigned to…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Tenant-based rental assistance, as defined in section       8(o) of the United States Housing Act of 1937 (42 U.S.C.       1437f(o)).\n\n(ii) Supportive services, including health care, housing       services, permanent housing placement, day care, nutritional       services, short-term payment for rent, mortgage, or utility       costs, and assistance…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Florida. We actually  audited how much we spent on Medicaid emergency care last year. It was  $660 million for hospital care for illegal immigrants, according to the  Agency for Health Care Administration in Florida. That was $660 million  that was intended to be spent on healthcare for American citizens, or  to maybe move the dollars around for education or…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…2025''.       SEC. 2. DELIVERY, DISTRIBUTION, AND DISPENSATION OF                     CONTROLLED MEDICATIONS BY COVERED DEPARTMENT OF                     VETERANS AFFAIRS HEALTH CARE PROFESSIONALS VIA                     TELEMEDICINE.\n\nSubchapter III of chapter 17 of title 38, United States       Code, is amended by adding at the end the following new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695456/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…all exchange enrollees in       2024, do not use their benefits at all. For these enrollees,       known as zero-claim enrollees, health coverage did not       translate to health care. Many zero-claim enrollees are known       as ``phantoms''--people who are enrolled but not practically       in the market because they are enrolled in other coverage or…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…section 4 of       the Americans with Disabilities Act of 1990 (42 U.S.C.       12103).\n\n(2) Covered entity.--The term ``covered entity'' means any       licensed provider of health care services (including licensed       health care practitioners, hospitals, nursing facilities,       laboratories, intermediate care facilities, psychiatric       residential…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…substance use disorder alone, 1115 waivers were pivotal in early  efforts to lift the IMD exclusion, an obsolete edifice to the Medicaid  program that undermines access to mental health care and substance use  disorder care by only allowing for Medicaid to reimburse for care in- patient facilities with fewer than 16 beds.\n\nUnder President Trump's guidance, in…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Thousands of citizens will now reap the  benefits of this achievement, including expanded educational  opportunities, strengthened economic development, improved access to  health care, and an enhanced quality of life for countless families and  businesses.\n\nTombigbee Electric Cooperative has demonstrated that when vision,  leadership, and commitment to…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}]