[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Speaker, we are going to adjourn and not do the  peoples' business because we have thus far gotten an ``F.'' An ``F''  for the work of the people in this Congress. We have taken health care  away from hundreds of thousands of people. We have taken SNAP payments  and nutritional sustenance, away from tens and hundreds of thousands of  people. We have made…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…open-door policy which encouraged  colleagues and constituents and elected officials to become engaged. He  devoted his life to improving our community, to strengthening public  health and public safety, and to creating new opportunities for all  Rhode Islanders to thrive. He made significant strides toward improving  the lives of working Rhode Islanders,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…the islands lost their  ancestral homes, now uninhabitable, and the people who were exposed to  fallout were immediately sickened with ongoing, long-term impacts for  human health, including increased rates of birth defects, genetic  disorders, and secondary cancers.\n\nThe nuclear age taught us that while bombs may drop in seconds, their  impact crosses…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…U.S. doctors.\n\nLet's be clear by what we mean by gender-affirming care. We don't  only mean surgery. Sometimes it is just using the correct pronouns.  Sometimes it is mental health care. Sometimes it is hormone therapy.  Yes, sometimes it is surgery.\n\nThis ban would also take away mental health care from the trans  children of our servicemembers. We know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…and in supporting this important legislation by  becoming a cosponsor of H.R. 1143 that will help promote therapy  adherence, enhance quality of life, and promote positive health  outcomes for beneficiaries with CIDP and MMN.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Just Award for Excellence in Biology:       Shreya Soni and Peyton Tran, South County High School\n\nDr. Oscar James Cooper, M.D., Award for Excellence in       Biomedical and Health Sciences: Chloe Giglio, McLean High       School\n\nProfessor Frank Coleman Award for Excellence in Physics and       Astronomy: Leona Agyepong, Lake Braddock Secondary School…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…30, Medicare telehealth coverage will end, and many  patients will have to see their doctors in person only.\n\nThat is why I am urging my colleagues to pass the CONNECT for Health  Act and make telehealth coverage permanent. This is common sense. It  lowers costs, and it means less emergency room visits. Everyone wins.\n\nWe must save telehealth coverage…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Social Security Administration; $192 million from the General Services  Administration; $173 million from the Department  of Agriculture; $152 million from the Department of Health and Human  Services; $133 million from the Department of Transportation; and $119  million from the Department of Commerce.\n\nWe didn't have any transparency into what these…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…understand that last year, Congress rejected--again,  Congress rejected last year many of the changes being proposed now in  the PERMIT Act because it had damaging impacts to the health of  families, the economy, and our environment.\n\nMr. Chairman, it is not just this bill. This week, Republicans are  voting now on five dirty energy bills that attack communities…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…energy  source. Coal pollution from powerplants befouls our air, pollutes our  water, and leaches into our food. Coal pollution causes acid rain. Coal  pollution causes severe health issues, even death.\n\nBetween 1990 and 2020, pollution from coal-fired powerplants killed  460,000 Americans--23,000 deaths per year on average. Despite how  massive that death…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…families--for all of you. And that is it. That is it. This is  why Trump is about to shut down the entire Federal Government.\n\nYou know, my dad often said: If you don't have your health, you don't  have  anything. And it is clear that Donald Trump and Washington Republicans  want you to have nothing--nothing--because they are doing everything  they can to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…signed it into law. The system is supposed to work  that way.\n\nProtecting species like the longfin is not just about a single fish,  but it is about protecting the ecological health of the entire bay- delta, the largest estuary on the West Coast of the Americas. This  delta is the heart of California's water system. Its health underpins  clean drinking…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…determined to earn the American Dream. She graduated  with high honors from Godinez Fundamental High School in Santa Ana and  then went on to earn a bachelor's degree in public health from UC  Merced in 2019.\n\nMartha's passion for innovation led her to University Lab Partners,  where she helps startup companies develop groundbreaking medical  devices and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688313/daca-recipients-need-pathway-to-citizenship"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…commitment to helping our students unplug.\n\nAs a father of two kids, I know the importance of creating a learning  environment that nurtures the academic success and mental health of our  young folks.\n\nCollaborating with educators like Dr. Catlett has been critical in  working to build a stronger future for Virginia's next generation of  leaders. I extend…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692135/recognizing-dr-marcy-catlett"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…reconsider be considered made and laid upon the table  with no intervening action or debate.\n\nMs. ALSOBROOKS. Thank you.\n\nMs. ALSOBROOKS. Robert F. Kennedy, Jr., Secretary of Health and Human  Services, is presenting a clear and present danger to the health and  well-being of the American people. He oversees 13 Agencies that are  critical to U.S. health…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…costs, it should be on the table.\n\nI would remind my colleagues on the other side of the aisle that  financial stress induced by higher utility costs also increases  negative health outcomes.\n\nWe need balance, not heavy-handed leftist mandates that harm the  economy, increase costs, and increase poverty, which, again, increases  negative health outcomes.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Natalie: Wall       Street Journal/Dow Jones; Anglin, Tara: New York Times;       Aoyama, Ryo: Asahi Shimbun; Appelbaum, Binyamin: New York       Times; Appleby, Julie: KFF Health News; Aratani, Lori:       Washington Post; Archambault, Haley: Asahi Shimbun.\n\nArmour, Stephanie: KFF Health News; Arnsdorf, Isaac:       Washington Post; Asher-Schapiro,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…furnished to individuals with similar       conditions and characteristics in the inpatient setting and       through the Acute Hospital Care at Home initiative, including       health outcomes, hospital readmission rates (including       readmissions both within and beyond 30 days post-discharge),       hospital mortality rates, length of stay, infection…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "Mr. HUDSON. Mr. Speaker, my bill, H.R. 3668, would guarantee we  protect the environment, ensure we protect public health, and lower  energy costs by speeding up energy projects through much-needed reforms  to the permitting of interstate natural gas pipelines.\n\nThe development of interstate pipelines…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…needs to live up to its obligations to keep us safe.\n\nGet the homeless people help. Letting them live in the streets is not  helping them. You are hurting them. Get them mental health counseling.  Get them a shower. Get them a job. Get them help. Letting them live  under bridges is not helping them. It is wrong. The fact that I have to  sit up here and tell…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…why I partnered with my  colleagues to introduce legislation called the Medicare Audiology  Access Improvement Act. Our bill will let seniors access a full range  of hearing health services provided by licensed audiologists without  the redtape.\n\nDuring Audiology Awareness Month, Americans should be aware that they  can access hearing aids over the counter,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696431/national-audiology-awareness-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…15th Congressional District  and as chairman of the House Agriculture Committee, I know firsthand  the central role that dairy plays in our economy, our communities, and  our health.\n\nPennsylvania is an incredible dairy State. With more than 6,200 dairy  farms, we rank second in the Nation in the number of dairy operations  and eighth in milk production.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…option to choose the milk that they want to drink.\n\nMilk is an essential building block for a well-rounded and balanced  diet, offering 13 essential nutrients and numerous health benefits.\n\nUnfortunately, out-of-touch and outdated Federal regulations have  imposed restrictions on the types of milk students have access to in  school meals. While the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of her dedication. Recognizing the crisis of  veteran suicide, Diane took action. She joined forces with Vietnam war  hero Captain David A. Christian to establish Victor Six Health and  Fitness, an innovative program designed to combat the mental and  emotional struggles afflicting so many of our returning servicemembers.\n\nDrawing upon groundbreaking…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Lumbee, this amendment would in  one stroke create the largest Tribe in the country, granting immediate  access to already overstretched Bureau of Indian Affairs and Indian  Health Service resources.\n\nAs a member of the House Appropriations Committee, I am proud of the  work that we have done to provide robust funding for the Indian Health  Service and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…and reports data on the causes of death among veterans with a  particular emphasis on accurately identifying when suicide is a primary  or contributing factor.\n\nThe mental health crisis among America's veterans has reached an  alarming level. Suicide is now the second leading cause of death for  veterans under the age of 45.\n\nDespite ongoing efforts,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…America. That is  millions in America.\n\nMr. Speaker, I don't know of an American that you talk to about  fentanyl who won't tell you that they know someone whose family, their  health, or their child has been destroyed by fentanyl, many of them  being destroyed as we speak.\n\nThere are about 1,900 miles of Mexican border between the United  States and Mexico.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…and we were busy  with catalytic scrubbers on all the industry that we had  making sure that Texans had clean energy. We care about the  environment. We care about people's health. We care about the future.  We care about the economy.\n\nIt is a little bit curious to me to hear our friends across the aisle  say that we don't care about any of that stuff.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…XXVI, paragraph 5(a), of the Standing Rules of the  Senate, the following committees are authorized to meet during today's  session of the Senate:             COMMITTEE ON HEALTH. EDUCATION. LABOR, AND PENSIONS\n\nThe Committee on Health, Education, Labor, and Pensions is authorized  to meet during the session of the Senate on Thursday, July 17, 2025,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693750/authority-for-commitees-to-meet"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…University with a  Bachelor of Science degree in 1973.\n\nAfter graduation, he worked at the Department of Human Resources as a  social worker for 36 years. He also worked at Piedmont Health Care  Center as the Alzheimer's Coordinator and Activity Director after his  retirement from DHR.\n\nMayor Baker was awarded a State of Alabama Senior Citizens Hall of  Fame…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693645/recognizing-the-retirement-of-mayor-bill-baker"}]