[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Already a community health center in my district is feeling the  impact of the healthcare cuts.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "President, 52 organizations in Alabama,  including the Alabama Cancer Society, the Leukemia & Lymphoma Society,  churches all across the State, wrote to the Governor urging opposition  to healthcare cuts, citing the need for more care and less bureaucracy.", "title": "One Big Beautiful Bill", "date": "2025-06-17"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Reversing the draconian  and cruel healthcare cuts that House Republicans pushed through just a  mere 7 weeks ago is at the top of the list.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": null}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Republicans made devastating healthcare cuts to Medicaid and the  Children's Health Insurance Program.", "title": "Ensuring Funding for Communities", "date": null}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "We are  fighting for him and we are fighting with him and every family facing  these terrible decisions with these healthcare cuts.", "title": "Shane's Story", "date": "2025-05-01"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "But not only are we not having that discussion with this budget, we  are having a discussion about a budget that cuts taxes and blows this  massive hole in the deficit, no matter how much the healthcare cuts  are, of about $4.6 trillion.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "In Texas, these healthcare cuts will be catastrophic.", "title": "Republicans' Assault on American Arts, Culture, and Public Knowledge", "date": "2025-05-15"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "I am here to stand up against a bill that kicks 17 million Americans  off of their healthcare, a bill that cuts school lunches and food  assistance to children who go to bed hungry every night, a bill that  includes billions of dollars for ICE, an already bloated agency that  has been upending due process and racially profiling people in my  district for weeks.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "You will see cuts: cuts to healthcare, cuts to  services, and cuts to the very people who need help the most.", "title": "Opposing Provider Tax Restrictions in the Gop Reconciliation Bill", "date": "2025-06-26"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "These are just a few things, in addition to healthcare, if the cuts  to Medicaid happen--it goes away.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Looming healthcare cuts are about to result in skyrocketing  premiums for Americans across the Nation.", "title": "District of Columbia Cash Bail Reform Act of 2025", "date": "2025-11-19"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Several hospitals that are barely  squeaking by today have told me they will fall into the red because of  the Republican healthcare cuts in this law.", "title": "Healthcare", "date": "2026-01-07"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "They are feeling  the largest healthcare cuts in the history of the country that were  passed in the big, ugly bill, and they know firsthand that the deeply  inadequate rural healthcare fund comes nowhere near making up for the  lost revenue that happened in that bill.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}]