[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…law, for God's sake. Hang the  plaque.\n\nMr. McGOVERN. Mr. Speaker, is the gentleman prepared to close?\n\nMr. McGOVERN. He has no more speakers?\n\nMr. Speaker, what we have heard today is excuse after excuse after  excuse, diversion after diversion, but no answers to the questions that  I have asked: Why won't the Trump administration release the Epstein…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…word ``patriotism'' a lot, and it is often used  in a way to brandish pride or, at its worst, as a way to condemn  others. But the truth of patriotism was in the language we heard today;  it is in the language of love, the fact that you cannot love your  country unless you love your fellow country men and women.\n\nI am excited that New Jersey has a Senator…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…medication and equipment; support lines for caregivers that have  been reduced; Veterans Crisis Line employees fired and, after a public  backlash, maybe some rehired, as we heard today in a hearing of the  Veterans Affairs' Committee. But the impact is enduring because suicide  prevention has to be done in the moment, and suicide  prevention training sessions…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…families are  so afraid to send them to school.\n\nIt is in Mankato, MN, which is in the southern part of the State. It  is another regional center, a farming community. I heard today on the  public radio station that the local immigrant rights organization is  getting 400 calls a day from people who are trying to figure out what  their rights are, what…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…about the damaging impact of  President Trump's tariff taxes. I call them taxes because that is what  they really are, but those tariffs, particularly on Canada, although we  heard today that he announced a number of others.\n\nI have been hearing from a lot of small businesses in New Hampshire.  But on Monday, I visited a bakery in Derry, NH, that may have…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…this resolution for both the extreme  danger that it poses to the Boundary Waters and the outrageous abuse of  the Congressional Review Act that it represents.\n\nAs you have heard today, the Boundary Waters Canoe Area Wilderness is  an American treasure with a strong, nonpartisan history of protection,  dating back to 1909 through treaties with Canada and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…families afford necessities like food, rent, and  childcare to crisis pregnancy centers that prey on vulnerable women  seeking legitimate reproductive healthcare.\n\nWe have heard today that wonderful, caring people staff these crisis  pregnancy centers, and I don't doubt that, but crisis pregnancy centers  do not provide medical care, though they imply…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…going to take  just a couple minutes to thank all of my colleagues from the  Congressional Black Caucus for being here this evening.\n\nTo reiterate a little of what we have heard here today, I represent a  congressional district in South Carolina that includes ZIP Code 29203.  It happens to be the ZIP Code that I live in, Columbia, South Carolina.  My house…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…employees and flash-bang grenades were used outside.\n\nThere are stories like this from communities all across the country  about what this administration has done. We heard them today. Stories  of Trump's immigration agents causing fear and chaos. Stories of  violent raids turning quiet neighborhoods into places that feel more  like war zones.\n\nTrump's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697447/fighting-dhs-immigration-raids"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…challenge. Federal enforcement is  not abstract to us. It is the difference between support and neglect.\n\nThe reality is, IDEA has also been an unfunded mandate. You have  heard it here today from my colleagues. The Federal Government once  promised to cover 40 percent of the cost. It has never met that  promise, never rising above 10 or 12 percent at best.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698942/protecting-education-for-children-with-disabilities"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…be the Wild West with uncertainty, or  do we want to have clear rules of the road to protect consumers? Do we  want to do something or nothing? Is it perfect? As you have heard  today, no, it is not perfect. Few pieces of legislation we bring here  are.\n\nThe questions are: Will it do good? Will it make sure that we look  after people who are involved…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…conservative  principles both for his district in Utah and for the country at large.\n\nMr. KNOTT. Mr. Speaker, I thank the gentleman for his remarks.\n\nMr. Speaker, you have heard today from our colleagues and myself  about the outrageous government-funded incentives and plans to keep  illegal aliens not only flowing into this country but also to stay in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…previously  predicted by one of our earlier speakers, increased purchase prices.\n\nBriefly, I will address the congressional resolution of disapproval  process. We have heard a lot today about all this, and I would submit  to you that Congress under Article I should deal with repealing  regulations, particularly when that regulation has significant impact…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…formula to impose and collect  a tax based on intensity, Biden's EPA did so by ignoring well- established international standards.\n\nActually, one of the things I have heard here today is that industry  was consulted. That is false. Industry was not consulted. In a hearing,  I asked a member of Biden's Department of Energy to tell me one  producer they…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…critical mental health care. Additionally, this bill will  strengthen the FAA's hiring of medical examiners to help clear the  backlog of special issuance requests.\n\nAs you heard today, Mr. Speaker, this bill will keep pilots flying,  air traffic controllers working, and airspace safe while getting people  the help that they need.\n\nMr. Speaker, I urge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Speaker, the Federal Register lists this class of  equipment, and the simple payback period in years is 93.9 for all  purchasers. I have it right here.\n\nMr. Speaker, as we have heard today, the Biden-Harris administration  DOE's final rule for commercial refrigeration equipment will have a  detrimental impact on small businesses and the consumers. If small…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…has fully secured our border and eliminated over $100  billion in government spending on waste, fraud, and abuse.\n\nMy Democratic colleagues speak of confusion, as we have heard today.  Let me remove some of that confusion. President Trump's new proposal on  tax cuts is for those making tips, not the wealthy; those on overtime,  not the wealthy; and reducing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…in my congressional  district would be without a job. That is why I urge my colleagues to  join me in support of this critical legislation.\n\nTo put everything that we have heard today into perspective,  noncondensing tankless water heaters account for 40 percent of our  country's tankless water heater market. A majority of those water  heaters are manufactured…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…SESSIONS. Mr. Speaker, I thank the young chairman of the  Committee on Oversight and Government Reform from Kentucky (Mr. Comer)  for yielding time.\n\nMr. Speaker, what we have heard today is a continuation of this lame  excuse of politics and on Donald Trump. The gentleman from California  did allude to it but really did not get into much more of the data.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}]