[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and gives back to the community. She is a taxpayer. She  is an example of what is possible when we actually invest in people and  give them the care that they need.\n\nAfter hearing her story, we were able to implement this waiver to  really increase our capacity as a State to address the opioid crisis.  We know that more people have died from the opioid…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…forced to appear before, should be  IMPEACHED!!!''\n\nAnother U.S. District Chief Judge has reported receiving increased  numbers of violent threats, particularly after he began hearing  arguments in a lawsuit against the Trump administration.\n\nIn 2025, roughly a third the federal judiciary has been flooded with  threats, with data showing that these threats…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the Capitol, they marched down to the Capitol. When the whole  place was falling apart here and he was getting urgent calls from  the then-Speaker Kevin McCarthy, when he was hearing from others, he  was going on to tweet against Mike Pence for not abusing the authority  of the Vice President of the United States--by the way, it is not even  authority.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…for obstructing justice by allegedly directing a migrant out of her  courtroom through a side door, as Federal agents waited to arrest him  in the hallway. He was there for a hearing on charges unrelated to his  immigration status.\n\nImmigration and Customs Enforcement, ICE, did not even have a  judicial warrant to arrest him. A judicial warrant is based…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Trump's worst impulses, and to exert Congress' Article I powers  against the executive's repeated overreach. In the context of the NDAA,  there hasn't been a single oversight hearing scheduled in the House or  Senate to address the ongoing misuse of our military forces.\n\nOf all Trump's abuses, his worst have been in the domain of national  defense. Empowered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…them to facilitate the return of an  individual who was deported without due process. Alongside others, he  was sent to an inhumane prison in a different country without a  hearing. This happened in the United States, violating his right to due  process. There are many individuals whose stories deserve to be told,  so today I am going to highlight just…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in 10 different States who were physically assaulted, pepper- sprayed, denied medical treatment, detained, sometimes for days, by  Federal immigration agents. And we did a hearing with a number of those  American citizens who were injured, denied medical care, prevented from  contacting their families or lawyers, some of them for days on end,  while…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…occur. The United States should not be stepping back; we should be  stepping up.\n\nFew leaders understood these stakes more clearly than Madeleine  Albright. At her confirmation hearing for Secretary of State, she said,  ``Democratic  progress must be sustained as it was built, by American leadership. And  our leadership must be sustained if our interests…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…recognize that, but it is true. The numbers  do not lie.\n\nSo 100 days of chaos, increased costs, and corruption are shrinking  our economy. To my Republican colleagues: Are you hearing this? Are you  listening? Are you prepared to act?\n\nAmerican businesses are going to be forced to take on some of these  higher costs for materials, to cut back on production,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…have watched the movie about ten  times.\n\nFrom Transformers to Lincoln Logs to Barbies, this administration is  raising prices in our toys aisles with these tariffs. We keep hearing  that this President is ushering in a golden age. I  think raising costs on families buying gifts, clothes, or shoes for  their children does not sound very golden to me,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692923/lowering-costs-for-all-virginians"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today because I have been  hearing from so many constituents in northern Virginia about the Office  of Personnel Management. That is because there are 16,000 retirement  claims pending at OPM, and a lot of…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690798/pending-opm-claims"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…they have done multiple times over the last year.\n\nThe President's chaotic trade war has been crushing businesses and  raising prices on families across the country. I am hearing from  communities across Washington about the devastating impact of these  tariffs. A small business owner in my district told me he is being  tariffed out of business. I…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Congressional Black Caucus, and I want to just share some of my own  stories coming from my district and also my experience.\n\nI was in that Judiciary Committee where we had the hearing on  immigration, and I was in that Committee when Republicans voted to  deport and detain Americans, where they voted to allow for cavity  searches on children, where they…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…constituents? Because, last  week, window shopping for next year's health plans actually started in  my home State, and, this week, open enrollment begins nationwide. I am  hearing from families in my State today who are panicked.\n\nWhile Republicans are refusing to act on this and saying they are  going to talk about it, their premiums--their family's…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…stores, and supermarkets across the  country, and Republicans' anti-efficiency agenda will rob them of these  cost savings.\n\nThis is especially concerning at a time when we are hearing more and  more stories about the damaging impacts of Trump's extreme tariffs, the  rising cost of groceries, and the chaos and uncertainty that Trump is  bringing every day…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the administration and really stepped up in  this past week or so.\n\nIt is one thing to have a discussion. It is one thing to have a  conversation. But, instead, what we are hearing is some pretty  aggressive rhetoric from the Trump administration and some members of  Congress. There are statements that we are seeing that are suggesting  that not only…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…complete  this workforce program are earning more and are in a better spot than  they were before entering the program. VR&E currently does not track  those results.\n\nAt a recent hearing, VA told the committee that 45 percent of  veterans who successfully complete the program reenter it later. This  does not show that the program is working for veterans. In…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695445/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…would authorize a new site for  the memorial just south of the White House, where John and Abigail  Adams were the first Presidential family to reside.\n\nDuring a legislative hearing in the Federal Lands Subcommittee,  Jackie Gingrich Cushman, the chair of the Adams Memorial Commission,  testified: ``The Adamses exemplified strength of character, belief…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…minority. The American people were  tired of being told what to do, what they could buy, what they could  wear, and what they could use. Here we are, and my colleagues are  hearing the same cold rhetoric that leads to cold homes and cold water.\n\nI introduced this resolution because we are determined to restore a  quality of life in this country that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…material to the National Center for Missing and  Exploited Children, was signed into law. I applaud Chairman Biggs for  beginning the 119th Congress with our first subcommittee hearing once  again focused on protecting victims of online exploitation.\n\nOur work is far from over, which is why I look forward to passing the  Combating Online Predators Act today.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…in an airport or on the House floor or walking  through the tunnels. He never failed to accompany that with jokes from  ``My Cousin Vinny'' about the ``youts.''\n\nI hope that hearing all of these memories and all of these stories  that people have of Doug will comfort his family, his staff, and  everybody else who is missing him at this difficult time…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698744/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…impressed me was how he managed to stay  in contact, to offer to help to push issues forward, and to lend a hand  no matter how big or small the cause.\n\nRecently, I appreciated hearing from him as I had put some  information forward, and he responded immediately on what a good idea  this was.\n\nI do want to share just one example of his generosity. One of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…perhaps unlike  ever before, because of President Trump's incredible leadership.\n\nAs President Trump said at the State of the Union, our country is  winning again. I loved hearing that from him. It made me so proud to be  a U.S. Senator serving with President Trump in the White House once  again.\n\nAnd while President Trump was celebrating our country,…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Walz has announced he is not going to seek  reelection for that job, that he is dropping out of the race.  Minnesotans deserve an immediate resignation from him, and we are  hearing that he will not do that.\n\nWe know that this issue goes far beyond Minnesota. Just last month,  California's nonpartisan auditor found that eight State agencies have a  high…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Madam Speaker, this bill would ensure that the best judges with  vitally important firsthand experience are serving our veterans at the  VA.\n\nVeterans expect that those who are hearing their appeal or reviewing  evidence in support of their appeal, have the skills, knowledge, and  experience in veterans law to make sound decisions.\n\nI support this commonsense…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699210/veterans-law-judge-experience-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Speaker, I have chaired several hearings over the years on forced  organ harvesting beginning over one-quarter of a century ago. In June  of 1998, 27 years ago, I chaired my first hearing on forced organ  harvesting in China. A Chinese security officer testified that he and  other security agents were executing patients with the doctors right  there and the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…gentleman from  Florida (Mr. Mast), the true sponsor of this amendment who has just  arrived to state his position.\n\nMr. JOYCE of Ohio. Mr. Chairman, what else can I say after hearing  the true story of a true American hero and why it should be important  for all people--Floridians, every veteran--to be able to access  cannabis if, in fact, it is necessary…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692949/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…economic and national security  interests unchecked and the opportunity to lead in the development of  standards for the next generation of wireless technology.\n\nAlready, we are hearing about the Chinese Communist Party's efforts  to dominate the upcoming 2027 World Radiocommunication Conference.\n\nI again thank the Representatives from New Jersey's Seventh…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…signed collective bargaining agreements with Federal employee  union bosses specifically designed to tie the hands of incoming  President Trump.\n\nIn January, at our very first hearing this Congress, the House  Committee on Oversight and Government Reform heard testimony from  President Biden's Social Security Commissioner, Martin O'Malley. He cut  a deal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…made  available for new infrastructure development.\n\nNagruk Harcharek, president of the Voice of the Arctic Inupiat,  stated in a September 2023 Natural Resources Committee hearing that:  ``We also felt heard when BLM released an NPR-A Integrated Activity  Plan (IAP) in June 2020 that considered the interests of our  communities, including future community…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}]