[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…California plans on continuing to exercise our legal authority under  the Clean Air Act to protect kids, to set ambitious but achievable  goals, to reduce pollution and, yes, Heaven forbid, set an example, set  a model, set a path for other States to follow if they wish because no  one is forcing California  standards on States that don't voluntarily choose…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Every single one of us knows what  it is like to have a loved one struggling when it comes to their care.  I know everyone knows that experience of saying we would try to move  Heaven and Earth to be able to make sure that they get the care that  they need in their time of greatest need. How can I--when I stand by  thinking about 4.5 million Americans, including…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…America, in addition  to our veterans, our men and women in uniform--and I am proud that I  stand here as the son of someone who once wore the uniform, my father.  He is in Heaven right now.\n\nMarland Jeffries grew up in Newark. His nickname was Pudding. One of  my regrets is I never got to ask him how he got the nickname Pudding.  He left Newark as a…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…corporations and private equity. Any giveaway or  special treatment an ultrawealthy corporate executive can dream of, the  Treasury Secretary and his crew are there to move Heaven and Earth to  make it happen.\n\nWith respect to the resolution we are voting on today, the question  is whether the most profitable corporations and private equity giants  in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…to  Medicaid, closing Social Security offices, threatening Medicare, laying  off veterans at veteran services offices, and then providing a tax cut  to those in billionaire heaven down in the Cabinet.\n\nLet's have an honest discussion between the two parties about fiscal  policy.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689892/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Speaking for my cousin Nina and I, we       so wish we could have been flies on the wall at one of those       legendary gatherings.\n\nIt is said that there's a special place in heaven for the       father of three girls. I remember seeing that written on a       piece of art hung in the home of dear family friends, Ray and       Peg Ramsey's home for years.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…another, and not a  single peep from my Republican friends. Nothing. Now, Mr. Speaker,  Republicans have the nerve to come down here and censure anyone.\n\nRepublicans moved heaven and earth to come down here and defend the  honor of their boss, Donald Trump, but they won't lift a finger for  their own constituents. Look in the mirror and censure yourselves.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the bills on the floor  today: more garbage, more culture war crap, more bills written by this  Republican majority of, by, and for the billionaire class.\n\nRepublicans moved Heaven and Earth to give tax breaks to the rich and  powerful. That got done in a nanosecond.\n\nIf you are a regular person staring down next year's healthcare  premium hikes and deciding…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…perhaps not giving them full halo status, let me  say that these angel investors do play an important role in our  economy, even if they have named themselves after the angels of Heaven.\n\nLet's break down two things with the bill. First, it allows startups  to discuss their products and business plans at certain events known as  demo days without such discussions…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…need Medicare, who need Social Security.\n\nI just have to say: If Republicans are so enamored with this big,  beautiful, backstabbing bill and believe it to be the manna from  heaven, then they shouldn't be afraid to go into their districts and  talk about the cuts, talk about cutting Medicaid.\n\nLook at the person in the wheelchair, look at the person who…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…And now we want to gut it $880 billion?\n\nJohn McCain--most people remember the thumb down. They don't remember  his words; they don't remember the warnings. This man is in Heaven now  and his words, they speak to us in this moment again. Why won't we  listen to them?\n\nOur deliberations today, not just are debates but the       exercise of all our responsibilities--authorizing…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…preacher's kid, and as I listened  to the debate on the billionaire bonus bill, I couldn't help but think  of Matthew 25:31-46 where Jesus said that when He came into His glory  in Heaven and all the nations of the Earth would come and be divided  and He would turn to the righteous and say: Come, you who are blessed  by my Father; take your inheritance, the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…the Texas sun      And no one guessed that a man so blessed      Would perish by the gun      Lord, would perish by the gun      A shot rang out like a sudden shout      And Heaven held its breath      For the dreams of a multitude of men      Rode with him to his death      Lord, rode with him to his death      Yes, the heart of the world weighs heavy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697104/saluting-the-life-of-john-fitzgerald-kennedy"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…and great- grandchildren. It was in this same house, on January 14, 2026, that  Doris passed away at the age of 93.\n\nDoris was surrounded by her family, sending her back to Heaven, where  they all know she came from.\n\nMr. Speaker, Doris' legacy and memory will live on in her family.                 Honoring the Life and Legacy of Howard Koch\n\nMr. CORREA.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…it would pass in the blink of an eye. Most Republicans would vote for  it because they know how much the public wants to renew these credits.  So there is no reason under Heaven for us to delay. The House passed  this bill last week by 230 to 196, and 17 Republicans joined Democrats.  That is not a fluke. That is a glaring signal to Republicans that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…hundreds  of thousands of visitors every year.\n\nWithout the Grand Ole Opry, we would likely not know the names Hank  Williams, Patsy Cline, Loretta Lynn, or Willie Nelson. Heaven-forbid,  we might not even know Dolly Parton had it not been for the show.\n\nWSM, those are its call letters, was one of the fist radio stations  to connect urban and rural…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going into plant, equipment, data centers, AI, and all of  these things are happening, wage growth is actually okay. It is  actually outpacing inflation now, finally, thank Heaven. Yet the real  GDP growth is coming from that capital spend and not from wage and new  employment and the demand for labor.\n\nUnderstand why this is a problem. We are an income-tax-base…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…all in a hurry. We rush  through life, and sometimes, we don't know the impact we have on  others.\n\nOne of my favorite books is by Mitch Albom, ``The Five People You  Meet in Heaven.'' The book says that when you get to Heaven, you get to  see other people's lives, the impact you had on their lives, and how it  unfolded.\n\nOn the other hand, Mr. Speaker,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…important.\n\nI am going to do it backwards from how I originally thought because I  want to hit a couple of things that are remarkably important.\n\nI have come behind this microphone, heaven knows how many times and  shown the charts. We are borrowing $72,000 a second. We could borrow as  much as $2.3 trillion this year. I am going to show some other things  in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…with this one story. And I remember it so well  because I remember reciting it back to him in a letter one time. In one  sermon, he said: We should all live with one eye on Heaven.\n\nAnd there are lots of scriptural references that sort of touch on  that, but his point--his point, I believe--was if you live with one eye  on Heaven, particularly knowing…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…controversies when we were trying to do  some of the reforms in Medicaid, saying that should we ask folks to at  least look at participating in the economy and the society because,  Heaven knows, we need them.\n\nLook, this may be a little bit geeky, this chart, but the basic  premise is, when you are taking a look at labor force participation,  back here is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…everyone to know that my friend is hurting today because  he lost his wife 1 year ago suddenly. My prayers are with Thomas. My  prayers are with his family. I know Rhonda is in Heaven looking down on  Thomas, probably laughing at him a little.\n\nI know my colleagues all wish Thomas well. He is a dear friend, and  we will be thinking and praying about him…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…journey with the strength and confidence that he could trust  his Lord with the outcome of his life. We will miss him dearly but look  forward to the day we will be reunited in Heaven.\n\nBruce will be remembered for his great sense of humor and his  generous heart. He was a faithful son, wonderful brother, and a fun  uncle to his nephews and nieces. His personal…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…advocate for his district. He  did his very best for his constituents. He never gave up. He focused on  wolves, water, forests, and fire. May my good friend find solace in  Heaven and may his family find comfort in knowing he was a man of  integrity, faith, and truly deserving of our honor and our deepest  respect.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698720/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…peace,  sadness, is all just a construct of neurons firing in your brain. We,  as Christians, have hope that we are going to see our loved ones again  and that we will be in Heaven and that we will be in perfect peace and  that this is not it. In fact, there is something even better awaiting  us.''\n\nAlso earlier this year with Bill Maher: ``The greatest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time  remains.\n\nMr. SCHWEIKERT. Madam Chairwoman, I yield myself such time as I may  consume.\n\nMadam Chairwoman, can you believe this? We broke our printer.  However, thank heaven we didn't break the markers.\n\nSo I thought actually just because we are trying to do fact-based,  the average family's taxes are going up at the end of this year $2,853,  and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…blades, their last word was the name of Jesus.\n\nI remember my father had a Bible verse on his mirror that said if you  deny me before man, I will deny you before the gates of Heaven. They  did not deny their faith.\n\nThis month marks 10 years since their deaths. ISIS thought they were  making a statement of fear. Instead, they showed the world what  unshakeable…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688172/meaning-of-religious-freedom"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…MD Anderson, going through chemo  seemed trivial to me compared to watching the parents at MD Anderson  who were watching their children go through treatment.\n\nMolly went to Heaven last week while visiting a friend in Italy, and  I think I speak for everybody in this body when we offer our deepest  condolences to Jim and to his entire family and to our…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…outspoken, loud, aggressive, annoying, the title  ``Senator'' and the role we have should entitle him to ask a question  at a press conference. If the result is this mistreatment, heaven help  us all, and heaven help our democracy.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…we are going to go to lunch or adjourn for the evening until the  next day requires unanimous consent.\n\nBut a lot of legislation we pass gets done that way, too, and thank  Heaven above that it can. If we can't do the easy stuff this way, the  harder stuff becomes much more difficult. And the really tough stuff,  the stuff that still needs to get done--things…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}]