[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…If it is about the tax code, then let's deal with the tax code.  However, as Mr. Doggett made the argument about domestic abusers, these  are people who perpetrate the most heinous of crimes. That is why when  this House and Senate passed the Bipartisan Safer Communities Act, we  closed the boyfriend loophole to ensure that abusive boyfriends were  blocked…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…the  past 2 years, to call for the release of the hostages that were  kidnapped and are being held by Hamas in Gaza.\n\nWe pray hard, Mr. Speaker, for the 15 victims of this heinous attack,  my constituents. Several of these victims are people I know personally.  They are friends. I support this bipartisan resolution denouncing anti- Semitism. I continue…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…cleansing, collective punishment--the  Nobel Peace Prize.\n\nI know you are waiting for me to say the other word. Yes, I am going  to say it. This President has sanctioned the most heinous of crimes  against humanity, and those are crimes against humanity that are being  committed on the Palestinians. He has sanctioned the most heinous  crimes against humanity,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. NEGUSE. Mr. Speaker, 2 days ago a heinous and horrific act of  terror took place in the district that I represent in Boulder,  Colorado.\n\nAs families gathered on the idyllic Pearl Street Mall, a group of my  constituents,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691842/in-memory-of-recent-gun-violence-victims"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…President referred to them as  beautiful women on the younger side, some of them.\n\nWell, some of them were actually not women; they were girls. This  crime is about the most heinous kind of exploitation of women,  predatory victimization of girls, in effect, trafficking them--which  was Maxwell's specialty. And the President has said that they may have…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…and directly engage in or facilitate the  involuntary harvesting of organs within the People's Republic of China  while strengthening reporting requirements regarding this heinous  crime.\n\nThese steps are vital to address the forcible harvesting of organs, a  grave violation of human rights and bodily autonomy. The PRC has been  accused of forcibly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…rise in opposition to this amendment.\n\nTo be clear, I have disagreements with Prime Minister Netanyahu's  government.\n\nIsrael totally had the right to defend itself after the heinous  attacks on October 7, and all the hostages should come home.\n\nThe Israeli military campaign has been an absolute tragedy for the  people of Palestine. The people of Gaza…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…firearm-equivalent,       with the same lethal capacity, due simply to semantics.\n\nSo, now, let us return to the depraved domestic and sexual       violence offenders whose heinous acts were detailed in the       opening paragraph. Despite their use of TASERs to physically       and sexually abuse their intimate partners and the attendant       criminal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Melissa Hortman, and her  husband Mark. She and her husband leave behind two children.\n\nThese killings are not only horrifying for Minnesota but a tragedy  for America. This heinous act of political violence defies American  values and democracy.\n\nUnfortunately, we have seen a disturbing increase in political  violence in recent years, seemingly, as part…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…by the assassinations of Speaker Emerita  Melissa Hoffman and her husband Mark and the attempted murder of  Senator John Hoffman and his wife Yvette. These are shocking and  heinous acts of targeted political violence against elected officials.  They were clearly intended to instill fear in our communities.\n\nThe additional attempt that night to target…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Boulder County. My wife  and I are incredibly blessed and lucky to be raising our family in this  community.\n\nLast week, I introduced a bipartisan resolution denouncing this  heinous anti-Semitic terror attack in my community. H. Res. 476, a  resolution that makes clear that we stand with the Jewish people, the  Jewish community, and which explicitly calls…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…offered a reward of up to 1,000 pounds sterling--more than       $150,000 in today's currency--to anyone who could help       identify and convict the ``outrageous and heinous Offenders''       behind the ship's burning. He also established a commission       to conduct a formal inquiry, and the British vowed to       transport any colonists indicted…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…identities begs the  question of whether this was intentional.\n\nAnd, look, the DOJ's failure to protect the identities of the victims  is bad enough, but what makes it even more heinous is how far the DOJ  went to protect Donald Trump during these releases. The DOJ took down  pages and pages of documents that were full of vulgar accusations  against the President.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699465/epstein-files"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…that a congressional delegation needed to  urgently go to CECOT in El Salvador and check on the health and well- being of all the political prisoners who we have sent to that heinous  place.\n\nMy Republican colleagues disagreed, and Chairman Mark Green said that  my official request to conduct oversight in my capacity as a member of  the Committee on Homeland…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…with the rich and powerful getting  a different set of justice. There cannot be two tiers of justice in  America, and I will not rest until the people who committed these  heinous crimes and this heinous behavior are held accountable.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699688/there-cannot-be-two-tiers-of-justice-in-america"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…when  the offender intentionally includes the child in the depiction, even  passively. This is a straightforward, bipartisan fix that ensures that  Federal law captures these heinous acts and imposes the penalties that  they deserve.\n\nMr. BIGGS of Arizona. Mr. Speaker, I commend law enforcement for  their tireless work of protecting children, and I commend…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I have consistently called for  the maximum possible level of transparency when it comes to the heinous  crimes of Jeffrey Epstein. That is why I have consistently said that I  am inclined to vote for this bill, and it is why I will be doing so  today.\n\nThe victims deserve the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696819/epstein-files-transparency-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…displayed true courage through this nightmare.\n\nMy prayers are with the families and friends of the victims who have  had their lives upended and forever altered by these heinous acts.\n\nWe will not bend to intimidation or fear, and we refuse to tolerate  the actions of those who would seek to usurp the will of the people and  their representatives,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…applaud the FBI for taking crucial steps to both raise awareness of  this issue and hold predators accountable. However, more tools are  needed from Congress to ensure that these heinous individuals are  prosecuted.\n\nThe conduct of groups such as the 764 network do not always fit  neatly into existing criminal statutes, which potentially jeopardizes  prosecutions.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…in Federal law that predators have exploited to  harm children online.\n\nBy explicitly criminalizing threats to distribute child sex abuse  material, Congress ensures these heinous acts are prosecuted with the  seriousness that they deserve. This legislation reflects the bipartisan  recognition that protecting children from exploitation is a shared…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Forced       Organ Harvesting Act of 2025.\n\nYour support and passage of this legislation will ensure       that the United States is combating and not complicit in the       heinous practice of forced organ harvesting.\n\nThank you for your thoughtful consideration of this       legislation.            Respectfully,      Susie Hughes,\n\nExecutive Director,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Mark, who were viciously murdered in  their home on June 14.\n\nWe also continue to pray for Minnesota State Senator John Hoffman and  his wife, Yvette, as they recover from this heinous attack, as well.\n\nThere is no place in our country for politically motivated violence.  None. The fact that the Hortman and Hoffman families are being forced  to endure the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692785/in-memory-of-mark-and-melissa-hortman"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…cannot  ignore the reality that Sarah Beckstrom was another victim--an  unnecessary victim--of President Biden's careless immigration policies.\n\nThe man who committed this heinous act was an Afghan national whom  President Biden allowed to enter the country after our disastrous  withdrawal from Afghanistan. Unfortunately, it is too late to bring  Sarah's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…illegal alien, Hyrum Rodriguez, was  arrested by ICE after a local court dropped his charges.\n\nWhat was the crime that he was charged with?\n\nIt was abducting a 4-year-old.\n\nThese heinous criminals are only a small number of those welcomed  into our country by Joe Biden and who were arrested in just the past  few days by the Trump administration.\n\nMr. Speaker,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…what Democrats on the other side of  the aisle are fighting right now.\n\nMr. Speaker, this legislation lowers the age for transfer to adult  court from 16 to 14 for the most heinous crimes. We are talking about  murder, first-degree sexual assault, armed robbery, and burglary.\n\nIt expands the cases that can be tried by the U.S. Attorney's Office,  ensuring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…most pro-Israel Cabinet ever  assembled. And he is committed to defending Israel, combating  terrorism, and protecting Jewish Americans.\n\nToday, I rise to condemn last night's heinous and anti-Semitic attack  on these innocent people. I condemn this hateful rhetoric against  Israel and against the Jewish people who deserve the right to live  freely and…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I rise today to honor the many families still  grieving from the heinous assault that claimed 1,200 innocent lives on  October 7, 2023.\n\nLast Monday marked 500 days since Hamas terrorists perpetrated the  unprovoked and truly evil attack. It was…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688087/500-days-since-october-7-attack"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…This legislation passed the House Judiciary Committee by a voice vote  earlier this year, and I am looking forward to seeing it pass the full  House.\n\nHuman trafficking is a heinous crime that we are all too familiar  with. Human trafficking is not just a distant problem. It is a crisis  that touches every corner of our Nation, rural communities and urban…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…an explosion of human trafficking and sex trafficking in this  country. While we know that human trafficking has been a problem over a  period of time, the concern is this heinous crime and how it has  exploded in the recent past.\n\nNow, there are some reasons and some contributing factors to the  escalation numbers, and one of them is during the Biden…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Speaker, I thank and very much  appreciate Republican Vice Chairman Blake Moore of Utah for holding  this Special Order hour.\n\nLast Monday, February 17 marked 500 days since the heinous attack in  Israel where drug-induced Iranian puppet Hamas launched the most  cowardly, murderous assault against Israel and the Jewish community  since the Holocaust. The…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}]