[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…mentorship and investing in young athletes can transform lives. He  was recently inducted into the Grand Rapids Sports Hall of Fame, and  that solidifies his place in history.\n\nHelen Claytor, Activist: Helen Claytor's work with the Young Women's  Christian Association extends far beyond Grand Rapids. She was the  first Black woman to serve as president…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…second time in memory.''\n\nOn this day, 50 years ago, fathers, mothers, sisters, and brothers  looked out across a vast ocean as Saigon was falling behind them. Among  them was Helen, my constituent, who watched as her aunt boarded a boat,  and days later she would also follow the path of Vietnamese refugees on  to San Jose in my district, which proudly…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Ormsby Environmental Stewardship Award: Sara Holtz.\n\nThe Mayo Stuntz Cultural Stewardship Award: Mary Lipsey.\n\nFairfax County Park Foundation Eakin Philanthropy Awards:       Helen L. Kafka (posthumously), McLean Central Park Playground       Team, Pohanka Automotive, and the Scott A. & Phyllis P.       Crabtree Family Foundation.\n\nChairman's Choice Award:…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Secretary of State; Michael Posner, Former Assistant       Secretary of State; Ned Price, Former Spokesperson,       Department of State; Charles Ray, US Ambassador, retired;       Helen Reed-Rowe, US Ambassador, retired; Stacy Rhodes, Senior       Foreign Service Officer, USAID, retired.\n\nSusan Rice, Former National Security Advisor, Former U.S.       Permanent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…spiritual  leadership has touched the lives of millions of Orthodox Christians and  countless others across the globe.\n\nI am especially proud to represent the Saints Constantine and Helen  Greek Orthodox Cathedral in Richmond, Virginia, a vibrant and  faithful community that stands as a testament to the Orthodox  tradition's rich history and enduring presence…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize Helen  Birkhead, a remarkable constituent from my district. It is my honor to  celebrate her on her 100th birthday--a day marking a hundred years of  love, laughter, and commitment…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…also  the lasting opportunities it provided to so many.\n\nI would also like to recognize and thank Mac's family for their  encouragement, love, and support, including his wife Helen Tolar--who  was also a decorated House and Senate senior staff member--and their  three children Walker, Mary Mac, and Oliver.\n\nMr. Speaker, I am honored to recognize Mac Tolar…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Edward: CQ Roll Call; Fellmann,       Fabian: Tages Anzeiger; Ferran, Lee: Breaking Defense;       Ferrechio, Susan: Washington Times; Ferrer, Antonia: Ara;       Fessenden, Helen: Washington Post; Fields, Gary: Associated       Press; Figueroa, Ariana: States Newsroom; Figueroa, Laura:       Newsday.\n\nFilippino, Marc: Financial Times; Fillion, Max:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…to the  specialized care they need and deserve. Nicklaus offers more than 30  pediatric specialties and operates leading institutes focused on  pediatric care, including the Helen and Jacob Shaham Cancer and Blood  Disorders Institute, the Brain Institute, the Heart Institute, and the  Orthopedic, Sports Medicine, and Spine Institute. And just last year,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…SATELLITE TELEVISION; Garay, Gavino: REUTERS RADIO & TV;       Garbitt, Devin: ABC NEWS; Garcia, Jon: ABC NEWS; Garcia,       July: CBS NEWS; Garcia, Manny: CBS NEWS; Garcia Alton, Helen:       CNN; Garcia-Munoz, Alejandro: TELEVISA N+; Garcia Sandoval,       Laura: The Epoch Times; Gardenswartz, Jacob: SCRIPPS NEWS;       Gardinier, Elizabeth: PBS NEWSHOUR;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  birthday of Helen Dramer Jarrell. Helen will turn 100 years old on July  3rd.\n\nHelen Dramer Jarrell was born the eighth child of the nine children  Ida Mae and Walter Hubert Waldrop on July…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692887/recognizing-the-100th-birthday-of-helen-dramer-jarrell"}]