[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…economically.\n\nVirginia has started to see some population decline in recent years,  except for immigration. Immigration has actually enabled our State to  continue to grow. Growth is helpful to the economy. Immigrants  contribute $104 billion annually to the Virginia economy. Get this: 29  percent--nearly one-third--of our Main Street business owners in  Virginia…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…this is an  energy strategy in which families lose; billionaires win. And there are  far fewer good-paying jobs for Americans.\n\nAnd, by the way, prioritizing fossil fuels is helpful to China.\n\nIf we have a national energy emergency, we shouldn't be fueling our  competitors by selling our energy to China to make their economy run  better. If we have an…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…That is our law. That is the manual of the Department of Defense.\n\nThe administration has released a video of all of these attacks  except this one, and I think it would be helpful to the public--to all  of us--to make that video available.\n\nAs we all know, on January 3, this campaign reached a climax. U.S.  forces conducted airstrikes to neutralize…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…neighbors are rebuilding from Hurricanes Helene and  Milton. They were flooded out. They lost their appliances. Many  businesses went on the fritz. It would be particularly helpful to know  that they are going to save money over time as they make these major  investments.\n\nThis is exactly what Congress intended when we passed the Energy  Policy and Conservation…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…one opposed the Department of Energy's final  rule on this topic, no one.\n\nIn fact, manufacturers are on record saying that consistent and clear  certification guidance is helpful and necessary to them. Today's  resolution is the opposite of consistent and clear. They are asking for  this, the manufacturers are, and you are saying no. You don't even…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…goalposts.\n\nAgain, even if my colleagues on the other side come up with testimony  or documents today that say that the Department of Energy was wrong, it  would have been helpful to hold a hearing where their experts could  come in and challenge the Department of Energy experts who put these  standards together. Then we as members of the Committee…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…in House history to the longest vote, Allison  has skillfully navigated the unprecedented.\n\nShe has powered through all-nighters with a smile, with pride, and  always with helpful information, because above all, she is driven by a  love of country, a love of justice, and a love of this institution and  its people.\n\nWe thank Allison for her hard work,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695729/farewell-allison-blankenship"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…engaged. The  Mayday Movement, the Fourteenth Now! movement, and the Citizens'  Impeachment movement.\n\nI have two friends that I would like to single out who have been very  helpful: Jessica Denson would be one. She is with ``Lights On with  Jessica Denson,'' a podcast, and my constitutional law friend, attorney  John Bonifaz.\n\nI plan to have these flags…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…possible resource we can to ensure that those who have signed up to  risk their lives for this country can find employment when they leave  the armed services.\n\nIt will be helpful for veterans to know about additional job  opportunities at ports, railroads, and trucking companies. Many of  these jobs are solid, middle-class, family supporting, union…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695017/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…Even my Republican colleagues have spoken up about this, saying:\n\nIt's a horrible idea. . . . It's been policy.\n\nI am going to quote again:\n\nVaccinations have proven to be helpful in preventing the       spread of [diseases like] measles, polio, and other things.\n\nThis was a Republican:\n\nMy children are vaccinated, my grandchildren are       vaccinated.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…just about miles. It became a journey of connection       with the country and its people.\n\n``I have a good feeling about America now because people       were so kind and helpful and friendly,'' said Bob's wife,       Kathryn Sanders. ``The very best thing about it is to realize       Americans and America is still one country,'' Bob added. ``We…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…consultation with  the Department of Defense of what weapons and technologies can be moved  from the FMS-only list to be eligible for direct commercial sales.\n\nIt also requires helpful reporting to Congress on the process and  evaluation of these changes. Importantly, it does not modify or  undermine Congress' oversight or visibility into the proposed arms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694810/made-in-america-defense-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and Republicans unanimously would join together  to override such a veto. I can't imagine anybody here wanting to defend  the indefensible.\n\nWe have another way you could be helpful here. If we defeat the  previous question, I will offer an amendment to the rule to provide for  consideration of H.R. 4405, the bipartisan Epstein Files Transparency  Act,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…submission is inconsistent with this caselaw.       Therefore, we are providing you with our views and analysis       of preemption waivers under the Clean Air Act that may be       helpful as Congress considers how to treat these Notices of       Decision and the application of CRA procedures.\n\nAs background to these issues, we issued a legal decision…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…stockpile  to make sure our arsenal is safe, secure, and reliable. All this is  done without any explosion. It is a scientific experiment called  subcritical and is far more helpful to understanding how the weapon  will perform than setting off an explosion in the desert.\n\nOur leadership on arms control and nonproliferation has clearly come  to an end,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…here versus answer the  callous questions out in the hallway--is because in the moment where he  and I had a disagreement, I had to make a decision about how I could be  most helpful to him.\n\nIf I ran for reelection, I would necessarily always have to think  about what boundaries I should have in expressing my concern, and that  created complications for…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Member. I didn't know Doug long, but I met him on one of our  first days in the orientation sessions and the planning sessions for  Congress. He was warm. He was friendly. He was helpful to a new  freshman who didn't know much.\n\nFrom there, I learned how fun he was. He loved to play with my last  name, ``Fedorchak.'' He used to say: ``How much wood could a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…income, the  agency should clearly indicate that error to the taxpayer and explain  why the refund is different than expected.\n\nHowever, current notices do not explain or contain helpful  information, leaving millions of taxpayers confused about how and when  to rectify the issue with the IRS.\n\nThe IRS MATH Act ensures that the IRS clearly spells out errors…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…for overtime, so we remove a major financial barrier for  some small business owners who want to help their employees actually  balance work and family life. It would be a helpful thing for those  employers and employees to help provide childcare.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, I will point out that Americans know that Trump has been  horrible…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…tracking, and  drought monitoring, topics that are all front-of-mind for all  Americans, but especially those in my home State of Oklahoma.\n\nCommercial remote sensing can also be helpful in humanitarian relief  efforts and monitoring treaty compliance, among other national security  and foreign affairs applications.\n\nThis technology provides us with critical…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…would also allow the  public to hold the government accountable for its actions.\n\nBorder Patrol had produced small iterations on this data for 2016 to  2018 and it would be helpful to re-start this publication at a more  frequent cadence.\n\nI urge you to support H.R. 275.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…needed a new  President.\n\nThe largest illegal mass migration in history must now be followed by  the largest legal deportation and repatriation in history.\n\nNew laws would be helpful to prevent a future Joe Biden from making a  mockery of our sovereignty and reopening our borders to the most  violent criminal gangs, cartels, criminals, and terrorists on…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…that people should care about these issues is not the time  for people to go and make partisan potshots about anti-Semitism. It is  not productive. It is divisive. It is not helpful, particularly in a  world where folks on our side could go through a long list and a litany  of problems on the other side of the aisle, including the people who  actually…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…compliance experts. The problem is so bad that agency guidance  documents are known as regulatory dark matter.\n\nFor a brief time, the first Trump administration was able to bring  helpful and needed sunshine to the situation. Following the GOOD Act's  passage by the House during the 115th Congress, the first Trump  administration voluntarily adopted the bill's…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Environment Act.\n\nMr. BIGGS of Arizona. I am prepared to close, and I reserve the  balance of my time.\n\nMr. BIGGS of Arizona. Madam Speaker, I thank Ranking Member Raskin  for his helpful suggestions that will make this bill much better and  has made it much better. I thank Ranking Member McBath for her support  as well.\n\nIt is our desire to bring these malevolent-hearted…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…aids can decrease the risk of cognitive decline  by nearly half.\n\nFor many, purchasing hearing aids presents many questions. That is  why accessing audiology services can be helpful.\n\nTo access audiology services, like a diagnostic test, under Medicare,  a physician's order is required. That requires more time and a great  number of hoops to jump through.…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696431/national-audiology-awareness-month"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…ranking member, Lois  Frankel, who has been an amazing partner in putting this bill together,  and, by the way, Chairman Brian Mast, another Floridian, who has been  incredibly helpful. I also thank my staff, the amazing staff. This bill  never would have happened without them; my clerk, Susan Adams, and the  entire majority team, as well as the minority…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…almost a Laffer curve. We are going to tax you to the  point that it rolls over. On every tax, you get 1\\1/2\\ percent of GDP  in new taxes.\n\nOkay. It would probably be really helpful.\n\nOn the Republican side, the things we talk about cutting, we only get  about 1 percent of GDP.\n\nLast year, if you do the internal borrowing, we borrowed about 7.6,  7.4…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…because this was normal to be  able to do. But now we are in a new political age where nothing seems  to be normal.\n\nSo we proposed a very simple thing; that this would be helpful to do  in what is called a standing rule. It would take 60 votes to be able to  move this, and we would have a standing rule to say here is how this  could be done. Up to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…provided  the agency and his community with 1,320.25 volunteer hours. John has  been instrumental in updating forms and practices within the CSU. His  input has been especially helpful in the creation of an electronic  Daily Activity Report, which captures trackable information pertaining  to the calls-for-service handled by CSU Volunteers. John is a  tremendous…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690801/recognizing-john-wajdowicz"}]