[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…floor for a vote       this week. The bills Republicans are bringing to the floor do       not represent serious attempts by Speaker Johnson or the GOP       to help working people or working families. This is the party       that just this last week stripped five states of $10 billion       in childcare funding and funding to needy families. This is…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, every day, more Americans are being hurt by  the Republican healthcare crisis. Tax credits that help working people  afford healthcare are vanishing, and Americans are watching  billionaires get huge tax cuts while the cost of living goes up.\n\nMy Republican friends knew that refusing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Act enhanced premium tax credits a boondoggle, but let me tell you  what those tax credits have meant for millions of Americans.\n\nOver 80 percent of the tax credit goes to help working people in  States that  President Trump won. Since they were introduced, more than half of the  growth in national enrollment has come from Texas, Florida, Georgia,  and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…coauthored a bill on that.\n\nThat is not what the White House is doing. Instead, they think that  just having these billionaires cut deals with the private sector is  going to help the working or middle class. It will help my district. We  will make more money with AI. It will help more of the financial and  technology elites.\n\nI will tell you what it is not…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the tens of millions more seeing a spike in  healthcare premiums. I urge my colleagues in the Senate to do right by  families and act without delay to lower healthcare and help working  family people breathe a little easier.\n\nMake no mistake, the fight to lower costs is far from over. We have  got to put our foot on the gas when it comes to driving down…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…this country from  housing to groceries.\n\nThere were 10 bills to undo the democracy of people who live here in  D.C., 10 issues and 10 solutions we could have worked on to help  working families.\n\nMr. Speaker, in closing, I encourage all of my colleagues in Congress  to oppose this joint resolution.\n\nVoting ``no'' means that we refuse to support this congressional…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…saving over $1,000 a year. That doesn't make  up for the tariffs, the pain inflicted and the higher costs that people  are paying, but it will sure help. Every dollar will help working  families right now.\n\nIn Florida, I know my neighbors are very eager to take advantage of  the $346 million in cost savings that will come under these  initiatives. We received…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…people and driving down grocery  prices, utility bills, rent and mortgage payments, and childcare and  elder care costs so that hardworking people can breathe easier.\n\nTo help working families, especially multigenerational households,  deal with the rising costs of living, I am introducing the  Multigenerational Family Tax Credit Act. My bill gives  multigenerational…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…is going to be a skyrocketingly higher number than it  was just this week.\n\nSo Donald Trump and his congressional Republicans, they just can't  seem to find anything to help working families and grandma and grandpa,  but they can find it for the billionaires. They can find it for the  defense contractors.\n\nAnd you want to talk about waste and fraud.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…40-hour workweek, overtime pay, public education, and strong  consumer protections. However, we need more Democrats whose filter for  what they do in Congress is: Will this help working people, as opposed  to giving lipservice in some disconnected way?\n\nWe should all be fighting hard against corruption and for a real path  to the middle class. Young people…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…on  service workers' tips without cutting Medicaid or SNAP. And let's get  this done with strong guardrails so CEOs and the ultrawealthy don't  exploit loopholes meant to help working people. Let's pass it today.\n\nNevadans sent me here to fight for them, and so I am going to keep  working to lower costs, to raise wages, and to make sure people who  power…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…taken away food stamps. He has taken  away opportunities. We are going to make sure that we reverse all that.\n\nThe first step is these ACA tax credits because it is going to help  working families. The party in the majority now said they were going to  lower the cost of living, but they failed. Now we are going to step up.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…this Chamber have yet to put forth anything that addresses their  issues.\n\nI am disappointed that House Republicans blocked my amendment to this  bill that would actually help working families across the country. My  amendment would require the official name change to not take effect  until the Department of the Interior can prove that this bill would…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…the same frustrating news. It is not just  canceling funds to help companies modernize and decarbonize. It is  canceling tax credits to help union workers find jobs and to help  working people keep the lights on.\n\nThe President's so-called big, beautiful bill isn't beautiful. It is  a big, ugly joke. The only thing this bill does is hand out tax breaks…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695602/devastating-harm-caused-by-trump-administration"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…3 years.  This is at the same time that billionaires and those who can afford a  $1 million annual membership to Mar-a-Lago got tax breaks that are  permanent. Why is help for working families temporary but handouts for  the privileged permanent?\n\nWe won't be deceived. Communities in northwest Indiana are struggling  with increasing costs, and they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695037/temporary-benefits-for-working-families"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President, in the runup to last year's elections,  Republicans made some promises to the American people. We promised to  turn the page on the failures of the last 4 years, to help working  families and to get our economy moving, to make our country stronger  and more secure. Last week, we delivered legislation that will help  fulfill those promises. That…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…flexibilities that they provide.\n\nThe CFPB rule amounts to government price controls that will limit  access to a lawful, contractually agreed-upon product. The rule will  not help working families. It will hurt them.\n\nBy capping fees below the costs of providing the service, many banks  and credit unions will be forced to reduce or eliminate overdraft  programs…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…support working families.\n\nMr. Speaker, this is a resolution that would provide no tax on Social  Security, no tax on tips, no tax on overtime, provisions that  specifically help working families, families in this country. Yet, they  are opposed to it.\n\nMr. Speaker, we have heard a little bit about fiscal responsibility.  That is something that Republicans…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Big Beautiful Bill Act's tax cuts  benefit families making less than $500,000. Just because they keep  saying it doesn't make it true. The One Big Beautiful Bill Act does  help working families.\n\nMr. Speaker, I do have to address, because my colleague has decided  to bring ICE into this debate, or this discussion, regarding small  businesses and help that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]