[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…the inclusion of these reforms, including the SMART Act and the  Least Cost Exception Act, which I am proud to co-lead.\n\nThe banking provisions are narrowly tailored to help our small  community financial institutions, to provide regulatory relief for  well-managed institutions, to increase access to insured deposits, and  to establish safeguards to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…bill passed the Small Business Committee unanimously in March  and passed the House by voice vote in the last Congress. It is a  bipartisan and commonsense solution to help our small businesses more  successfully navigate the Federal contracting process.\n\nMr. Speaker, I urge all of my colleagues here to support this  important bill.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…like. We know  that when we had the Covid pandemic, we all came together and created a  solution to help the economy keep going, to help the airline industry  keep going, to help small businesses. We could have done more. We  obviously had differences of opinion about how much to do, but we  worked in a bipartisan fashion.\n\nSo now, as we face this crisis…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Small Businesses with Career and Technical Education  Graduates Act.\n\nSmall businesses can't thrive if they can't access a highly qualified  workforce. This legislation will help small business owners connect  with graduates of vocational programs and hire employees who can help  their businesses thrive.\n\nTalented graduates come out of vocational education…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691732/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…down business.\n\nThese guys don't care. They don't care. They just go along to get  along. They don't want to tick Trump off.\n\nI guess my question is: If Republicans want to help small businesses,  why are they blocking a vote to overturn the tariffs? Why have they  refused to let Congress vote on the tariffs for months and months, even  though it is our…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2965, the Small Business  Regulatory Reduction Act.\n\nLet me begin by stating that I wish we were here to talk about bills  to help small businesses grow or policies that address challenges they  are facing today, like tariffs and the cost of groceries and  healthcare. Instead, we are talking about an unworkable…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, we often speak about how Congress can help  small businesses grow, but the true hard work is being done on Main  Streets across this Nation.\n\nIn the Sound Shore region of Westchester, businessowners are  advancing their…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693116/recognizing-local-chambers-of-commerce"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Nicole Good and Alex Pretti would be alive right now if  maybe on the seventh D.C. bill, we did something about this.\n\nOn the eighth D.C. bill, we could have done something to help small  businesses by passing legislation because we do too much to help the  big corporations and nothing to help small businesses and  entrepreneurs.\n\nOn the ninth one, on the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…finally vote to  exempt small businesses from these painful on-again, off-again tariffs.  That would put American entrepreneurs first.\n\nUnfortunately, this bill does nothing to help small businesses grow  or adjust to supply chain disruptions or unexpected tariff costs.  Rather, it will actually make it harder for thousands of legally  operating small businesses…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…today on bills that are unnecessary,  divisive, and a waste of taxpayers' dollars.\n\nUnfortunately, my Republican colleagues are focused on regulatory  bills that will not help small businesses one iota, while allowing the  authorization for critical, vital counseling and training programs to  lapse. It doesn't make sense. Small businesses deserve better…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…specifically  set aside for small producers, which I know there are a lot of those in  the district of the gentleman from Texas.\n\nUnfortunately, much of that $700 million to help the small producers  has been stalled by President Trump with his funding freeze. That harms  the small producers who are counting on those critical funds.\n\nI just want to stress,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…exempted. In effect, it enables the  small business advocate to properly do its job by providing it with the  information and data it needs to draft regulations that actually help  small businesses raise capital without imposing costly demands.\n\nMr. Speaker, I thank the gentlewoman from California (Mrs. Kim) for  her bipartisan leadership, her friendship,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693955/improving-access-to-small-business-information-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…middle class instead of the rich. Let's eliminate these tariffs on  products that we don't even produce in the United States because we  don't have the climate for it. Let's help small businesses thrive and  survive this summer.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…If this bill is passed, SBA offices will be relocated as political  payback, away from public access in major cities. In fact, that is the  point: to reduce programs that help small businesses gain access to  capital, professional services, and predictable tariff policies.\n\nThat is why I introduced an amendment to prohibit SBA from relocating  an office…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…improvements to housing  programs, expands local development opportunities, and broadens access  to homeownership.\n\nH.R. 6644 also includes a dozen bipartisan provisions to help small  banks like community development financial institutions, the CDFIs, and  minority depository institutions, the MDIs. It helps meet the housing  and other needs of our constituents.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…work on this bill.\n\nThis is a narrowly tailored fix to a longstanding problem that is  hurting business development companies, or BDCs, which Congress  originally created to help small and midsized businesses access  capital.\n\nMr. Speaker, unfortunately, the SEC rule called Acquired Fund Fees  and Expenses, or AFFE, requires funds that invest in BDCs to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…have a voice. Their efforts deserve our thanks.\n\nAs someone who worked in small business, I understand the challenges  entrepreneurs face, and while I was fortunate to help grow a small  business into a larger business, I never lost that small business  mindset. That mentality, grounded in what we call the WIT principle,  Whatever It Takes, is built…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…bill sells itself.\n\nEvery Michigander I spoke with is excited. They are excited for no  tax on tips, tax relief for seniors, the end of the death tax, and  provisions to help small businesses create jobs and grow the local  economies.\n\nThe One Big Beautiful Bill Act truly puts the American person first.\n\nNow, here is the interesting fact. Instead of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…to keep up with and bear  the costly burden of complying with local, State, and federal  regulations.\n\nTo say that we are not going to save money and we are not going to  help small businesses save money by cutting resolutions is an absolute  lie.\n\nWorking hard has always been the standard for small business owners,  but when the Biden-Harris administration…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Madam Speaker, I move to suspend the rules and  pass the bill (H.R. 5784) to amend the Small Business Act to help small  business concerns critically evaluate artificial intelligence tools,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…decades, we are removing bureaucratic barriers and enabling  the construction of a modern behavioral health facility.\n\nI urge my colleagues to support H.R. 3620 and help us take a small  but significant step forward in improving behavioral health outcomes  for our Tribal communities.\n\nMr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, my voters and my constituents sent me  here to help solve problems, to help small business, to help employees,  and to help grow the economy. As such, I am proud to support the Tipped  Employee Protection Act. This important bill will help codify changes…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the Small Business Administration on any overly  burdensome and costly regulations they must deal with. I think we can  agree that we should do everything we can to help protect our small  businesses in this country.\n\nFinally in this rule, we also will be considering H.R. 4312, the  SCORE Act, led by Representative Bilirakis from Florida and the  chairmen…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…payroll, employee benefits, compliance assistance and HR services to  hundreds of thousands of small and mid-sized businesses that employ  more than 4.5 million people.\n\nPEOs help small businesses improve productivity and profitability,  focus on their core mission and grow. Through a PEO, the employees of  small businesses gain access to important employee…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…capital for small businesses. The Small Business  Investment Company, or the SBIC, program plays a crucial role in this  effort by attracting private equity investments to help small  businesses grow, create jobs, and strengthen our economy.\n\nSBIC has been an invaluable tool for investing in small businesses  that build critical technologies and support…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687921/investing-in-main-street-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Congressional Budget Office has estimated that my bill will not result  in a measurable increase to Federal spending.\n\nH.R. 131, the Finish the Arkansas Valley Conduit Act, will help small  rural communities in southeast Colorado finally complete a Federal  water project that was authorized in 1962 under the Kennedy  administration.\n\nRadium, uranium, and other…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…canceled because our small businesses deserve to know. Additionally,  our bill requires a Federal agency's Office of Small Business and  Disadvantaged Business Utilization to help small businesses find  additional opportunities if a solicitation on which they made an offer  is canceled so that they can go after these opportunities.\n\nSmall businesses create…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…including critical  investments in cybersecurity, financial crimes enforcement, and  oversight of our adversaries' investments.\n\nIt preserves community development funding to help small businesses  and manufacturers on Long Island grow, create jobs, and strengthen  supply chains without raising taxes.\n\nThis legislation also protects taxpayers by modernizing,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699046/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…half of the workforce. It is no exaggeration  to say that the success of our economy is tied to the success of our  small businesses.\n\nDespite government set-asides meant to help small businesses compete,  participation in Federal contracting has dropped by 50 percent over the  past decade. That means fewer small businesses are securing Federal  contracts,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…With the One Big Beautiful Bill Act now law, Americans can take  advantage of a new interest deduction when purchasing an American-made  vehicle. This provision can really help small-town car dealers like  M.J. McGuire.\n\nFor a family buying a $50,000 vehicle, Dan explained to me what this  would mean. He said the interest in just the first year might…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}]