[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…housing  accessible to everyone. The American Dream depends on it.\n\nEvery family deserves a safe and affordable place to call home, and  this House has a responsibility to help make that possible. Until  housing costs come down, Congress has a lot more work to do. I look  forward to working with this body on behalf of my constituents and  across the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…said: Hey, can you help my dad?\n\nThat is what Americans across this country are asking, like, are you,  the people in power, the people with the gavel, are you going to help  me?\n\nMake me drop my notes.\n\nI want the party in power to say: Yeah, I am going to help you. I am  going to prioritize you. I am just not going to prioritize you in March  of 2026…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Nash.\n\nHe said this project is not just a project for Black people. This is  a project for the city of Akron. It is everyday citizens doing  remarkable things like this who help make our community the birthplace  of champions. Community members from the Akron Rites of Passage  Institute are certainly champions in their own right and have made  Akron and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…housing, for utilities, for groceries, just about everything. What I  hear from my constituents is that they want relief. They want their  government to help bring down costs and help make their lives more  affordable, but time and again, the policies that would do exactly that  stall or they just die right here in this Chamber and down the road at  the White…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…research into semiconductor chips.\n\nAt the end of the day, this announcement, which I have worked so long  and hard for since 2017--at the end of the day, this announcement will  help make chips and science a reality, boosting American innovation,  creating American jobs, making the United States the world leader in  chipmaking.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…unprecedented enormous  health insurance premium hikes since we are extending healthcare stuff  today.\n\nIn my own State of Wisconsin, Mr. Speaker, 279,000 people receive  credits to help make insurance coverage affordable. In my State, for a  60-year-old couple not yet eligible for Medicare, earning $85,000 a  year, they will see their premiums increase by $23,281…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…jobs. They  give back. They reinvest, and they show us what is possible in our  communities.\n\nH.R. 1804, our 7(a) Loan Agent Oversight Act, is a smart, targeted  fix and will help make sure that small business owners' dreams stay  attainable.\n\nMr. Speaker, once again, I thank my colleague for co-leading this  bill with me, and I also thank our ranking member…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691853/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…lose their care due to the $1 trillion in cuts to Medicaid and the  Affordable Care Act and another $5 million because Republicans failed  to extend the tax credits that help make ACA plans more affordable.\n\nThese cuts will throw millions of Americans off coverage entirely,  bury families in medical debt, and result in hospitals and nursing  homes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to go back to D.C. I said that it is for work.  They seemed sad about that. My wife chimed in, and she said that it is  really important work. It is work that is going to help make people's  lives better.\n\nNow here we are, back at work. The first thing on the agenda in 2026  is not to lower the soaring utility bills. It is not to lower the  insurance…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Rando.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  recipients of the 2025 Arts Awards and recognizing the visionaries,  leaders, and supporters who help to make our Northern Virginia  communities rich with cultural opportunities.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697103/recognizing-the-recipients-of-the-2025-artsfairfax-arts-awards"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…This is a program that is there for all of us. If you lose your job,  if your hours get cut, if you become disabled or have trouble paying  bills, you can turn to SNAP to help make ends meet.\n\nRepublicans don't want to talk about how their cuts are going to hurt  people. They haven't held one hearing or briefing on the program, so  Democrats went around…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689041/impact-of-proposed-snap-cuts"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…their  children--we help them to access dignity.\n\nPeople that we have talked about and that we read their letters, they  all said: We can help you find efficiencies. We can help you make the  programs work better. We can help you, but why are you doing this if it  is all part of a larger package to give tax cuts to the wealthiest  Americans, to give tax…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…so,  I thank my colleague, with whom I have been proud to co-chair the  caucus. We both know too many children who have died, but we know a lot  who we were able to get help for. We make a commitment to all the  families in the gallery, and those who we have not gotten to know, that  no matter where the gentleman is going, he and I are in this fight for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…that door  and be my daughter's doctor. I would be meeting him for the first time.  I never felt so helpless as I did at that moment.\n\nAs lawmakers, I believe our job is to help make life a little bit  better for the people we represent. This week, it means tackling the  quality, affordable health insurance issue. It is no secret what  happened in this…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Fentanyl       Act, do not deter drug use. They only push people into       riskier behaviors, increase the likelihood that someone will       die rather than call for help, and make our communities less       safe. How many more Americans must die before we finally       admit that the War on Drugs was a failure?\n\nI am a former mayor. I oversaw a police…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…further implementing the  mandate our constituents sent us here to deliver on.\n\nDemocrats chose to have a month of political theater, but political  shows don't do one thing to help make the costs of everyday items more  affordable. It is time to govern and to focus on making America more  affordable for the middle class.\n\nMr. Speaker, I urge a ``yes'' vote…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…The next 2 weeks will require us to listen  to each other, to work hard, and to hammer out more accountability and  transparency for the Department of Homeland Security to help make sure  that we meet this moment.\n\nBut at the end of the day, as someone who is proud to be an  appropriator and to have the opportunity to deliver more than $150  million…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Christine officially purchased the business from him.\n\nFor more than seven decades, the Hebard Insurance team has been  committed to working closely with their clients to help them make  important and informed decisions relating to their protection and  future. They prioritize customer service and are committed to treating  their customers like family.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…material in America,  sourced by American mining companies, processed in America, and going  into American manufacturing. We can partner with our allies around the  world to help make this happen, but when we look at where the deposits  are, they are here in America. We have to produce oil and gas where the  oil and gas deposits are. We have to mine copper…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…days of submission.\n\nI commend Representative Donalds for his continued leadership, and I  urge my colleagues to support H.R. 1676.\n\nMr. CRANK. Mr. Speaker, this bill will help make the Federal  Government more efficient and ensure our conservation programs work as  they were intended.\n\nOnce again, I thank Mr. Donalds for his diligent work and attention…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697624/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Mr. Chair, this is going to create jobs, not just  for Texas but for the entire Nation.\n\nThe gentleman across the aisle just mentioned Iran, that somehow this  is going to help make it easier for Iran in the nuclear realm.\n\nI think Iran just discovered that President Donald J. Trump is  serious when he says they will not be allowed to get a nuclear weapon.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Geographic Names to rename the Gulf of Mexico as the Gulf  of America. President Trump signed this executive order on his first  day in office.\n\nEnacting this legislation will help make President Trump's historic  action permanent and ensure consistency in references to laws, maps,  regulations, and records of the United States.\n\nThe Gulf of America is critical…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…not act, American jobs and energy production  will be lost. This is really, for all intents and purposes, a punitive  tax on natural gas. These folks are not our enemy. They help make the  fuel that we use to heat our homes, et cetera.\n\nMr. Speaker, I and other Republicans are not opposed to the  regulation of methane. I see it as an asset that should…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…had a major winter storm on the east coast and  parts of the South. FEMA will be interrupted if Department of Homeland  Security is not getting funded.\n\nOur TSA agents who help make sure we get around the country safely  through our airports, they will stop getting paid. That could  potentially lead to slowdowns at airports. The Coast Guard will stop…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…at our senior centers, I think there are more  healthy choices out there.\n\nWe have to think of ways to make it more affordable and things the  Federal Government can do to help make these nutrients more affordable  as well. I just can't emphasize enough that the best medicine in the  world is a healthy diet. This is what making America healthy again…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…State of  Arkansas.\n\nNationwide, residential electricity prices have increased by 13  percent since 2022, and overturning misguided policies like this RMP  amendment will help make the cost of living more affordable for  families across America.\n\nIt is time to unleash our domestic resources to put this money back  into the pockets of American families…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…nation:  freedom of religion, freedom of speech and of the press; private  property rights; free and fair elections; the rule of law and an  independent judiciary. All of these help make us exceptional, but we  Americans often take this for granted because these principles, these  values, are so ingrained in our way of life. That is who we are. But it  also…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…as the 2024 chairman of the  National Association of Home Builders, where he has been relentless in  advocating for policies that strengthen the construction workforce and  help make homeownership, a key tenet of the American Dream, possible.\n\nGenerous in sharing his time and talent, Carl served as president of  the Wichita Area Builders Association and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688140/recognizing-carl-harris"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…legislation regarding cryptocurrency and our  financial markets.\n\nThe GENIUS Act, the CLARITY Act, and the Anti-CBDC Surveillance State  Act are all critical bills that will help make America the crypto  capital of the world. These bills provide simplified rules of the road  for the crypto industry, which so desperately needs these provisions to  flourish.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693546/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…to set  an example and defend human rights. Standing for freedom isn't just  about words. It is about action. By respecting our history and working  to protect freedom, we help make the world a better place.''\n\nOur next winner is Riley Olendorff, who is a junior at Glasgow High  School. Riley wrote: ``Standing for freedom is having courage,  integrity,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}]