[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and\n\nWhereas, Fulton County was one of the last counties       organized in Ohio, emerging from the resolution of the Toledo       War and the shifting of state lines that helped shape the       boundaries of Northwest Ohio; and\n\nWhereas, from its early seat in Ottokee to its present-day       seat in Wauseon, Fulton County has grown alongside the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…Carnival, where they performed before 300,000 fans. With       sold-out concerts across multiple continents, CaRiMi has       solidified its place in music history and has helped shape       and modernize Konpa while remaining deeply rooted in its       traditions;\n\nWhereas, as they reunite for their final concert at Amerant       Bank Arena, this momentous…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Congress more than 200 times and helped Congress steer the United  States through the global financial crisis. Mr. Dodaro's work with  Congress and Presidential administrations helped shape the Digital  Accountability and Transparency Act of 2014, the Federal IT  Acquisitions Reform Act of 2014, the Fraud Reduction and Data Analytics  Act of 2015, and countless…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…community.\n\nI would like to extend my congratulations to the Mountain's Edge  Master Association, local businesses, schools, first responders, and  all the residents who have helped shape the community's success over  the last 20 years. I wish its residents continued success and community  spirit for decades to come.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…telling  the untold stories of Northern Virginia. Under his guidance, NOVA Parks  made significant efforts to illuminate the forgotten stories of the  many communities that helped shape Fairfax County. Mr. Gilbert's vision  ensured that NOVA Parks was not only protecting natural landscapes but  also honoring the diverse communities and stories that helped…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…grief, but instead she chose action.\n\nShe ran for Congress as a mother, a nurse, and a voice for families  devastated by the senseless scourge of gun violence. Her courage helped  shape the national conversation and inspired a generation of advocates  whose work is saving lives in communities across our country every day.\n\nShe also advocated for America's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…reliability, leading work that has resulted in more than  $1 trillion in taxpayer savings and other financial benefits. His  dedication to fighting fraud, waste, and abuse has helped shape the  federal civil service for more than half a century.\n\nGene joined GAO as an entry-level analyst in 1973 after graduating  from Pennsylvania's Lycoming College with a…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…team--bringing not only  her sharp communication skills and strategic insight but also her  kindness, dedication, and unwavering passion for public service. Her  excellent work has helped shape our message, build connections, grow  the New Dem brand, and advance the values we hold dear. As a  communicator, Emma is second to none.\n\nAs Chair of the New Democrat Coalition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Speaker, each month I recognize a St. Louis all-star,  someone who represents the very best of our city. During Black History  Month, I have been highlighting Black leaders who helped shape St.  Louis and expand opportunity for everyone.\n\nHowever, this week is bigger than one name. That is because long  before the great Bill Clay was elected to Congress, Black…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700077/st-louis-all-star-frankie-muse-freeman"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, February is Black History Month, when we  take special note of the historic achievements of African Americans who  have helped shape today's America. Black history is American history  and for decades has been ignored by racism. Now, as we identify and  remember both those famous and some unfamiliar names…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700078/black-history-month"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…the fire  due to delays in medical care and exposure to toxic elements.\n\nThe Eaton fire was the second most destructive wildfire in  California's history. Those we lost helped to shape the fabric of their  communities, and their absence has left a void that cannot be filled.  They are in our thoughts on this 1-year anniversary of the fire.\n\nWe remember…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Trump administration's  attempt to erase American history and specifically to erase the history  of Black, Native American, Hispanic, and other people of color who have  helped shape this country.\n\nThe Department of the Interior under this administration recently  removed a slavery-related exhibit at Independence National Historical  Park in Philadelphia…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…a little easier because of women like Jean.\n\nMr. Speaker, I am so honored to support this legislation to make sure  that we commemorate in a place of honor the women who helped shape our  country and helped shape the future of women in service and in the  trades for years to come.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…was it to Fresno State's Maddy Institute but he  also mentored the next generation of agricultural leaders.\n\nWe miss John. His impact will stretch far beyond his ranch. He helped  shape the agriculture of our region, and his legacy of innovation,  integrity, and service will benefit generations to come.                       Honoring the Life of Joel Nelson…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…president, and on various State and national committees.\n\nThe time and effort she invests on behalf of not only Minnesota pork  producers but all American pork producers has helped shape a better  business climate, expand American producers' market access, and promote  the benefits of pork to a wide audience.\n\nLori often says: ``The world is run by the people…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692906/recognizing-lori-stevermer"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the Yardley-Makefield Fire Company, he  has stepped into a variety of roles--most significantly his 29 years  serving as President of the Fire Company. His leadership has helped  shape the growth of the department to ensure it remains prepared and  stays connected to the community it serves.\n\nLarry's impact goes beyond his leadership roles. He has written…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Therefore, I honor Captain Carol MacGibbon for her lifetime of  service to the United States, to West Point, and to the countless young  men and women whose lives she has helped shape.\n\nWe extend our gratitude and best wishes upon her retirement as  academy liaison officer for West Point.\n\nThe enduring legacy Captain Carol MacGibbon leaves at West Point…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…November  7, 2025. Born in New York on November 7, 1925, Mr. Unterman represents  a generation of Americans whose courage, resilience, and unwavering  commitment to freedom helped shape the course of history. At the age of  18, in the midst of World War II, Lewis answered the call to serve his  country. On September 8, 1944, he enlisted in the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694998/recognizing-lewis-m-unterman"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…live on through the impact  they have created for past generations.\n\nOur contributions as women are not a sidenote in the story of our  world. They are central to it. We helped shape the world, and we are  here to make sure that the women who came before us get credit for what  they have done. Their influence is undeniable.\n\nWhen we think of remarkable…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…for over 40 years and have raised four  daughters, three sons-in-law, and five grandchildren, imparting to them  the same values of faith, service, and community that have helped shape  his life and legacy.\n\nAbove all of his many accomplishments, it is Judge Ginn's unwavering  faith in the Lord Jesus Christ that has truly defined his life. In his  courtroom,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Chief of Staff for Ranking Member Kevin Brady before coming to  Team Jackson as my Chief of Staff. His extensive experience, knowledge,  and leadership in these roles have helped shape policy and governance  at the highest levels.\n\nDuring his tenure in my office, Jeff was instrumental in my success  on the House Armed Services Committee, House Agriculture…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…commend him for a lifetime of  service to the Cullman community and the State of Alabama. Over the  course of more than three decades in economic development, Mr. Greer  has helped shape the future of Cullman County through his steady  leadership, dedication to public service, and commitment to creating  opportunities for others.\n\nMr. Greer was born in Birmingham…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…day.\n\nPublic service is often described as thankless. Too often the people  who give the most receive the least public recognition, and today we  correct that.\n\nMs. Lee has helped shape legislation, supported veterans, solved real  problems for real people, and strengthened this institution. She has  done so with professionalism, humility, and unwavering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…community, a job  creator, and a champion for working families in Pennsylvania's First  Congressional District. Through his leadership, generosity, and vision,  Mike has helped shape not only the economic fabric of our region, but  its moral character as well.\n\nMike was born on February 24, 1975, in Bucks County. He grew up in  Levittown before moving…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…behind a legacy of courage, innovation, and selfless  leadership. He mentored thousands of soldiers and cadets, contributed  to groundbreaking Army modernization efforts, and helped shape the  future of America's defense forces. His journey from the glaciers of  Alaska to the deserts of Iraq reflects a career built on resilience,  integrity, and an unyielding…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…his life to protecting others, serving in many roles over  the decades, including nearly 25 years as assistant fire chief.\n\nJim's leadership, experience, and commitment helped to shape the  department and mentor generations of firefighters. For nearly half a  century, Jim answered the call whenever his neighbors needed help. His  service reflects the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Ambulance Association and the National EMS Museum honored  Hall Ambulance for its foundational leadership, recognizing the  organization among seventeen native Californians who helped shape  emergency medical services nationwide. Today, more than 500 dedicated  employees continue Mr. Hall's legacy, upholding a mission rooted in  care, compassion, and service.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Alaska's Far North, the people whose  ancestors have called the region home for 10,000 years, are asking us  to restore the balanced, lawful management framework that they helped  shape.\n\nS.J. Res. 80 does exactly that. It restores congressional intent. It  restores certainty for Alaska's communities. It restores America's  strategic energy reserve.\n\nMr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…not only preserved and honored but shared with all  Americans. Our daughters and granddaughters should be able to walk into  this museum and see firsthand how women have helped shape this Nation,  not as passive observers but as leaders, innovators, and changemakers.\n\nThis museum tells the stories of the women who built businesses,  defended our freedoms,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689364/womens-history-month"}]