[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…told us, ``My main concern is that I don't       want to be dragged on the street and locked up. I am thinking       of leaving, but I can't go back to Haiti. Can you please help       me find another country to go to? I don't know if I will be       able to sell my home before the due dates. I don't know what       to do for my son. Please help me.''…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…available  because it is tied up paying for interest.\n\nSo these trends are changing the role of those Senate cardinals--the  chairs and the ranking members of the subcommittees who help guide us  in the 12 different sections of spending. And, I will say, that problem  of the debt growing, that is very significant.\n\nBack in 1974, Democrats and Republicans came…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to the States so the States can  distribute it to the citizens who need it. We are in the cold weather  season and getting money out after the cold weather season does not  help keep people warm.\n\nLIHEAP funding enjoys broad support, and that is because, in the  Presiding Officer's State and in mine, folks in the winter who are on  the margins financially,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697111/low-income-home-energy-assistance-program"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…fees.\n\nRepublicans will try reverse psychology to convince Americans that it  is in their best interests to fork over even more money to the big  banks.\n\nMr. Speaker, let me help Republicans out. Making Americans pay high  overdraft fees only benefits the big banks, no one else.\n\nLet me be even clearer. A vote for this resolution is a vote for big  banks.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…national partners, and  the promotion of dignity, resilience, and recovery among those who have  served and sacrificed for others. This community-focused asset will  undoubtedly help thousands of El Pasoans in need of support. I am  grateful for Endeavors' commitment to care for veterans, active-duty  service members, first responders, caregivers, and their…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696519/recognizing-the-grand-opening-of-the-endeavors-health-wellness-center-in-el-paso"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…these students receive free and appropriate public  education that meets their needs. It also provides funding--yes, we  need to fund the IDEA to the extent that is required--to help support  these students and ensure the oversight of services for students with  disabilities.\n\nBefore the IDEA was enacted, we did not have these kinds of Federal  protections…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…eventually find a cure.\n\nIn honor of Rachel's family and the tens of thousands of others who  face Huntington's disease, I urge my colleagues to protect research and  funding to help those living with this rare disease.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691303/recognizing-huntingtons-disease-awareness-month"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…hiring doctors with the  skills needed to treat very sick veterans.\n\nDebbie loved her job, she was good at her job, and she went to work  every day to serve her community and to help our veterans. A week ago,  Debbie received an email telling her she no longer had a job. She  wasn't fired because veterans were suddenly cured or because her work  was no longer…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687961/debbie-va-employee"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…TANF and SSBG funds due to  political retaliation, the Republican leadership chooses to move a bill  restricting women's reproductive choices.\n\nIf Republicans really wanted to help parents care for their children,  they would work with Democrats to ensure that HHS follows the law and  immediately releases the childcare funds that HHS is illegally delaying…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699231/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…connected deeply as a member of the  Armed Services Committee to all of our military community.\n\nI am not a pacifist. Every year, I work on the Armed Services  Committee to help write a defense bill and try to get it passed. I whip  votes on the floor for military aid packages to allies. There are bad  folks in the world. The United States needs to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Salary History  Question Prohibition Act of 2025, which would help reduce the gender  and racial pay gap by prohibiting employers from asking job applicants  for their salary history before making a job or salary offer. Even  though many employers…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688912/introduction-of-the-salary-history-question-prohibition-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…to the Affordable Care Act, and record cuts to  Medicare.\n\nThat is not all. It kicks off 4\\1/2\\ million from nutrition  assistance, mostly seniors and children. Why? It is to help subsidize  massive tax cuts that mostly go to the top 1 percent.\n\nOf course, all of those cuts, over $1.5 trillion worth, don't come  close to paying for the more than $5 trillion…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…the type of policy that makes  government work and improves people's lives that we should be focused  more on in Congress. This bill is an example of how government should  help people. We are providing a plan based on a law that would help the  government better serve people, especially in a time of need.\n\nThis is why we should come together and support…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…townhalls.\n\nA lot of issues come up at these townhalls. There are a lot of  obstacles that Coloradans and Americans are facing that they would like  to see their elected leaders help to solve.\n\nI can tell you, Mr. Speaker, the one topic that has never come up at  a single townhall that I have held in my career: undersea cables. It  just hasn't come up.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…100,000 people without insurance and restricting  access to abortion care, setting the stage for a national abortion ban.\n\nHowever, I believe it is my job to offer solutions to help the  American people and, specifically, my constituents in Ohio. That is why  I proposed an amendment to remove the section responsible for  increasing costs and limiting access…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…verified the       applicant's estimated income based on documentation we       submitted. However, we did not submit documentation.''\n\nIn two cases, brokers called the ObamaCare help center       because applicants had submitted invalid Social Security       numbers. The center let brokers submit the       fraudulent applications anyway. This suggests the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Congressman   David Kustoff for his leadership  on this bill. Thanks to his work, victims of identity theft whose  Social Security  numbers have been compromised will get the help that they so need.\n\nMr. SMITH of Missouri. Mr. Speaker, I have no further requests for  time, and I am prepared to close.\n\nMr. Speaker, identity theft has become a major issue…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…experience for filers and increase accountability for  lawmakers deciding where those funds are allocated.\n\nWorking families were our top priority in these tax cuts. We wanted  to help them achieve the American Dream, make life more affordable, and  make filing taxes less of a burden. This year, Utah families will be  able to keep more of their hard-earned…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…up, if there was a criminal  running down the street and an officer was chasing him, somebody would  be a Good Samaritan and stick their leg out or say: He went that way  and help out. But we are literally living in some dystopia where they  say that somehow it is different because it is ICE. It is different  because we can say ICE; Immigration and Customs…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…of the fastest-growing States in the Nation and has the  highest average household size. The One Big Beautiful Bill Act  increases the child tax credit to $2,200, which will help our Utah  families as they continue to grow. Without the bill's passage, the  child tax credit would have dropped to just $1,000 per child. I am glad  this bill invests in the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694171/benefits-of-one-big-beautiful-bill"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the very  same response, even before Putin's escalation in Ukraine.\n\nWhat about now? With Russia waging a war of conquest and with China,  Iran, and North Korea pitching in to help them, has NATO outlived its  useful life?\n\nIs the notion of U.S. interests in Europe just a relic from the Cold  War?\n\nOr, to paraphrase some of Moscow's most useful idiots,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…through regulatory  overreach but through transparent and deliberative processes.\n\nH.R. 3633 is not only sound regulatory policy but also essential  economic policy. It will help preserve the United States' leadership in  financial innovation, support the growth of compliant digital asset  markets, and provide much-needed certainty to investors, developers,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…a survey from the Small Business and Entrepreneurship  Council, 53 percent of small business owners use express checkout  tools. When asked whether express checkout services help their business  succeed, 94 percent of small businesses agreed that the online payment  tool is boosting their businesses' growth.\n\nYet, despite the obvious potential for Main…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…create more  than 350 jobs, creating economic opportunity desperately needed in  rural Alaska.\n\nKeep in mind, this is only one project unlocked by this CRA. This CRA  will also help the advancement of the Alaska LNG pipeline project.\n\nGlobal demand for energy is expected to double by 2050, and our  domestic energy production must rise to meet that demand.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…not going to be  redundant. We are just making sure that you also include, young lady,  if you are pregnant and you want to continue in school, we are going to  do our best to help you and provide all the resources. I just wish we  could catch hold of this.\n\nMr. WALBERG. Mr. Speaker, to my dear friend and colleague from  Georgia, as she has discussed that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…of H.R. 1860, as amended,  offered by Representative Sylvia Garcia of Texas.\n\nThis bill would create coordinators within each of the Veterans  Integrated Service Networks to help veterans navigate cancer care.  Specifically, this bill aims to improve care coordination for common  cancers in women.\n\nNo person wants to hear that they have or that their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…have been too many instances in which  individuals with disabilities have been denied a lifesaving organ  transplant, and this is unacceptable.\n\nCongress has the opportunity to help ensure that individuals with  disabilities are treated fairly within the organ transplant system. No  one, Mr. Speaker--no one--should be denied access to an organ  transplant…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…does not benefit  small businesses. Nobody wins when the Federal Government goes hog wild  with regulations.\n\nThese two CRAs that the House will consider under this rule will help  us break out the shovels and bury the Department of Energy's rules in  the grave. They won't be missed.\n\nMr. Speaker, I spent time last week in my district, too, talking to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…amendment No. 274, included in Bipartisan En Bloc No. 7, continues  the Navy's work to research and test conductive pigments and coatings  for batteries. This research will help in building towards eventual  wide-scale production.\n\nContinued research on innovative battery coatings will heighten  military readiness, improve energy efficiency, and benefit…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693897/department-of-defense-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…we make  it easier if you are an individual investor to have other opportunities  in which to invest.\n\nBefore I served in this House, I conducted many private placements to  help people start their own business, and Reg D of the SEC is what you  do that under. Those are the rules of the SEC to privately raise money  to help somebody start a business.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}]