[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…with bipartisan support.\n\nIf Republicans cared about victims, then they would stop making cuts  to the crime victims fund so that people who experience harm get the  help that they need.\n\nIf Republicans cared about our kids, then they would invest in  restorative justice programs that teach children how to resolve their  conflicts without violence.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…district hungry. I rise today because that is unacceptable.\n\nI am talking about SNAP. SNAP provides children and families in my  district and across this country with the help they need to put food on  the table. It reduces food insecurity, and it boosts our local  economies. Our communities can't afford cuts to these benefits.\n\nIt is a vital lifeline…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692160/snap-cuts"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…we  have a chance to fix it. Democrats have a clean, 3-year extension of  these tax credits on the floor today with bipartisan support.\n\nLet's make sure families get the help they need. We must vote ``yes''  on this bill.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698797/breaking-the-gridlock-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…communities and torn apart families across our  country, and H.R. 2483 is the latest in a long line of bipartisan  efforts to address this problem and ensure Americans get the help they  need without stigma or other barriers.\n\nHowever, we must acknowledge that this legislation came to the House  Floor at a time when the Trump administration is systematically…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692133/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Friday, I was proud to stand with them to officially open the  pantry, which is a welcoming space that will provide anyone in the  UMass community with a little extra help when they need it. The shelves  are stocked with nutritious food, including food grown locally by the  incredible farmers in western Massachusetts.\n\nMr. Speaker, times are tough. Food…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695079/umass-amherst-campus-pantry"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…coerced  by their traffickers, who do not see them as people but see them as  objects only to be bought, sold, and abused; but we see them, and we  must give them the help that they need and they deserve.\n\nToo often, they emerge with criminal records directly tied to their  exploitation. These records follow them along their path long after  they are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…bills; Medicare is how they get healthcare without going  broke; and Medicaid is how their kids, their parents, and neighbors  with disabilities can get the support and help they need.\n\nThese aren't government programs to them. They are lifelines promised  to them after a lifetime of work and service. That is why I have been  and will continue to be…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Alsobrooks (D-Maryland) conceded, ``The       truth of the matter is that we don't know what they intend.''\n\nMs. CASTOR of Florida. Mr. Speaker, this is a real cry for help, and  we need Republicans and Congress focused on Americans' pocketbooks, not  trying to distract from the massive tax giveaway to billionaires and  special interests.\n\nMr. Pallone…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…do it again, and  they seek help. That option, unfortunately, is rarely available to  those people like my dad who had a weapon available.\n\nToo many people don't seek help when they need it. Whether they are  held back by fear, stigma, or lack of access, we need to do more as a  society to remove all the barriers and encourage open and supportive  communities.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695318/recognizing-suicide-prevention-month"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…for the families who are going to  be left behind right now. Those families are going to be heading for  emergency rooms. They are not going to be getting the kind of help that  they need with their family's healthcare.\n\nSo Trump told families, last night, they should ``give up pencils''  to deal with his affordability crisis, but Americans just can't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…help. The people who are working their butts off every day in hospital  wards making sure that we are all healthy and safe and cared for, they  are the ones that need the help.\n\nWe need to reject these Medicaid cuts and reject this plan. Let's go  back to the drawing board, as Mr. Kahn said from the Federation of  American Hospitals, and do it the right…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…reeling from an affordability crisis. It doesn't matter if you are  talking about the price of groceries or rent or healthcare, everybody  is stretched thin.\n\nThey need help and they need it now and they need it from Congress  and the President. But help is not what the President and his  administration are delivering. Instead of working to lower healthcare…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…throw them in  prison, which only exacerbates the problem.\n\nIn the President's budget, they propose to cut SAMHSA programs that  assist with harm reduction strategies to help those in need, as well as  programs to help prevent Americans from using controlled substances.  The President's budget also calls for reducing opioid overdose  prevention and surveillance…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the most devastating hurricane season that we have ever experienced.\n\nThe changing climate isn't just about the weather. It is about your  wallets, and folks really need help. They need Republicans, in addition  to Democrats, looking out for them, not just lipservice about lowering  costs.\n\nThat is why it has been so disheartening to watch Elon Musk and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…floor of this Chamber for what they do in Missouri and beyond. I also  want to recognize all of the CACs throughout the United States that  open their doors every day to help those who need it most.\n\nThe legislation before all of us today will turn our gratitude into  action, Mr. Speaker. We will get these organizations, the amazing  people who work there,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…that life has twists and turns but  following your passions will never steer you wrong. It should also  remind us that there is no greater obligation in life than to help  those in need.\n\nMadam Speaker, I applaud Bart for his success and thank him for his  dedication to helping others.                            Celebrating John Gill\n\nMr. HILL of Arkansas.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…important  issue.\n\nMr. Speaker, one in four Americans today deal with mental health  challenges over the course of their lifetime. We need to make sure  pilots get the help they need and still keep flying.\n\nThis legislation is intended to reduce the barriers preventing  pilots, air traffic controllers, and other aviation professionals from  reporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…restoring their  lives and livelihoods first and foremost.\n\nIf Washington is slower than a State government to respond, that is  not a good enough reason to deny Americans the help they need. This  legislation will lighten the load carried by families affected by a  natural disaster.\n\nMr. SMITH of Missouri. Mr. Speaker, on that I demand the yeas and  nays.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…I salute the Brother's Keepers Motorcycle Club of Kentucky for  providing a beacon of hope for families across the Commonwealth, going  far beyond the call of duty to help those in need.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…art  videos to YouTube for people to watch when they are feeling upset, and  she also passed out brochures that she designed with resources on how  to seek professional help if they need it.\n\nOn behalf of the 2nd Congressional District of Nevada,  congratulations to Faith McCrea for achieving the highest distinction  in Girl Scouts, the Gold Award. We…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…my point about In God We Trust and celebrating the  Christmas season. As Christians, we are called to take care of those  less fortunate than we are. We are called to help those who need help.  That is why so many of our hospitals historically were nonprofits built  up from faith-centered institutions. That is why so many hospitals are  Saint Fill-in-the-Blank…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Government. That is something that my office  will continue to ensure to see that it happens.\n\nWe have had devastating floods. The government's responsibility is to  help those in need, and that is what we expect to do. Mr. Speaker, I  just wanted to make that point loud and clear and hope that we can  continue to work through the recovery phase.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690765/recovering-from-north-carolina-floods"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…profoundly and reverberated  throughout the communities he touched.\n\nMichael was renowned for his kindness, generosity, and selflessness,  often going above and beyond to help others in need. He was a devoted  family man, cherished husband to Jill, and loving father to their  children, Annaliese, Olivia, Abbey, Seamus, Emma; his sons-in-law; and  his grandchildren.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…holding up that kind of bipartisan legislation when you  see the violence against law enforcement officers in our country every  single day. This is a lifeline to them, the help they need not just to  do their jobs but to be able to seek the services so they can be  healthy, physically and mentally.\n\nSo let's be clear about what is happening. My friend has,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Security Administration, Department of Veterans Affairs,  IRS, and other Federal agencies. Appointments are not necessary, and I  am pleased that we are available to help those in need. Personally, I  hosted over 1,200 meetings in 2025 and sponsored and cosponsored 183  bills.\n\nMr. Speaker, as many around the Capitol complex know, I often come to  this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…to be able to say: No one is going to stop us from  praying.\n\nIt is the most simple request that we have--to not go to government  but to go to God and say: We need your help. We need your intervention.\n\nI am always proud of a group of students at a high school football  game that finish the game or that start the game just taking a knee to  be able…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Congressman   David Kustoff for his leadership  on this bill. Thanks to his work, victims of identity theft whose  Social Security  numbers have been compromised will get the help that they so need.\n\nMr. SMITH of Missouri. Mr. Speaker, I have no further requests for  time, and I am prepared to close.\n\nMr. Speaker, identity theft has become a major issue in our…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}]