[{"senator": "Ed Case", "party": "Democrat", "sentence": "…environment. They provide critical habitats for wildlife, including  pollinators like bees and butterflies, which are essential for  agricultural productivity. They also help reduce our reliance on  chemical fertilizers and pesticides, prevent soil erosion and improve  water quality. Beyond their environmental benefits, native plants are  foundational…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…it being in Russia's  own national interest, there are other concrete steps that we, Russia,  and China could take short of negotiating an entirely new treaty that  would help reduce the risk of nuclear war, one that could be caused by  false alarm, by error, or by misperceptions.\n\nThese include improving lines of communication to reduce that risk of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…hopefully to continue their participation in the Federal  market.\n\nMr. McGARVEY. Mr. Speaker, in closing, we know that providing a  little  more predictability and stability can help reduce the barriers that  keep small businesses from bidding on and winning government projects.  That is what this bill will do.\n\nMr. Speaker, again, I thank Mr. Latimer and Mr.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691759/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Salary History  Question Prohibition Act of 2025, which would help reduce the gender  and racial pay gap by prohibiting employers from asking job applicants  for their salary history before making a job or salary offer. Even  though many employers…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688912/introduction-of-the-salary-history-question-prohibition-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…batteries are reliant on lithium, creating a potential       bottleneck around supplies of the material. CATL says sodium-      ion batteries, if mass-produced, could help reduce its       dependence on lithium.\n\nSodium-ion batteries are made from a sodium compound called       soda ash, which can be produced using table salt. Unlike       lithium,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nuclear weapons on the agenda when he  meets with Xi Jinping. He expressed a willingness to do this in his  Oval Office comments.\n\nEven talking about negotiations in itself can help reduce tensions. A  deal requires a first step, and I encourage the President to take it  and to take it soon.\n\nWe, in Congress, can use our voice. Along with our colleague, the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and yet they are still not coming together to show us how they  are going to reduce healthcare costs.\n\nWe need to keep covering people because covering people is a way to  help reduce costs. As I mentioned, the expansion of the Basic Health  Program is one way to lower those costs. But I know that in this last  big bill passed by my colleagues, they basically…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in addition to increasing generation, we have to  incorporate ways of reducing energy demand. Energy conservation  standards are one of the tools that help lower costs and help reduce  demand.\n\nThe previous administration's efficiency standards are estimated to  save consumers $1 trillion over 30 years. That is a trillion dollars.  The water heater standards…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Electrical Corridors Act, which I introduced  with Representatives Valadao, Costa, and Fitzpatrick.\n\nMy Fire Safe Electrical Corridors Act is a commonsense solution to  help us reduce the risk of catastrophic wildfires. It simply allows the  United States Forest Service or the Bureau of Land Management to  approve the removal of hazardous trees or vegetation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…replace New START, despite it being in Russia's  own national interest, there are other steps that we, Russia, and China  should take--short of negotiating a new treaty--to help reduce the risk  of a nuclear war, whether due to a false alarm, error, or other  misperception. For example:\n\n* Creating joint early warning centers to monitor missile       launches;…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…rates than residents of most U.S. States. However, veterans  in the territories have long struggled to access the VA healthcare they  have earned. This legislation could help reduce the rate at which these  veterans must be referred to community providers or endure lengthy  travel to access services at VA medical facilities thousands and  thousands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ensures that when an online dating service bans a user for fraud, it  notifies all the other users who have been in contact with that banned  person on the service. This will help to reduce the number of people  who fall victim to identified fraudsters looking to extort money from  dating app users.\n\nMr. Speaker, this bill is an important first step in addressing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…expensive as prices rise.\n\nTo tackle the cost-of-living crisis and affordability head-on, this  bill provides an additional $375 million for electric grid  modernization to help reduce prices to target the primary driver of  skyrocketing utility bills and ensure every American has access to  reliable, affordable power.\n\nThis bill provides $3.1 billion…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…its damage.\n\nWe are talking about bills like the Freedom to Vote Act, the DISCLOSE  Act, the Protecting Our Democracy Act, and the Ban Corporate PACs Act.  These bills will help reduce and mitigate the influence of big money,  strengthen transparency around it, and limit corporate power. This is a  moment to draw a line between a political system that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…accessibility for  individuals facing barriers to care, such as lack of insurance or  transportation difficulties. By providing convenient and affordable  options, ASCs can help to reduce health disparities and improve overall  community health.\n\nI want to acknowledge the following physicians for their exemplary  work specifically, Christopher J. Vesy, M.D.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…management under FLPMA. Specifically, the Buffalo       RMPA designated approximately 48.12 billion short tons of       coal as unavailable for further leasing consideration to help       reduce greenhouse gas emissions.\n\nOur conclusion here is consistent with our previous       decisions finding similar land use plans and RMPs implement,       interpret, or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…based on recent analysis, the  average home in Michigan costs almost double to build than what the  average family can afford.\n\nThe Housing for the 21st Century Act would help reduce Federal  barriers to building housing by expanding the Federal and local housing  systems. Now, the American people need the same level of commitment  from their State and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699804/housing-for-the-21st-century-act"}]