[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…House Committee on Small Business, I am  proud to partner with Congressman Stauber, who has done incredible work  in this area to support Americans with disabilities and help to ensure  that every American has the same opportunity to become a successful  entrepreneur.\n\nMr. Speaker, this is, after all, the fundamental promise of the  American Dream: that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…from people who don't understand why  you guys moved at the speed of light to give tax breaks to billionaires  but won't lift a damn finger to extend the tax credits that help ensure  people's health insurance premiums don't skyrocket.\n\nThis CR, this dirty CR, which does nothing to solve the healthcare  crisis, is one of the most immoral, unethical,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…opportunities.\n\nSmall businesses are not only the backbone of our economy, but they  also drive forward American innovation and ingenuity. The DOE and SBA  Research Act will help ensure that small business owners continue to  play a central role in the United States' leadership in these areas.\n\nI thank my colleagues for their collaboration on this critical…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…with my colleague from California (Ms. Simon).\n\nMr. Speaker, I rise today in strong support of the Assisting Small  Businesses Not Fraudsters Act, legislation that will help ensure that  small businesses who need and deserve support get it, while cutting out  fraudsters seeking to exploit vital relief programs.\n\nSmall businesses are the backbone of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…tragedies occur like the recent shootings of both Renee Good and Alex  Pretti.\n\nThese are just a few of the examples of commonsense practices that  strengthen accountability and help ensure the safety of both law  enforcement and our communities. Our local law enforcement personnel  already follow them, and we shouldn't expect anything less from our  Federal…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…do  more for small businesses with existing Federal contracts but also help  attract new small businesses to navigate the Federal contracting  process.\n\nThe SPUR Act will help ensure more small businesses, like those in  the San Gabriel Valley which I represent, can fairly compete for  Federal contracts.\n\nThe SPUR Act will require Federal agencies to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…ensuring the most relevant and technologically critical elements are  included. We want the best mariners in the industry, and by removing  outdated entry barriers, we will help ensure steady, long-term  employment opportunities.\n\nMadam Speaker, I, once again, thank Chairman Graves for his  leadership and bipartisan collaboration in crafting this bill.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…bill to the floor. I also  thank my partners in this effort, Congressman Keith Self and Senator  John Cornyn.\n\nThe Fairness for Servicemembers and their Families Act will help  ensure that life insurance benefits for servicemembers and veterans  account for changes in the economy.\n\nThis bill will require the Department of Veterans Affairs to  periodically…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…expertise, court reporters and captioners play  a critical role in expanding access to justice and ensuring equity  within our legal system. Court reporters and captioners help ensure  meaningful participation for individuals who are deaf or hard of  hearing and support broader public access to court proceedings and  civic processes.\n\nI am also proud…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…wasn't  easy, but Democrats stayed united and stood firm. After fighting for  months, we are joined by Republican colleagues who recognize that we  have a responsibility to help ensure Americans can afford to provide  healthcare for their families.\n\nMr. Speaker, it is our job to bring down the cost for Americans. It  is our job to make life better for…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698793/breaking-the-gridlock-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…manufacturing and job creation. Over a third of all foreign  direct investments are in domestic manufacturing, exceeding a total of  $120 billion a year.\n\nThis bill will help ensure we keep that flow of investment strong and  that such investments support quality, good-paying jobs right here at  home. It must be coupled with Federal trade policies coming…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…District is home to nearly  640,000 small businesses, many of which are in rural communities, all  with unique needs and challenges.\n\nI support this bill because it will help ensure small businesses in  rural communities receive the resources they need and the support they  need to recover during times of crisis by requiring targeted outreach  and marketing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687928/rural-small-business-resilience-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…they suspect that low-quality batteries from overseas are       often to blame.\n\nA federal safety standard enforced by the CPSC would level       the playing field and help ensure that manufacturers and       sellers put safety first. Thankfully, the Setting Consumer       Standards for Lithium-Ion Batteries Act (H.R. 973) would       address this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong support of this bipartisan legislation,  which will help ensure that Americans have access to bankruptcy relief  when financial disaster strikes and they need it.\n\nThe legislation would increase compensation for chapter 7 trustees  for…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…hurricane warning systems provide local emergency  managers critical information to prepare and respond to storms, often  up to a week in advance.\n\nNOAA's aviation forecasts help ensure planes can take off and land at  their destinations safely.\n\nNOAA's seasonal forecasts help farmers plant and grow our food.\n\nOn the seas, NOAA's nautical charting and mapping…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…titled ``Federal Pay: Opportunities Exist to Enhance       Strategic Use of Special Payments'', published on December 7,       2017 (GAO-18-91), which may be made available to help ensure       full compliance with all such requirements in a timely       manner.       SEC. 249. TRAVEL ALLOWANCE FOR MEMBERS OF COAST GUARD                     ASSIGNED TO ALASKA.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…$2.81 billion.\n\n(iv) Significance: This proposed sale will significantly       enhance Japan's intelligence, surveillance, and       reconnaissance (ISR) capabilities and help ensure Japan is       able to continue to monitor and deter regional threats.\n\n(v) Justification: This proposed sale will support the       foreign policy goals and national security…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…coordinate efforts to help individuals with disabilities  pursue entrepreneurship, secure employment with small businesses, and  overcome accessibility challenges. This will help ensure that  individuals with disabilities have access to business counseling  through existing SBA programs, like the Small Business Development  Centers.\n\nImportantly, H.R. 1634…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691777/thinkdifferently-about-disability-employment-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Mr. CRANK. Mr. Speaker, the Studying NEPA's Impact on Projects Act  will provide Congress with crucial information on NEPA litigation. It  will also provide transparency to help ensure that agencies comply with  the Fiscal Responsibility Act's NEPA deadlines and page limits.\n\nI thank Mr. Yakym and Mr. Panetta for their work on this bill, and I  urge my…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…victims and Tulare County CASA was created  in 1984 by concerned members of the community. These strong advocates  step into the court room on behalf of victimized children to help  ensure their cases go smoothly and they can get on track for a better  life.\n\nTo date, 15,000 children have been served by the Tulare County CASA  volunteers who have worked over…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698218/recognizing-the-tulare-county-court-appointed-special-advocates-casa"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…the VA and other Federal agencies,  we can reduce overpayments and prevent families from being hit with  unexpected debt notices.\n\nThis is a commonsense bill that would help to ensure that our  veterans and survivors receive the benefits that they deserve in a  timely and efficient manner.\n\nMr. Speaker, I urge my colleagues to support this bill. I also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…opportunity and fostering economic growth  in regions that are much in need.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this legislation and to help ensure that investors and  entrepreneurs in every one of our districts have a fair and level  playing field.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697243/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…remove self-certification in  other programs, such as service-disabled veteran-owned small business  contractors. Now, it is time to do the same with the WOSB program to  help ensure integrity across SBA programs.\n\nWhile we continue to have conversations on how to better align small  businesses' contracting goals with merit-based principles, this bill…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and  managing their own health.\n\nThey deserve our support and recognition, which is why I am proud to  support legislation like the Lowering Costs for Caregivers Act to help  ensure these caregivers have the financial resources to continue  providing care for their loved ones.\n\nMr. Speaker, let this month be a reminder of our shared  responsibility…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697240/recognizing-national-family-caregiver-month"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Mr. Speaker, I rise in support of S. 3424, the Bankruptcy  Administration Improvement Act of 2025.\n\nThe bill before us today is an important piece of legislation that  will help ensure the bankruptcy system continues to function  efficiently and without taxpayer funding.\n\nCongress designed the bankruptcy system to be funded through the fees  imposed on…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…been too many instances in which  individuals with disabilities have been denied a lifesaving organ  transplant, and this is unacceptable.\n\nCongress has the opportunity to help ensure that individuals with  disabilities are treated fairly within the organ transplant system. No  one, Mr. Speaker--no one--should be denied access to an organ  transplant…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Under the legislation before us, the Social Security Administration  will be required to update the agency's language to make it clearer and  more straightforward. This will help ensure that Americans do not  accidentally claim benefits earlier than they should, are completely  informed, and don't potentially miss out on substantial income during  their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Assistant Secretary Adams, and Director Salazar of  the Office of Refugee Resettlement.\n\nAs the record states, this administration has made efforts to expand  DNA testing to help ensure sponsors are, in fact, who they claim to be.  In addition, fingerprinting checks should reveal if new sponsors have a  criminal or a violent past.\n\nIt is pretty simple:…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…join the  Congressional Scouting Caucus, attend Camp Capitol Hill, and support  the young people who work every day to build a stronger, more service- minded America.\n\nLet's help ensure that the next generation lives up to the Scout law:  trustworthy, loyal, helpful, friendly, courteous, kind, obedient,  cheerful, thrifty, brave, clean, and reverent.\n\nAlso…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…informed of agency actions, their impact on licensees, and the state of  the commercial remote sensing industry.\n\nMr. Speaker, H.R. 1325 is a simple, bipartisan bill that will help  ensure that the United States remains the global leader in the  commercial remote sensing industry.\n\nI thank Ranking Member Lofgren for joining me in advancing this  legislation,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}]