[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…who had just lost everything  had a warm meal, a roof over their heads, and a shoulder to cry on.\n\nFederal, State, and local governments mobilized to get families the  help they needed, help that has made a tremendous impact on our road to  recovery and rebuilding. Emergency operation hubs were propped up in a  matter of hours. Recovery centers were…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…nonprofits and schools. Steve has supported nearly every sports  team in town, contributed to Watersprings Ranch, and served as the go- to man behind the scenes whenever help was needed. He even advocated  directly with the Army Corps of Engineers to advocate improvements to  local flood control and levee systems.\n\nSteve counts among his greatest blessings,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours of direct support to neighbors and flood victims, she helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Ms. Mankotya was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Youngblood was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692457/recognizing-tyra-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Tyrone was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…character of our town. Cindy's  volunteerism goes above and beyond expectations. She does not hesitate  to take an extra responsibilites, often stepping up when additional  help is needed. Whether it is arriving early to set up for an event,  staying late to clean up, or brainstorming creative ideas to enhance  the visitor experience, Cindy's selfless dedication…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690272/recognizing-cindy-mahon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Arnold was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Sean…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Smith was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Travis…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…being flooded in the last hurricane--talk about an  ounce of prevention because those programs, those families, they would  have received Federal help. Turns out no Federal help was needed  because we were able to build resilience. We were able to keep those  homes from flooding in the first place. This is the type of work that  we need to do. And if we…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…countless hours of direct support to neighbors and flood  victims, he helped coordinate the collection and distribution of  emergency supplies, meals and donated services to help those who needed  help. He and his wife also provided cash assistance to victims of  Hurricane Milton in Lacoochee, Trilby, Ridge Manor area. A truly  selfless leader, Pastor Buzzie…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. White was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mr.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Frazier was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Hutton was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Ronnie…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Phillips was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Lastra was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mike…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}]