[{"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Centers responded by supporting immigrant  families, taking food to their homes, and helping find loved ones that  ICE had taken.\n\nMr. Speaker, the work of New Life Centers helps strengthen our  community through faith, hope, and healing. I look forward to many more  years of partnerships to change the lives and change neighborhoods.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…standards for appliances are designed to reduce  energy use and climate pollution while also saving consumers and  businesses money. Reducing an appliance's energy use also helps  decrease stress on the electric grid.\n\nThe resolution today is proof that my Republican colleagues' concern  about grid stress--we had a hearing yesterday on that--and the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…my sons are veterans--one, a Marine Corps first lieutenant who  served in Afghanistan; another, a Navy SEAL. They value the VA.\n\nAmericans see in their real lives how the VA helps our veterans.\n\nWhen the President speaks tonight, I want him to look at the guests  whom we have brought--not only my guest, Michael Missal, the former  inspector general of…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…injured, the nearly hundreds of Ronald McDonald House programs across  the world keep families traveling for their child's medical needs cared  for and together. And McDonald's helps make this effort a reality.\n\nThe story of McDonald's is one of three sons of immigrants using  their drive, ingenuity, and ambition to go from a local drive-in  restaurant…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…of government, a government that oppresses some  for the benefit of a few.\n\nThat sparked my imagination again to say what can I do to make  government a force for good that helps people and solves problems,  rather than oppresses some for the benefit of a few? Eventually, that  question led me to Congress.\n\nAfter growing up as a member of Generation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…the  prices of essential goods are already too high, and President Trump's  actions will only hurt our attempts to bring down these costs.\n\nAmerica's global leadership also helps to keep Americans safe, too.  President Trump turning his back on Ukraine isolates us and undermines  our strength, the strength of international institutions, and the  security…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Big Beautiful Bill Act.\n\nMr. Speaker, even one of the gentlemen who was most instrumental in  passing this bill that they are here blatantly lying about and saying  that it helps working people when it really helps the richest, wealthy  people in this country, he won't even call it by the name because most  adults in this country know the truth. They…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…collective bargaining rights to  allow everyday people, our Federal workforce, to achieve economic  security and dignity by speaking with one powerful, unified voice. A  union helps workers use their power by standing together to level the  playing field.\n\nIt is disappointing that this bill couldn't come to the floor through  the regular process as there…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697868/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…program that 80 million Americans, including 9 million veterans, rely  on for health insurance coverage.\n\nThis extreme budget also cuts $230 billion from SNAP. Every year,  SNAP helps almost 43 million Americans, including over 1 million  veterans, put food on the table.\n\nRepublicans aren't just going to leave American veterans without  healthcare or make…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Van Hollen said it  well. You don't have to be an expert on the art of the deal to know you  go into negotiations from a position of strength. Strength never hurts;  it only helps in a negotiation.\n\nWe are not dictating an outcome. We are not prescribing what the  result of the negotiation should be. We are not telling the President  or President Zelenskyy…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…district. It  meets the Nation's need for scientific information used to restore,  enhance, manage, and protect the freshwater fisheries and habitats of  the Great Lakes. The GLSC helps to protect the freshwater fisheries and  habitats that are invaluable economic and ecological assets for the  entire Great Lakes region.\n\nWe know the devastating effects that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Instead of solving this dire hunger problem, the Trump administration  is now slashing critical funds to USDA.\n\nIt is rare to have a hat trick in public policy: a program that helps  our small  farmers, supports our food banks, and gets healthy food into schools.  Yet, this administration is cutting the very funding that food banks  and local schools utilize…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691898/food-bank-cuts"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Texas added more solar and wind energy  to their power grid than any other State in the country in the wake of  the blackouts during Winter Storm Uri 4 years ago. Solar and wind helps  keep the lights on.\n\nUnfortunately, Republicans seem uninterested in acknowledging the  basic reality that solar and wind, partnered with batteries, can be an  essential part…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…experiments within HUD; and begun planning to shut down HUD  field offices all over the country.\n\nMake no mistake, this agency isn't a luxury. It is a necessity. This  agency helps our veterans, our seniors, people with disabilities, and  families struggling to stay afloat.\n\nWhen I saw the harmful impact of this administration, I quickly took  action…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…memorial fund that donated to  family charities identified by each surviving spouse in memory of their  loved one.\n\nPat showcases exceptional personal care for the people she helps,  immediately contacting newly surviving spouses to support them in their  time of grief and inform them of available resources. Every holiday,  Pat contacts each surviving…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…officers can communicate clearly and safely in the field.\n\nAs the Colorado River continues to face a worsening drought, water  security is more important than ever. This package helps fund water  reclamation facility upgrades in Tombstone that will improve efficiency  and replace aging infrastructure.\n\nIt supports the multi-municipality sewer treatment project…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…defense in this resolution.\n\nWhy does President Trump call it one big, beautiful bill? It is  because it does a lot of critically important things all in one  resolution that helps get this country back on a strong footing.\n\nWhat else it does is it produces incredibly needed savings, Mr.  Speaker, savings that the American taxpayers want, as well. They…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…substantial portion of that is because of obesity.\n\nLet's not be afraid to talk about it. Let's do the moral thing of  helping ourselves, helping our brothers and sisters. It actually helps  the debt and deficit.\n\nWe published a major report 2 years ago now, showing that obesity  will be responsible for $9.1 trillion of additional healthcare spending  over 10…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…submit their  findings to Congress, which allows us to conduct proper oversight of  the 7(a) loan program, ensuring it remains a successful public-private  partnership that helps small businesses thrive.\n\nThough Administrator Loeffler is bringing a lot to this office and  has reined in the Biden administration's weakening, frankly, of  underwriting…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691855/9999"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…burden falls on taxpayers, often at moments when they  are already under stress. This bill provides practical updates that  help the court do its job more effectively, and it helps taxpayers find  resolution more easily and quickly.\n\nFirst, this bill modernizes the court's subpoena rules. Today, if  someone is subpoenaed to produce documents before the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the Organ Procurement  and Transplantation Network by allowing the Secretary of HHS to collect  member registration fees to support the operation of the OPTN.\n\nThis bill also helps secure our medical product supply chain by  requiring the FDA to establish an office in a country that has signed  the Abraham Accords.\n\nI am grateful to Representatives Harshbarger…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…qualified workers to support their company's growth. A company  must be rewarded and not penalized for making critical benefits  available to their employees, which, in turn, helps the company recruit  the best and the brightest to their workforce.\n\nThe Empowering Employer Child and Elder Care Solutions Act lowers  costs, cuts red tape, and better serves…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…taxable, so there is limited private land available for small business  expansion.\n\nWe often talk up here about how important infrastructure is. Here is  a small business that helps infrastructure projects throughout northern  Wisconsin. This is a prime example of a business that helps build  America. Without this parcel, Tony's Redi-Mix will run out of…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…pilot is fully voluntary and keeps the Federal Government in its  proper lane. It does not impose any new obligations on a producer or  private landowner. What it does do is it helps best practices already  being implemented in places like Iowa and many other States that are  working to  meet ambitious nutrient reduction goals.\n\nThis amendment will help…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…this bill, the  gentleman from California (Mr. Tran), for his work on this bill.\n\nI appreciate the opportunity to serve as co-lead on this legislation.  The SBA's 504 program helps small businesses to grow, create jobs, and  invest in their communities. Since this program uses taxpayer-backed  loans, it is important that we properly review and manage…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699185/504-program-risk-oversight-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Program.\n\nThe Sustainable Rivers Program would allow the Little Rock Army Corps  to plan effectively for the environmental stewardship that correctly  assesses water trends and helps the Little Rock Corps decisionmakers  make good, low-risk decisions for the benefit of this trout fishery.\n\nIt also prevents the need for new and required equipment,  environmental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…advantage, we must be able to track how  American technology is used around the world.\n\nMy bill, the Maintaining American Superiority by Improving Export  Control Transparency Act helps to ensure increased transparency and  accountability in the export control process by creating better  reporting in the licensing application process, giving critical  information…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…investment in  our infrastructure. Establishing periodic assessments of  vulnerabilities in the artificial intelligence supply chain that  foreign entities of concern could exploit helps ensure our country  maintains stable access to necessary components, boosting domestic  manufacturing and innovation.\n\nTo remain at the forefront of the next generation of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Development  Association, Bette Slayton.\n\nBette is retiring after 35 years as the senior executive of an  organization that recruits new businesses to move into Bedford County  and helps existing firms expand.\n\nRecognized as the 2021 Economic Developer of the Year by the  Pennsylvania Economic Development Association, Bette played vital roles  in the restoration…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the pro-energy policies included in the working  families tax cut law, this CRA also has the potential to generate more  than $260 million for the Federal Treasury.\n\nThis CRA helps the U.S. remain energy dominant and will lower prices  for families, strengthen our economy, and boost real wages for  hardworking men and women. I urge my colleagues to stand…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]