[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…nation's founding fathers exchanged fervent       messages about the Gaspee's burning and the British response,       setting up the committees of correspondence that helped them       coordinate strategies in the years to come.\n\nAdams, particularly, warned that Britain's determination to       pursue the Gaspee affair, and the discussion of the       deployment…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…years.\n\nBob Baker has served with South Metro Fire Rescue as the Chief for  the last ten years. Last summer, when the Quarry fire broke across the  Front Range, Chief Baker helped coordinate the emergency response to  keep our community safe. Under his leadership, the South Metro Fire  Department was awarded Class 1 status by the Insurance Service Office…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Verosic was a strong…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Phillips was a strong…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Verosic was a strong…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690146/recognizing-brody-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating  shelters for 5,800…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Noble was a strong advocate…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Hutton was a strong advocate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Smith was a strong advocate…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Hoffland was a strong…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Jason Chase has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Chase was a strong advocate…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690800/recognizing-jason-chase"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Frazier has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Frazier was a strong…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Mankotya has made to our community in  the aftermath of Hurricane Milton. In addition to providing countless  hours of direct support to neighbors and flood victims, she helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Ms. Mankotya was a strong…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690691/recognizing-jennifer-mankotya"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Harry White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. White was a strong advocate…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating  shelters for 5,800…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating  shelters for 5,800…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Gabelli has made to our community in  the aftermath of Hurricane Milton. In addition to providing countless  hours of direct support to neighbors and flood victims, Casey helped  coordinate the collection and distribution of emergency supplies, meals  and donated services to help those who needed help. A truly selfless  leader, Casey was a strong advocate…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690275/recognizing-casey-kc-gabelli"}]