[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I rise today to discuss my concerns  regarding the hemp provisions in this bill. I voted against the motion  to table Paul amendment No. 3941. I strongly support protecting kids  and ensuring they do not have access to harmful products.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696973/paul-amendment-no-3941-to-hr-5371"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr. MERKLEY. I really ask my colleagues, particularly on this side,  to hear me out on this.\n\nThe Senators from Kentucky and Oregon cooperated to create the first  research on hemp. We cooperated to give the first opportunity to move  research seeds across State lines. We cooperated and pushed to create  hemp as a legitimate agricultural product.\n\nCBD…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…passed bill to reopen the government, I want to clarify that we should  be proceeding through regular order before taking any action that could  potentially impact the entire hemp industry and affect more than  220,000 American jobs.\n\nAuthorizing policy through an appropriations bill is counter to House  rules and undermines the jurisdiction of our authorizing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…It ensures both USDA and FDA can  safeguard our Nation's food and drug supply and fully fund nutrition  programs, including SNAP and WIC.\n\nAdditionally, the bill closes the hemp loophole that has resulted in  the spread of unregulated, intoxicating hemp-derived products that are  being sold online and in gas stations and corner stores across the  country.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I rise to address an issue very near and dear  to my heart--industrial hemp.\n\nAs Kentucky's Commissioner of Agriculture, I led the charge to make  Kentucky the very first State to legally grow hemp. Fast forward to  today, hemp is a major crop for our…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698983/industrial-hemp-in-kentucky"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, instead of a clean CR, this bill contains  language that has been air-dropped in that will destroy hemp farming in  Kentucky and across the United States.\n\nTucked away on page 163, title VII, division B of this spending  package is a provision that will shut down the hemp industry…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, I rise today to discuss the original  intent of the 2018 farm bill's Federal hemp legislation and the need to  restore it.\n\nEarlier this year, a report from the University of Kentucky found  that cannabis-related poisonings among Kentuckians under 18 rose…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…reckless and unnecessary 43- day government shutdown, I strongly oppose Section 781 of this bill,  which would deal a fatal blow to American farmers supplying the  regulated hemp industry and small businesses, and jeopardize tens of  billions of dollars in economic activity.\n\nThe 2018 Farm Bill expanded the definition of hemp and established a  successful…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…appropriations bill addresses a serious concern regarding  the manufacturing and selling of unregulated, intoxicating THC products  nationwide.\n\nI led the effort to legalize industrial hemp through the 2014 pilot  program and the 2018 farm bill. Unfortunately, companies have exploited  a loophole in the 2018 legislation by taking legal amounts of THC from  hemp…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}]