[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Blacks/African Americans in Sewickley &  Edgeworth.'' It was a one-of-a-kind documentation of a significant and  often-overlooked part of the Sewickley Valley community's history and  heritage.\n\nMrs. Cole passed away in 2016 at the age of 92, leaving behind a  family and community proud of her contributions. I think those merit  recognition, and what better way…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…they are tackling the so- called problem of noncitizens voting, which is already illegal. I say  so-called problem because the Bipartisan Policy Center's analysis of  The Heritage Foundation database--I repeat, a Heritage Foundation  database--found just 77 instances of noncitizen voting between 1999 and  2023. That is 77 instances out of hundreds of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…and  segregation, and of the enduring hope of working families seeking a  better life. Her name endures in our memory because her legacy endures.\n\nAs we close out Immigrant Heritage Month, Saint Frances Xavier  Cabrini challenges us to stand up to those in power who would seek to  divide us and pit us against our own neighbors.\n\nDespite those who seek…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…we acquired more  than 60 people of African ancestry in this Congress. More than 50  persons in this Congress are Latinos. More than 20 persons in this  Congress have Asian heritage.\n\nIt is the Voting Rights Act. Yes, that Voting Rights Act was there to  deal with racism. It says so in the act. It says race. We can't  discriminate against people based…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to honor an extraordinary advocate from Rochester, New  York, Daisy Rivera-Algarin.\n\nAs a founding member of Latinas Unidas, Daisy Rivera-Algarin has long  recognized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695836/recognizing-daisy-rivera-algarin"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Jewish American  Heritage Month to pay tribute to a remarkable spiritual leader and  community advocate from Rochester, NY: Rabbi Alan Katz.\n\nRabbi Katz served with grace and wisdom as the rabbi of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691618/recognizing-rabbi-alan-katz"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I recognize Caribbean American Heritage  Month, celebrating the culture, contributions, and history of Caribbean  Americans in Michigan's 12th Congressional District and across the  country.\n\nCaribbean American…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to share a story of renewal, of  history and heritage rediscovered, and of deep respect for heritage in  the American heartland.\n\nFor 167 years, one of the world's greatest collections of coins-- doubloons, silver dollars, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…in 1973. Since  then, he has been a driving force in the creation, restoration, and  preservation of its murals, negotiating with Caltrans to protect the  park's cultural heritage. Accordingly, he served as the Lead Artist for  the Historical Mural Restoration Project.\n\nMr. Barajas is the founder of Motivational Design and has completed  more than 500…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…can hand millions of acres of our public lands over to  the fossil fuel industry for extraction.\n\nPublic lands should be our country's proudest legacy. They are our  natural heritage, a national treasure, and the agencies responsible for  stewarding them, like the Bureau of Land Management and the Forest  Service, diligently manage these resources for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…the marine sanctuaries most at risk because of this  legislation are iconic spots off the coast of California: Monterey Bay,  Channel Islands, and the newly created Chumash Heritage National Marine  Sanctuary.\n\nNowhere is this more evident than in the Chumash Heritage National  Marine Sanctuary, a sanctuary that was decades in the making. First  nominated…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…their families. This thoughtless  decision is an abuse of power and just one more example of how the  Trump administration is scapegoating immigrants.\n\nToday, during Immigrant Heritage Month, I am, once again, calling on  USCIS to reinstate the remainder of the canceled grant awards that  helped refugees and other aspiring Americans who came to the United…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…over three  decades. He earned a Grammy nomination in 2010 for the song ``Love''  from his album ``We Got This,'' and was awarded a National Endowment  for the Arts National Heritage Fellowship in 2005.\n\nD.C. named a park located at 2901 20th Street, Northeast, for Chuck  Brown, and named a street near the historic Howard Theater for him.\n\nI urge my colleagues…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692742/introduction-of-a-bill-to-designate-the-facility-of-the-united-states-postal-service-located-at-3401-12th-street-northeast-in-washington-district-of-columbia-as-the-chuck-brown-post-office"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Center in Virginia, he has  provided countless students, particularly second-generation children,  with dance training that emphasizes not only technique but also  cultural heritage and language. His choreography has been featured in  films, theater productions, and music videos, while his students have  performed across the United States in places such…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I am proud to rise today to recognize Native  American Heritage Month.\n\nNative American Heritage Month is an opportunity to not only honor  the rich cultures and history of Indigenous peoples across North  America, but to recognize the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696915/recognizing-native-american-heritage-month"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Hanford Civic  Auditorium on their 100th anniversary. For the past century, this  iconic building has stood as a symbol of Hanford, California's rich  history, architectural heritage, and cultural identity.\n\nSince opening its doors in 1925, the Hanford Civic Auditorium has  served as the cornerstone of community life--a vibrant hub for artistic  performances,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Festival to the irresistible aroma of wild-caught shrimp  sizzling across the waterfront, every corner of this festival reminds  us of why we come together to celebrate our heritage as the birthplace  of the modern shrimping industry.\n\nMr. Speaker, when it comes to festival, this one is shrimply the  best. I invite my colleagues and you, Mr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690464/isle-of-eight-flags-shrimp-festival"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…States, and command respect from the general public.\n\nIt declares that these buildings should be visually identifiable as  civic buildings and respect the regional architectural heritage. That  is important, as well. While the policy gives preference toward  traditional and classical architecture, other styles are permissible if  they clearly convey the dignity,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…level. It is time we support them.\n\nThe following organizations have endorsed this resolution, including:  AMAC Action, America First Policy Institute, the D.C. Police Union,  Heritage Action, the Independent Women's Forum, the International  Franchise Association, the National Association of Convenience Stores,  the National Association of Wholesaler-Distributors,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…team on their recent statewide victory. The team made  history by capturing the State's Class 4A State championship here in  Florida. The Pirates overcame a tough American Heritage squad where  they rallied from a 14-point deficit to win the State title.\n\nLeading the way was Senior Guard Jaida Civil, a University of  Tennessee commit and McDonald's All…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…first piece of cake to the oldest marine present, and then he hands  that piece of cake off, after he takes a bite, to the youngest marine  present, signifying the passing of heritage and culture and tradition  from one generation to the other.\n\nLast night, there were two special Marine Corps balls that I cared a  lot about. One--the one I really care about--was…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…acquiring the visitor  concession at the Okefenokee National Wildlife Refuge headquarters and  the nomination by the U.S. Department of the Interior as the next  American World Heritage site.\n\nAfter his successful tenure in this role, Dr. Clark has expressed  enthusiasm for this transition and remains confident in the ongoing  excellence of the Okefenokee…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the  Filipinos, the Cubans, people who come here from the West Indies. They  are all doing far better than the native born, despite the fact that  they are not of European heritage.\n\nIf anybody knows anybody who has been corrupted by this wicked  ideology that implies, in America, you can't succeed unless you are a  White European, look at the facts.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "John Rose", "party": "Republican", "sentence": "…than 100 members of the Grand Ole Opry. It is indeed  an elite crowd of men and women who made the world better, who embody  country music, and who are part of our shared heritage as Americans. In  fact, that membership sits at the top of dozens of obituaries among  some of our Nation's finest performers.\n\nThis year, Tripadvisor ranked Nashville sixth…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…environment. Their leadership in conservation,  water management, and environmental protection has helped preserve the  natural beauty, the biodiversity, and the cultural heritage of south  Florida.\n\nThis bill is about fairness and conservation. It ensures the  Miccosukee Tribe has the autonomy to protect their home, their land,  and their way of life.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693410/miccosukee-reserved-area-amendments-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and preservation, honoring  family ties and restoring beloved menu items including a throwback menu  featuring The Original Mountain Burger, a culinary emblem of community  heritage.\n\nToday, The Waterville Hotel stands as a vibrant hub, serving hearty  fare from burgers and fries to vegetarian dishes, complemented by local  craft beers and wines. The…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rights movement to alter public discourse and make  Jew hatred unacceptable in contemporary society, empowering Jews with  positivity and strength to discover and enjoy their heritage in  whichever manner they choose, without fear of attack or persecution;  and\n\nWhereas, we all share an obligation to condemn and combat Jew hatred  in all its forms; and…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…City Main Street Board, and 13 years on  the Royse City Parks Board. She has also contributed to the Rockwall  County Historical Commission, helping preserve the county's heritage  for future generations. Her dedication to children and education is  evident through her service on the Rockwall County Children's Advocacy  Center Board, the Royse City…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698359/recognizing-the-success-of-janet-nichol"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…players develop and improve not only their soccer skills  but their personal goals as well. Through scholarships, volunteering,  and community efforts to preserve Ukrainian heritage and bring  awareness to those in need, the Tryzub continues to support and grow  the Ukrainian American community.\n\nIn times of need, their service is a testament to the belief…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…spirit of the Tribe.\n\nAs the American flag and the Spokane Tribe flag flew side by side,  this celebration stood as a powerful symbol of unity, resilience, and  the living heritage that continues to enrich the inland northwest.\n\nMr. Speaker, I am not a Native Tribal member myself, but growing up  in eastern Washington, I did have time to spend playing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}]