[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…can hand millions of acres of our public lands over to  the fossil fuel industry for extraction.\n\nPublic lands should be our country's proudest legacy. They are our  natural heritage, a national treasure, and the agencies responsible for  stewarding them, like the Bureau of Land Management and the Forest  Service, diligently manage these resources for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…we acquired more  than 60 people of African ancestry in this Congress. More than 50  persons in this Congress are Latinos. More than 20 persons in this  Congress have Asian heritage.\n\nIt is the Voting Rights Act. Yes, that Voting Rights Act was there to  deal with racism. It says so in the act. It says race. We can't  discriminate against people based…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…1955, AHF has provided a cultural bridge between Hungary and the  Hungarian American community through history, arts, and tradition.\n\nIn 1989, AHF established the Hungarian Heritage Center. The Center  hosts a rich curation of historical archives which fosters a space for  meaningful lectures, cultural events, and workshops for all to enjoy.  Over the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…our  national marine sanctuaries for free.\n\nI have to ask: What is the endgame here? Where does it stop? Are we  systematically privatizing every piece of America's national heritage  for the richest and most powerful corporations in the world? That is  exactly where H.R. 261 seems to be taking us.\n\nIt rigs the game so that, for example, family fishing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…chemical fertilizers and pesticides, prevent soil erosion and improve  water quality. Beyond their environmental benefits, native plants are  foundational to the cultural heritage of many indigenous communities,  who have long depended on these plants for food, medicine, shelter and  spiritual practices.\n\nIn my home state of Hawaii, our kuleana (responsibility)…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Jewish  community, and for his decades of work to support Jewish community  values.\n\nI rise in strong support of my resolution, H. Res. 352, to recognize  Jewish American Heritage Month and highlight the enduring contributions  of Jewish Americans to our country.\n\nI proudly sponsored this bill when I was a freshman Member of  Congress, and it was the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…and  segregation, and of the enduring hope of working families seeking a  better life. Her name endures in our memory because her legacy endures.\n\nAs we close out Immigrant Heritage Month, Saint Frances Xavier  Cabrini challenges us to stand up to those in power who would seek to  divide us and pit us against our own neighbors.\n\nDespite those who seek…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…the marine sanctuaries most at risk because of this  legislation are iconic spots off the coast of California: Monterey Bay,  Channel Islands, and the newly created Chumash Heritage National Marine  Sanctuary.\n\nNowhere is this more evident than in the Chumash Heritage National  Marine Sanctuary, a sanctuary that was decades in the making. First  nominated…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Blacks/African Americans in Sewickley &  Edgeworth.'' It was a one-of-a-kind documentation of a significant and  often-overlooked part of the Sewickley Valley community's history and  heritage.\n\nMrs. Cole passed away in 2016 at the age of 92, leaving behind a  family and community proud of her contributions. I think those merit  recognition, and what better way…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…allow America to turn its back on immigrants who followed  every rule and make America stronger. It would be an affront to the  Constitution and a retreat from our values and heritage as a nation of  immigrants.\n\nThis is an awful situation where helpless people are being exploited  for political reasons. It is time for both political parties to step  aside…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to recognize an extraordinary artist, educator, and  community leader from Rochester, New York, Jason Barber.\n\nAs a Cuban-American artist and educator, Jason Barber…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…to lead with  purpose and pride.\n\nThe Igbo Day Celebration stands as a vibrant reminder of the strength  and beauty of the Igbo spirit. It is a time to reflect on the Igbo  heritage, honor ancestors, and inspire future generations to carry the  legacy forward.\n\nMr. Speaker, I am proud of the Igbo Community Association of Nigeria  DFW's continued dedication…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bailed-out peso from Secretary Bessent--and how  the Bessent policy on tariffs is going to give any kind of lifeline to  those family farms that have been so much a part of our heritage, who  do so much for the well-being of our country, and whose prosperity is  so essential to the well-being of our whole country.\n\nFarmers like to feed people. They like to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Government Champion Award--Gray Montrose: Gray Montrose is a  leader in land use, environmental law, and conservation, with over a  decade of experience advancing cultural heritage and resource  protection. As Deputy Director of Land Conservation at the Capital  Region Land Conservancy and a former Assistant Attorney General, she  has shaped major policies…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I recognize Caribbean American Heritage  Month, celebrating the culture, contributions, and history of Caribbean  Americans in Michigan's 12th Congressional District and across the  country.\n\nCaribbean American…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692989/caribbean-american-heritage-month"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…level. It is time we support them.\n\nThe following organizations have endorsed this resolution, including:  AMAC Action, America First Policy Institute, the D.C. Police Union,  Heritage Action, the Independent Women's Forum, the International  Franchise Association, the National Association of Convenience Stores,  the National Association of Wholesaler-Distributors,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…forward-thinking spirit  that Jeff brings to every opportunity. His leadership strengthens South  Carolina agriculture, ensures the future of family farming, and honors  the heritage that makes our State proud.\n\nOn behalf of the people of South Carolina, I thank Mr. Jeff Wilson  for his extraordinary contributions to our State, to our city, to our  county,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…stood as a symbol of Texas craftsmanship  and authenticity. Situated in the heart of the Fort Worth Stockyards,  the shop stands as a lasting symbol of the area's Western heritage and  strong sense of community. While it's known for its unrivaled custom  boots and saddles, M.L. Leddy's also offers western clothing, hats,  buckles, and accessories. Each…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700234/recognizing-ml-leddys-on-being-included-in-the-new-york-times-list-of-the-top-50-clothing-stores-in-the-united-states"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Festival to the irresistible aroma of wild-caught shrimp  sizzling across the waterfront, every corner of this festival reminds  us of why we come together to celebrate our heritage as the birthplace  of the modern shrimping industry.\n\nMr. Speaker, when it comes to festival, this one is shrimply the  best. I invite my colleagues and you, Mr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690464/isle-of-eight-flags-shrimp-festival"}, {"senator": "French Hill", "party": "Republican", "sentence": "…recreational fishing that is done on the Little Red River now  contributes $1.2 billion and 10,000 jobs to the Arkansas economy.  However, despite this beloved place in Arkansas' heritage, this river's  existing tail water trout fishery has been struggling for years.\n\nAfter careful conversations with the Arkansas Game and Fish  Commission, the Little Rock Army…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…empowering radical Islam to take a foothold in the United  States of America.\n\nGovernor Kathy Hochul of New York welcomed in the new year by  declaring January as Muslim American Heritage Month. To red-blooded  American patriots' dismay, Hochul directed State landmarks, including  the iconic skyline of New York City, to be lit in the color Islamic  green.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…passion have left an indelible mark on our city.\n\nThis St. Patrick's Day, Jay will carry forward not just a family  tradition but the enduring spirit of our community's Irish heritage  that defines this parade.\n\nMr. Speaker, I congratulate Jay on this richly deserved role.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…they are married.\n\nWe had a hearing a couple of weeks ago in a subcommittee which I have  been fortunate enough to chair. In that hearing, Robert Rector, who  works for the Heritage Foundation, found approximately 90 programs in  which eligibility depended upon having a small income.\n\nIn other words, you would lose eligibility for these programs if you…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today in recognition of National  Hispanic Heritage Month and to commend the extraordinary work of the  Miami-Dade County Hispanic Affairs Advisory Board.\n\nEach year, our Nation honors the history, culture, and countless  contributions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695658/recognizing-hispanic-heritage-month-and-the-miami-dade-county-hispanic-affairs-advisory-board"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…for H.R. 2701 from National Commander Scott  P. Stevens, CW04, USA, (R).\n\nThe Jewish War Veterans of the USA supports H.R. 2701, the       Fallen Servicemembers Religious Heritage Restoration Act. JWV       appreciates the leadership of Rep. Debbie Wasserman Schultz        (D-FL) and Rep. Max Miller (R-OH) for their bipartisan       introduction, as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…I am grateful for my colleague Jackie Rosen for working with me to  draft a resolution that draws attention to anti-Semitism in America and  declaring May, Jewish American Heritage Month.\n\nI yield to my colleague from Nevada Senator Rosen.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania, that makes a great product using sunflowers for that  beverage.\n\nI commend them today for honoring a vital piece of the Commonwealth's  logging and conservation heritage, the Colossal Cherry. The Colossal  Cherry is now an artifact, but at one time it was the largest black  cherry tree in the world. The Wilds Sonshine Factory hosted a  dedication…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694894/the-colossal-cherry"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…rights movement to alter public discourse and make  Jew hatred unacceptable in contemporary society, empowering Jews with  positivity and strength to discover and enjoy their heritage in  whichever manner they choose, without fear of attack or persecution;  and\n\nWhereas, we all share an obligation to condemn and combat Jew hatred  in all its forms; and…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Texas is home to a lot of wide-open spaces,  beautiful terrain, and vibrant wildlife. And Big Bend is a national  treasure.\n\nThis legislation expands and preserves the park's heritage, natural  resources, and jaw-dropping scenery while safeguarding private property  rights. It authorizes the National Park Service to acquire  approximately 6,100 additional…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691670/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…players develop and improve not only their soccer skills  but their personal goals as well. Through scholarships, volunteering,  and community efforts to preserve Ukrainian heritage and bring  awareness to those in need, the Tryzub continues to support and grow  the Ukrainian American community.\n\nIn times of need, their service is a testament to the belief…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}]