[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Harrison, Grace       Harrison, Michael Hart, Daniel Hartl, John Hatfield, Wesley       Helms, Holly Hendrix, Bridget Henne, Bryson Henriott, Nicole       Herman, Rosanna Hernandez, Sofia Herring Jones, Allison       Hibben, Elliot Higgins, Grace Higgins, Emma Hoffschneider,       Ryan Hofmann, Elizabeth Hood, Randall Hopkins, David Horsley,       Kelsie…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…during, the 2013 and 2017  elections of former President Juan Orlando Hernando who today sits in a  U.S. prison. So it is important that this election, like the election  of Hernandez' successor in 2021, is widely accepted as free, fair, and  transparent and that the results are honored in and outside of  Honduras.\n\nAt that time, I expressed concern about…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Ms. PELOSI. Mr. Speaker, I rise today with deep concern at the  President's outrageous and shameful pardon of Juan Orlando Hernandez, a  man an American jury convicted of trafficking tons of cocaine into the  United States and of corrupting his own government in the process.\n\nI saw this firsthand when…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697367/shameful-hernandez-pardon"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…we lost a lot that  morning, none more priceless than the six lives that perished: Maynor  Yassir Suazo Sandoval, Miguel Angel Luna Gonzalez, Jose Mynor Lopez,  Alejandro Hernandez Fuentes, Dorlian Ronial Castillo Cabrera, and  Carlos Daniel Hernandez. They are irreplaceable. Their names are  forever remembered--six hard-working men devoted to their…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…about drugs, I asked the chairman  previously: Why would the President of the United States pardon one of  the biggest drug dealers who was killing Americans, Juan Orlando  Hernandez. The last time, the gentleman said that he hadn't spoken to  the President and didn't know why.\n\nMr. Speaker, if he is so interested in stopping drugs, maybe he could  have…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…bipartisanship.\n\nThe last point I want to make is almost impossible to understand or  explain. Can you imagine that the former President of Honduras--his  name is Juan Orlando Hernandez--was prosecuted by the Federal  Government of the United States for his involvement in the trade of  narcotics? He was found guilty of having been involved and was  sentenced…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…turns out those plans had been developing over a very  significant period of time.\n\nSo if it was about drugs, by the way, the President wouldn't have  pardoned Juan Orlando Hernandez, a drug kingpin, right in the middle of  the process of saying he is trying to stop drugs. Here is a guy who was  sitting in our prison because he was the architect of a…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, last Friday President Trump said he would  give a full and complete pardon to Juan Orlando Hernandez, the corrupt  former President of Honduras. It is disgusting.\n\nTrump is going to erase a major drug trafficking conviction against  Hernandez, who is serving 45 years in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697176/juan-orlando-hernandez-former-president-of-honduras"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…They deported a 4-year-old American citizen child with cancer whose  parents had no criminal record, and we still don't know why.\n\nWe still haven't gotten answers about Andry Hernandez Romero, a gay  makeup artist with no criminal record who legally sought asylum and who  never even entered the country but was deported to a prison in El  Salvador, a country…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…attention to the  full picture because, of course, you won't see a pattern if you just  look at one case and you ignore the many, many others.\n\nThere is the case of Andry Hernandez Romero. He is a barber who came  here legally. He has no criminal record.\n\nThere is the case of Arturo Suarez Trejo. He is a musician. He came  here legally. He has no criminal…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…who have seen their working hours, wages, or employment       reduced or terminated.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield to the gentleman from  Puerto Rico (Mr. Hernandez).", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…it was another example of optics over evidence?\n\nMr. Speaker, 75 percent of these men had no criminal charges in the  United States. One of these men is 31-year-old Andry Hernandez Romero  who was snatched off the streets and put on a plane to El Salvador to  rot in a prison there.\n\nAndry is not a gang member. He is not a terrorist. He is a threat to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689646/protect-due-process"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Western Hemisphere, those bombs are not about drugs.\n\nIf the administration did want to stop drugs, Trump would not have  pardoned the former President of Honduras, Juan Orlando Hernandez, or  Ross Ulbricht who operated the Silk Road drug marketplace. He wouldn't  seize an oil tanker off the coast of Venezuela or threaten CIA  operations, blockades, and strikes…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…continues to defy a Supreme Court ruling to return this man to his  family. In fact, it is a full-blown constitutional crisis.\n\nThere are other people--including Andry Jose Hernandez Romero, a  makeup artist and legal asylum seeker, and Merwil Gutierrez, a teenager  who was mistakenly picked up by immigration enforcement--languishing in  El Salvador.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690509/trump-immigration-policies"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President, I want to begin with a truly disgusting  and alarming piece of news the American people got this morning. This  morning, the former President of Honduras, Juan Orlando Hernandez, was  released from prison after Donald Trump gave him a pardon.\n\nWe all know Donald Trump does a lot of hypocritical things. Almost  every day there is hypocrisy oozing…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Speaker, I rise today in proud recognition of four  Corona High School students, Seth Hernandez, Billy Carlson, Brady Ebel,  and Ethin Bingaman who were selected in the 2025 Major League Baseball  Draft. Seth Hernandez, Billy Carlson, and Brady Ebel were selected in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693755/recognizing-seth-hernandez-billy-carlson-brady-ebel-and-ethin-bingaman"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Herd, Michael: SKY NEWS.\n\nHeredia Soler, Lidia: CATALUNYA RADIO; Heritage, Robert:       NBC NEWS; Herlihy, Brianna: FOX NEWS; Hermelijn, Ryan: DUTCH       TV & RADIO (NOS); Hernandez, Alec: NBC NEWS; Hernandez,       HENRY: TELEMUNDO NETWORK; Hernandez, Michael: CNN; Hernandez       Orellana, Angel: UNIVISION; Hernon, Louise: NBC NEWS;       Herrera,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…regardless of blue or red, can count on the support it needs to prevent  and respond to acts of terrorism.\n\nLastly, I thank Ranking Member Thompson, Resident Commissioner  Hernandez, and former Congressman and Chairman Mark Green for  cosponsoring this bill. I also extend my gratitude to the Major Cities  Chiefs Association and the International Association…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…and the swift action of the FBI, Garner police,  and the North Carolina State Bureau of Investigation, they were  rescued.\n\nThat crime never should have happened. Estrada-Hernandez should never  have been in this country in the first place. Do you know what, Mr.  Speaker? He would not have been if it weren't for the Biden  administration's open-border…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Call; Heltman, John: American       Banker; Henderson, Cameron: London Daily Telegraph;       Herchenroeder, Karl: Communications Daily; Hermann, Peter:       Washington Post; Hernandez, Efrain: Washington Post;       Hernandez, Michael: Anadolu News Agency; Hersey, Linda: Stars       and Stripes; Hertzler-Mc Cain, Aleja: Religion News Service;       Hesson,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]