[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…improve services for residents, and support community  development across southwest Georgia.\n\nHis commitment to service has earned him numerous honors, including  the Unsung Hero Award, Certificates of Congressional Recognition,  multiple recognitions from the Southwest Georgia Regional Commission  for long service and perfect attendance, a Certificate…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…administration is destroying democracy through its  attack on the rule of law.\n\nAs a young man, I decided to become a lawyer. Actually, as a child, I  was 4 years old when my hero, my mentor, my cousin--we called him  Tokey, but his name was Archibald Hill--I was 4 years old when he  graduated from law school and became a lawyer. When that happened, I…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…including General CQ Brown, the eminently qualified  Chairman of the Joint Chiefs of Staff.\n\nGeneral Brown is an exceptional leader, a dedicated servicemember,  and an American hero. His firing, the dismissal of Admiral Franchetti,  and the judge advocate generals for the services is a travesty. When  nominated, General Brown had logged in over 3,000 flying…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…controversial former Arizona       sheriff Joe Arpaio, who was convicted of violating a federal       court order to stop racial profiling. Arpaio was a political       ally and a hero to many of Trump's anti-immigrant supporters.       As we noted earlier, the chief executive's constitutional       power to pardon is without limit, but presidents have…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…our communities.      Honoring Joshua Jarzab, Ohio's 13th District Champion of the Week\n\nMrs. SYKES. Mr. Speaker, today, I rise to recognize Twinsburg  firefighter and local hero Joshua Jarzab as Ohio's 13th Congressional  District Champion of the Week.\n\nOn August 17, Joshua and his team responded to a call for a basement  fire. Joshua and his team acted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to uplift the story of a hero  from Ohio's 13th Congressional District, Mariah Stacy Frederick.\n\nMariah is the voice and advocate for her daughter, who lives with  spina bifida, a condition that occurs when…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691524/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…that war. Robert Smalls, who  convinced Abraham Lincoln to allow these freedmen to serve, became a  captain in that Navy, participated in 18 battles, and was the only  genuine hero of the Civil War. In my not-so-humble opinion, Robert  Smalls is the most consequential South Carolinian who ever lived.\n\nIn 1865, Abraham Lincoln acknowledged their value,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…embodied to a ``T''), the closing       lines of the show encapsulate the simple, but pure divinity       of living a life full of love. As the show comes to a close,       the hero, Jean Valjean, is welcomed to heaven after a life of       reformed selflessness and love. The bishop, who inspired the       story's hero to live a new life devoted to others,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Jersey's  highest Heroism Award. He has recently been recognized with the  Distinguished Executive Award by the New York City Federal Executive  Board and was inducted as a Hero of the Harbor.\n\nMr. Speaker, please join me in congratulating Joseph Seebode on his  retirement. It is my privilege to recognize his remarkable  contributions to our Nation…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be exposed to the public, but they chose not to  but for it having been sent to Mr. Goldberg.\n\nMr. Goldberg, by the way, deserves a Congressional Medal of Honor. He  is the hero in this story. He is the person who has had the courage and  also the wisdom and insight to understand that before you release this,  you need to do some checking. So he did…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…were  upended, since the floodgates were opened to corporate money in an  unlimited way, in an anonymous way, coming into our elections.\n\nSenator Durbin, of course, has been a hero, as he mentioned spending  much of his career trying to introduce legislation and pass legislation  that would put citizens in charge of our elections rather than Big  Money.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise to congratulate and recognize the  extraordinary bravery of Tesfaye Deyasso, who was named the 2025  National Hero of the Year by the National Association of Letter  Carriers.\n\nOn April 18, 2024, Mr. Deyasso witnessed a car drive off the highway  and crash into a barrier, erupting into flames.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is largely  because Donald Trump betrayed them and decimated their businesses with  his disastrous tariffs.\n\nNow, Donald Trump is patting himself on the back, acting like a hero  to farmers, while using taxpayer dollars to clean up the mess he  created. It is textbook Donald Trump incompetence.\n\nI want to make three very important points about this…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…tempered by time, never to subside.\n\nHowever, amidst our sorrow, may we find solace in his courage,  character, and the oath he kept until the end. Officer Riveros' legacy  as a hero will live on in the hearts and minds of the Baldwin Park  community and the 31st Congressional District.\n\nThis devastating event also claimed the life of Darius Wong, a  resident…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…from Sustainable Jersey and  the National Park Service, including twenty-five thousand dollars to  provide composters to residents. In 2015, Dorothy was named a  Sustainability Hero by Sustainable Jersey. I am confident that the 6th  Congressional District of New Jersey will thank her for her efforts to  keep Middlesex County's greater environment safe,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…While many her age focus on  slowing down, Joan stays energized and youthful by serving others. Her  mind is always on how to help--then doing exactly that. Joan is truly a  Hero Among Us. As she puts it, ``I started volunteering to help others  but never realized it would help me too. It has given me more joy than  I could ever imagine. Volunteering…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…The Revolutionary War reenactment is especially significant as one of  the early settlers of the wilderness of far Downeast Maine after  America won its independence was a hero of that conflict, General John  Crane. A Massachusetts carpenter, Crane was a leader of the Sons of  Liberty and was the only rebel injured during the Boston Tea Party.\n\nCrane…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…``Hey, this guy is still  alive!'' Miraculously, after his wounds were addressed and he was  stabilized, he not only survived, but fully recovered.\n\nCpl Ivanoff returned home a hero. He finished his education at  Harrisburg Catholic High School and began his civilian career at the  Post Office. He became an accomplished amateur golfer, earning the 1968…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…and coal miner for the Southern Ohio Coal Company. Ray has  received numerous awards such as the National Grange Volunteer  Firefighter of the Year and was deemed a Hometown Hero by Modern  Woodmen. To this day he is an active fire chief and continues to give  back to southern Ohio.\n\nMadam Speaker, America is forever grateful for people like him and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…meritorious  achievement in a combat zone, an enduring reflection of his courage  under fire and commitment to mission and comrades alike. Delman doesn't  consider himself a hero but credits the men that would not quit until  he was safely off the battlefield. They provided protection and care  and were amazingly able to get a helicopter in after three…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…medal of sacrifice will ensure that when a family member, a  spouse, a son, a daughter, or a department, that when they reflect on  the end of watch for their friend or their hero or their loved one,  they will know that it is the whole of America that remembers with  them.\n\nMr. Speaker, I ask my colleagues to send a clear message to the  families who…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…staff and the team she serves with.  Additionally, Carol has served for years as a Sunday School teacher  each week and Poll Captain of elections in her area. She truly is a  Hero in the community.\n\nIt is clear Carol Berti has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690132/recognizing-carol-berti"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…led, and his respect for  those he fought under.\n\nWhether he will admit it or not--I suspect the answer is no--Clyde  Milligan is one of our best. You might even call him a hero--a hero for  the way he answered his country's call in a time of peril and for the  way he has lived his life since the war ended--a life guided by faith,  full of achievements…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…reserve the  balance of my time.\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Oscar Upham, an American  military hero.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, I rise today to honor a true west Texas  giant and American hero, Mr. J.L. Stevens of Big Spring, USA, a World  War II veteran who just turned 100 years old this past week. He is a  living monument to the grit, courage, quiet humility, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Member Takano for his comments and support.\n\nI have represented the Peltz family for well over a decade, and that  included Ernest Peltz, a World War II veteran and American hero, who  died a few years ago between Christmas and New Year's Day.\n\nAt that time, I heard from his son, Charles Peltz, who found himself  caught in a maze of bureaucratic VA red…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…day.\n\nThese officers aren't just responding to emergencies. They are  neighbors, trusted members of our communities, and our role models.\n\nToday, I also want to honor a fallen hero from my home State of Utah,  Sergeant Bill Hooser of the Santaquin Police Department. Sergeant  Hooser gave his life in the line of duty, and this week his name is  being added…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691165/events-this-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…along with her husband, mom and, of  course, Coral. Volunteering has become a Godding/Brooks ``family  affair''! Kimberly is truly an example of an outstanding volunteer and  a Hero in our Community.\n\nIt is clear that Kimberly Godding Brooks has made a profoundly  positive impact on our community, and I am grateful for her service.  May we all strive to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize Dr. Tim  Connelly, an internal medicine physician at Memorial Health University  Medical Center, who has been named the 2025 Physician Hero Award  recipient by the Georgia Hospital Association.\n\nThis award honors physicians who give their time and expertise to  strengthen their institutions and improve lives. Dr.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699008/dr-tim-connelly-receives-2025-georgia-physician-hero-award"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…recently as last week, Rick received a call on Monday and  delivered supplies on Tuesday. Rick and his team save lives with his  work, and I am extremely privileged to recognize a hero like Rick  Grizzell.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690844/recognizing-rick-grizzell"}]