[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…around our country. We have military patrols in American  cities, political investigations of the President's critics, mass  detentions without due process, Federal agents hidden behind masks,  museums ordered to rewrite history, the government bullying private  companies and universities, and banners of the President's face that  would even make Kim…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…declassify the Department of Justice's  Office of Legal Counsel's opinion underpinning their legal argument for  this operation. There is no reason for this document to remain hidden.  The American people deserve to know why this administration believes it  has a license to kill in their name and what parameters govern that  authority. If the legal reasoning…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Republic of  China and their families from financial institutions and accounts in  the United States.\n\nThe report mandated by the bill is intended to raise public awareness  of hidden and corruptly gained funds that are directly or indirectly  controlled by such officials--for those listed in the report, and their  immediate family members.\n\nThe bill would…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…$10.3 billion handout never got any debate here on the floor of  the Senate. It didn't even come from any legislation. The  administration created it out of thin air. It is a hidden piece inside  part of Federal rulemaking with a very deceptive bureaucratic name. It  is IRS Notice 2025-28. And the topic is so bland, if you don't have a  background in tax…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…for working men and women on  the Outer Continental Shelf.\n\nMarine archaeological surveys are not just a nice idea. They actually  are safeguards that protect workers from hidden dangers lurking beneath  the waves. These surveys can detect unexploded ordnance, UXOs, which  are military ammunition, that has never detonated.\n\nThere is actually a lot of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Republican Senator blocked it.\n\nIn the week since, even more damning information has come out, and  now we know exactly why Trump is bending over backwards to keep these  files hidden.\n\nWe know that Epstein was at Trump's wedding. We know that Epstein  once called Trump his ``closest friend for 10 years.'' And we have seen  that Trump wrote Epstein a birthday…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans are fighting tooth and nail not  to stop the insanity but to keep Congress from having a say about these  tariffs, to hide from doing their jobs.\n\nWith this provision hidden in the rule, they are stopping the entire  House from bringing up legislation to put an end to these tariffs, not  pause them, end them, legislation which, under the law, any…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…seen an over 800 percent surge in these fires, creating an  unprecedented crisis in public safety.\n\nPoorly manufactured lithium-ion batteries often imported from China  are hidden ticking time bombs waiting to detonate in American homes and  neighborhoods. The danger has become too great to ignore.\n\nToday, the House is poised to pass bipartisan legislation…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…behind TikTok are buying $300 million worth  of Trump coin, and that is just what we know about. There is a lot we  don't know about because cryptocurrency literally means hidden money.\n\nIt allows for bailouts under section 13(3) of the Federal Reserve  Act. Jay Powell won't do it, but the next guy will.\n\nCongress won't stop him because crypto spends…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of  putting a tariff on them?\n\nThe second fact that bears mentioning is that the vast majority of  the fentanyl crossing the southwest border is transported by Americans,  hidden in their cars and trucks. That is why I have supported--like  most of my colleagues in this body have supported--more money for  technology and personnel to better find these…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…By Stephen Jiang       Gliding across the tiled floors are a hundred pairs      Of shoes like loafers and running kicks, we discern      From our vantage, but hidden when C-SPAN airs      Behold the resolute heels of Senator Blackburn!      They've traveled here from Alabama's waterfalls      Tracking dust from Jersey streets onto the blue…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…hospitals  and nursing homes and doctors' practices are reeling at what those cuts  mean for their financial viability.\n\nMedicare--Medicare--half a trillion dollars in cuts hidden in the  bill in a tricky way so that the cuts come through sequestration and  nobody has to own them. They can do a Pontius Pilate hand-wash of the  cuts.\n\nWell, no. We saw…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…secret by the administration.\n\nBeing put on a list by the executive branch does not deprive Congress  of its vital role in approving the use of force, but such a list kept  hidden from the American people, if used as a justification, may drag  our Nation into an unintended war.\n\nIf it were as simple for a President--any President--to claim that  war…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…infamous rail juncture and holding town just north       of Paris. From there, its prisoners were transported to       concentration or death camps.\n\nGrandmother and I stayed hidden in my mother's apartment       for a year, never leaving for fear of being arrested or       worse. I went out alone to get food. Every day I stood in       lines, unable to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…and powerful men who went to  Epstein's island, who went to his ranch, who went to his home and raped  and abused underage girls or saw underage girls being paraded, are all  hidden. They are all redacted.\n\nIt is a little bit of a farce. They are inviting all the Members of  Congress to go see the Department of Justice's ``unredacted files,''  but they…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…current fraud, waste, and abuse  exposed in the unaffordable care act subsidy scheme that Democrats are  addicted to, we are offering transformative policies that will root out  hidden costs, attack inflationary programs, and increase competition  throughout the entire healthcare insurance marketplace, lowering  premiums for all Americans.\n\nHowever, Mr. Speaker,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…up because of massive  overspending during the 4 years of the Biden-Harris administration.  Taxpayers have already sustained a cut in their standard of living  through this hidden tax called inflation. So the last thing they needed  or they deserved was a massive tax increase on top of this 40-year-high  inflation, where everything, on average, is, let's…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…stepped in while men fought during World War II, the  10,000 women known as Code Girls who broke German and Japanese codes  for the U.S. Army and Navy during World War II, the ``Hidden Figures''  of NASA who helped launch John Glenn into space, or the Black Angels  from my district, Staten Island, New York, who treated sick  tuberculosis patients when no…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that may have become  pollution in Lake Tahoe.\n\nIn comparison to visible litter items collected by volunteers, BEBOTs  detect and remove up to 10 times the number of items hidden under the  surface of the sand.\n\nThey also partner and collaborate with several local organizations,  one of  which includes the Desert Research Institute, which analyzes the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…in these roles how important it is that, during this Small  Business Week, as we are doing our reconciliation bill and doing all  the things we do, we not forget about this hidden tax, that we have  created this burden that we have placed on the 99 percent of small  businesses in our community, which employ half the people working in my  State, making…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Federal Government having a price cap on a product that is a  very competitive product, with many, many banks not even charging for  overdraft protection.\n\nThere is nothing hidden, Mr. Speaker, about fees on overdrafts. The  Electronic Fund Transfer Act signed by this Congress made it clear  decades ago that consumers must opt in to overdraft protection.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Institute has tabulated that Federal  regulations impose a cost of $1.9 trillion on the economy. This  averages out to more than $14,000 imposed on every American household,  a hidden regulatory tax that is eating up American paychecks.\n\nThe amount of rules far exceeds statutes by Congress. In 2022 alone,  there were more than 3,100 rules issued by agencies…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…solution to an irrefutable  problem, which is why it passed last Congress with bipartisan support.  We should be loud and clear: No American university should be helping  the hidden agendas of the Chinese Communist Party or other nations  continue to threaten U.S. national security.\n\nI thank Mr. Baumgartner for introducing this vital piece of  legislation.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…a much-needed deregulatory effort.\n\nFederal regulation's total compliance costs and economic effects are  at least $2.155 trillion, which equates to over $16,000 in annual  hidden regulatory costs to the American taxpayer. If we truly care  about affordability, about the economy, about small businesses and  their consumers, then there is no better policy…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…criminalized regulations, but no one actually knows because Washington  has never bothered to count them. This is the very definition of  overcriminalization: vague laws, hidden laws, duplicative laws, and  regulatory crimes that nobody could reasonably expect an ordinary  citizen to find or understand.\n\nThe Federal code has grown so bloated that a…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…yelling at their Representatives. They are  saying: Do something.\n\nWhile Americans want us to have the courage to stand up to Trump,  House Republicans are doing the opposite.\n\nHidden in the rule we are debating today is a provision that will  cover up Secretary Hegseth's texting of classified war plans.  Republicans won't even let Democrats ask for information…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Rose", "party": "Republican", "sentence": "…than just end a partial government shutdown. It  corrected a serious wrong.\n\nBuried deep inside the funding bill that the Senate passed and sent  to us last November was a hidden provision that never should have seen  the light of day. It was quietly inserted without transparency, without  debate, and without notice to House leadership.\n\nIt allowed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…focused on the bank's  Nazi-linked financial accounts. Turns out, Credit Suisse serviced more  Nazi wealth than was known during and after World War II and tried to  keep it hidden. Thanks to these whistleblowers, I discovered that  Credit Suisse lied to Congress about all this, while smearing the  reputation of the Simon Wiesenthal Center.\n\nMy oversight…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…about the numbers of veterans and first responders who  have experienced an event, the numbers are small but not  inconsequential and staggering but, I think, kept too well hidden. For  example, over 50 percent of veterans have experienced at least one  traumatic event in their lifetime.\n\nMr. Speaker, let's just go back a little bit in history because…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…they need to rebuild their lives. She  has played a key role in transforming how society understands and  addresses human trafficking, ensuring that the issue is no longer  hidden or overlooked.\n\nIt is clear Laurie Swink has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}]