[{"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…legislative measures to prevent Members of Congress from trading stock.\n\nThe original STOCK Act passed in 2012 bars a Member of Congress, the  President, Vice President, and high-level staff from engaging in  insider trading or otherwise using nonpublic information for their own  benefit. The bill also included important updates to financial  transparency…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691213/stock-trading-ban-for-members-of-congress"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, I had the opportunity late last month to  spend some time with a delegation of high-level officials from the  leadership of Libya.\n\nSent to Washington by the Libyan Prime Minister, the group presented  solid evidence that a new Libya is in the making.\n\nThe new…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697566/recognizing-the-importance-of-a-new-libya"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…you don't  want to have to say that it was over something minor like a stolen car.\n\nThe balance that the city struck was that it should be for an  imminent violent offense, high-level felony, something like that that  you really understand why they would have engaged in the pursuit. This  bill would take that away and expand it open so that you could have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…creation.\n\nEven so blinkered, the numbers are colossal, and the threat looms.  All this has caused the World Economic Forum to elevate ``ecosystem  collapse as a mid- to high-level global risk.'' Other studies advance  the concept of planetary insolvency. Others warn about our continued  fossil fuel pollution: If left unchecked, ``then mass mortality,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…from Brittny in Denver:\n\nMy son has autism, a developmental disability, and a speech       delay. He cannot be in a typical daycare or even go to       preschool due to the high level of support he requires.       Medicaid pays for his speech therapy and occupational       therapy. After just 6 months of ABA therapy, occupational       therapy, and speech…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…community       hospitals like his, where they must always think about       whether there is enough demand for a particular service, he       said.\n\n``There has to be a high enough level of volume to maintain       that proficiency,'' Kramer said. ``And if it becomes a       service that is too expensive to offer, we've got to think       about, `Okay,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "Mr. PANETTA. Mr. Speaker, I rise today to welcome the positive  outcomes of the C5+1 Summit, held in Washington, D.C., on November 6,  2025. This high-level meeting reaffirmed the United States' partnership  with the nations of Central Asia--Kazakhstan, Kyrgyzstan, Tajikistan,  Turkmenistan, and Uzbekistan--in promoting regional…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…incidents of AI being used to falsely  impersonate Federal officials, posing a very serious threat to our  national security.\n\nRecently, an imposter using AI attempted to contact high-level U.S.  security personnel pretending to be Secretary of State Marco Rubio.\n\nAI will only continue to be more powerful and accessible, so we must  act now to establish strict…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695106/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…forthcoming and  transparent about those missteps. The language in this legislation  would tighten the circumstances under which critical skills incentives  can be used to retain high-level VA employees.\n\nWhile I am generally supportive of this additional oversight to  ensure these awards are being used appropriately, I continue to be  concerned with Secretary…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…the Office of National Drug Control Policy,  threaten the effectiveness of HIDTA.\n\nWithout full funding, regional HIDTAs will lack the resources needed  to maintain this high level of coordination. That's why I recently  joined with my colleagues in urging House Appropriations Committee  leadership to ensure that the HIDTA program receives the full…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…administration, when Secretary Bodman was there,  they tried to shortcut the cleanup process by saying we could just  grout the waste.\n\nSo, obviously, you can't just pour concrete on high level nuclear  waste, on a toxic brew, and then just leave it in the ground--so many,  many challenges there. Despite Secretary Chu's Nobel Prize-winning  credentials and genuine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…were underrepresented in advanced classes, so she  created a framework for teachers when making course recommendations and  worked from the ground up to better publicize high-level courses for  students.\n\nThanks to her efforts, the gaps in advanced coursework decreased and  now these advanced classes more closely reflect the composition and  diversity…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697970/national-school-counselor-of-the-year-danielle-crankfield"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…STEM education, this bill would  qualify accounting instruction for Federal funds. This recognition  aligns with the increasing need for accounting professionals to have  high-level math and technology skills, including the ability to analyze  big data, ensure data security, and manage cyber security risk.\n\nIn particular, this bill would allow States…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Obama  administration. For example, at that time, I released a majority staff  report just last year. That report made public FBI emails that showed  agents tried to arrest high-level Iranians but were stopped from making  those arrests. Those agents were stopped then from doing their jobs  because of political considerations relating to the 2015 Iran…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Amy's presence in Idaho, she worked tirelessly to help  Idahoans where she could and serve their needs. One of the things I'm  most proud of during my time in Congress is the high level of service  we've provided to Idahoans--and Amy played a key role in making that  happen.\n\nFederal government agencies are often difficult and complex to  navigate. However,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…White House and with the leadership of both Houses  of Congress from both parties. We recognize that His All-Holiness is  among the very few world leaders who commands such high-level access to  the leadership of our Nation.\n\nThe U.S. Congress expressed its profound respect and admiration for  His All-Holiness in 1997 when it awarded him the Congressional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…determination, work ethic, and pride--not only as individuals, but in  each other as a team. They stayed focused on their mission, never  wavered, and performed at an extremely high level under immense  pressure. On behalf of the 10th Congressional District of Pennsylvania,  I'm honored and privileged to commend the Marching Bulldogs on their  well-earned…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…tolerated.\n\nIndeed, at the time, in 2019, Gavin Newsom, who had just taken  office, had declared a war on charter schools. Charters, which are  public schools that have a high level of flexibility as to how they run  their school but, in turn, are held to a greater standard of  accountability, have gotten tremendous results. Studies consistently  show…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…STEM education, this bill would  qualify accounting instruction for Federal funds. This recognition  aligns with the increasing need for accounting professionals to have  high-level math and technology skills, including the ability to analyze  big data, ensure data security, and manage cyber security risk.\n\nIn particular, this bill would allow States…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…economy,       infrastructure, or particular industries.\n\n(4) Political elites.--The term ``political elites'' means       current and former government officials and their high-level       staff, political party leaders, and political committee       leaders.       SEC. 5. SUNSET.\n\nThe authorities provided by this Act shall cease to have       effect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…subsequent NEPA reviews and analysis, which will be conducted  before BLM issues permits or approvals for any ground disturbing  activity.''\n\nIn other words, what you had was a high-level management framework.  No individual projects were approved. Any seeking to advance would  still have to go through a separate permitting process before being  allowed to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…to constituent service.\n\nAs my Casework Director, she instilled the same standard across my  team. One of the things I'm most proud of during my time in Congress is  the high level of service we've provided to Idahoans--and Linda played  a key role in making that happen. Federal government agencies are often  difficult and complex to navigate. However,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}]