[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…Failing to invest in those who need it most because our debt  is bogging us down will only add fuel to that fire.\n\nOn another front, Americans have continued to experience high  inflation this year that can be tied to this growing national debt.  When inflation goes up, the Federal Reserve has to raise interest rates  to combat those higher prices. As interest…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…economic analyst observed ``the preliminary signs of  stagflation pressures.''\n\nNow, I am old enough to remember the stagflation of the 1970s: low  growth combined with high inflation. It was devastating then, and it  would be devastating now. Unsurprisingly, consumer sentiment is down  substantially.\n\nMuch of this economic weakness is the result of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…tank. Its  analysis is that, by October, tariffs have raised retail prices on all  goods by nearly 5 percent relative to their pretariff trend line.\n\nInstead of solving high inflation, the Trump tariffs have continued  it and, in some instances, increased it. This includes a 6 percent  increase for imported goods and 4.3 percent for domestic goods because…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…briefly, then, just make, again, a few simple points. I am  disappointed that President Trump isn't doing more to reduce costs. He  was elected, in no small part, because of high inflation and promised  it would come down on day one.\n\nThese tariffs, if imposed, will make inflation worse and hit the  lowest income Americans the hardest. It will impact American…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…supply can be easily constricted by foreign governments,       investing in domestic oil production is a matter of national       and energy security. During a time of high inflation across       the country, this misguided rule will almost certainly lead       to higher energy prices for working class families across       America. Restricting access…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Democrats who were demagoguing this issue, can you imagine  what that would do to the standard of living of hard-working American  families? And that would be on top of 4-year high inflation--actually  the highest in 40 years. So that would be, to me, insult added to  injury, to add a huge tax increase on top of all of the inflation that  Americans experienced…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…America. I don't  know what parallel universe they have been living in, Mr. Speaker, but  we heard the message that the voters sent who said they are sick and  tired of high inflation, of high gas prices, of not being able to fill  up their grocery cart because of the spending in Washington, for  Washington, at their expense.\n\nWhat does this bill do?…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…yet, but I assume that is coming.\n\nMy question to my good friends on the other side is: Where were they  the last 4 years? Where were they? We have got a steady diet of high  inflation. We have got a steady diet of 15 million illegals coming into  this country, using every public school, every hospital, not being a  citizen, draining the payroll, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…reintroduced this Congress with my colleague, Congressman Josh  Gottheimer of New Jersey.\n\nAmerica's small businesses have faced a tough road, weathering the  impacts of COVID, high inflation, and burdensome regulations that have  made it harder to grow and compete. Yet, they continue to serve as the  backbone of our economy, driving innovation, creating jobs,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…always been an important issue.\n\nBut, a year ago in November, the American people delivered a clear  message that the Biden administration, which presided over 40-year high  inflation, was taking the country in the wrong direction. President  Trump received the electoral vote and the popular vote, and he won  every swing State. Republicans secured majorities…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…people to extend the 2017  Tax Cuts and Jobs Act, to enshrine border security into law, and to  move forward toward American energy independence.\n\nAfter enduring years of high inflation, American families and small  businesses urgently need tax relief in order to thrive. We must pass  our budget resolution today to start the budget reconciliation process…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689894/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the investments and  productivity because we have got to raise wages.\n\nNow, we are going to do a little economic geekdom. Remember the  previous few years where we had high inflation? Most of America is  poorer today than they were 4 years ago, and that is basically  inflation. Your dollars, your salary became worth less.\n\nIn my district today, if you…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…regulate every aspect of small business owners'  livelihoods if they didn't fall in line with his Green New Deal agenda.\n\nSmall business owners, already struggling with sky-high inflation,  begged Washington, D.C., for less regulation and more freedom to just  make a living. The Republican majority has spent the last 4 months  rolling back these regulations.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "French Hill", "party": "Republican", "sentence": "…yielding to me.\n\nMr. Speaker, the policies of the Biden-Harris administration crushed  the spirit of the American people under the weight of rising costs from  a 40-year high inflation, open borders, uncertain futures, and spending  an avalanche on Biden's Big Government spending priorities that have  saddled us with an annual deficit of $2 trillion.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689915/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…successful. This legislation prevents hard-working taxpayers from  facing the largest tax hike in American history.\n\nAfter 4 years of the Biden administration, we saw 40-year-high  inflation. The cost of everything has gone up because of massive  overspending during the 4 years of the Biden-Harris administration.  Taxpayers have already sustained a cut in…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…future.\n\nWe are not cutting taxes for the rich. We are looking out for the  folks that make America work every day and who have been hardest hit in  the last 4 years by high inflation and failed government policies.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691557/republican-tax-cuts"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…was the outrage then?\n\nFor 8 years, this hysteria has cost them. While they persisted in  their witch hunt of President Trump in 2022, Americans contended with  40-year high inflation, after Democrats and President Biden dumped  trillions of dollars into a recovering post-COVID economy, which even  one of their chief economists told us would create massive…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "French Hill", "party": "Republican", "sentence": "…continued access to  financial services by voting to nullify the Consumer Financial  Protection Bureau's disastrous rule on overdraft fees.\n\nIn a time burdened by the 40-year-high inflation, when many middle-  and low-income households are living paycheck to paycheck, ensuring  Americans have access to affordable credit has never been more  important.\n\nOverdraft…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]