[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…mental health care services for  transgender kids of servicemembers. That is what we are talking about.\n\nThis amendment is intentionally discriminatory and will result in  higher rates of mental health issues and suicide for trans youth, kids  who already experience higher rates of depression, anxiety, and suicide  compared to their peers.\n\nRepublicans'…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…controversial to say that air pollution is dangerous.  Every year, particulate-matter pollution kills more than 50,000  Americans. Study after study has linked air pollution to higher rates  of cancer, heart disease,  diabetes, cognitive decline, and, of course, respiratory conditions.  The evidence is overwhelming that clean air saves lives.\n\nIf my colleagues…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…in four Americans are concerned with their utility bills  increasing, and they should be because at least 102 gas and electric  utilities have either raised or proposed higher rates that will go into  effect next year.\n\nHere is the proof. Here is a report from September of this year:  ``Residents in at Least 41 States and Washington, D.C., Are Facing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…20 percent of non-elderly adults and 40       percent of children living in rural areas enrolled in       Medicaid and CHIP. In almost all States, rural areas have       higher rates of Medicaid enrollment than metropolitan areas.       Cuts to Medicaid would shift healthcare costs onto rural       families, many of whom already struggle with financial…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provisions in the One Big Beautiful Bill Act it wants to  permanently adopt or decouple.\n\nThis disapproval resolution could harm D.C.'s credit rating, forcing  D.C. to pay higher interest rates. Rating agencies consider the  possibility of Congress meddling in D.C.'s fiscal matters as negative  for D.C.'s rating, but also consider as positive that ``Congress…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…receive equitable, respectful, and high-quality healthcare.\n\nThe United States continues to face a maternal health crisis, with  Black women experiencing significantly higher rates of pregnancy- related complications and maternal mortality compared to their white  counterparts. These tragic and preventable outcomes stem from systemic  inequities, implicit…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…reaching its lowest level in 12 years, and economists are increasingly  convinced that we are heading for a recession.\n\nThis budget will balloon our deficit, leading to higher interest  rates. It will slash critical investments and will decimate essential  programs that support the people who we represent, all of this to help  billionaires and corporations…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689895/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…According to the FBI,  assaults against officers remain very, very high, with tens of  thousands of them who are injured annually.\n\nBeyond the line of duty, officers experience higher rates of PTSD,  depression, and suicide compared to the general population. Yet, for  too long, this body, Congress, has not done as much as we should to  tackle these issues…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…SBA programs undermines entrepreneurship, limits       innovation, and weakens our long-term economic       competitiveness.\n\nImmigrant entrepreneurs open businesses at higher rates       than native born Americans and Latino-owned businesses       contribute almost $800 billion to the nation's economy. And       as we noted in our 2024 analysis on…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means we  are going to have to pay more on our debt.\n\nAt the same time, the dollar is declining and prices are going up,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Arkansas  System and Arkansas Children's Hospital in Little Rock. Arkansas  Children's used NIH funding to research why kids in rural, smalltown  areas were experiencing higher rates of pediatric asthma and improving  their treatment options.\n\nThey also used Arkansas NIH funding to research how to limit the  negative long-term impact of chemotherapy…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…my second child. I was  on the Joint Commission on Health Care, and I began to really look into  the maternal mortality crisis that we have in this country. We have  higher death rates for women than many other Third World countries.\n\nI started looking at the data of why women were dying. Many of these  deaths were preventable. There were differences.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…South  Carolina. We see it in Massachusetts, as my colleague just spoke about.  We see it in Mississippi, Georgia, and other places as well, where  Black residents face higher rates of those chronic, preventable  diseases and illnesses such as hypertension and diabetes. They suffer  disproportionately from things like stroke and heart attack.\n\nToo often,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…consume.\n\nMr. Chair, I rise today in opposition to this budget resolution.\n\nThis budget is disastrous for the American economy. It will balloon  our deficits, lead to higher interest rates, and make the things  Americans buy every day more expensive. It will slash critical  investments in the things that make us healthier, safer, and more  productive,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…on basic  necessities just to pay their rising electric bill. People are very  concerned, and they should be, because over 100 gas and electric  utilities are proposing higher rates this year.\n\nMr. Speaker, you know very well that we are grappling in Florida  where the largest utility has requested what looks like the largest  rate increase in the history…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$1.62. The original model was, every $1 in, we would  spend $1.42 or $1.43. Our spending is up.\n\nWhat is driving that spending up? It is the refinancing of our debt  at higher interest rates, because we had all that debt we sold a few  years ago at very low interest rates. The fact of the matter is  healthcare costs keep going up. The stupid discussion…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in taxes. When we  have had very low marginal tax rates, we take in about 17, 18 percent  of GDP. It is the seesaw of lower marginal tax rates, the economy  grows; higher marginal tax rates, the economy shrinks. We are getting  basically the same percentage of the economy in tax receipts.\n\nThere is an article on the Manhattan Institute's website that…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Now, somebody is paying. You and I are paying it. By the way, if you  are not getting extra money, if you are paying for it on your own, you  are still paying those higher and higher rates. If I were that person  individually insured who was not getting the subsidy when everyone else  was but my tax dollars were going to subsidize other people, I would…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bonds and  that they have to be refinanced. Every quarter, this is what is coming  to market and the fact that we are moving away from much lower interest  rates to much higher interest rates, but there are other things going  on.\n\nDo you remember how often--and, Mr. Speaker, you have probably had  this experience. You are at a townhall, and someone says:…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the baseline  between now and 2035 of the $22 trillion we are supposed to borrow,  some of the potential financing costs of what the Senate is doing right  now, the higher interest rates, we are not exactly there, but we come  close to doubling U.S. sovereign debt over the next decade. That took  us 240 years, and we functionally double it in the next…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to be about $11 trillion. That is bonds, notes, and paper  that come due, plus another $2 trillion probably in virgin. That is new  issuances. They are subject to the higher interest rates today than we  had 5 years ago.\n\nThat is why our interest coverage costs have gotten so much more  expensive. That is why if we do total interest from last year--the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the deficits, what it really  means is the inability to afford a house for the average American,  right, because the impact that flows from it is, as you alluded to,  higher interest rates, an inability for the Fed and for Congress to  continue to borrow and print money because of what you are describing  worldwide. The ability to have people to buy,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…like.\n\nWhy this should terrify us, CBO has us over the next 10 years adding  another $22 trillion of debt. If interest rates move--because now you  need to calculate the higher interest rates. If you start to put those  dollars in--we are not completely there, but we are getting close to  the next 10 years, we borrow as much as we did the previous 240 years.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…legislation for a great part  of Alaska, and this is the Alaska Native community in my State. These  are incredible, patriotic Americans. By the way, Alaska Natives serve  at higher rates in the military than any other ethnic group in the  country. They are great Americans. They add so much to our State. They  are the first peoples of Alaska, and so in my…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$50 trillion in debt in 10 years. That is literally the best case  scenario. I think it is much worse, especially if our interest is going  up and we refinance our debt at higher rates, which seems likely, but  here we are just nibbling around the edges begging for crumbs. Please,  oh, please, please give me $150 billion a year in savings on a $7  trillion…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…point of interest, 1.5 points, some  2. There is your problem. The chart here--I am just trying to show  you--is we have to constantly refinance. We are refinancing at higher  interest rates because we are making the markets cranky. We are not  telling the bond markets that we are serious about taking on our debt  and deficit.\n\nMr. Speaker, have you ever…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "John Thune", "party": "Republican", "sentence": "…years, farmers and ranchers across the country have faced  some pretty fierce headwinds. Higher input costs and depressed  commodity prices strained their budgets, and higher interest rates made  financing more difficult. Then there were the supply chain disruptions;  natural disasters and drought; and things like bird flu, African swine  fever, and the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…inflationary policies, we saw  inflation soar to over 9 percent, 20 percent over the 4-year period.  Those policies and inflationary rates that came from them forced the  higher interest rates by the Fed to as high as 5.5 percent.\n\nThe recent CPI report, however, has inflation at 2.4 percent, and  PCE, personal consumption expenditures, the Fed's favorite…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…a signing. And this  is a really big deal for my constituents.\n\nHere is what it is: I talked about what I called the special  patriotism of Alaska Natives. They serve at higher rates in the  military than any other ethnic group in the country.\n\nThey had a situation when so many--and I mean thousands and  thousands--of Alaskan Natives were serving in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…protection insurance so that they don't make a  mistake and miss a mortgage payment, a rent payment, or a utility  payment that causes higher costs, higher fees, and higher interest  rates.\n\nTwo-thirds of consumers support overdraft protection products. Two- thirds of consumers think a reasonable fee is appropriate. Competition  has brought down fees…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]