[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…families. Clothing prices  are expected to jump by 33 percent, and food prices by 4.5 percent.  These are not abstract numbers, they represent real consequences for  real people: higher grocery bills and more expensive everyday  essentials.\n\nFor instance, Canada, Illinois's top export market for oil, vehicles  parts, and agricultural products, has already…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…community, to the least among us is the highest form of patriotism.\n\nLet Chuy Garcia's examples lead us out of our complacency and to a  greater level of integrity and to a higher calling. Let this unyielding  spirit remind us that America becomes America only when ordinary people  dare to demand the extraordinary.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…plummeting,  reaching its lowest level in 12 years, and economists are increasingly  convinced that we are heading for a recession.\n\nThis budget will balloon our deficit, leading to higher interest  rates. It will slash critical investments and will decimate essential  programs that support the people who we represent, all of this to help  billionaires and corporations…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689895/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…setting.\n\nCanceling or even delaying the briefing is completely unacceptable  and a failure of your duties and responsibilities to this body.\n\nMr. Speaker, the stakes could not be higher.\n\nFor more than 40 years, Iran has threatened its neighbors, threatened  Israel, the United States, and the world. Under the Ayatollahs, Iran  has been the largest state sponsor…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…education.\n\nHead Start, the Elementary and Secondary Education Act, the Adult  Education and Family Literacy Act, the Individuals with Disabilities  Education Act, and the Higher Education Act are some of our Federal  laws that work to ensure that opportunities to learn and advance are  not limited by income, race, ethnicity, or disability.\n\nThe expansion…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…milestone in our community-- the 175th anniversary of Defiance College.\n\nWhereas, Defiance College, founded in 1850 as Defiance Female  Seminary, has served as a beacon of higher education for 175 years,  fostering a tradition of academic excellence, service, and leadership;  and\n\nWhereas, the institution has remained steadfast in its commitment to…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…impacts of this one big, ugly bill.\n\nIt goes on to say: ``The House Committee on Education and the  Workforce has been tasked with cutting $330 billion, where Federal aid  for higher education--such as Pell grants--may be a target for  reductions.''\n\nOnce again, let me park it right there parenthetically to make the  observation that this bill also assaults…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the national average by threefold. We are not  alone in this problem. For example, in Maine the cost of electricity  hovers at 22 cents per kilowatt, coming in at 13 percent higher than  the national average, in part due to its many islands and isolated  communities.\n\nMy colleagues and I representing these communities intimately  understand the challenges…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…of SBA programs undermines entrepreneurship, limits       innovation, and weakens our long-term economic       competitiveness.\n\nImmigrant entrepreneurs open businesses at higher rates       than native born Americans and Latino-owned businesses       contribute almost $800 billion to the nation's economy. And       as we noted in our 2024 analysis…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…because they could no  longer deduct their State and local taxes.\n\nIt is not fair. In fact, people have moved away from our States to  other lower tax States.\n\nWhy are taxes higher in my State and in your State compared to, say,  Florida and Texas? They are higher because in New York State and in  California, we insure our children. We have the lowest…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…from the Biden administration that  would have put in place critical sirens and warning equipment that  would have warned these kids at this camp to get out, flee, and seek  higher ground.\n\nWhat we know is that communities that accepted these resources, they  all survived. The warnings worked. This community didn't want to accept  help from a Democrat,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the Mississippi River Bluff downtown. She  is a 1976 graduate of Blackburn College in Carlinville, Illinois, with  a degree in Sociology. She received a Master's degree in Higher  Education Administration in 1985 from Southern Illinois University-- Carbondale, and a Doctor of Education degree in Higher Education  Administration in 1995 from the University…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…hold, and the recording said 15-minute wait, and after time       passed, the recording said I would be helped as soon as       possible, then said they were receiving higher than normal       call volumes . . . After several rings, the recording said .       . . leave [a] message (which I did) and someone will return       your call, but that hasn't…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…more than 5 percent.\n\nThe Department of Agriculture expects grocery prices to rise again  this year. These cost increases amount to grocery bills that are  hundreds of dollars higher for less food. This is compounded by the  SNAP cuts in the one big, ugly bill and cuts to food banks all across  this country.\n\nHowever, it is not just food and groceries.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…already decided, because of the bill  President Trump pushed for in July, they are no longer going to be  offering plans through the ObamaCare marketplace. So less choice,  higher prices.\n\nJust to put this in perspective, here is an example of what President  Trump and my Republican colleagues have brought to working Americans: A  family of four making…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…officers were fired upon but, fortunately,  were not struck.\n\nMr. Speaker, ambush-style attacks are some of the most dangerous.  They are calculated and often deadly, leading to higher rates of both  injuries and fatalities. That is why I introduced this legislation to  ensure that we are doing all that we can at the Federal level to  understand, prevent,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…safe for all residents and visitors. Yet, in recent  years, this simply has not been the case.\n\nIn 2024, D.C.'s homicide rate exceeded 27 homicides per 100,000  residents, higher than that of any State and nearly three times that of  Islamabad, Pakistan, and 18 times that of communist-run Havana, Cuba.  That same year, the city recorded nearly 30,000…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…tenure as President of Loras College. As  the longest-serving president in Loras college's 185-year history,  Collins has left an indelible mark on Iowa's oldest institution of  higher education.\n\nCollins earned his Bachelor of Science degree in Finance from Loras  College in 1984. After graduation, what began as a brief visit to his  alma mater evolved into…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…discourage investment, keeping Alaska's  energy potential locked away.\n\nMeanwhile, Cook Inlet gas supplies are declining, threatening  Alaskans in south central Alaska with higher heating and electricity  costs. If we want long-term energy security, we must develop our  resources.\n\nMr. Speaker, every job is an energy job because energy powers  everything…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…plan  supplemental EIS this past summer. It was signed on July 5, 2024, with  implementation beginning just 3 days later on July 8. Pretty doggone  quick.\n\nThe ROD calls for higher flows at the dam to combat the presence of  predatory smallmouth bass which threaten the federally protected  humpback chub. These higher flows bypass hydropower generators…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…country and set a court date  years in the future. They will begin to actually receive healthcare  benefits at the expense of taxpayers, who have already been hard hit by  higher prices for basic things like gas, food, and rent.\n\nThe burden is real. From 2017 to 2023, the Federal and State  Governments spent $27 billion on emergency Medicaid for noncitizens,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…lunches to children each school day. We know that  healthy diets can improve student success both in and out of the  classroom. Whole milk is a nutrient-rich food, and its higher fat  content allows children to stay fuller longer.\n\nUnfortunately, misconceptions about certain types of fat or calories  have prevented schools from offering whole milk as…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…broad-based index and mutual funds and requires real enforcement. It  has teeth with substantial penalties for violations. As public  servants, we should hold ourselves to a higher standard, Mr. Speaker,  and avoid the mere appearance of corruption and impropriety.\n\nUnfortunately, too many Members of Congress are engaging in  suspicious stock trades based…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…result of pro-growth policy. It  was not just the tax cuts but deregulation. It decreased the cost of  business so those businesses could afford to retain those workers  through higher wages and faster wage growth.\n\nConfidence is returning to the American economy, and President Trump  has taken us from energy desperate under the previous administration to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the 3rd Generation       Partnership Project.\n\n(2) 5G network.--The term ``5G network'' means a fifth-      generation mobile network as described by 3GPP Release 15 or       higher.\n\n(3) Assistant secretary.--The term ``Assistant Secretary''       means the Assistant Secretary of Commerce for Communications       and Information.\n\n(4) Cloud computing.--The…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…bill  (H.R. 983) to Amend title 38, United States Code, to direct the  Secretary of Veterans Affairs to disapprove courses of education  offered by a public institution of higher learning that does not charge  the in-State tuition rate to a veteran using certain educational  assistance under title 10 of such Code, and for other purposes.\n\nThe Clerk…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…down altogether. The gentleman from  California mentioned one of them.\n\nIn several States, hostile policies are pushing refineries out so  fast that families are now facing higher prices and increased  dependence on foreign fuel.\n\nThat is not how you build energy security, Mr. Speaker. That is how  you weaken it.\n\nMeanwhile, global demand for fuels is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…purposes described in       subsection (c); and\n\n``(ii) may enter into a memorandum of agreement with any       other Federal, State, local government entity, institution of       higher education, or research institution to use any vessel       acquired under this section to conduct research to facilitate       science activities, data collection, and other…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…hurting America, have brought $15 billion,  that is just from Canada, that we can use to pay down our debt and pay  down our deficit, again, as we have lower inflation and higher economic  growth. It has worked. The chairman talked about the cost of 5,000  lives a year in New York, almost 100,000 nationwide, but those  statistics are 1 year old.\n\nUnder…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699967/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…unprecedented obstruction from the  Democrat minority. What have they done?\n\nWell, basically, they have just tried to obstruct. They have spent  the entire year on the side of higher taxes, on the side of illegal  immigrant criminals, on the side of wasteful spending, and on the side  of burdensome regulations. If Democrats had their way, Americans would…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}]