[{"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Association of New York State, have already warned  that the impact of gutting this program will be felt by all, including  those with private insurance.\n\nEvery American can expect higher costs and reduced access to care.\n\nOnce again, we have been clearly warned: The Medicaid cuts in the  budget bill will have devastating impacts on our healthcare system and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…and his encouragement that people vote against  the so-called SAVE America Act.\n\nMr. Speaker, the way to enhance Americans' trust in government is by  holding ourselves to a higher standard, not by disenfranchising  citizens seeking to participate in our democracy.\n\nThe vast majority of Americans believe that it is time to end the  practice of Members…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699938/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Especially now at a time when we have seen that Secretary Collins has  shifted the Department's focus from getting claims right to simply  getting them fast, we are seeing higher rates of processing errors,  higher denial rates, and consequently higher rates of appeals to the  Board of Veterans' Appeals, the BVA.\n\nIn that context, it is imperative that…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…citizens be forced to pay for power and water?  They have a right to know.\n\nWill our building trades be true partners in economic growth or just  temporary labor, while facing higher utility bills at home?\n\nHow many permanent jobs will these largely opaque facilities actually  provide? Exactly which out-of-town interests will get the profits if  these firms…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…of an NBA  team. That is because of Fred Smith. Our college football team plays in  Liberty Stadium. He has pledged $50 million to improve that stadium and  bring it up to higher standards. We have a golf tournament that is the  FedEx St. Jude Golf Classic.\n\nHe had his hand in every good thing in Memphis from education, zoos,  and the civil rights museum.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…grandparents, our parents.\n\nHave you gone to a children's hospital? Have you visited a child who  is dying from cancer? Would you go to that child and tell them there is  a higher probability that you are going to die because we are cutting  the grants that would allow us to find a cure? That is what is in this  reconciliation package.\n\nThen Social Security,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the Mississippi River Bluff downtown. She  is a 1976 graduate of Blackburn College in Carlinville, Illinois, with  a degree in Sociology. She received a Master's degree in Higher  Education Administration in 1985 from Southern Illinois University-- Carbondale, and a Doctor of Education degree in Higher Education  Administration in 1995 from the University…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Shaheen said, this can't wait. The date is going to  arrive; the tax credits expire; people depending on that healthcare  won't have it. Twenty-four million Americans will face higher costs.\n\nAgain, I want to emphasize that is not 24 million Democratic  families; that is not 24 million Republican families; it is 24 million  families. It is in both our States.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…strategy.\n\nConflict in the Caribbean or with Venezuela is entirely avoidable,  but the risk that we stumble into war because of one man's impulsive  decision making has never been higher. Our troops deserve better--much  better.\n\nThis War Powers Resolution would restore that balance. It reaffirms  that the Constitution has always required that decisions of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…killed in Gaza since October 7,  2023, including tens of thousands of mothers, children, and other  innocent people. Sadly, it is likely that the actual death toll is even  higher. The U.N. estimates that approximately 92 percent of residential  buildings and 70 percent of all the buildings in Gaza have been  destroyed.\n\nStarvation is rampant, as is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Trump and his minions, for their big fossil  fuel donors, are deliberately holding clean energy off the grid, which  is cheaper, so that the grid can't go to it, has to go to higher and  higher cost fossil fuel plants, so consumer costs go up. But that  additional money that consumers have to pay goes to the fossil fuel  industry, which gave him hundreds…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…rather cross  their fingers or pray that the Supreme Court settles this.\n\nLet's be clear. A vote for this rule is a vote in favor of Trump's  illegal tariffs. It is a vote for higher costs for the American people,  and it is an abdication of our duty as Members of Congress.\n\nI urge my colleagues, Republican and Democratic alike, to vote  ``no.''", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699899/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…even worse occurs. High tariffs inevitably lead to       retaliation by foreign countries and the triggering of fierce       trade wars. The result is more and more tariffs, higher and       higher trade barriers, and less and less competition. So,       soon, because of the prices made artificially high by tariffs       that subsidize inefficiency and…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Doctors and nurses will be stretched thin.  Hospitals will be left with large sums of uncompensated care, which  will be passed on to everyone with insurance in the form of higher  monthly premiums. This isn't just about the ACA, but it is most  important for those people who had the ACA and perhaps don't have it  anymore.\n\nUnfortunately, the Republican…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…taking their chain saw  to another lifesaving service that supports our farmers in feeding  Delaware. All of this will result in fewer customers for Delaware's  farmers and higher prices at the grocery store for Delaware's families.\n\nThe Trump administration has broken their promise time and time again  to the American people, ripping funding and literal…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…policies that hurt workers' bottom  lines.\n\nThe Tipped Employee Protection Act also ensures workers earn at least  the minimum wage, and the bill respects States' authority to set higher  wage levels. This creates even more opportunities for tipped workers to  earn more, often far above the minimum wage.\n\nAs we have discussed at length in the Education and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Silver Star, Vietnam Campaign Medal, Vietnam  Cross of Gallantry, Navy Valorous Service Ribbon, and a Presidential  Unit Citation.\n\nFollowing his military service, Danny pursued higher education at  Hardin Simmons University and earned a B.A. from Wayland Baptist  College. He then dedicated 32 years to the Texas Department of Public  Safety, where he rose…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…is  truly moving in the right direction. Those folks who earned tips or  overtime, people who earned Social Security, and families who worked  hard after being hard-hit by higher gas prices, rent prices, and food  prices are being helped in this bill.\n\nThis is what the American Dream is all about, looking to Washington,  D.C., and finally seeing a Washington,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…that principle. He is a global faith leader,  distinguished scholar, educational visionary who is shaping  contemporary discourse at the intersection of faith, ethics, and higher  education.\n\nAs the fifth president of the Yeshiva University, he has redefined  the role of faith-based universities in the United States. He gave the  benediction at President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…businesses that employ most of them are  spending about $25,000 a year for insurance premiums that give them  fewer options and restricts them on what they can do, gives them higher  copays, higher deductibles, and fundamentally makes it impossible for  them to have actual care.\n\nI go back to my point about In God We Trust and celebrating the  Christmas…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…going to need to verify their income when they  reenroll, and we are going to require a full repayment when individuals  have underreported their income in an effort to get higher subsidies  because it is fraud.\n\nEvery single Democrat voted against the fraud provisions. They voted  against these protections that we had against the fraud. And now  Democrats,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…trying to  bring an end to what truly is modern-day slavery.\n\nBut, unfortunately, what we saw as we looked at the data was that  last year's total of 1,170 was still 62 percent higher than the number  in 2019. So as we have looked at this in recent years, what you have  seen is an explosion of human trafficking and sex trafficking in this  country. While…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, I rise today to recognize President  Wendy Wintersteen, a longtime champion for Iowa's students and a  nationally respected leader in higher education, as she moves on from  her role as the 16th President of Iowa State University.\n\nWendy's leadership has shaped the future of Iowa State and made a  meaningful difference…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691609/recognizing-president-wendy-wintersteen-for-her-service-to-iowa-state-university"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…tape. Well, that is how we got into this mess. Republicans  have a better answer: Build more homes, faster, better, and cheaper.\n\nThe solution to inflation, the solution to higher costs, is always  more supply. The reason we have affordability challenges in housing,  Mr. Speaker, is because we have an inventory shortage. Republicans are  offering solutions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people every year that in this country we  wind up swearing in about 850,000 new people legally. I think if you  think about that number for a little bit, something that is far higher  than the historical average in this country, you will realize it is  ridiculous to say this country is in any way xenophobic.\n\nAs I mentioned, one of the strong predictors…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…insurance premiums. They  are getting the worst of both worlds. They had to pay to elevate their  home, successfully preventing flooding; despite that, they are having  to pay much higher insurance premiums.\n\nLet's put up the chart of prices. Two properties. This is before they  elevated their home, after they elevated their home. At first, it  worked. They…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Do the math. With the average 3.15 people in  that household, that is nearly 79 million, with an m, 79 million people  affected. Mr. Speaker, that doesn't even account for higher prices or  the hit to our energy security or the actual possibility that our  energy security will be severely damaged.\n\nMr. Speaker, if we want reliable power and lower costs,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…shall require the use of a       competitive, merit-reviewed process, which considers       applications from Federal agencies, National Laboratories,       institutions of higher education, non-profit institutions,       and other appropriate entities.\n\n(c) Coordination.--In carrying out the activities under       subsection (a), the Secretary and the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…capacity has  been delayed because of rising demand and insufficient replacement  resources. To put it bluntly, removing coal from the grid at this  moment in time would lead to higher costs and greater instability for  families and businesses. This is a reality that my colleagues on the  other side of the aisle refuse to acknowledge.\n\nIn New York we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…me about is this issue of  rural broadband. For those who don't know, this is a program that has  been allocated over $40 billion so that everyone, not just a select few  in higher urban areas, can enjoy high-speed internet access. This  program, which is allocated over $40 billion, is one which takes time,  because as everyone knows who is in business,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}]