[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, today marks the anniversary of Citizens  United. This decision did not rewrite campaign finance law; it sold our  democracy to the highest bidder.\n\nBefore Citizens United, elections were about persuading voters. After  it, they became about courting billionaires.\n\nAs of 2025, there are 2,502 super-PACs. For the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699235/restoring-election-integrity"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Presidential inaugurations. The  strong relationships she developed across the Capitol campus,  especially with the Media Galleries and Senate Photographic Services,  enabled the highest standard of press coverage.\n\nThe efforts of the administration team of Elisa Mendez, Nick Stella,  and Teddy Kohlhaas, all under the leadership of Christi Mayer, helped  to…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…in 2023 to programs that enhance community wellbeing.\n\nThe Malcolm Baldrige National Quality award is a recognition that  honors businesses and organizations that have the highest standards of  excellence, innovation, and sustainability. Northeast Delta Dental was  recently recognized as a 2024 recipient, one of only five companies in  the United States…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688205/recognizing-the-achievements-of-northeast-delta-dental"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…For her outstanding service to our students and community, it is my  honor to recognize Kathleen Brugger. Her commitment to the Inland  Empire and beyond is worthy of the highest commendation.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Government and sought to overthrow the will of the people  with bats and clubs. Now, the individual responsible for promoting such  baseless allegations once again occupies the highest office in the  land.\n\nI extend profound gratitude for the Capitol Police who stood on the  front lines on that terrible day. I thank my colleagues, our appointed  officials,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698550/january-6-attack"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…They were much higher in  many places across the country.\n\nIn Florida, they passed along a $6 billion rate increase. They were  calling it the largest rate increase and the highest rate increase in  the history of the country.\n\nWhat have we seen out of this administration?\n\nWe have seen just the sabotage of affordable, reliable, clean, and  cheaper energy…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…months.\n\nInflation remains stubborn. Consumer prices rose by 2.9 percent in  August compared to last year. Job growth is slowing. Unemployment has  climbed to 4.3 percent, the highest in 4 years. We are now veering  toward stagflation: rising prices and a cooling job market.\n\nNo matter what you call it, the reality is clear: American families  and small…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695597/fed-rates-and-stagflation"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…need to bring this  to light because this is important when we talk about Medicaid.\n\nMr. Speaker, Black Maternal Health Week begins on April 11, and  Michigan has one of the highest Black maternal mortality rates in our  Nation. Medicaid plays a critical role in supporting maternal health,  covering a significant portion of births in our country and providing…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the political fray. And that is the role they have performed in our  government: saving millions--perhaps billions--of dollars in taxpayer  money, ending corruption at the highest levels, and performing a vital  experience for our democracy.\n\nOne of the very best of our inspectors general has been Mike Missal.  He was responsible for recovering more…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…than 10 years  of legal experience. Outside of clerkships, she has only practiced law  for 6 years, and she is seeking a lifetime appointment to the circuit  court--one of the highest in the land. She has never served as sole or  chief counsel in any case--any case--tried to verdict, judgment, or  final decision.\n\nThat is a shocking lack of experience for…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…national security by loosening President  Biden's export controls on advanced chip sales to build data centers in  Saudi Arabia and the UAE. He is auctioning off our chips to the highest  bidder without a care for the national security implications. Without  strong guardrails in place, this puts American IP and technology at  risk.\n\nH.R. 2683 provides BIS…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…funds but rejected  it. When ordered to do so by the courts, they fought it all the way to  the Supreme Court to keep hungry families from receiving food.\n\nAmerica produces the highest quality, safest, most affordable, and  most abundant food, fiber, and medicine anywhere in the world. To that  end, this bill provides many welcome investments.\n\nIt fully…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…champion for justice and a visionary leader in  Washington's legal community.\n\nAs the first Asian American, the first Latina, and the first LGBTQ+  justice to serve on our state's highest court, she has brought an  unparalleled depth of experience and perspective to the judiciary. She  co-chaired the Minority and Justice Commission and chaired the Board  for…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…senses, which will have a positive  impact on our community for years to come.\n\nOn behalf of Michigan's 3rd Congressional District, I congratulate  Hannah Davis for achieving the highest distinction in Girl Scouts, the  Gold Award. I thank Hannah for her leadership and for making such a  positive, enduring change in our community.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693151/recognizing-hannah-davis"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…are paying the price.\n\nMr. Speaker, buried in the last jobs report was this number: The  Black unemployment rate is now 7\\1/2\\ percent. That is a recession- level rate, the highest rate since the pandemic.\n\nDo you think they care at Mar-a-Lago? I will tell you who does care:  the people in the community I represent. They are watching as prices  keep…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…dance, and travel. She was studying French  at Brown University. She also loved kids and spent much of her time  babysitting and serving in Sunday school. She believed her highest  calling was to be a mom one day.\n\nBut the most important thing to know about Ella is that she was a  devout Christian. She was very involved in her church, the Cathedral…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…about six times  what we were letting in when I was a child. We right now are in a  position in which about one out of six people in America is foreign  born, which is the highest it has been for at least the last 130 years.\n\nWe have nothing to apologize for. We are not being xenophobic. We are  not saying we are going to let nobody in this country,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…colleagues talk  about corporations and about high-net-worth individuals, but the small  businesses are structured in a way that their ordinary income is taxed  at what some of the highest income individuals of our society are taxed  at.\n\nThese small businesses are taxed at a significantly high rate,  oftentimes higher than other corporations. We need to make…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…with excellence. Her calm under  pressure, strong organizational skills, and unwavering dedication  helped our office serve the people of Indiana's Second District at the  highest level. Hoosiers who visited the Capitol often commented on her  customer-service-driven approach.\n\nOver the past 2\\1/2\\ years, I have come to rely on Mariah not only as  a…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…celebrate this  extraordinary accomplishment by one of its own. Master Sergeant Worthen  proudly serves as the Leadership Studies and Marine Instructor, and  exemplifies the highest standards of the United States Marine Corps. He  consistently instills discipline, honor, and civic responsibility in  his cadets each and every day.\n\nThis recognition is…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696209/recognizing-bensalem-high-school-jrotc-instructor-of-the-year-master-sergeant-shawn-worthen-retired"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…in the United  States Congress.\n\nOn February 9, the National Football Foundation named Stephenville  High School the national winner of the Hatchell Cup award. This is the  highest academic team honor in high school football, and the Yellow  Jackets were awarded this distinction with an outstanding 4.0 team GPA.\n\nOur community is proud to see Stephenville…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700201/stephenville-high-school-awarded-national-football-foundation-hatchell-cup"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia. Mr. Speaker, I rise today to recognize  Lieutenant General Thomas Carden.\n\nGeneral Carden has been promoted to Vice Chief of the National Guard  Bureau, the second highest position in the National Guard, overseeing  soldiers and airmen. He is the first vice chief ever to wear the four- star rank.\n\nPreviously, General Carden served as commander…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700199/recognizing-lieutenant-general-thomas-carden"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…come. Coach Lewis has been  the dedicated leader of the Harlem High School baseball program for  decades, securing eight state titles and over 900 impressive wins--the  3rd highest in Georgia High School Association history. This is no  small feat, and I cannot think of anyone more deserving of this honor.\n\nHowever, Jimmie Lewis is far more than a coach…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688921/harlem-high-school-baseball-field-named-after-legendary-coach-jimmie-lewis"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…deployment of the National Guard to Memphis.\n\nIt is going to be several Federal Agencies that are going into  Memphis. Now, the reason for this is that Memphis has had the highest  crime rate in the country. And for years, we have seen Democrats that  have enacted soft-on-crime policies, and this has taken, truly, a  tragic toll on Memphis. In many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has the broader American public.\n\nThis issue has been so politicized by so many people in so many ways,  which is deeply unfortunate when we are talking about matters of the  highest sensitivity and untold suffering.\n\nIt is my hope that the passage of this resolution today, together  with the work of the Committee on Oversight and Government Reform, will…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696819/epstein-files-transparency-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…are important recognitions of the hard work and dedication of  America's young leaders. The Congressional Award has empowered over  500,000 participants nationwide and is the highest honor Congress  bestows on American youth.\n\nBy reauthorizing this program, we honor the countless hours of hard  work and dedication of so many past and present participants.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…and       funding that should be available to achieve the objectives       outlined pursuant to paragraph (1) and an assessment whether       Georgia should remain the second-highest recipient of United       States funding in the Europe and Eurasia region;\n\n(C) includes a determination of the extent to which the       United States should continue to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the physical       and electrical interface between the CMBRE and the missile.\n\n4. This potential sale will include AMRAAM guidance and       control section spares.\n\n5. The highest level of classification of defense articles,       components, and services included in this potential sale is       SECRET.\n\n6. If a technologically advanced adversary were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…other great institutions  of higher education. Utahns value education, and we are good at it.\n\nThe Salt Lake City metro area has professional sports teams competing  at the highest level, with basketball, the Utah Jazz; soccer, Real Salt  Lake; and hockey, the Utah Mammoth. They have already hosted the Winter  Olympic Games and are set to host another…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…bipartisan legislation with me for the last two  Congresses.\n\nMr. Speaker, today, I rise in strong support of H.R. 695, the Medal  of Honor Act.\n\nThe Medal of Honor is our Nation's highest and most prestigious  military decoration that can be awarded.\n\nUnder current law, the President may award a Medal of Honor to a  member of the Armed Forces who has distinguished…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}]