[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…dollars a year; someone who  knows well what that is and has been working tirelessly ever since they  did that, ever since they foisted that tax increase on people in high- cost-of-living areas; and someone who has been working on it ever since  they did it, trying to work with people on both sides of the aisle to  figure out how to resolve the State…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…priority that should be worked on in a  bipartisan way.\n\nFrom the very beginning of this Congress, our Republican colleagues  have shown no interest in addressing the high cost of living in the  United States of America.\n\nNot a single executive order has been issued by this administration,  Mr. Speaker, to address the high cost of living. Not a single…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…They were  able to get away with it for a year, almost a year after the  President's liberation day. They snuck it into a rule so we wouldn't  have any debate on the high cost of living driven by these import  taxes.\n\nWell, last night, late last night in the House of Representatives-- while you were probably watching ice skating in the Olympics--because…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…three times during this past year, my  Democratic colleagues and I have tried to pass our legislation to offer  some real relief to working families grappling with the high cost of  living. Unfortunately, our colleagues on the other side of the aisle  have blocked each and every one of these efforts.\n\nNow, this program to provide that help that families…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Instruct. From the very beginning of this Congress, Democrats have made  clear that  we are willing to work with anyone in this town who is committed to  lowering the high cost of living.\n\nAmerica is too expensive. Far too many people in this country are  working hard and playing by the rules, but they are unable to get ahead  and can barely get by.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Americans, middle-class Americans, and  everyday Americans are suffering because of the failed Trump Republican  economy.\n\nDonald Trump, his words, promised to lower the high cost of living on  day one. More than 1 year later in the United States of America, Mr.  Speaker, costs haven't gone down. Costs have gone up. Housing costs are  out of control. Healthcare…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…with today's so- called pause announcement, he is still putting a 10 percent tax on  food, on energy, and on essentials that Americans need, while keeping  up with the high cost of living.\n\nThe number one thing that I hear in my district and that I know  everybody hears in their districts is the cost of living is too high.\n\nWhy in the world is this President…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…inferior products to the U.S., but that is what they are  doing.\n\nNo, in 2026 we are going to need real solutions. I beseech my  colleagues to work with us to tackle the high cost of living. You can  look back on 2025 now; Federal spending is up. They added $2 trillion  to the national debt and they have lost manufacturing jobs when you add  it all up.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…was introduced by Representative Mark  Alford of Missouri.\n\nAt a time when Americans are struggling to live paycheck to paycheck,  and when we are grappling with the high cost of living, don't worry  because Republicans have a solution. Congressman Brandon Gill of Texas  has our back with a bill to require the $100 note to include a portrait  of Donald…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…will spend one-hundred dollars more on everyday goods  each month. In my district, I'm hearing that working families and  seniors on fixed incomes need relief from the high cost of living. They  can't afford to add money for tariffs to their already tight monthly  budgets.\n\nNot only are the President's tariffs hurting my constituents, but he  is also…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…energy prices. We  need accountability. The American people deserve to know how much this  is costing them so that they can push on us to end these trade wars and  the high cost of living, including energy costs.\n\nMr. SPEAKER pro tempore. Is there objection to the request of the  gentleman from Ohio?\n\nMr. LANDSMAN. Mr. Speaker, I hope my colleagues will…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698058/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Mr. Speaker, the people of Virginia sent a clear message:  They want pragmatic solutions. They want a government that works for  everyone. They want us to tackle the high cost of living, housing, and  health care, to confront climate change, to honor the public servants,  our Federal employees, who keep our government running.\n\nMr. Speaker, I am humbled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695221/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…once again, we are on the floor of  the House of Representatives not debating legislation that Republicans  bring forward, Mr. Speaker, that is designed to lower the high cost of  living in the United States of America, a promise that Republicans  repeatedly made last year to the American people and now have  repeatedly broken.\n\nThroughout this Congress,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692530/rescissions-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…am privileged to represent back home in  Brooklyn.\n\nThe American people elected us to solve problems on their behalf and  to address the issues that matter, like the high cost of living, to  lower housing costs, to lower grocery costs, to lower childcare costs,  to lower insurance costs, and lower utility costs. America is too  expensive.\n\nWe need to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…House floor. I promise not to rebuke him in the name of Jesus.\n\nHere in America, we were told by Donald Trump and House Republicans,  that they were going to lower the high cost of living for everyday  Americans. In fact, we were told that Republicans were going to do it  on day one, and it hasn't happened.\n\nPresident Trump and House Republicans told…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…rentals, in people leaving the State. It is usually not the wealthiest  people. It is people who simply can't afford to get by in California  because of the inordinately high cost of living.\n\nThis proposed wealth tax would take this trend to an entirely new  level in a way that would make it so California is a failed State, is  no longer viable as a political…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…for roads, airstrips, and other infrastructure. Local access  to these materials allows rural villages  in this region to avoid costly imports that contribute to the high cost  of living in these communities.\n\nImportantly, the area also contains the Dalton Highway and the right- of-way for the Trans-Alaska Pipeline System, Alaska's most essential  piece…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}]