[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…catalyst for change.\n\nAfter an economic study was commissioned, it was determined that  Akron's Black population, who represents nearly one-third of the  region--yet, the report highlighted through the Elevate Akron report  that there was purposeful, intentional, and systemic exclusion from  economic growth and job opportunities for Black people in the region.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699951/recognizing-black-chamber-of-commerce-of-summit-county"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…President Harry S. Truman's Address in St. Paul at the  Municipal Auditorium on October 13, 1948. While this speech is over 50  years old, the sentiments still remain today, as highlighted by the  President's recent State of the Union. Millions have lost access to  much needed food assistance, while prices at the grocery store continue  to rise. Daycare centers…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700295/president-trumans-words-still-ring-true-today-the-failings-of-the-state-of-the-union"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…those amendments are  defeated, we will wind up in a different place, but if they pass, we  will have a bill that is no longer bipartisan.\n\nThis year, as Ms. Houlahan just highlighted, there is one particular  thing that was problematic, and that is we are not exercising oversight  of the Chief Executive in the manner in which we should. We have become…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…have spoken with shrimpers in Newport, Oregon, and scientists at  Oregon State University, Tribal leaders along the Columbia River, and  teachers in Hillsboro. They have all highlighted how NOAA's work is  far-reaching, and this is just in one of 435 congressional districts.\n\nStudents in Oregon recently told me that the Sea Grant program, run  by NOAA,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…education, culminating in a Master of  Business Administration degree and completion of numerous prestigious  leadership courses. Her dedication to excellence is further highlighted  by her numerous awards and decorations, including the Bronze Star Medal  and the Meritorious Service Medal with three oak leaf clusters. She has  also been recognized with…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…new pastor, Reverend Horace Sanders, Jr., and his wife,  Lady Katrina Sanders, to the pulpit. Bethesda Baptist will be  celebrating this month over installation weekend, highlighted by a  congregational celebration gala on Friday night, January 16.\n\nThe faithful of Bethesda have given God the glory for over 138 years,  since 1888, with weekly Sunday…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…hosted a public       roundtable for Senators to examine the profound consequences       of the Trump Administrations' cuts to U.S. global health       programs. The panel highlighted the increased risks to the       health of Americans from diseases, including drug-resistant       TB and Ebola, to Americans livestock and plant farmers from       bird…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…document. This is  my copy. But all 140 Members who voted for H. Res. 939 will receive a  similar copy, and their names are all listed. Each person's name is  going to be highlighted one time, and that one time will be the time  that we will acknowledge this person as being in the document by  highlighting the name. That will be given to that person.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Comprehensive       Policing and Justice Amendment Act of 2022 which was signed       into law.\n\nH.R. 2096 repeals key portions of current local law that       address the problems highlighted in recent D.C. Auditor's       report of officers being rehired despite being previously       terminated for police misconduct or criminal conduct.       Specifically:…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Department of Education in  supporting education campaigns. Bipartisan support for that idea--is it  on the HALT bill? No. Let me go on.\n\nRepublican witness Sheriff Donald Barnes highlighted the successes of  a multifaceted strategy to address both supply and demand for illicit  drugs. These are the bullet points he said that we should do, imploring  Congress:…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…therefore, would       still not be subject to CRA's submission requirement because       of CRA's exclusions.\n\nJust two other elements that, again, I think are in need of being  highlighted here because of the significance of the action taken this  evening--quoting still from the letter:\n\nEPA stated that the Notices of Decision were not rules       under CRA,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…women an advantage in the Department of Defense. What it is is a  program that gives us a security advantage.\n\nEvery combatant commander who has come through my office has  highlighted the strategic advantage that this program gives to our U.S.  forward deployed forces, and it gives us that advantage because our  adversaries don't have this kind of program.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…reproductive harm and birth defects.\n\nJust last night, in this Chamber, President Trump claimed: ``Our goal  is to get toxins out of our environment.'' President Trump also  highlighted the concerning increase in rates of childhood cancer and  claimed: ``Reversing this trend is one of the top priorities.''\n\nYet, less than 24 hours later, the Republican…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688527/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…disenfranchise millions of citizens,  including millions of women who changed their last names after getting  married, as would the legislation that my colleagues have just  highlighted. I heard Senator Merkley discussing the problems with this  bill.\n\nIt would make it harder for men and women in uniform serving overseas  to vote, and it would compromise--this…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…grave concerns with the firing of 168 workers at the NSF.\n\nUnfortunately, the DOGEs in the Trump administration have ignored  this sort of appeal completely.\n\nThis letter highlighted the importance of NSF funding to our  country's leadership in cancer research, energy, artificial  intelligence, and quantum computing. None of this work would be  possible…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…determine how the big, beautiful bill is sent to  President Trump.\n\nOne of those debates involves the State and local tax deduction.\n\nAnother of the debates, which hasn't been as highlighted, involves  President Trump's proposal to reduce the marginal rate on manufacturing  to 15 percent. President Trump is, rightly, obsessed with America being  the world leader…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…sprang up, aiming to shape the minds of  our youngest learners.\n\nAt a 2023 Subcommittee on Early Childhood, Elementary, and Secondary  Education hearing, Defending Education highlighted a report exposing  nearly two decades of CCP efforts to influence thousands of children.  At one point, more than 500 schools hosted Confucius classrooms, many  located…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…this House is already filled with serious, actionable reforms  that give Americans real options beyond ObamaCare.\n\nI recently cosigned a letter by Representative Biggs that highlighted  14 distinct healthcare reform bills that are out there, all of which  present much better, more affordable solutions than the current  disaster that we are facing with…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…percent, and that was from the CBO. The CBO said that, and we are not  exactly the biggest fans of that unique organization. Our plan would  actually fight fraud, which was highlighted in the GAO report.\n\nFinally, we would actually give choice to individuals as opposed to  this one-size-fits-all debacle. We want healthcare, not a plan to  simply fund insurance…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…supported over 69,250  direct and indirect jobs.\n\nAlaska's role as a leader in unleashing American energy dominance  will continue. In the Working Families Tax Cut Act, Congress  highlighted the importance of the NPR-A and required five lease sales  to be held in the area over the next 10 years.\n\nTo ensure our energy independence, we must unleash American energy…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…was charged with leaving the scene of a crash resulting  in death, aggravated driving under the influence of alcohol, and  reckless homicide.\n\nLast October, Secretary Noem highlighted more than 140 illegal alien  truckdrivers who were arrested in Northwest Indiana during Operation  Midway Blitz. These aliens were found guilty of numerous crimes,  including…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…ambiguity exists, it can undermine enforcement and allow dangerous  conduct to fall outside the reach of existing statutes.\n\nRecently, a court decision in United States v. Howard highlighted a  technical gap in Federal child exploitation law, one that exposed the  need for greater clarity in how certain conduct is defined and  prosecuted.\n\nIn that case, the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…of being in that committee,  and it is so exciting to see a chairman who brings everyone together in  a bipartisan fashion to pass commonsense legislation.\n\nWhat has been highlighted throughout the day today is the fact that  it is not about spending more money, it is about reducing the  regulatory burden that has caused prices to rise so rapidly as…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…as these  represent key parts of the lifeblood of our economy.\n\nIndiana's Sixth continues to be home to safe and prosperous  communities in which to raise families. It was highlighted by my visit  with the leadership of Franklin College and a number of state of the  city addresses that occur in the month of January, including  Greenwood's, where I attended…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…honored  for the steady and reliable leadership that she provided to the  community.\n\nServing in the role of Council Vice President, Betty was presented a  proclamation that highlighted her service on the borough's union and  police contract committee and a design committee that facilitated the  creation of a mural for the new borough building.\n\nBetty's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698629/recognizing-the-dedicated-public-service-of-betty-bucher"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…manager of Reedley, Nicole Zieba, said--who was centrally  involved in trying to get the Federal and State authorities to take  action here--she said: The Reedley incident highlighted a gap in the  Nation's biosecurity. Any city around this country could have dozens of  deadly pathogens stored next to sensitive locations and be completely  unaware of…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…act has done irreparable damage to Jocelyn's family,  friends, and community.\n\nIn May, Jocelyn's mother, Alexis, testified on this legislation, but  more importantly, she highlighted Jocelyn's caring personality, deep  love for animals, and passion for finding animals homes, sharing  stories of Jocelyn's life, such as Jocelyn's efforts to nurse injured…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…hampered from developing  these acres to their fullest potential. Mr. Lampe shared the continuous  efforts undertaken by KIC in order to open ANWR to oil and gas  operations. He highlighted the fact that pursuing oil and gas endeavors  in ANWR is essential to realizing self-determination within Kaktovik.  In testimony on Coastal Plain oil and gas development…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the only idiot who came  here to the floor with the MedPAC, but that is partially my  responsibility being on the Committee on Ways and Means. The MedPAC  report was all highlighted, and we showed the MedPAC report says:  Medicare Advantage, part C, is coming in at 120 percent of fee for  service.\n\nJust that delta from where it was supposed to be at…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to acknowledge a  true southern institution, Mrs. Wilkes' Dining Room in Savannah,  Georgia, which was recently highlighted on Southern Living's bucket  list.\n\nIn the Hostess City of the South, it is only fitting that lunch is  served with true southern hospitality. At Mrs. Wilkes', this means…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}]