[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…people's moral values and their  priorities in terms of who should get help in our country.\n\nThis measure will not help the people who need it, who are still  struggling with the high cost of living, and who don't need to  basically have the rug pulled out from under them with a measure like  this.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Working-class Americans, middle-class Americans, and  everyday Americans are suffering because of the failed Trump Republican  economy.\n\nDonald Trump, his words, promised to lower the high cost of living on  day one. More than 1 year later in the United States of America, Mr.  Speaker, costs haven't gone down. Costs have gone up. Housing costs are  out of control.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…includes energy prices. We  need accountability. The American people deserve to know how much this  is costing them so that they can push on us to end these trade wars and  the high cost of living, including energy costs.\n\nMr. SPEAKER pro tempore. Is there objection to the request of the  gentleman from Ohio?\n\nMr. LANDSMAN. Mr. Speaker, I hope my colleagues…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698058/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…will cut child  poverty in half and provide critical relief for middle-class and low- income families by providing a $6,000 refundable tax credit to help  families with the high cost of a child's first year of life.\n\nDemocrats will lower the cost of goods and services for Americans. If  we  had those four additional Democrats, we would include provisions…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…would direct the Federal  Communications Commission to establish a process to more thoroughly vet  internet service providers participating in the Universal Service  Fund's high-cost program.\n\nI have long advocated for reforms to combat waste, fraud, and abuse  in the high-cost program. Following an investigation by Energy and  Commerce Committee Democrats…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Speaker, I thank Dave for his many years of service to Rhode  Island. His impact will long endure, and I wish him a very happy  retirement.                    Concerns Over High Cost of Healthcare\n\nMr. MAGAZINER. Mr. Speaker, while Donald Trump and congressional  Republicans spend time building a billion-dollar ballroom, bailing out  Argentina, and lavishing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…is a priority that should be worked on in a  bipartisan way.\n\nFrom the very beginning of this Congress, our Republican colleagues  have shown no interest in addressing the high cost of living in the  United States of America.\n\nNot a single executive order has been issued by this administration,  Mr. Speaker, to address the high cost of living. Not a…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…House. They were  able to get away with it for a year, almost a year after the  President's liberation day. They snuck it into a rule so we wouldn't  have any debate on the high cost of living driven by these import  taxes.\n\nWell, last night, late last night in the House of Representatives-- while you were probably watching ice skating in the Olympics--because…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…import inferior products to the U.S., but that is what they are  doing.\n\nNo, in 2026 we are going to need real solutions. I beseech my  colleagues to work with us to tackle the high cost of living. You can  look back on 2025 now; Federal spending is up. They added $2 trillion  to the national debt and they have lost manufacturing jobs when you add  it all…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…has  specifically advocated for preferential trade agreements given its lack  of competitiveness due to its small national markets, isolation from  the global market, and high cost of operating and land and labor  constraints. The PIF has encouraged the U.S. to extend duty-free  treatment under the GSP beyond preferences for Least Developed  Beneficiary…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Mexico.\n\nWe could be protecting Social Security and Medicare, protecting  Medicaid, finding affordable childcare for the millions of children in  this country and reducing the high cost of living that so many families  in all of our districts are struggling to afford basic necessities, or  we could rename the Gulf of Mexico.\n\nRepublicans have made their…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690744/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…to  Instruct. From the very beginning of this Congress, Democrats have made  clear that  we are willing to work with anyone in this town who is committed to  lowering the high cost of living.\n\nAmerica is too expensive. Far too many people in this country are  working hard and playing by the rules, but they are unable to get ahead  and can barely get…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that I am privileged to represent back home in  Brooklyn.\n\nThe American people elected us to solve problems on their behalf and  to address the issues that matter, like the high cost of living, to  lower housing costs, to lower grocery costs, to lower childcare costs,  to lower insurance costs, and lower utility costs. America is too  expensive.\n\nWe need…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that, once again, we are on the floor of  the House of Representatives not debating legislation that Republicans  bring forward, Mr. Speaker, that is designed to lower the high cost of  living in the United States of America, a promise that Republicans  repeatedly made last year to the American people and now have  repeatedly broken.\n\nThroughout this…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692530/rescissions-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this House floor. I promise not to rebuke him in the name of Jesus.\n\nHere in America, we were told by Donald Trump and House Republicans,  that they were going to lower the high cost of living for everyday  Americans. In fact, we were told that Republicans were going to do it  on day one, and it hasn't happened.\n\nPresident Trump and House Republicans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…rentals, in people leaving the State. It is usually not the wealthiest  people. It is people who simply can't afford to get by in California  because of the inordinately high cost of living.\n\nThis proposed wealth tax would take this trend to an entirely new  level in a way that would make it so California is a failed State, is  no longer viable as…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…essential for roads, airstrips, and other infrastructure. Local access  to these materials allows rural villages  in this region to avoid costly imports that contribute to the high cost  of living in these communities.\n\nImportantly, the area also contains the Dalton Highway and the right- of-way for the Trans-Alaska Pipeline System, Alaska's most essential…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…I move to suspend the rules and pass the  bill (H.R. 2399) to require the Federal Communications Commission to  establish a vetting process for prospective applicants for high-cost  universal service program funding.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2399\n\nBe it enacted by…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690153/rural-broadband-protection-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…concern for millions of Americans, including in my State of  Iowa, where they bring up this very subject regularly at my county  meetings.\n\nThere are many reasons for the high cost of prescription drugs. It  could be the lack of competition and abusive practices. It could be  opaque and powerful drug middlemen that we call pharmacy benefit  managers…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…legislative clerk read as follows:\n\nA bill (S. 98) to require the Federal Communications       Commission to establish a vetting process for prospective       applicants for high-cost universal service program funding.\n\nMr. HUSTED. I know of no further debate on the bill.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693056/rural-broadband-protection-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…impacted, and interstate commerce  would be disrupted. And American consumers would bear the brunt of  increased costs. Hard-working families are already dealing with the  high cost of everyday goods and services, and they cannot afford this  regulation.\n\nLet me be clear. This action is necessary to stop one State from  dictating emission policies for…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…on the North Slope provides 95 percent of  local tax revenue, which pays for schools, clinics, utilities, public  safety, and infrastructure in some of the most remote and high-cost  communities in America. Without development, those services disappear.\n\nMr. Speaker, the law is clear. The science is clear, and the economic  reality is undeniable. The…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…apartments.\n\nFor a variety of reasons, it is grotesquely expensive. We can deal  with that by working our way towards more of a balanced budget, so  interest rates are not so high. As the cost of energy goes down, it  will lower the cost of anything and lower inflation on other goods as  well. Anybody who remotely believes in the free market believes there…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…building egress       performance;\n\n(2) construction costs and potential impacts on housing       affordability, including the potential for increasing housing       supply in high-cost jurisdictions;\n\n(3) flexibility for diverse consumer needs, including       family sizes, unit configurations, and accessibility;\n\n(4) examples of single-stair codes adopted…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…feeling squeezed the most. One of these groups is  families with children. Those with small kids often have to choose  between living on one income or incurring the increasingly high cost of  childcare. If we hadn't passed the Working Families Tax Cuts bill,  these families would have been slapped with a tax increase, with the  child tax credit scheduled to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}]