[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and in life.\n\nFinally, the arts heal, and we need that now. The brain research is  there; the arts improve health and well-being.\n\nA few years ago I met two students at Aloha High School in Oregon.  They were in a music class. They were high school students, and I asked  them what they liked about the class. They told me they had both lost  family members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Trump and congressional Republicans promised the  American people that they would take swift action on day one to address  our Nation's affordability crisis by lowering the high cost of living.\n\nWell, instead, they unleashed the most aggressive assault on our  Nation's healthcare in history, and the damage has been devastating.\n\nAcross the country,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Under his leadership, GAO continued its impactful  work on the federal government's long-term fiscal outlook, efforts to  reduce overlap and duplication across agencies, and the High-Risk List,  which highlights programs and operations vulnerable to waste, fraud,  abuse, mismanagement, or in need of transformation. As Comptroller  General, Gene also spearheaded…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…showed  that prices jumped again at 2.8 percent, well above the Federal  Reserve's target of 2 percent, which is why interest rates are going to  continue to stay unnecessarily high.\n\nOn Wednesday, a couple days from now, so-called Liberation Day, he is  now going to announce another wave of tariffs that every economist of  every stripe will tell you is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Lilith's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Lilith Roberts-Ruiz on achieving the  Arvada Wheat Ridge Service…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691136/recognizing-lilith-roberts-ruiz"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…home and for them often the first  meal they would get was the free or reduced breakfast and lunch.\n\nHe would say: You can't learn if you are hungry. When you get the  sugar high of eating some of what they serve in schools as your first  meal and then you crash around 2 o'clock in the afternoon when it is  time for the history lesson, you are not going…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…includes energy prices. We  need accountability. The American people deserve to know how much this  is costing them so that they can push on us to end these trade wars and  the high cost of living, including energy costs.\n\nMr. SPEAKER pro tempore. Is there objection to the request of the  gentleman from Ohio?\n\nMr. LANDSMAN. Mr. Speaker, I hope my colleagues…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698058/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…been able to return to his job,  trimming trees, and has been working small side jobs. Medicaid pays for  Isaiah's doctor visits and his insulin.\n\nA single father without a high school degree, Isaiah is concerned  that the bill's cuts and changes to Medicaid will result in his losing  his health coverage. And if Isaiah loses Medicaid, he will no longer…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…will go down,'' if you flipped it over, it said,  ``Relax. The price will go up,'' because energy consumers want the  price to be cheap. Energy producers want the price to be high.\n\nIf you work in the energy industry as long as I have or even if you  worked there for 35 seconds, you spend time talking to consumers and  producers. The debate that is going…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…gravestones  from the earth. It doesn't just forget. It forbids remembering.\n\nThese 885 women who put together 17 million pieces of mail that kept  the morale of our troops high were given no recognition until today,  after 80 years. I thank Speaker Johnson and Leader Thune for their  contribution.\n\nWhen we talk about erasure, ask the descendants of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…state an opinion on a key issue. A  lawyer's questioning then further tests the reliability of those  opinions. Thanks to these established procedures, jurors learn the  court's high valuation of honesty and come to expect it from their  government\n\nRather than relying on a single robed jurist to render a final  verdict, our Founders wanted a panel of common…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…part of a long-sought effort by       conservatives to privatize all or part of the agency.\n\n``They're creating a fire to require them to come and put       it out,'' said one high-ranking official who took early       retirement this month.\n\nDudek, who was elevated from a mid-level data analyst in       the anti-fraud office, hurried to cut costs when…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…she retires from the Chaffey College Governing  Board after 32 years of service.\n\nMs. Brugger is a lifelong resident of our community; in 1961, she  graduated from Montclair High School, and in 1963, she earned her  associate's degree from Chaffey College. Later on, she earned a  bachelor's in social work from Cal Poly Pomona, which kick-started her…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…MAGAZINER. Mr. Speaker, I rise today to recognize Sarah Dully,  Rhode Island's 2026 Teacher of the Year.\n\nMs. Dully began her work as an educator in 2012. She joined  Narragansett High School as an English language arts teacher in 2020,  where she is admired and respected by her fellow teachers, students,  and administrators alike. At Narragansett, she also…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…four institutions are the press, the legal profession,  universities, and the business community. If you degrade or co-opt  these four institutions, you never need to have a high-stakes fight  with the top court in your country. You don't need to burn the  Reichstag down. You can still have elections, but only one party will  win.\n\nSo that is why this…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…thing. That is a good thing. In the University of Georgia,  Georgia State put forward a robust survey of how elections were  conducted in the State of Georgia. What I saw was high voter  participation and people actually having a positive view of how  election results were conducted.\n\nIf I recall correctly, it was zero percent statistically of Blacks…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…missions.\n\nThis is a practical approach. Instead of duplicating capabilities,  NASA can leverage private-sector innovation. Through commercial  licensing, researchers gain access to high-quality satellite data that  supports wildfire response, agricultural monitoring, disaster  preparedness, reforestation, and environmental tracking. That data  translates directly…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700117/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…Mr. Speaker, Ohio families and small businesses  continue to face unprecedented healthcare costs, making it increasingly  difficult for my constituents to access affordable, high-quality care.\n\nSince the enactment of the so-called Affordable Care Act in 2010,  healthcare costs have risen dramatically, with premiums increasing by  more than 25 percent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698389/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…another 100 pounds of weight on it.''\n\nThe failure to pass a continuing resolution is slowly crushing our  aviation system. Our system is too fragile and the stakes are too high  for us to continue operating the national aviation system in the manner  we are doing so. We will reach a breaking point, and this could result  in the closing of our airspace…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize Master  Sergeant Shawn Worthen, United States Marine Corps, Retired, of  Bensalem High School, who has been named the Marine Corps Junior  Reserve Officers' Training Corps (JROTC) Instructor of the Year for the  past school year.\n\nThe Bensalem Township School…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696209/recognizing-bensalem-high-school-jrotc-instructor-of-the-year-master-sergeant-shawn-worthen-retired"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…has always been an important issue.\n\nBut, a year ago in November, the American people delivered a clear  message that the Biden administration, which presided over 40-year high  inflation, was taking the country in the wrong direction. President  Trump received the electoral vote and the popular vote, and he won  every swing State. Republicans secured…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…service of Richard ``Dick'' Young, a lifelong member of the  Lancaster, New York community, who recently passed away at the age of  94.\n\nDick was a proud graduate of Lancaster High School, Class of 1948,  where he served as class president and remained dedicated to keeping  his classmates connected for decades. In fact, those remaining from his  class…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Milk for  Healthy Kids Act, I just want to go back over a couple things as well.  Senator Welch, it is always a pleasure to work with you. Whether we are  trying to connect high-speed internet or give milk to schools, it is  always a joy. I appreciate your hard work and greatly appreciate your  staff and my staff as well. I think our staff never gets…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…willing  to tackle the most pressing challenges facing their communities and the  world with measurable, sustainable, and far-reaching results. To earn  the Girl Scout Gold Award, high school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I rise today to recognize and  congratulate the Pullman High School's science bowl team for their  outstanding performance in the U.S. Department of Energy's National  Science Bowl held in Washington, D.C., on April 28.\n\nRepresenting…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690876/congratulating-pullman-high-schools-science-bowl-team"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Second  Congressional District home to both Miss Ohio and Miss Ohio's Teen:  Olivia Fosson and Allison Payton.\n\nAllison, a Chillicothe native and rising senior at Zane Trace High  School, was crowned Miss Ohio's 2025 Outstanding Teen this past June.\n\nA newcomer to the pageant world, Allison was encouraged to get  involved last year by a friend from her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "James Risch", "party": "Republican", "sentence": "…AN/PRC-160(V) is the smallest, lightest,       fastest, Type 1-certified manpack radio available today.       Engineered for advanced security and performance, the       wideband high frequency very high frequency tactical radio       system features industry-leading encryption and breakthrough       data performance and interoperability.\n\n3. The AN/PRC-163…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691198/arms-sales-notification"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, I rise today to commemorate our  Nation's brave men and women and to recognize the High Plains Honor  Flight Network, which conducts trips for veterans to Washington, D.C.,  to tour the monuments built to honor their bravery and service. The  High Plains Honor…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of the date of enactment of the Fisheries Act of 1995 for       which a license has been issued under subsection (a) may fish       for tuna in the Licensing Area, and on the high seas and in       waters subject to the jurisdiction of the United States west       of 146\u000f west longitude and east of 129.5\u000f east longitude in       accordance with international…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I rise today to honor and recognize the  Menominee High School football team on winning the Division 7 Michigan  State Championship. This remarkable and well-deserved accomplishment  reflects these young men's commitment to excellence,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698002/recognizing-the-menominee-maroons-2025-division-7-michigan-state-football-champions"}]