[{"senator": "Al Green", "party": "Democrat", "sentence": "…but that one person's.\n\nIt is important now for me to read a bit from H. Res. 939. It reads:  ``Impeaching Donald John Trump, President of the United States, for  high crimes and misdemeanors.''\n\nI have to pause a minute and say this. The President said just  recently that ``they will find a reason to impeach me.'' Mr. President,  we don't have to find…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…explicitly clear that we can impeach, and we can impeach for  this type of behavior. It is not in these exact words. It uses language  that we are all familiar with: ``high crimes,'' ``misdemeanors,''  ``treason,'' or ``bribery.''\n\nYet, we have an authoritarian President who is defying the courts,  who does not respect the separation of powers. We have an…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…consequential tool  Congress to has protect our Nation from a president or other public  official who has betrayed their oath, abused their power, and committed  high crimes and misdemeanors against the American people. Impeachment  necessitates a deliberate process of investigation and a thorough  documentation of crimes committed  against the American…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…status quo personalities may have you believe  and would have you believe, there is no requirement for the existence  of a constitutional crisis before impeaching for high crimes and  misdemeanors.\n\nBecause of the importance of this statement, I shall repeat it.  Contrary to what many status quo personalities would have us believe,  there is no requirement…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…yesterday, voted to support  H. Res. 939, House Resolution 939. This resolution, H. Res. 939,  impeaching Donald John Trump, President of the United States, for high  crimes and misdemeanors.\n\nI rise to thank the 140 persons who supported this resolution.\n\nI rise to thank the 47 persons who did not oppose what we were doing  but chose to simply say:…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…question of the  privileges of the House.\n\nThe form of the resolution is as follows:\n\nH. Res. 939. Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolved, That Donald John Trump, President of the United States, is  an abuser of presidential power who, if left in office, will continue  to promote the incitement…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…question of the  privileges of the House.\n\nThe form of the resolution is as follows:\n\nH. Res. 353: Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolution: Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolved, That Donald John Trump, President of the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]