[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Julissa's hard work, determination, and perseverance  at Wheat Ridge High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Julissa Martinez on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691749/recognizing-julissa-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Gael's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Gael Alvarez Acosta on achieving the  Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690273/recognizing-gael-alvarez-acosta"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Crystal's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Crystal Lozano Gutierrez on achieving  the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690329/recognizing-crystal-lozano-gutierrez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Heyzel's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Heyzel Perez on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…ethic that will guide them for the rest of their lives. This  award is a testament to Abdullahi's hard work, determination, and  perseverance at Jefferson Jr./Sr. High School and is clearly just the  beginning of a bright and promising future.\n\nIt is my honor to congratulate Abdullahi Ali on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690274/recognizing-abdullahi-ali"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Nyx's hard work, determination, and perseverance at  Pomona Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Nyx Walton on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691487/recognizing-nyx-walton"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Ricky's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Ricky Martinez on achieving the Arvada  Wheat Ridge Service Ambassadors for…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690401/recognizing-ricky-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Argjend's hard work, determination, and perseverance  at Arvada West High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Argjend Krasniqi on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689459/recognizing-argjend-krasniqi"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Jayden's hard work, determination, and perseverance  at Arvada West High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Jayden DeGroot on achieving the Arvada  Wheat Ridge Service Ambassadors for…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689669/recognizing-jayden-degroot"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and  a work ethic that will guide them for the rest of their lives. This  award is a testament to Rachelle's hard work, determination, and  perseverance at Arvada High School and is clearly just the beginning of  a bright and promising future.\n\nIt is my honor to congratulate Rachelle Martinez Marentes on  achieving the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689434/recognizing-rachelle-martinez-marentes"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…ethic that will guide them for the rest of their lives. This  award is a testament to Fernanda's hard work, determination, and  perseverance at Jefferson Jr./Sr. High School and is clearly just the  beginning of a bright and promising future.\n\nIt is my honor to congratulate Fernanda Orozco Saenz on achieving the  Arvada Wheat Ridge Service Ambassadors…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691035/recognizing-fernanda-orozco-saenz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Marisol's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Marisol Chavez on achieving the Arvada  Wheat Ridge Service Ambassadors for…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690220/recognizing-marisol-chavez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Juan's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Juan Diego Camacho Rodriguez on  achieving the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690248/recognizing-juan-diego-camacho-rodriguez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Alicia's hard work, determination, and perseverance  at Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Alicia Montoya on achieving the Arvada  Wheat Ridge Service Ambassadors for…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689448/recognizing-alicia-montoya"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Zoe's hard work, determination, and perseverance at  Arvada West High School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Zoe Williams on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689650/recognizing-zoe-williams"}]