[{"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Speaker, I rise today to honor Mayor Tyrone Echols  of Venice, Illinois, and to congratulate him on his retirement after  more than 40 years in office.\n\nAs a graduate of Madison High School and Southern Illinois  University, Mayor Echols is a true son of downstate Illinois. He has  dedicated his career to serving our community.\n\nBefore he was elected mayor,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691471/retirement-of-mayor-tyrone-echols"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Congratulating Randolph Blue Devils\n\nMs. PRESSLEY. Mr. Speaker, I rise to congratulate the Massachusetts  Seventh's very own Super Bowl champions, the Randolph High School Blue  Devils.\n\nShowcasing electric offense and stifling defense, the Blue Devils  shut out West Boylston at Gillette Stadium, capping off an undefeated  season with another…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…been able to return to his job,  trimming trees, and has been working small side jobs. Medicaid pays for  Isaiah's doctor visits and his insulin.\n\nA single father without a high school degree, Isaiah is concerned  that the bill's cuts and changes to Medicaid will result in his losing  his health coverage. And if Isaiah loses Medicaid, he will no longer…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…hardworking parents in a  traditional Irish Catholic household on Richards Place in the center of  West Haven. Steve attended public schools and graduated in 1973 from  West Haven High School, where he ran track. He also attended Quinnipiac  College. It was through his parents that Steve learned the importance  of giving back to his community and he took those…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…secured my first job. I was a messenger  traveling from office to office in Midtown Manhattan delivering mail  and delivering packages. I was just a sophomore at Midwood High School  in Brooklyn, when I got my first job, earning minimum wage, $3.35 an  hour. I was thankful for that money, having been raised by my mom and  dad in a working-class neighborhood…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…They helped me to learn English  and helped set me on a course that ultimately led to the U.S. Senate.\n\nToday, teachers like Chayanee Brooks, an English teacher at Ka'u High  School and Pahala Elementary on Hawaii Island, continue to educate and  inspire Hawaii's youth. Chayanee, a Thai immigrant, is a nationally  board-certified teacher. And, believe…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…American Historians (OAH) as the  winner of the prestigious 2025 Mary K. Bonstell Teacher of the Year  Award. He currently is a U.S. History and Government teacher at Gonzaga  High School in Washington, D.C.\n\nThe award was given at the OAH annual meeting last April in Chicago  and was presented by Pulitzer Prize winning author and historian David  Blight.…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, for months I have been sharing the story of  Benjamin Guerrero-Cruz, a constituent of mine who is a senior in high  school. He was detained by ICE in August while walking his dog.\n\nIn the span of 24 hours, ICE shuffled Benjamin between detention  centers and across State lines without his family…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697953/benjamin-guerrero-cruz-is-home"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…decade, the growth rate of STEM  employment is expected to be more than double the growth rate of non- STEM employment.\n\nHowever, we do not have enough students graduating from high school  and college with necessary skills in the STEM fields to fill these  jobs. As times change and we move into a more STEM-based economy, it is  important that our students…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Gael's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Gael Alvarez Acosta on achieving the  Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690273/recognizing-gael-alvarez-acosta"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I recently held the first meeting of my  Youth Advisory Council, a group of two dozen high school students from  my district who will help guide my work here in Congress.\n\nThese students spoke boldly about their fears and hopes for the  future, and they made one thing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696966/youth-advisory-council"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Jewish Museum here in D.C.\n\nSarah grew up in Prairie Village, Kansas, a community that I have the  honor of serving in Congress. She graduated from Shawnee Mission East  High School and the University of Kansas.\n\nShe was a devoted member of Congregation B'nai Jehudah and was  dedicated to building understanding and connection between Israel and  the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691841/in-memory-of-recent-gun-violence-victims"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…which will be happening again this year.\n\nThey offer after-school programming, provide meal service at local  shelters, and help the next generation get involved, engaging high  school students and volunteer work.\n\nI am thankful for all Sewa International does for our communities.      Supreme Court of Virginia Prevented a Toll Hike on Dulles Greenway…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…dates, but the strength and power of our democracy. This  honor recognizes educators who spark curiosity about the Constitution,  government, and civic life.\n\nAt Milford High School, Ms. Parks is shaping the continued strength  of our democracy by preparing her students to enter the world with  critical skills of engagement. She describes the importance…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…was  devastated.\n\nHe was devastated again when 2 months later the school year abruptly  came to an end when Shawn Jackson was shot and killed minutes after  receiving his high school diploma.\n\nThese are 2 of the 46,728 people who died from gun-related injuries  in 2023 alone. They were among the average 13,300 Black Americans who  die of gun violence…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…young Americans of his time, his life was forever changed  by the events of World War II.\n\nIn the wake of the attack on Pearl Harbor, while most teenagers were  still in high school, Dick Burbine chose service. At just 16 years old,  he enlisted in the United States Merchant Marine, trained at Gallops  Island in Boston Harbor, and soon found himself…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, I rise today to recognize an extraordinary  group of young athletes from Virginia's Sixth Congressional District,  the Parry McCluer High School boys' cross-country team, who have  achieved a rare and remarkable feat. This season, the Fighting Blues  captured their third consecutive VHSL State championship, securing…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…is vital, and their influence extends beyond the classroom.\n\nThis year, Pennsylvania has special reason to celebrate. Ashlie  Crosson, an English teacher of Mifflin County High School, has been  named the 2025 National Teacher of the Year. A first-generation college  student, Ms. Crosson earned degrees from Susquehanna University and  Penn State and previously…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690925/recognizing-ahslie-crosson-during-national-teacher-appreciation-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually disrupt policy and do things that are better,  faster, and cheaper--because I will argue the army of lobbyists,  basically the rent seekers, if you remember your high school economics,  who are around us all, despise the concept of reform. They despise the  concept of modernization. That is actually some of the basic things I  want to go over…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…middle America.\n\nMr. Speaker, 60 years ago this week, the Bessemer Speedboys  basketball team ended a 42-game losing streak, at the time, the longest  in Upper Peninsula high school basketball history.\n\nThe people of Bessemer always showed up, cheered, and stood by their  team. That loyalty and perseverance reflect the hardy spirit that  defines this…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to congratulate Bill  McInnish for his outstanding contributions to education and workforce  development at Eau Gallie High School in Melbourne, Florida, where he  teaches aviation fabrication and assembly technology.\n\nHis 27 years of technology and CTE teaching experience are best  defined by his passion…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690495/congratulating-bill-mcinnish"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…24, 2004.\n\nAs Mayor, he established Opelika as the first gig city in Alabama. He  helped establish a first-class Pre-K program and helped with plans to  renovate Opelika High School. He led the charge for a new sports  complex, library, fire department, police building and municipal court  facility.\n\nHe was instrumental in the development of the Tiger…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, I am grateful for the time you have  granted me to acknowledge a stunning accomplishment by one of our high  school athletes in Utah's Third District, Jane Hedengren.\n\nJane runs track for Timpview High School in Provo, Utah. In an  invitational meet in St. Louis, Missouri, on June 5,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692882/congratulating-jane-hedengren"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school athlete  from Ohio's Fifth Congressional District. Nathan Bright, a senior at  North Ridgeville High School, has represented his school ably on his  way to achieving the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…to tackle the most pressing challenges facing their communities and the  world with measurable, sustainable, and far-reaching results. To earn  the Girl Scout Gold Award, high school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…service of Richard ``Dick'' Young, a lifelong member of the  Lancaster, New York community, who recently passed away at the age of  94.\n\nDick was a proud graduate of Lancaster High School, Class of 1948,  where he served as class president and remained dedicated to keeping  his classmates connected for decades. In fact, those remaining from his  class gathered…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…reservation in Susanville, California, she grew up with strong values  of respect and kindness, taught by her mother.\n\nNot long after graduating from Sherman Indian High School, a boarding  school in Riverside, California, Nola joined the Navy in January 1988.  She trained as a welder and served aboard the USS Acadia, and later the  USS Dixon as a radiation…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…N. Post--a patriot who was and still is truly committed to  service, community, and country. John moved to Westfield, New Jersey,  at age ten and graduated from Westfield High School in 1958. He  attended St. Peter's College, where he joined the U.S. Marine Corps  Platoon Leaders Class program. On the day he graduated in 1962, he was  commissioned as…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…week, it was announced that Peshtigo native and St. Norbert  College senior Mitch Van Vooren signed with the Seattle Seahawks as a  tight end.\n\nMitch graduated from Peshtigo High School. After graduation, he  attended Marquette University on a Division I track and field  scholarship. Despite his success in this field, he never gave up on his  goal of playing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692195/recognizing-mitch-van-vooren"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…hardworking, detail-oriented,  and resilient. Katie's experience as a team leader has prepared her to  be a leader in life, and I am excited to see what she accomplishes  beyond high school.\n\nAll of southern Ohio is proud of Katie's accomplishments. If she has  any tips for me before I play in the upcoming Congressional Baseball  Game, I will gladly take them.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691899/recognizing-katie-ankrom"}]