[{"senator": "Dina Titus", "party": "Democrat", "sentence": "…Although his efforts have brought him little relief from his problems  in Turkey, they have been recognized around the world, including by the  U.S. Congress, which gave him its highest award, the Congressional Gold  Medal, in a ceremony in the Capitol. ``The greatest lesson about  America lies under this magnificent dome,'' he told the assembled  legislators.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…as they are backed  by the commitments, or equities, of the largest economies of the world  including the United States.\n\nThese securities tend to be AAA rated which is the highest investment  grade, making them safe investments for all investors.\n\nHarmonizing the exemption regime available for MDBs with that of the  IDA would enhance the IDA's ability…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…project will have a positive impact on our community for years to come.\n\nOn behalf of Michigan's 3rd Congressional District, congratulations  to Paige Kitts for achieving the highest distinction in Girl Scouting,  the Gold Award. We thank Paige for her leadership and for making such a  positive, enduring change in our community.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…shuttering offices and freezing Federal funds, and scrubbing  websites of American history.\n\nWe see it in the military in the treatment of our veterans, firing  one of the highest-ranking generals serving on the Joint Chiefs of  Staff and the first females in military leadership across multiple  armed services divisions, the banning of our trans and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…They were much higher in  many places across the country.\n\nIn Florida, they passed along a $6 billion rate increase. They were  calling it the largest rate increase and the highest rate increase in  the history of the country.\n\nWhat have we seen out of this administration?\n\nWe have seen just the sabotage of affordable, reliable, clean, and  cheaper energy…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…him.\n\nFor his outstanding military service and his remarkable life, it is  my honor to recognize Jesse Drake. His commitments to his family and  our Nation are worthy of the highest commendation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the  field.\n\nI thank Superintendent Stovell Herndon, Principal Licorish, Head  Coach Jon Marshall, the players, and the entire team for putting  teamwork on display at the highest level.\n\nCongratulations on earning the Division 8 Super Bowl title. Go, Blue  Devils.                           In Memory of Alice Wong\n\nMs. PRESSLEY. Mr. Speaker, I rise…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…suppression.\n\nIn 2012, Minnesotans rightly rejected a state constitutional  amendment that would have imposed voter ID requirements. Each election,  Minnesotans turn out at the highest levels in the nation to participate  in elections that are free, fair, and secure.\n\nUnder the guise of election integrity, the Republicans' H.R. 22 would  require Minnesotans…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise in vigorous opposition to the  CLARITY Act. This bill gives a green light to self-enriching crypto  schemes where officials at the highest levels of power, including in  the White House, have generated hundreds of billions of dollars in  personal profit.\n\nWe need legislation that stops financial abuse, not encourages…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693786/digital-asset-market-clarity-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Constitution.''\n\nOn November 20, 2025, in response, President Trump called for their  execution. In one social media post, he wrote: ``It's called SEDITIOUS  BEHAVIOR AT THE HIGHEST LEVEL. Each one of these traitors to our  Country should be ARRESTED AND PUT ON TRIAL. Their words cannot be  allowed to stand--We won't have a Country anymore!!! An example…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…outdoor  spaces, as the efforts of the individuals and organizations recognized  tonight reflects. These are truly selfless actions done for the benefit  of all and merit our highest praise.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…away rebates for households to  help them afford the cost of upgrading their homes, making their lives  more energy efficient.\n\nAlso, these arbitrary Trump tariffs are at the highest levels since  the 1930s. We see it in our grocery bills, but it is also impacting  electricity costs. Costs are way up for poles and wires and things that  we import for our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…months.\n\nInflation remains stubborn. Consumer prices rose by 2.9 percent in  August compared to last year. Job growth is slowing. Unemployment has  climbed to 4.3 percent, the highest in 4 years. We are now veering  toward stagflation: rising prices and a cooling job market.\n\nNo matter what you call it, the reality is clear: American families  and small…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695597/fed-rates-and-stagflation"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…are the backbone of our  economy, and ensures that everyone pays their fair share.\n\nBut the tax cuts passed during the Bush era did just the opposite,  largely benefiting the highest income earners in our country, and in  the process increased the Federal debt by trillions--trillions--of  dollars. In fact, in just 3 years, these tax laws caused our country…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…For her outstanding service to our students and community, it is my  honor to recognize Kathleen Brugger. Her commitment to the Inland  Empire and beyond is worthy of the highest commendation.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…balance of my time.\n\nMr. Speaker, we must do everything we can to improve our foreign  defense sales process to ensure American competitiveness and equip our  allies with the highest quality defense materials.\n\nI am proud to sponsor this legislation to streamline the direct  commercial sales process, and I urge my colleagues to join me in  support of it.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…AIM-260 missile used for captive test purposes.\n\n4. The KGV-135 A is a high-speed, general purpose       encryptor/decryptor module used for wideband data encryption.\n\n5. The highest level of classification of defense articles,       components, and services included in this potential sale is       SECRET.\n\n6. If a technologically advanced adversary were…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Federal tax relief, denying  hardworking families and small businesses much-needed breathing room  after years of Bidenflation.\n\nCalifornians are struggling with some of the highest taxes and cost  of living in the Nation and are getting no relief from Governor Newsom  and Democrats in Sacramento.\n\nMr. Speaker, I am proud to support this resolution because…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699679/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…our landowners  and local partners are already engaged in implementing.\n\nThis issue hits particularly close to home for me. In the Hawkeye  State, we have seen some of the highest nitrate levels ever recorded in  our rivers and streams across Iowa. This year alone, the Raccoon and  Des Moines Rivers exceeded Federal nitrate limits multiple times,  requiring…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…currently the Sr. Vice President and Worldwide Leader, Government  Affairs & Policy, and is retiring after twenty years with the company.\n\nDuring his tenure, Calvin exemplified the highest standards of  advocacy before Congress and engaged the American people on many  critical public health and public policy matters. I have had the  opportunity to work with…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…world. Today, we see the resurgence of American  strength. We are defending our interests and deterring our enemies  around the world. Military recruitment has surged to its highest level  in 15 years. Morale is high. Deterrence is back.\n\nPresident Trump successfully crippled Iran's nuclear program. He  strengthened the success of the Abraham Accords.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…other great institutions  of higher education. Utahns value education, and we are good at it.\n\nThe Salt Lake City metro area has professional sports teams competing  at the highest level, with basketball, the Utah Jazz; soccer, Real Salt  Lake; and hockey, the Utah Mammoth. They have already hosted the Winter  Olympic Games and are set to host another…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Pam and was happiest when surrounded by family and friends.\n\nMr. Speaker, Gerald ``Jerry'' Danforth's life was defined by service,  leadership, and love. He exemplified the highest ideals of his people  and of this Nation. His legacy will endure in the lives he touched, the  institutions he shaped, and the Nation he served so faithfully. I offer  my…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "James Risch", "party": "Republican", "sentence": "…secure beyond line-of-sight communication.\n\nThe Sensitivity of Technology statement contained in the       original notification applies to additional items mentioned.\n\nThe highest level of information that may be transferred in       support of this proposed sale is classified SECRET.\n\n(vii) Date Report Delivered to Congress: September 15,       2025.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…grown up on a dairy farm, Kyle has dedicated his life to the  dairy industry from a young age. On October 3, 2025, he received the  Merle Howard Award, which is one of the highest honors a young person  can achieve in the dairy industry.\n\nKyle's work ethic is demonstrated by his steady determination and  pursuit of excellence. He began by showing cattle…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Reprogramming Equipment (CMBRE) and the missile.\n\n3. The KGV-135 A is a high-speed, general purpose       encryptor/decryptor module used for wideband data encryption.\n\n4. The highest level of classification of defense articles,       components, and services included in this potential sale is       SECRET.\n\n5. If a technologically advanced adversary were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…to the U.S.  Supreme Court.\n\nMr. Tung was a Bristow fellow in the Justice Department's Office of  Solicitor General, where he worked on numerous cases before the  Nation's highest Court.\n\nDuring President Trump's first administration, he also worked as an  assistant U.S. attorney in the Central District of California. As a  Federal prosecutor, Mr. Tung…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Electric Cooperative and  Cullman Power Board, an initiative that has generated millions of  dollars to support students by allowing customers to round up their  bills to the next highest dollar. He also served as the project manager  for the Duck River Dam and Reservoir Project, which helped secure  Cullman's water source for the next 100 years and stands…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…colleagues talk  about corporations and about high-net-worth individuals, but the small  businesses are structured in a way that their ordinary income is taxed  at what some of the highest income individuals of our society are taxed  at.\n\nThese small businesses are taxed at a significantly high rate,  oftentimes higher than other corporations. We need to make…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…efforts will  have a lasting positive impact on the community.\n\nOn behalf of the 17th Congressional District of Florida,  congratulations to Reagan Graham for achieving the highest distinction  in Girl Scouts, the Gold Award. We thank Reagan for her leadership and  making such a positive, lasting change in our community.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}]