[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…These grants help children  of mobile farmworkers and fishers, people who are harvesting our crops  and putting food on our tables, meet academic standards and graduate  from high school, preparing them to become responsible citizens and  productive employees.\n\nTitle II grants provide essential support to recruit, prepare, and  retain high-quality teachers…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…enforcement officers face unparalleled risks every day, from  physical violence to psychological traumas. According to the FBI,  assaults against officers remain very, very high, with tens of  thousands of them who are injured annually.\n\nBeyond the line of duty, officers experience higher rates of PTSD,  depression, and suicide compared to the general…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…our       relations with our good friend Japan, which overall remain       excellent, recent disagreements between our two countries on       the issue of trade will also be high on our agenda.\n\nAs perhaps you've heard, last week I placed new duties on       some Japanese products in response to Japan's inability to       enforce their trade agreement…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…if they can start  building the housing that New Hampshire desperately needs if their  lumber costs 25 percent more overnight? And how can a family already  struggling with high costs continue to pay the rent or put food on the  table if their household costs are going to go up $1,200 this year?\n\nI want families and businesses to know that the whims…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Marisol's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Marisol Chavez on achieving the Arvada  Wheat Ridge Service Ambassadors…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690220/recognizing-marisol-chavez"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…company--largely since rebranded and reorganized under the       Russian Defense Ministry as the Africa Corps--among the ranks       of Haftar's forces.\n\nIbrahim Sahad, a member of Libya's High Council of State       that succeeded the General National Congress in 2016, stated       that Russian personnel had established ``three or four air       force bases in Libya,''…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…shootings.\n\nThat is the reality for students at Brown University right now,  students like Zoe Weissman, who was a middle schooler at the school  next to Marjory Stoneman Douglas High School during the Parkland  massacre. Years later, she found herself again facing an active shooter  on a college campus. Mia Tretta was shot as a teenager at Saugus High  School…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698338/school-shootings-are-not-inevitable"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…administration to arrest, detain, or deport without lawful due  process sets a dangerous precedent for us all, even those who one day  may count themselves among former holders of high office. Americans  also now risk being subject to retaliatory treatment in other  countries. Given the centuries-old protections granted by our  Constitution, I urge the administration…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Pete's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Pete Rapa on achieving the Arvada  Wheat Ridge Service Ambassadors…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689458/recognizing-pete-rapa"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…personal development, as well as 200-plus  hours of personal fitness activities.\n\nThe winners of the Congressional Award's gold medal this year are  Sabrina Lu of Riverside High School, who designed handmade cards and  spread cancer awareness; Jason Jayanth of Academies of Loudoun and John  Champe High School, who tutored students and volunteered at…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…volunteers. Twenty separate  agencies, at every level of government, have come together to help save  lives. At Camp Mystic, the counselors, many of whom had just graduated  from high school, risked their own lives to save younger campers. We  will never forget that bravery.\n\nThis disaster has impacted people of both political faiths-- Republicans and Democrats--and…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693273/central-texas-floods"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…crucial skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Zoe's hard work, determination, and perseverance at  Arvada West High School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Zoe Williams on achieving the Arvada  Wheat Ridge Service Ambassadors…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689650/recognizing-zoe-williams"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this for months, and the Republicans  have done nothing; not a damn thing. I don't know how they go home and  face their constituents who are about to get screwed over with high  healthcare premiums and bills and say: Oh, I know, I get it. People are  going to lose their healthcare. My friends have been in charge all  year, and they have done zero,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…percent in my home State of New Jersey, in part due to  increased exports of liquefied natural gas. Both of these figures are  vastly outpacing inflation, which is already sky high, thanks to the  President's tariffs and the healthcare and housing crisis.\n\nLet there be no mistake that Republicans and President Trump own this  affordability crisis, and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…doesn't care about the cab driver who is now paying  $2,600 per month in healthcare as opposed to $44. He doesn't want to  save the 20 million Americans who are going to face high premium  increases. How is that America first?\n\nMr. Speaker, we need national health insurance in this country. We  need to tax billionaires in this country. We need to fund…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696687/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, it is with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school football  team in Ohio's 5th Congressional District. The young men of the Avon  High School football team have represented their school ably on their  way to achieving…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698001/recognizing-avon-high-school-on-winning-the-division-ii-state-football-championship"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…What was under his feet demonstrated his devotion  to this country and his belief in it at a ripe age. You see, Clyde was  16 years old, and he was a sophomore at Ben Davis High School outside  Indianapolis. The legal enlistment age at the time was 18, but Clyde  could not tell a lie. Nothing was going to stop him from fighting for  America, though,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Scenic Overlook Trail Bridge  and the Bill Pascrell, Jr. Overlook Park.\n\nPaterson, New Jersey, was home to Congressman Pascrell, a former  Member of this body and, before that, a high school teacher and college  professor.\n\nCongressman Pascrell was instrumental in the designation of the  Paterson Great Falls National Historical Park in 2009. Known for his…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691128/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise to congratulate the Indiana High  School Athletic Association 3A football State champions, the Cascade  Cadets.\n\nThe Cascade High School football team triumphed over Fort Wayne Luers  with a 29-14 victory,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697559/congratulating-cascade-high-school-cadets-football-team"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Obama  administration. For example, at that time, I released a majority staff  report just last year. That report made public FBI emails that showed  agents tried to arrest high-level Iranians but were stopped from making  those arrests. Those agents were stopped then from doing their jobs  because of political considerations relating to the 2015 Iran…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…Outside of work, Deputy Larkin has been a steadfast Boy Scout Leader  for Troop 132, for over 35 years. An avid sports lover, Deputy Larkin  is also a referee for many local high school sports leagues. Deputy  Larkin is a graduate of Ole Miss University. He has given back to his  alma mater by teaching a criminal justice course as a guest lecturer.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Guidance Section (GS) (Single Variant Block Upgrade (SVBU))       developed by BAE Systems, Inc., a legacy 2.75-inch MK66 Mod 4       Rocket Motor, and the MK-151 or MK-152 High Explosive       Warhead.\n\n2. The highest level of classification of defense articles,       components, and services included in this potential sale is       SECRET.\n\n3. If…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…milestone in America's push for critical mineral independence.\n\nLast week, I joined Talon Metals to celebrate the new Beulah Minerals  Processing Facility, which will process high-grade nickel and copper,  just like this, from Talon's high-tech, environmentally friendly mine  in Minnesota.\n\nThey will turn it into materials for our defense, aerospace,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691909/north-dakotas-greatest-resource"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…retired as secretary and treasurer of the borough  council, acting as borough manager and head of maintenance and  permitting.\n\nJust 2 years after graduating from McConnellsburg High School, Jack  was drafted in 1953 and served our country in the Korean war.\n\nWhen Jack was asked about his military service, he shared that he  learned to depend on others and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…gas.\n\nThe result is an electric grid that is less reliable and increased  utility prices for hardworking Americans. While natural gas demand is  expected to reach an all-time high, accounting for more than 40 percent  of electric generation in the U.S. next year, this is clearly a  pressing issue that must be addressed immediately. H.R. 3668 is the  answer.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that converts unguided       free-fall bombs into accurate, adverse weather ``smart''       munitions. The JDAM weapon can be delivered from modest       standoff ranges at high or low altitudes against a variety of       land and surface targets during the day or night. The JDAM       can receive target coordinates via preplanned mission data…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…their own town or a neighboring community in need,  Kennedy's volunteers have never hesitated to offer support through  mutual aid. When disaster strikes and the stakes are high, these men  and women grab their gear and get moving, facing flames, chaos, and the  unknown with unshakable resolve.\n\nTheir station, nestled on Dailey Hill Road, is home to…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…willing  to tackle the most pressing challenges facing their communities and the  world with measurable, sustainable, and far-reaching results. To earn  the Girl Scout Gold Award, high school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…essential for roads, airstrips, and other infrastructure. Local access  to these materials allows rural villages  in this region to avoid costly imports that contribute to the high cost  of living in these communities.\n\nImportantly, the area also contains the Dalton Highway and the right- of-way for the Trans-Alaska Pipeline System, Alaska's most essential…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…colleagues on the other side usually support, but for some  reason here they are against it.\n\nThis guts MPD's ability to recruit, retain, and respond. The result  is consistently high crime rates and a staffing shortfall of about 800  officers that puts both police and residents at risk. I mean, I don't  know if people forget, just under 2 years ago, one…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692303/protecting-our-nations-capital-emergency-act"}]