[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and a work ethic that will guide them for the rest of their lives. This  award is a testament to Christelle's hard work, determination, and  perseverance at Arvada High School and is clearly just the beginning of  a bright and promising future.\n\nIt is my honor to congratulate Christelle Kumeso on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689494/recognizing-christelle-kumeso"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Jose's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Jose Luis Gonzalez Chacon on achieving  the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690363/recognizing-jose-luis-gonzalez-chacon"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Diego's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Diego Moreno on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690391/recognizing-diego-moreno"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Heyzel's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Heyzel Perez on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Alfonze's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Alfonze Romero on achieving the Arvada  Wheat Ridge Service Ambassadors for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690988/recognizing-alfonze-romero"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Crystal's hard work, determination, and perseverance  at Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Crystal Lozano Gutierrez on achieving  the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690329/recognizing-crystal-lozano-gutierrez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Omar's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Omar Lautenbach on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689451/recognizing-omar-lautenbach"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Amelia's hard work, determination, and perseverance  at Arvada West High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Amelia Ferkuniak on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689635/recognizing-amelia-ferkuniak"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a  work ethic that will guide them for the rest of their lives. This award  is a testament to Julissa's hard work, determination, and perseverance  at Wheat Ridge High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Julissa Martinez on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691749/recognizing-julissa-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Valeria's hard work, determination, and perseverance  at Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Valeria Seanz Alvarado on achieving  the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689450/recognizing-valeria-seanz-alvarado"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and  a work ethic that will guide them for the rest of their lives. This  award is a testament to Veronica's hard work, determination, and  perseverance at Arvada High School and is clearly just the beginning of  a bright and promising future.\n\nIt is my honor to congratulate Veronica Quezada on achieving the  Arvada Wheat Ridge Service Ambassadors for…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689438/recognizing-veronica-quezado"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Dulce's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Dulce Villegas Menez on achieving the  Arvada Wheat Ridge Service Ambassadors…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691114/recognizing-dulce-villegas-menez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…skills and a  work ethic that will guide them for the rest of their lives. This award  is a testament to Pete's hard work, determination, and perseverance at  Arvada High School and is clearly just the beginning of a bright and  promising future.\n\nIt is my honor to congratulate Pete Rapa on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689458/recognizing-pete-rapa"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Brody's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Brody Hafer on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690316/recognizing-brody-hafer"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…work ethic that will guide them for the rest of their lives. This award  is a testament to Juan's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Juan Diego Camacho Rodriguez on  achieving the Arvada Wheat Ridge Service Ambassadors…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690248/recognizing-juan-diego-camacho-rodriguez"}]