[{"senator": "Katherine Clark", "party": "Democrat", "sentence": "…are ready to vote, Mr. Speaker. You have the power to bring that  to the floor today.\n\nLet the will of the people be the will of the people's House. Let's  stop the premium hikes, extend the ACA tax credits, and get back to  building a healthcare system that is worthy of the American people.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698376/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…of climate pollution,  locking us into a dirtier and more expensive future.\n\nIn July, Republicans passed their big, ugly bill, which will saddle  American families with price hikes of at least $110 next year and up to  $4,000 annually within a decade.\n\nIn August, EPA announced an illegal cancellation of the $7 billion  Solar for All Grant Initiative,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…spike.  Seniors are turning off the heat on frigid winter days. Prices jumped  sharply last year, far faster than paychecks.\n\nLast year, there were 43 different electricity rate hikes across the  country, totaling over $11 billion in new costs for ratepayers.  Millions of households are saying they cannot afford this. They are  already behind on their utility…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Nationwide, it is estimated that healthcare premiums will more than  double for hard-working families. Make no mistake, plenty of families  won't be able to afford these significant hikes and will be forced to  go without healthcare--all because Republicans refuse to act.\n\nWorking families are awakening to this healthcare crisis because--and  I repeat--they…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the whims of this  President are not going to cause them to break the bank on everyday  items they need to get by. That is why I introduced the Protecting  Americans from Tax Hikes on Imported Goods Act. It is a simple change,  really. It says that the International Emergency Economic Powers Act,  or IEEPA, can no longer be used to place taxes on imports.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the ``number one threat'' to our Nation. The Republican Senate  leader says that it is a ``ticking time bomb'' just before he lights  the fuse with this sorry resolution that hikes the debt by $6 trillion.\n\nThe independent Committee for a Responsible Federal Budget urges us  to reject this ``unprecedented level of fiscal recklessness.''\n\nRepublicans are…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689897/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…and small businesses are seeing  electricity costs rise by hundreds of dollars. Demand for power is  rising quickly, and this year, utilities have already proposed major  rate hikes to the tune of $34 billion. Instead of helping lower bills  with forward-looking technology, this legislation takes us backward,  effectively promoting energy sources that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to insist that we pull our  Nation back from the largest-ever, Republican-forced loss of healthcare  in our history.\n\nThese catastrophic coverage cutoffs and massive premium hikes will  hammer millions of us back in Florida, and it is all because  Republicans chose billionaire tax breaks over extending the Affordable  Care Act tax credits for our hardworking…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…clean power plants, Republicans will abandon billions  in sunk costs, leave half-built equipment, and electricity bills will  go up. Utility companies are expecting major rate hikes if these  credits vanish because, without them,  they will be forced to rely on more expensive, unstable, and dirty  fossil fuels.\n\nLocal economies will be devastated by shuttered…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…night at 12:01 a.m. Those tariffs are  expected to add about $2,400 in costs for the average household per  year.\n\nThat is why I introduced the Protecting Americans from Tax Hikes on  Imported Goods Act. This bill states clearly that the International  Emergency Economic Powers Act cannot be used to place taxes on imports.  If the President needs to…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…country. So this is a very dangerous place to put the  small businesses of our country.\n\nEven as the vast majority of small businesses are seeing massive  tariff-induced cost hikes, this administration is offering exemptions-- exemptions--for billion-dollar corporations.\n\nIf you can get a dinner invitation to Mar-a-Lago, like the heads of  Apple and Google,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…just about the ACA, but it is most  important for those people who had the ACA and perhaps don't have it  anymore.\n\nUnfortunately, the Republican majority has known these price hikes  were coming all along, but they didn't do a single thing to stop this  from happening.\n\nLast year, Republicans instead spent their time giving permanent tax  breaks to billionaires…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…issue. It is daily life for the people that we all represent. Let's do  something about it. Let's reject this budget. Let's stop the healthcare  cuts. Let's stop the premium hikes. Let's stop the hospital closures,  and let's stop the billionaire giveaways.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696729/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Georgia. Folks really are at their wits' end because it is all coming  down at once.\n\nIn Florida, the three largest investor-owned utilities have requested  $34 billion in price hikes this year. Last month, the DeSantis- appointed utility commission approved a $7 billion rate hike for  Florida Power & Light customers. FPL customers will be paying much more…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…actually, but this one is terrible.\n\nI think it sets a dangerous precedent. It hurts our constituents by  increasing their energy costs, just as so many are already seeing huge  hikes to their bills. It weakens national security, and it undermines  the critical work that the Army Corps of Engineers does to keep our  coastal communities safe.\n\nMr. Chairman,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694863/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…population.\n\nThis is the average. Understand that I represent the Phoenix and  Scottsdale area. For my folks, our math is $3,300, almost $3,400 a year  for my average family in tax hikes. For the country, it is $2,850.\n\nThat is the tax hike that is already in the law. That is already what  is coming at us. That is what the Democrats have been arguing, saying…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Bill Act, and  they said bravo.\n\nThe Trump tax cuts have bolstered growth, boosted job creation, and  benefited American production. However, barring action, burdensome tax  hikes will be bothersome. In northeast Florida alone, the One Big  Beautiful Bill Act protects 15,000 jobs and over $2.6 billion in base  economic output.\n\nThe House has done its…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693038/buzz-from-break-rooms-to-backyards"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the American people, who know  that their purchasing power will be weakened with every new  protectionist measure unilaterally imposed by the White House.\n\nNone of these tax hikes are necessary. The populists argue that the  threat of tariffs is needed to force Canada to stop the flow of illicit  drugs. In fact, one of the social media posts today said…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…were ready to get the country back on track. We wanted less government  spending, more secure borders, and we wanted to see the 2017 tax cuts  made permanent to prevent tax hikes on every American. The majority  cannot take that mandate for granted, and this week we have the  opportunity to give the country what they voted for.\n\nOur one big, beautiful…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the point that when you did all the  corporate, the estate, the individual, and then you did the economic  effects, you got about 1.5 percent of the economy.\n\nAll the taxes hikes--every time we have someone over on that side  saying: Just raise taxes--if we do every one of their tax proposals,  then we get 01.5 percent.\n\nHopefully, everyone knows what…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…thought actually just because we are trying to do fact-based,  the average family's taxes are going up at the end of this year $2,853,  and 62 percent of taxpayers will see hikes.\n\nI am sorry, we just didn't have time to make a much prettier chart  for everyone.\n\nRemember that after 2017 we actually moved up, some of that were some  of the deductions…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…about somewhere better to  spend that $3,000 than to write a check to the IRS. Small business  owners like many of the folks that I met with these last 2 weeks would  see tax hikes of nearly 50 percent, and working families could see  their child tax credit cut in half, along with the standard deduction,  which was dramatically increased in 2017.\n\nDespite…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…litany, when you  do the economic adjustment, it comes in at 1.5 percent, maybe 1.6, but  the math is easier, 1.5 percent of the economy. That is what we get for  all the tax hikes.\n\nFor those of us on the Republican side when we walk through, we can  cut this, we can cut this, we can cut this, it is coming in at about 1  percent of the economy.\n\nAnyone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…every tax hike that  the left has proposed and the scores and its economic factors.  Actually, we did a bunch of the cuts in spending and those things,  Republicans.\n\nThese tax hikes came out to 1.5 percent of GDP. Our cuts came out to  about 1 percent of GDP, a big 2.5 percent. Looks like we are going to  borrow 7.3 percent of the economy this year. And…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are trying to get 2, that is 2.3 percent, and that is  creating the bedwetting. Do they really love their money, this  spending?\n\nRemember, Mr. Speaker, if you don't want tax hikes--I don't want tax  hikes. Borrowing is a tax hike. It is just paid for in the future with  interest. Stop thinking borrowing is free.\n\nMy wife and I have adopted a couple of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Social Security will  take a 24 percent cut. Our model says we double senior poverty in  America. That is absolutely immoral.\n\nHave you also read the papers, the scale of tax hikes, of policy?  Now, is the left offering to work with those of us on the right who are  willing to step on the third rail and do the moral thing to actually  take these on? Hell,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]