[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…consultation with the Secretaries  of Defense, Veterans Affairs, and Labor.\n\nVeterans are trained for hard and dedicated work. I understand why  supply chain employees want to hire more veterans. One of the lightest  lifts that we can do in this body is to ensure we are exhausting every  possible resource we can to ensure that those who have signed up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695017/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…two-thirds.\n\nOn top of that, Trump illegally froze or canceled $3.8 billion in DOJ  grant programs, including COPS grants for our police departments that,  of course, help communities hire and train police officers.\n\nMr. GARCIA of California.  Norton.)\n\nMr. GARCIA of California.  Crockett).\n\nMr. GARCIA of California. Mr. Speaker, I reserve the balance of my  time.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…providers, the small group health insurance market isn't just  a huge administrative burden, it is also expensive. The open  marketplace is the difference between being able to hire and retain and  keep doors open and losing staff to jobs at companies that have the  wherewithal to provide health insurance.\n\nBut this tax break is all on the line right now.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…believe in the potential of these companies and  demonstrate this faith by investing in their equities. This flood of  new capital allows companies to do research and development, hire  Americans, and innovate for the greater good.\n\nMy legislation strengthens our capital markets by requiring more  transparency around multiclass shareholder companies.\n\nFor…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…FEMA can be sometimes. We saw  the disaster of government when it didn't work. Congress put in place  some measures to repeal and increase FEMA. One of those was you have to  hire an experienced administrator of FEMA, somebody who knows what they  are doing, because this isn't a time to play around. This  administration hired as the director of FEMA somebody…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…I know that my colleagues on the other side of the aisle balk at  anything that might result in civil servants receiving more  compensation, but if we agree that we need to hire board attorneys with  greater experience, and we are asking them to do more work and more  complex work at that, we ought to see fit to pay them what they are  worth. I hope…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Violent Crime  Reduction Initiative, which provided funding to dozens and dozens of  rural law enforcement agencies across America allowing them, with their  strapped budgets, to hire more officers and purchase up-to-date  equipment and technology. They also supported rural victim services and  crime prevention programs. This program was created to assist…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…and GENIUS Acts cost the crypto industry  about $245 million, and that is a conservative figure. That is just the  money spent on 2024 campaigns. If you count money spent to hire  expensive lobbyists to come to Congress and ply Representatives with  industry talking points, the number is even higher.\n\nCrypto's $245 million was spent supporting candidates…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Republican talking point at the time that  we don't have a gun problem. We have a mental health problem. Well,  fine. With this grant, the Crystal Lake District 47 was able to hire  trained mental health professionals and give 7,100 students access to  mental health care.\n\nCanceling this grant will disrupt critical mental health care for  students who…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692131/crystal-lake-mental-health-program"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Republican spending  bill.\n\nThe GEO Group that owns Adelanto boasted about a $31 million windfall  if they keep full capacity.\n\nRepublicans want to boost the funding of ICE to hire more masked  agents and pay out more contracts like that at Adelanto.\n\nAccording to my Republican colleagues, our budget is too tight to  provide healthcare or groceries for…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…me on as his Chief of Staff  needing someone from Michigan who didn't have ethical conflicts with a  managed industrial bankruptcy of General Motors and Chrysler. We didn't  hire anyone in the auto industry. We didn't want to have conflicts. We  brought together this amazing team. It didn't matter who voted for  what, we just got the best talent in and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…recommending that  the administration increase the number of staff working on Pacific  Islands issues and in the region, authorizing the Secretaries of State  and Commerce to hire locally employed staff in the region, establishing  a workforce development program, codifying a media program and more.\n\nIt increases U.S. security assistance to address regional…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…and billions of dollars of clean energy projects all over this  country in every State--in Virginia, in Missouri--all over the Nation:  billions of dollars of projects that hire people, thousands of jobs  lost. The projects that are being canceled are going to continue this  trend of--at a time of great demand and growth--data centers and all  kinds…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…including those at the Consumer Financial Protection  Bureau, the Department of Labor, and other critical agencies.\n\nWe have seen this firing be so haphazard that they have had to hire  some of them back, including the decision to fire all the National  Nuclear Security Administration personnel responsible for overseeing  our U.S. nuclear weapons stockpile…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…wouldn't gleefully refuse to  coordinate with State and local officials. He wouldn't have literally  defunded our police by freezing and slashing Federal dollars that help  hire, train, and equip law enforcement. He wouldn't be diverting  Federal resources and agents away from operations that investigate drug  cartels and drug traffickers, from missions…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Guard.                           Subtitle D--Personnel  Sec. 241. Family leave policies for Coast Guard. Sec. 242. Modifications to career flexibility program. Sec. 243. Direct hire authority for certain personnel. Sec. 244. Command sponsorship for dependents of members of Coast Guard                assigned to Unalaska, Alaska. Sec. 245. Authorization…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…That was the goal of the JOBS Act, and that is what this bill will  accomplish. Small businesses shouldn't be punished for success. They  should be encouraged to grow, build, hire, and do that right here in  the good old USA.\n\nThis is a simple, targeted fix with a big impact. It cuts red tape  and keeps America's capital markets open and accessible for…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693854/greenlighting-growth-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…ground.\n\nThese changes are not about deregulation for its own sake. They are  about opening doors. They make it easier for new businesses to get the  early capital they need to hire, grow, and contribute to a dynamic,  competitive economy, and we know that this model works.\n\nAngel investors helped launch companies like Amazon, Google,  Facebook, Costco,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…in my office in Wichita has learned from her guidance and  decades of experience, and she has fostered a family and not just a  group of employees.\n\nDebbie was my very first hire following my special election in 2017.  As district director, Debbie was always focused on what was best for  Kansans, particularly in the Fourth Congressional District.\n\nShe…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…under the SBA's 7(a) and 504 lending programs from $5  million to $10 million.\n\nThis will provide American manufacturing the capital they need to  invest in new technology, hire, grow, and create onshore jobs that we  have carelessly lost overseas.\n\nH.R. 3174 is essential to keep pace with demand for capital and bring  jobs back to the U.S. Two weeks…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…items necessary to support and carry out tagging       and tag recovery operations, including data processing and       data dissemination relating to those operations; and\n\n(2) hire additional personnel, as necessary.\n\n(c) Required Collaboration.--In carrying out the Program,       the Director shall collaborate with applicable Federal,       State, and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…In Indiana's Ninth District, small businesses like Lincks Clothing  and Shoes, Brownstown Electric, and Lischkge Motors are strengthening  our communities one investment, one hire, and one customer at a time.\n\nThat is why I am committed to cutting government red tape, lowering  taxes, and fighting for progrowth policies that empower our  entrepreneurs…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690917/recognizing-hard-workers-driving-our-economy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…inflation?\n\nNearly half of these small businesses reported that they would have  to postpone or cancel capital investments; in other words, they  couldn't grow their business, hire more employees, or improve their  equipment.\n\nNow, these are not massive corporations, as we hear from folks on  that side of the aisle. They talk about businesses as if they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…are not consistently posted on  agency websites.\n\nThis inconsistency burdens regulated entities, and it especially  burdens small businesses who often lack the resources to hire  compliance experts. The problem is so bad that agency guidance  documents are known as regulatory dark matter.\n\nFor a brief time, the first Trump administration was able to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…big, beautiful  bill--we are committed to extending the provisions of President Trump's  Tax Cuts and Jobs Act, which helped countless small businesses invest,  expand, and hire.\n\nProvisions like section 199A, bonus depreciation, and the R&D tax  credit have had a direct, positive impact on small businesses. These  provisions, and the broader income…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…poverty or married somebody who wasn't in poverty.\n\nUsually, what you have to do is you have to keep your income below  $16,000 or $17,000, and if you talk to employers who hire people who  are making in the $10 to $15-an-hour range, they will always give you  anecdotes of their employees who don't want to work extra hours, or  they will lose their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…individuals with  disabilities who want to start their own business or find meaningful  employment, and it also ensures that small businesses have the guidance  they need to hire and support employees with disabilities.\n\nThrough this bill, we are ensuring that individuals with disabilities  can turn their ambitions into reality, whether that means starting…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…legislation offers a commonsense solution. H.R. 1642  requires the Small Business Administration's resource partners to  provide small businesses with vital information on how to hire  graduates of career and technical education programs.\n\nIn addition, it ensures that students and graduates of these programs  know about the business counseling resources available…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…of all businesses in  the State. In President Trump's first term, Congress passed the Tax  Cuts and Jobs Act, giving small businesses the relief that they needed  to grow and hire.\n\nI will also say that there are no Fortune 500 businesses without  first starting as a small business, or a mom and pop.\n\nIf we don't act now, those tax cuts will expire, and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…leads to.\n\nReexamine every mandate that we place on employers, especially those  that don't exist in any other State, and evaluate the impact they have  on the incentive to hire.\n\nTake a cue from President Trump who has said we are going to repeal  10 regulations for every new regulation that we offer.\n\nIf there is any place where the regulatory thicket…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}]