[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…celebrate the survivors who he cares so deeply for. He even walked one  of the people he supported down the aisle at her wedding. In fact, my  husband and I met Jerry when we hired him to secure our wedding when  MAGA protesters threatened our very precious and sacred event.\n\nJerry has always put the people of our community first, and his deep  desire…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…general of  these Agencies, who are the watchdogs. They have records of eliminating  waste, fraud, and abuse.\n\nExhibit A is Michael Missal, the inspector general of the VA, hired  and appointed first by President Obama. He served under President Trump  for 4 years and then under President Biden. He has ruffled feathers of  Republican and Democrat administrations…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…of Supervisors  appointed Mr. Varney as County Administrative Officer, overseeing 25  county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney found  himself navigating Madera County through one of the most challenging  times in recent history. He played a vital role in helping Madera  County survive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…administration have been praising and hiring into leadership positions  the very people who attempted to subvert our democracy. In fact, just  this past month, the White House reportedly hired Kurt Olsen, a lawyer  who attempted to overturn the 2020 election results, and he is working  officially as a ``special government employee'' tasked with looking  into the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…critical  infrastructure. Republicans will cut services that maintain our  national forests and our national parks, as we heard. Firefighters are  being laid off or not even being hired for the summer fire season.\n\nIn our national parks, who will be there? Apparently my colleagues on  the other side of the aisle don't care much for those people who are  necessary…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…services that help people find shelter and  leave the streets. I have worked with internal data that focused on  improving our programs. Most recently, I worked with a team that hired  people from housing authorities and Job Corps with the goal of  providing people a career and a way off government assistance. Those  incredible people, along with myself,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…assist local farmers sell produce locally. That job is gone.\n\nA young farmer with a newborn daughter and a single mother with two  children just back from maternity leave were hired to help citizens  understand how to save money through the Centers for Medicare and  Medicaid Services. They are out in the cold too, and so will the  American people be.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Holman Field  in Saint Paul, the city's historic downtown airport. Holman Field bears  the name of Charles ``Speed'' Holman, the pioneering aviator and  Minnesota native who was hired as Northwest's first pilot in 1926.  Holman's legacy as a fearless pilot and a trailblazer in American  aviation is preserved every time a plane lands at that field along the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…for indigent defendants, counsel is appointed from the Federal  Defender Service. If there aren't enough Federal defenders, justice  could be delayed. Panel attorneys can be hired, but from the panel they  could be more expensive.\n\nIn fiscal year 2024, there was an inadvertent budgeting error that  resulted in initial funding levels that were at least…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699126/fsgg-federal-defenders-funding"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…death in custody.\n\nRelease of body camera footage in cases of serious bodily       injury or death in custody.\n\nBackground checks so only highly qualified officers are       hired, and those who engage in misconduct cannot simply leave       one jurisdiction to be hired in another.\n\nWith appropriate safeguards and limits, preservation and       dissemination…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…are rolling those protections back.\n\nThe implementation of Federal law requiring affirmative action for  employees and applicants with disabilities, ensuring that they are  hired, retained, and promoted by Federal contractors; they are rolling  that back.\n\nEnforcement of antidiscrimination and affirmative action requirements  that ensure that Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…of those was you have to  hire an experienced administrator of FEMA, somebody who knows what they  are doing, because this isn't a time to play around. This  administration hired as the director of FEMA somebody who never even  knew whether or not a hurricane season existed, somebody who has no  experience in this area.\n\nHomeland Security Secretary…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…run a bar, a two-hundred-year-old  Kentucky law prohibited women from working as bartenders or even  sitting at bars. Dixie decided that just  wasn't right, and, in 1968, she hired her very first woman bartender  and served a woman seated at her bar--her own adult daughter, in fact.\n\nThe Kentucky Alcohol Beverage Control Board came down hard and fast,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695585/recognizing-the-extraordinary-life-of-dixie-demuth"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…people--and they are firing just about everybody in the  government with less than 2 years of government service, the  probationary employees. That destroys our future. The people hired in  2024 are those that we are going to need in 2034.\n\nThe Dodgers are a pretty well-run organization. I think better run  than government. Imagine if the Dodgers were going…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Government. After working for a  decade to make the Illinois transit system safer, he landed a job with  the Federal Transit Administration in safety assurance, where he was  hired to start a program that looked into transit safety hazards across  the Nation.\n\nBut after President Trump took office, he started to receive strange  emails about his job.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "John Thune", "party": "Republican", "sentence": "…themselves, hire more workers, and, in turn, grow our  economy. And that is what happened.\n\nAfter the Tax Cuts and Jobs Act passed, we saw businesses buy new  equipment. They hired new workers. Paychecks got bigger. It was good  for small business and good for American workers, and it led to a very  strong economy before the pandemic.\n\nBut many of the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…year of anemic--anemic-- Biden-era top lines. I don't think the President assembled his policy  and budget advisers with a mind to punt in the face of looming threats.  When he hired civilian Pentagon leaders to restore deterrence, I think  he meant more than just threatening adversaries with a catchy line on  camera; I think he meant building the force…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…and ideas to drive her oversight and legislative agenda.\n\nIn July 2014, Mac landed his next role in Congress working for the  Select Committee on Benghazi. He was initially hired to serve as the  Select Committee's Senior Counsel and then moved into the important  role of Security Manager. As an employee of the Select Committee, Mac  analyzed thousands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…President has now brought those down 95 percent and, since April  2025, has stopped releasing illegal immigrants into our country. That  is progress. But I believe the President was hired to address the issue  Joe Biden created. So we need to give the right tools to our law  enforcement officers to be successful.\n\nI encourage my colleagues on the other side…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Kirby Moore\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to celebrate the new  football coach of Washington State University, Coach Kirby Moore.\n\nJust before the holidays, WSU hired Kirby Moore, a Washington native,  as our new head coach. Kirby Moore is young, hungry, and armed with an  impressive coaching resume. Coach Moore is ready to lead the Cougs…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the results of the audit are--let's see,  what were the words here?--misguided. They do not reflect the  substantial progress that has been made.\n\nBy the way, the Governor has hired a gentleman who specifically goes  around on X attacking people like me who criticize anything that the  Governor is for. Newsom is completely for spending billions and  billions…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…477,000 employees. With that massive amount of employees, over the last  several years, many of the jobs were not getting done correctly even  though we put out a lot of money and hired a lot of employees.\n\nSecretary Collins has said that he will reduce staffing based on  attrition--attrition, mind you. We won't lose docs. We won't lose  nurses. We won't lose…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…recognize science  teacher Bill Eswine, who has decided to retire at the end of the school  year after 54 years of service to Savannah Country Day School.\n\nMr. Eswine was originally hired in 1972, and through his enthusiasm,  adaptability, and love for teaching has taught science to generations  of children. His impact is visible across the school's campus in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…written briefing which describes the use       of the authority provided under this section on an annual       basis, including the following:\n\n``(1) The number of employees hired under the authority       provided under this section within the year for which the       briefing is provided.\n\n``(2) The positions and grades for which employees were…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…whole nine yards. All night long people were asking, ``where did  this guy come from?'', ``he is amazing!'', ``Can he come to every  game?''. Coach Kupcik told him, ``You're hired!'' That day, and every  day moving forward, he refused payment for his services. Mr. Lancaster  always says it's his way of giving back to the community. Since his  ``tryout'',…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…``(7) Definitions.--In this subsection:\n\n``(A) Eligible nursing faculty member.--The term `eligible       nursing faculty member' means a nursing faculty member who--\n\n``(i) was hired by a school of nursing within the 2-year       period preceding the submission of an application under       paragraph (2), or a prospective nursing faculty member;\n\n``(ii)…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Gynecologic Cancer Care Coordinator at each Veteran       Integrated Services Network (hereinafter in this section       referred to as ``VISN''). Each Care Coordinator hired or       designated under this subsection shall report directly to the       Director of the Breast and Gynecologic Oncology System of       Excellence (hereinafter in this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…interest       in the entity providing physical security enhancements.\n\n4.3 Personal security services. A security entity,       including local or state law enforcement, may be hired to       provide personal security services for the Member so long as:\n\n4.3.1 The personal security services provided under the       contract are being provided only for the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…us.\n\nIf you stand up here and try to actually fix problems, you will get  the crap kicked out of you, but at least you are trying to do the right  thing. This is what you are hired to do on this job. It is not pander  to your voters, but tell them the truth and try to fix things.\n\nI can't tell you how many speeches I hear behind these microphones  where…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Township and  to the entire Centre region\n\nFor more than 50 years, Elliot delivered the weather report as chief  forecaster and senior vice president of AccuWeather. He was first hired  at AccuWeather in 1967. In 1971, Elliot graduated from Penn State  University with both a bachelor's and a master's degree in meteorology.\n\nElliot holds the title of certified…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697750/recognizing-elliot-abrams"}]