[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…unimaginable that it becomes easier just to ignore it all,  but to say nothing is not an option, especially for someone like me.\n\nMany of my family, my distant family, were in Hiroshima on the day  the atom bomb fell. That memory is not just historical. It is personal  for me and my family.\n\nMr. Speaker, the atomic bombs of 1945 caused unimaginable horror.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…up in return for  a guarantee of territorial integrity--one, unfortunately, which we are  not abiding by.\n\nMr. FOSTER. Mr. Speaker, I thank Mr. Takano for reminding us of  Hiroshima.\n\nMr. Speaker, I had the opportunity for the first time in my life to  visit, and the things that stick in your mind are hard to describe.\n\nOne of them is they have the steps…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…warhead--one--has the power to wipe out an entire city. A full- scale nuclear war would devastate life as we know it.\n\nMr. Speaker, 80 years ago, the horrific U.S. bombings of Hiroshima  and Nagasaki caused unimaginable death and immense human suffering, and  survivors to this day face long-term health issues and radiation  poisoning.\n\nSo 80 years after…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694114/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…shouldn't premise a decision to send our sons and daughters into  war on the judgment of a single person.\n\nThe President patted himself on the back, and he compared the attack  to Hiroshima and Nagasaki. That was a most unusual--most unusual-- comparison.\n\nI haven't put all the lyrics of the song up on my chart, but one of  the other lyrics was about sending…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…carried out 468 nuclear tests at the test  site. The total impact of these tests between 1949 and 1963 was 2,500  times more powerful than the atomic bomb the U.S. dropped on Hiroshima.  The toxic radioactive fallout these tests yielded caused irreparable  damage to more than 1.3 million people in Kazakhstan and severe  ecological harm to the area surrounding…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…really high- performance weapons.\n\nWhat about in between? They have 60 percent uranium. Guess what? That  is not weapons-grade, but it is weapons-usable. For example, the  Hiroshima bomb was made with a mixture of 50 percent enriched uranium  and higher enriched uranium.\n\nThe 60 percent enriched uranium that Iran has a significant inventory  of is perfectly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hundreds of nuclear bombs in this country  and others.\n\nNow Vladimir Putin is recklessly threatening to use tactical nuclear  weapons against Ukraine. That is the equivalent of a Hiroshima bomb.  That is what we would call it today. China is expanding its arsenal of  more than 600 nuclear weapons. North Korea is expanding its arsenal of  nuclear warheads and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…They, too, have suffered long-term health  consequences.\n\nIn 2 weeks, we will commemorate the first use of a nuclear weapon in  a conflict--and that was the atomic bombing of Hiroshima on August 6,  1945--and the second, the bombing of Nagasaki, on August 9. Let us pray  that Nagasaki will be the last. Let us work to make sure that it is.\n\nSadly, the threat…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Israel.\n\nThese bombs, by the way, are in addition to the 70,000 tons of  explosives--70,000 tons--that have already been dropped on Gaza. And  that is the equivalent of six Hiroshima nuclear explosions. Those  bombs, as Senator Sanders said, have been used to destroy more than  200,000 buildings in Gaza. That is more than three times the number of  buildings…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…mutual disarmament and abolition.\n\nIn a few short weeks we will mark the 80th anniversary of the only  time nuclear weapons have been used in combat by the United States in  Hiroshima and Nagasaki, Japan. The fact is in 80 years since, we have  only avoided nuclear war by sheer luck. As long as countries possess  massive arsenals of world-destroying weapons,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Committee, Mr. McGovern, for yielding. I thank him and the  CPC for organizing this very important Special Order hour.\n\nNext month marks 80 years since the atomic bombings of Hiroshima and  Nagasaki. These were the only times nuclear weapons have ever been used  in war.\n\nI have to say that this memorial, this memory, this 80th anniversary  milestone is…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…regional  conflagration if the President intervened alongside or even supported  Israel's strikes.\n\nThe President's own--his own--Director of National Intelligence  traveled to Hiroshima to record a bizarre video, not as a warning  against Tehran's nuclear ambitions but presumably against American or  Israeli operations to blunt them.\n\nNow, fortunately, the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]