[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, today, I rise on behalf of the  Congressional Hispanic Caucus. A number of members are going to come to  provide testimony tonight about what we perceive is a betrayal of our  colleagues on the other side of the aisle of the American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to recognize an outstanding business and community  leader from Rochester, New York, Orlando Ortiz.\n\nServing as President, Orlando Ortiz has played…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to honor an extraordinary advocate from Rochester, New  York, Daisy Rivera-Algarin.\n\nAs a founding member of Latinas Unidas, Daisy Rivera-Algarin…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695836/recognizing-daisy-rivera-algarin"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…than women.\n\nManaging your weight and managing your diet, Mr. Speaker, makes a  difference. According to the CDC, about one in nine African-American  men and one in seven Hispanic men have been diagnosed with diabetes.  Many more have diabetes but simply don't know it.\n\nFertility: According to studies, male obesity has been shown to  impact fertility.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…State, and people like in our inner administration.\n\nJust today, Governor Ron DeSantis deleted from the annual anniversary  statement the words and acronyms ``LGBTQ+'' and ``Hispanic,'' when most  of the people who were killed that day were from the LGBTQ+ community  and Hispanic. This was armed bigotry, and it was armed hate.\n\nI am oftentimes asked why…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…situation.\n\nEvery American should be outraged at the Trump administration's  attempt to erase American history and specifically to erase the history  of Black, Native American, Hispanic, and other people of color who have  helped shape this country.\n\nThe Department of the Interior under this administration recently  removed a slavery-related exhibit at Independence…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…This Chamber has decided to continue funding for ICE without any  accountability whatsoever.\n\nAs we begin negotiating to fund DHS for the rest of the year, the  Congressional Hispanic Caucus is unified in demanding real  accountability provisions, including requiring ICE agents to identify  themselves, prohibiting agents from wearing masks during enforcement,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…communities, Medicaid reaches 20 million       individuals, protecting nearly one-third of community       members, more than half of Latino children, and roughly 30       percent of Hispanic elders. Without these vital programs, it       would be higher hospitalization rates, delayed diagnoses, and       increased mortality. This would become the norm, placing…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…stark. In 2023, the Boston Public Health Commission reported that  diabetes mortality for Black women was three times that of White women.\n\nThe same report detailed that our Hispanic and Latino neighbors were  four times more likely to end up in the emergency room for asthma  emergencies compared to White residents and our Black neighbors nine  times more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…policies that return war powers to the United States  Congress, as enshrined in the United States Constitution.\n\nThat is why I and the executive board of the Congressional Hispanic  Caucus will propose a forward-looking framework for a democratic and  stable Venezuela. As members of the Congressional Hispanic Caucus, we  come from different nations in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…ESPAILLAT. Mr. Speaker, I thank Congresswoman Ramirez for her  leadership in this special hour, and I thank the Congressional  Progressive Caucus, as well as the Congressional Hispanic Caucus, and  all the other Members associated with this special hour.\n\nMr. Speaker, I rise today to forcefully speak against the Trump  administration's horrific ICE abuses,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Hispanic American  Heritage Month to pay tribute to a distinguished community leader from  Rochester, New York, Padron-Morales.\n\nAs co-founder of Hipocampo Children's Bookstore, Henry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…said, by an unprecedented, historic  coalition. Support spans 95 bipartisan cosponsors across 35 States,  including the Fraternal Order of Police, Major County Sheriffs,  Hispanic American Police Command Officers Association, Peace Officers  Research Association of California, African American Mayors  Association, Moms Against Police Brutality, and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700042/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…of statements that have been entered into the Record,  but I figured we would start with this one from February 19: ``Dear  Speaker Johnson, as members of the Congressional Hispanic Conference-- ''\n\nThat is different than the Congressional Hispanic Caucus. The  Congressional Hispanic Caucus right now is fighting hard on behalf of  the healthcare of the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…history of advocacy began when as a high school student,  she became involved with Guadalupe Center as a volunteer in the 1950s.  As she saw the many families in predominately Hispanic neighborhoods in  Kansas City who lacked access to food, running water, and electricity  disturbed her, she questioned the morality behind sitting by when  others lived that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today in recognition of National  Hispanic Heritage Month and to commend the extraordinary work of the  Miami-Dade County Hispanic Affairs Advisory Board.\n\nEach year, our Nation honors the history, culture, and countless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695658/recognizing-hispanic-heritage-month-and-the-miami-dade-county-hispanic-affairs-advisory-board"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Senate. Let them take the floor.  Let them look at 51 Republicans sitting on the Senate floor who want to  move a bill that 85 percent of White Americans, 82 percent of Hispanic  Americans, 76 percent of Black Americans, 71 percent of Democrats, and  95 percent of Republicans believe we should pass so that we can have  security in our elections.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the country by having unfettered immigration, but also to  divide America by groups. Part of that was when he passed one of his  big bills, and he put in there an American Hispanic museum. This is  consistent with the Democratic policy of trying to divide America.\n\nOur motto put in place in 1782 was E Pluribus Unum, Out of Many, One.  The Democrats are…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692121/opposing-funding-for-museum"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…bill itself has a ton of  support, to include the Fraternal Order of Police, Major County  Sheriffs, the National Organization of Black Law Enforcement  Executives, NOBLE, Hispanic American Police Command Officers and their  associations, Peace Officers Research Association of California, and  the Federal Law Enforcement Officers Association.\n\nAgain,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…is exactly what the election yielded.\n\nWe, in our party, had a record number of Black and African-American  voters come to the Republican Party. We had a record number of Hispanic  and Latino voters come to the Republican Party, a record number of  Jewish voters and union workers and suburban women and urban voters.  They came out in record numbers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…undergraduate full-time       equivalent students (as defined in section 312(e) of such Act       (20 U.S.C. 1058(e))) that is a total of at least 50 percent       Black American, Hispanic American, Asian American (as defined       in section 371(c) of such Act (20 U.S.C. 1067q(c))), Native       American Pacific Islander (as defined in such section), or…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…amend the Public Health Service Act to provide for  a behavioral and mental health outreach and education strategy to  reduce stigma associated with mental health among the Hispanic and  Latino population, and for other purposes; to the Committee on Health,  Education, Labor, and Pensions.", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694217/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…piece of legislation that  involves the tax code isn't legit, it is just atrocious.\n\nHere is a list of people that support it: The African American Mayors  Association. The Hispanic American Police Command Officers Association,  the Federal Law Enforcement Officers Association, the Fraternal Order  of Police, Major County Sheriffs of America, Peace Officers…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of Democrats across this  country, over 90 percent of Republicans, and well over 70 percent of  virtually every ethnicity and ethnic group in the country--Black  Americans, Hispanic Americans, White Americans, men, women, rural,  urban--overwhelmingly support voter identification and ensuring that  only citizens vote.\n\nFact five: We passed the SAVE Act…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…from every state, denomination, and ethnic  background.\n\nHer earlier career includes serving as Deputy Political Director at  the Republican National Committee, Director of Hispanic and Women's  Affairs in the George W. Bush White House, and Senior Advisor to two  U.S. Attorneys General at the Department of Justice. As a She Leads  America honoree, Jennifer…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Americans are in favor of requiring a photo ID to vote. That is not  Republicans. That is all across the spectrum. Over 70 percent of  Democrats support picture ID, 82 percent of Hispanic Americans support  picture ID to vote, and 76 percent of Black Americans support a picture  ID to vote.\n\nIf they still want to lie to people on the other side, Mr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Speaker, I rise today to recognize the Suarez-Delgado  family from my district for Hispanic Heritage Month. Their story is one  of resilience, devotion, and the pursuit of opportunity, one that  reminds us of the enduring promise of the American Dream.\n\nFather Jaime…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Hammond, who owns Atlas Electrical Air  Conditioning, Refrigeration & Plumbing Services. Sarah is known as a  pillar of her community, serving as chair of the Rio Grande Valley  Hispanic Chamber of Commerce and helping to oversee the management of  Hummingbird Trailer Park. On top of this, she is involved with an  organization dedicated to helping develop…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…appointed Captain of Patrol, the largest  division of the Lancaster City Bureau of Police.\n\nIn July 2022, Chief Mendez was sworn in as Chief of Police, becoming  the first Hispanic police chief in the bureau's history. During his  tenure, the bureau achieved accreditation from the Pennsylvania Chiefs  of Police Association and implemented significant…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Modern Healthcare; Mc Cann, Charlotte:       Economist; McCarthy, Mia: Politico; McConnell, William:       Law360; McCue, Daniel: The Well News; McDonald, Natashka:       Hispanic Link News Service; McFarland, Pamela: Engineering       News-       Record; McIntire, Mary Ellen: Roll Call; McLeod, Paul:       Capitol Forum; McMahon, Kevin: Townhall; Mejdrich,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}]