[{"senator": "Jason Crow", "party": "Democrat", "sentence": "This fellowship is awarded to educators  who demonstrate an outstanding commitment to civic responsibility and  education in the areas of American history, American government, or  civics.", "title": "Recognizing Jasmine Baker", "date": "2025-04-07"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Just 2 days ago,  our colleague Cory Booker, from the State of New Jersey, ended a  filibuster on the floor after 25 hours--broke the record, longest  speech in the history of the Senate.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Since its incorporation in  1955, AHF has provided a cultural bridge between Hungary and the  Hungarian American community through history, arts, and tradition.", "title": "-9999", "date": "2025-04-07"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "Senator Thompson developed a reputation as a respected local  historian for compiling the history of African Americans in Central  Florida and authoring the book ``Black America: Orlando, Florida.'' She  developed a passion for the history of African Americans in Central  Florida.", "title": "Recognizing Geraldine F. Thompson's Service to the Great State of Florida", "date": "2025-04-03"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "The Secretary of State of Georgia, in 2022, led a massive examination  of the history of voting in Georgia, and the Secretary of State says he  could not find a single noncitizen that had cast a ballot in Georgia in  25 years.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "safer, but the facts and history prove otherwise.", "title": "Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia", "date": null}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "This legislation would change that, honoring one of the greatest  minds and patriots in American history.", "title": "Procurement and Placement of Statue of Benjamin Franklin in the United States Capitol", "date": "2025-02-26"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "The Trump tariffs represent the largest tax hike in American history.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, that is a lot of words to defend the most closed  Congress in history.", "title": "Providing for Consideration of H.R. Student Compensation and Opportunity Through Rights and Endorsements Act; Providing for Consideration of H.R. Combating the Lies of Authoritarians in School Systems Act; Providing for Consideration of H.R. Transparency in Reporting of Adversarial Contributions to Education Act; Providing for Consideration of H.R. Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act; Providing for Consideration of H.R. Small Business Regulatory Reduction Act of Providing for Consideration of H.R. Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "It is  historically unprecedented in the history of our country during  peacetime.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "History teaches that unlawful uses of force cannot be excused by  secrecy or by claims of simply following orders.", "title": "Supporting the War Powers Resolutions", "date": "2025-12-17"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "He led the effort to create the  Kwiyagat Community Academy, dedicated to teaching Ute history,  language, and culture.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "After  fourteen years, Dorothy stands as the longest-serving Council Member in  Metuchen's history.", "title": "Recognizing Dorothy Giamboi for Nearly Fifteen Years of Public Service", "date": "2025-12-11"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, today, I introduce the Salary History  Question Prohibition Act of 2025, which would help reduce the gender  and racial pay gap by prohibiting employers from asking job applicants  for their salary history before making a job or salary offer.", "title": "Introduction of the Salary History Question Prohibition Act of 2025", "date": "2025-03-18"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "And after surrendering Czechoslovakia in  exchange for a peace pledge, when he returned to England, Chamberlain  waved about a piece of paper with Hitler's promise and declared,  ``Peace in our time.'' In reality, it was the beginning of the  capitulation that would lead inextricably to the greatest war in  history.", "title": "Ukraine", "date": "2025-02-27"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "I don't know where Speaker  Johnson got his patience from, but it must be God-given, because his  support throughout this process working with us, never giving up,  trying to restore regular order, has been incredible and I think  unparalleled in the history of the speakership, in my view.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-02-03"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "We have had dark chapters in our history, certainly: the McCarthy  era, the Red Scare, periods when we were not as committed to free  speech as we might be.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Whatever a person makes today, the greatest thing about America, the  greatest country in the history of the world, is that whatever someone  is today, however much they make today, wherever they came from today,  they can be anything they want to be if they work hard, play by the  rules, and follow their dreams, whatever that dream is, even if that  person wants to be a billionaire\n\nMr.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Just a few days ago here in this Chamber, House Republicans voted to  deliver the largest tax cut in American history.", "title": "Condemning Anti-Semitism", "date": "2025-06-05"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "President Trump is credited with  having the most secure border in history.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "Let's make history today.", "title": "Tools to Address Known Exploitation By Immobilizing Technological Deepfakes on Websites and Networks Act", "date": "2025-04-28"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Speaker, I thank our Senate colleagues for passing this critical  legislation, and I encourage all of my House colleagues to support the  HALT Fentanyl Act so we can get this to the President's desk and stop  the greatest poisoning in American history.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Now, as NASA takes on some of the most significant tests in its  nearly 70-year history, including the beating of China and other  adversaries back to the Moon and positioning America for historic deep- space exploration, the Agency needs a permanent, Senate-confirmed  leader.", "title": "-9999", "date": "2025-12-17"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Alex's dedicated work ethic and sharp sense of humor have made him an  integral part of our team, keeping me and my office on track, smiling,  and teaching us Armenian history along the way.", "title": "Recognizing Alex Keledjian", "date": "2025-05-08"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Speaker, I rise today to recognize a group of  remarkable young women from the plains of West Texas who are making  history on the national stage, our Texas Tech Lady Raiders' softball  team.", "title": "Recognizing Texas Tech Girls' Softball Team", "date": "2025-06-05"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Congress passed the largest tax cut in American history,  delivering relief directly to families and workers.", "title": "Highlighting Republican Successes in 2025", "date": "2026-01-21"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "As we commemorate this remarkable milestone, we not only honor the  department's rich history, but also pay tribute to the men and women,  past and present, who have answered the call to protect life and  property in times of need.", "title": "Recognizing the 150th Anniversary of the Leesburg Fire Department", "date": "2025-07-23"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Speaker, I think it is important to set the scene in  contrast to some of the revisionist history that Democrats seem to be  talking about today.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "James Lankford", "party": "Republican", "sentence": "It became the largest student prayer movement that we know of in the  history of the Nation.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": null}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "It was one of the  deadliest days in special warfare history.", "title": "Recognizing the 20th Anniversary of Operation Red Wings", "date": "2025-06-25"}]