[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…ADAMS. Mr. Speaker, I thank Ms. De La Cruz for yielding time.\n\nMr. Speaker, on the final day of Women's History Month, I rise  tonight to highlight the value of the Women's History Museum. Karen  Staser founded the museum in 1995 with the aim of addressing the  significant amount of women's history that was missing from our  Nation's Capital and museums,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…attempting to ``rewrite history'' with the  latest executive order targeting the Smithsonian Institute.  Specifically, the Executive Order singles out the African American  History Museum for its ``corrosive ideology.'' Before these relatively  recent attacks, diversity itself had been the goal--in fact, the Brown  v. Board of Education decision in 1954…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…is no better way to honor the prolific and powerful  contributions of women in this country than to finally authorize the  creation of the Smithsonian American Women's History Museum on The  National Mall.\n\nAs one of the original cosponsors of this bipartisan bill, I feel  strongly that this museum must become a reality.  The National Mall here in Washington,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689368/womens-history-month"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Pullman Porter Museum's  Juneteenth parade, games, and concert. Or the Cook County celebration  at Malcolm X College, the Juneteenth Annual barbeque at the DuSable  Black History Museum, or 1865 Fest in West Garfield Park, to name just  a few. Events like these are not just festivals: they are declarations  that we will not be silent. We will celebrate.…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…State of Louisiana for  yielding.\n\nI would like to read for you, Mr. Speaker, a speech that the  Honorable George W. Bush gave at the inauguration of the African  American history museum. I was proud to be in attendance there, and I  must say I was not a big fan of the Presidency of Mr. George Bush, but  now, looking back over the times from which we have…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the first Bipartisan  Women's Caucus of the year to stand in solidarity with my colleagues in  this historic caucus as we continue the work to break ground on a  Women's History Museum on Washington's National Mall.\n\nI would like to thank my colleague and cochair, Representative Monica  De La Cruz for organizing this Special Order hour. I would also like…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…pass it.\n\nToday isn't just about remembering the Emanuel Nine. It is also about  confronting the attacks on Black history. President Trump called the  African-American history museum oppressive and gave Vice President  Vance the power to erase Black history.\n\nMr. Speaker, 44 States now are debating laws to limit the teaching of  Black history. One Pennsylvania…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692130/defending-black-history"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…important to the legacy of this Nation.\n\nThe importance of showcasing women's achievements, sharing our  stories and teaching our history, cannot be overstated. Women's History  Museum offers young girls the opportunity to see themselves in history  as active agents of change. When we teach the history of women, we are  teaching the history of humanity,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…patriotism, and principle.\n\nHistory is not just simply about the past. It is about what we pass  on to the next generation. That is why the Smithsonian American Women's  History Museum is such an important project. It ensures that these  stories are not only preserved and honored but shared with all  Americans. Our daughters and granddaughters should…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689364/womens-history-month"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…U.S. Supreme Court, paving the way for  greater female representation in our legal system.\n\nMost recently, President Trump authorized the Smithsonian American  Women's History Museum in 2020. In his first few days of his second  term, he signed an executive order to protect women in sports.\n\nToday, we are fighting to get that museum that was authorized…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}]