[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…Nevada knows that my mom, my aunt, my uncle, my other  aunt--they live in Nevada. My mom lives in a retirement community  there. This Governor knows that that State would be hit so hard by a  reduction of these services that it would be like an impact that  ripples out throughout the State, raising costs, lowering care, hurting  Americans, hurting Nevadans.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…what they are able to do for the retirees.\n\nHowever, the country pre-ACA, Affordable Care Act, ran into some  severe challenges. Ford had gotten its loan before the recession hit,  and General Motors and Chrysler hadn't done that. They were tragically  and frighteningly staring bankruptcy in the face. So, Mr. Speaker, what  I was able to do was, being…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…them more expensive and harder to find.\n\nThose are just a few examples.\n\nThere are countless other imports that American businesses and  families rely on that are going to be hit hard, and these tariffs do  nothing to bring down those costs. They do just the opposite.\n\nThese tariffs could add $1,200 to an average household's yearly cost,  and we won't…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…today. We had back-to-back floods in 2023  and 2024, doing about a billion dollars' worth of damage.\n\nAnd by the end of last year, every county in Vermont, all 14  counties, were hit by flooding. That billion dollars in damages  affected homes; it affected businesses; it affected farms.\n\nWe had 6,000 tons of debris that was removed, 77 State bridges and…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…officer with a video camera  has his weapon just with him. This officer, as she turns away, shoots  her and then, as she is passing by, shoots again.\n\nI assume the first shot hit her. I don't know whether it did or  didn't. That is my assumption, so I am saying that. But we do know  this: There were additional shots fired as she passed by through her…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…hospital. He  served with the Phoenix Police Department for 5 years and is survived  by his wife and infant daughter.\n\nOfficer Buckner was killed on March 31, 2024, when he was hit by a  car while responding to a reported crime. He is survived by his wife,  mother, sister, and three brothers.\n\nMr. Speaker, 23-year-old Joshua Briese was shot and killed…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…are not funded and so that money comes out of  the trust fund.\n\nPresident Trump has now proposed a tax cut for Social Security that  is unpaid for. That is over a $900 billion hit to Social Security and  all the constituents who receive it.\n\nMr. Speaker, I know you to be a man of goodwill and you understand  your district and what your people need, as…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Medicare from the  ``Beautiful For Billionaires'' bill is $491 billion. That is where I  get half a trillion from. I am rounding the $491 billion number CBO  gave us for the total hit to Medicare done by Republicans in their  ``Beautiful For Billionaires'' bill.\n\nTo head this off, we are going to have to pass legislation that  exempts Medicare from those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…marketplaces, but Republicans refuse to extend these  tax credits for middle-class Americans in their big, ugly bill.\n\nIf we don't act now, millions of Americans are going to be hit with  huge premiums for the upcoming year. The nonpartisan Congressional  Budget Office has estimated that these premium increases will lead to  4.2 million Americans losing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…programming  for millions of American households, particularly in rural areas. I  don't know what my colleagues have against rural areas, but those areas  will be particularly hard hit by those cuts.\n\nIt is important to note, once again, that many of these rescissions,  especially to foreign aid, have already started to hurt and even kill  people. That is…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…President of the United States, who  stood at that podium and delivered a manifesto of pure fantasy.\n\nHe says he wants to make America affordable again. Well, inflation  just hit a 7-month high, and his new trade war will cost families  $2,000 more a year.\n\nTrump says he wants to balance the budget. His plan would add $3  trillion to the deficit to give…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…income is up, and, sometimes, their income is  down. And, sometimes, they want to enroll, and, at other times, they  don't. It is precisely this kind of person that is going to be hit the  hardest by the Trump rule and why I am so strongly in support of my  colleagues' efforts to repeal it.\n\nYou know, we often say--and I will conclude--that small businesses…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…can spiral into a conflict and from a conflict into an  all-out war.\n\nWhile Trump tries to claim their targets are boats from Venezuela, in  reality, reports show strikes have hit boats from Colombia and  apparently those carrying citizens from other neighboring countries.\n\nThe administration has even admitted they don't know each individual  identity…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…this administration hasn't had an overdraft  fee recently. I am guessing--I think it is an educated guess--that Elon  Musk has not had an overdraft fee recently.\n\nOverdrafts hit people who are living paycheck to paycheck, people who  are at the bottom rung of our economic order through no fault of their  own--often the result of discrimination and denial…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…able to receive  care, for all people to be able to receive care.\n\nThe disparities in access we know are well documented, so we know  that that burden will disproportionately hit the African-American  community. This is places that have contributed so much to this Nation,  places like Tuskegee, Alabama, that gave us so much, places like Troy,  Alabama,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…energy approach to ensure the grid's  reliability.\n\nIn fact, on July 9, Arizona's largest utility providers, APS and SRP,  reported a State record of energy demand as we were hit by a heat wave.  Luckily, Arizona did not have a blackout, but we must meet the growing  needs for electricity.\n\nMr. Speaker, this has been a legacy priority of mine since 2015.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…our  roads safe from illegal immigrant truckdrivers. Delilah, a beautiful 7- year-old girl, up in the audience, in the Gallery, with her dad--when  she was 5 years old, she was hit by an illegal immigrant driving a  semitruck and seriously injured. She has made a remarkable recovery but  is still injured to this day. When President Trump called on us to…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…onslaught of  overreaching Federal regulations that have made goods less affordable  in the United States of America.\n\nUnder the Biden-Harris administration, small businesses were hit with  an unprecedented $1.8 trillion--not billion--$1.8 trillion in new  regulatory costs while inflation soared over 20 percent.\n\nWhere do you think that cost goes, Mr. Speaker?…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…served in Iraq and Afghanistan,  he is no stranger to perilous situations. And this specific situation  was personal to him. ``I've got grandkids about the same age, so it  just hit pretty close to home. Serving the public is what we're here  for; it is what we do. I hope anybody in that situation would have done  the same thing,'' Mr. Wells said.\n\nOn behalf…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690127/recognizing-the-heroic-actions-of-mr-danny-wells-of-peculiar-mo"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…percent tax hike, meaning on average they will pay  $1,695 more in taxes; 40 million families will see their child tax  credit cut in half; and 26 million small businesses would be hit with a  43.4 percent top tax rate. This is over 20 points higher than what  businesses pay in Communist China.\n\nBecause of House Republicans and President Trump, American workers…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to tell truth.\n\nSo many people, like this very moment, there will be someone on cable  television on the left and the right doing their talking, getting  people's dopamine to hit, but it is not honest math. The math is really  hard. It is really complex. There is a way to make it work, but we have  only a couple more years, I believe, to provide the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resources. We got different services,  and we had ads all over TV in Alaska about choosing respect--real  Alaska men choose respect; they don't commit these heinous acts; they  don't hit their girlfriend; they don't do any of that kind of horrible  stuff.\n\nAnd it started to work in my State, to change the culture, which  wasn't a good culture in Alaska. We are…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…designed to put them and their loved ones in danger.\n\nThe ICE officer in Minnesota who opened his voicemail to hear a  caller tell him:\n\nI hope your wife dies. . . . I hope you get hit by a bus       and you're paralyzed and your wife leaves you.\n\nThe FBI agent in Minneapolis who received a voicemail promising to  kill him, his wife, and his daughter, stating…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…produces enough natural gas  to heat 15 million homes for an entire year, equivalent to 100 billion  kilowatt hours of electricity.\n\nU.S. electricity consumption is projected to hit an all-time high  this year, and electricity demand will grow by as much as 128 gigawatts  through 2029. Fueled by new data centers and AI, these estimates of  electricity demand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…tuition has risen  four and a half times faster than the rate of inflation.\n\nWhen Democrats passed the Inflation Reduction Act and spent $1  trillion on subsidies, inflation hit a 40-year high. It is clear that  pouring taxpayer money into our broken healthcare system will only  drive prices higher.\n\nAs we debate healthcare costs, the solution is not…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697139/skyrocketing-cost-of-healthcare"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…welfare checks.\n\nThe Mississippi Department of Wildlife, Fisheries, and Parks is  assisting with welfare checks and emergency calls in Alcorn and Tippah  Counties that were hit so hard.\n\nNumerous State agencies are playing vital roles in the response,  including the Mississippi Emergency Management Agency, Mississippi  Department of Public Safety,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…There is hope. There is a path. There is  a solution.\n\nI also have one of my economists who makes it very clear. We may have  only about 36 more months, and then we start to hit what is referred to  as sort of the interest rate feedback loop. Remember, a year ago, I  think we had 3 or 4 months where this government had to borrow money to  pay for our…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…While real wages are rising and inflation is nearing a 5-year low,  there is more to be done to lower costs for families and small  businesses. Washington regulations often hit Americans hardest in rural  communities like the ones I represent. Commonsense regulatory relief is  not about cutting corners. It is about letting people work, grow, and  innovate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…even my economists were predicting over the last year.\n\nWe are seeing some data right now--if you actually look at the  Atlanta Fed, GDPNow, nowcasts, some of these--we could hit a five- handle this quarter, which is remarkable.\n\nLooking at some of the data from the third quarter of 2025, it looks  like the number of a 4.3 percent GDP growth is going…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…``If it moves, tax it. If it keeps  moving, regulate it. If it stops moving, subsidize it.''\n\nToday, Washington has regulated the same thing twice. Manufactured  homes are being hit with overlapping energy mandates from HUD and the  Department of Energy. The Affordable HOMES Act fixes this by repealing  DOE's separate energy rules, restoring clear authority…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698636/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]