[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…when I was first  elected to Congress, there was a Congressman from California named Tom  Lantos. He was a Holocaust survivor. He was from Hungary, and he was  imprisoned by Hitler. He used to come to the floor, and he fought so  hard for the fall of the Soviet Union and for liberty across Europe.\n\nI remember him and I want to honor him this evening and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…pardoned by President Trump.\n\nOr consider Timothy Hale-Cusanelli, whom prosecutors identified as a  ``white supremacist and Nazi sympathizer.'' He told his coworkers that  ``Hitler should have finished the job'' and frequently dresses up as  Adolf Hitler.\n\nAt Hale-Cusanelli's sentencing hearing, Judge Trevor McFadden, a  Trump appointee, said ``Statements…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…nomination was doomed, regardless. I would say  that all of these disqualifications by themselves pale in comparison to  Mr. Martin's long and troubling relationship with a Hitler-loving neo- Nazi named Timothy Hale-Cusanelli, who was sentenced to 4 years in  prison for breaching the Capitol during the January 6 attack.\n\nHale-Cusanelli is an outspoken…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, like Hitler, Mussolini, and  Saddam Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically ended free and fair…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…which everyone  in this Chamber agrees should be condemned.\n\nSomehow, once again, this resolution fails to condemn some of our  history's most terrible dictators, like Adolph Hitler and modern-day  dictators like Vladimir Putin, who is responsible for killing countless  people in Ukraine, or President Xi who basically runs actual  concentration camps for…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and act as if we are one of the  thug nations of the world ourselves.\n\nSaddam Hussein's Iraq seized Kuwait. Vladimir Putin's Russia launched  war to take over Ukraine. Adolf Hitler grabbed Poland and  Czechoslovakia and, for a while, all of continental Europe. Mussolini  took Ethiopia, and Chairman Xi has long coveted Taiwan. Each presented  their flimsy…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…named to be the acting U.S.  Attorney Ed Martin. He was just forced to withdraw that nomination  because he was standing by a Neo-Nazi Holocaust revisionist who said  that Hitler's problem was that he didn't finish the job. He also said  that those who are born with disabilities should be killed at birth. Ed  Martin called him a great man and a great…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…is a place that  has inauspiciously become a shorthand for the ``appeasement'' of  tyrants.\n\nIn 1932, British Prime Minister Neville Chamberlain left his meeting  with Adolf Hitler in Munich. And after surrendering Czechoslovakia in  exchange for a peace pledge, when he returned to England, Chamberlain  waved about a piece of paper with Hitler's promise…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…very hungry for that. We must learn the lessons of  Neville Chamberlain in 1938 and 1939, where he thought he was going  somewhere toward peace and, of course, 1 year later, Hitler walked into  Poland.\n\nWith that, Mr. Speaker, I thank my friend very much for yielding.\n\nSlava Ukraini.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…starting line.\n\nThis is not just another issue. Nobody has done it here today, but  when we hear people out and about who will compare our current politics  to the Nazis or to Hitler, I hope we all will remind them that it is  not the same. There are moments to have vigorous debates, but it is not  the same. Perhaps when those terms are used, it cheapens…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…north of Naples, on April 29, 1945, when nearly 1  million Axis troops capitulated--the largest surrender of German forces  at that point in the war. The following day, Adolf Hitler's death  marked the collapse of the Nazi regime--a turning point made possible  by the military operations comprising the Italian campaign.\n\nThis resolution acknowledges the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…where might  he go for refuge? The only place he could go is Moscow. So that is the  company Vladimir Putin keeps in current day.\n\nBut Putin even echoes the likes of Adolf Hitler. Putin routinely  talks about ``liberating'' the Russian-speaking Ukrainians living in  the Donbas and other areas of Ukraine. This is the same vile, absurd  pretext that Adolf…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…good friend Senator Sanders, your solution will lead to World  War III. You will appease evil.\n\nWorld War II happened because people like Senator Sanders did not  stand up to Hitler. They did not choose wisely, and they did not stop  him when they could. That is exactly what is going on now.\n\nUntil this religious Nazi regime gives up their desire to destroy…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Second World War claimed tens of millions of lives, displaced  tens of millions more, and left the old world crippled by food  shortages and hyperinflation.\n\nAfter defeating Hitler's genocidal bid for world domination, American  leaders understood that our interests and those of our European allies  were linked, whether we liked it or not. As George Marshall…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…planet. They have been that way since 1979.\n\nI wonder what they want to do.\n\nThe Ayatollah's nuclear ambitions have been spread and fed for  decades now. I take him seriously.\n\nHitler wrote a book. Nobody believed he wanted to kill all the Jews.  They should have. Hitler wrote a book about a master race. People  should have taken him seriously. They wrote…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}]