[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…their premiums skyrocket.\n\nA Kaiser study, just today, came out: double the premiums--double the  premiums.\n\nThat is why one of my hospitals told me: Look, of course Medicaid  hits us hard. Of course, Medicare does. But so many of our patients and  the people who visit our clinic are on MNsure--that is the Affordable  Care Act plan in my State--that, if…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…access to stable export  markets. Our small businesses, like local breweries that depend on  Canadian aluminum for cans, are feeling the pinch.\n\nWhen tariffs slam the border, it hits the bottom line for small  businesses in Syracuse, Utica, Auburn, Cortland, and other communities  across my district.\n\nWhile we are fighting those challenges, the Trump administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…a few things: Groceries are not a luxury; food should never be  a bargaining chip; and working families should not be collateral damage  in Trump's reckless trade wars. This hits everyone at the  kitchen table. Every person needs to eat. You shouldn't be collateral  damage in Trump's reckless trade wars. Let's prove this Chamber can  still act on the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…together and find a path  forward.\n\nI urge my colleagues on both sides of the aisle to come together to  pass this bill now and fund SNAP and fund WIC before this hunger crisis  hits our communities.\n\n3071, introduced earlier today; that the  bill be considered read three times and passed; and that the motion to  reconsider be considered made and laid upon…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…They look particularly at the cost  savings overall, and the savings they estimate here are huge. It is  $6.5 billion in utility bill savings over the next 30 years.\n\nThis also hits home in my community because many of the businesses  and many of my neighbors are rebuilding from Hurricanes Helene and  Milton. They were flooded out. They lost their appliances.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…of them is going to have an emergency next  year.\n\nWell, that is the Republican plan for Laurie and her husband: Just  cross your fingers. Pray that no healthcare catastrophe hits your  family for a year--because they cannot afford $26,000 a year, up from  $6,000 a year.\n\nSo the Republicans are asking Americans to trade their health  insurance for hope,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…that has been in  place since 1962 that was meant to make sure that people were not  discriminated against.\n\nIt means something a little bit different when the administration  hits a pause on funding to 1890 land-grant institution scholarships  while not hitting a pause on that funding to 1862 land-grant  institution scholarships.\n\nIt hits a little bit…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…killing 5 people and hitting  the Cabinet of Ministers of Ukraine. The Tuesday before, a glide bomb  killed 23 Ukrainians. Just last night, Russian and Belarusian drones  made 19 hits in sovereign Polish airspace, scrambling NATO F-35s and F- 16s to fend off civilian casualties.\n\nIt was Ukraine's air force that alerted their neighbors in Poland to  these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…nothing excessive about needing insulin or a  wheelchair or therapy. This isn't luxury. It's survival. My son is on  the autism spectrum.\n\n``And let's be real about who this hits the hardest: children, people  with disabilities, and low-income seniors. These are Americans who rely  on Medicaid to live with dignity, to have food  on the table, to get…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…how about the families who paid for these products that have been  taxed by the Trump tariff tax? They deserve relief too. If we are  concerned about the cost of living as it hits American families, they  need to have some relief, too, and the President, after losing in the  Supreme Court, should pay this money back.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…$20  billion in bailout money to Argentina and perhaps another $20 billion  in private funding. What he is doing in tariffs has been eclipsed by  all the other stuff, but it hits Americans in their pocketbooks.  Groceries are skyrocketing in price. Americans are finding it more  difficult to put food on the table. Farmers are being crushed by these…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…prescription drugs, in  terms of the impact that this bill will have. There was a lot of hope  that maybe in the Senate this bill might be fixed and addressed,  particularly because it hits rural hospitals so hard. There are so many  Republicans in the majority caucus in the Senate that obviously are  going to feel the pain if this provision goes through.\n\nUnfortunately,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692841/stop-this-insane-attack-on-healthcare-that-affects-every-single-american"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…its magnificent and diverse natural beauty, Oregon has become a much  sought after location for film production. As the backdrop for major  television shows and box office hits alike, film production in Oregon  brings with it good-paying jobs and tourism that in turn support local  businesses and economic development across the State. Certainly all…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…currently, our Great Lakes economy is being choked by  reckless tariffs and inside-out trade policies that hit us hard,  including the district I represent in northwest Ohio. It hits our  pocketbooks and it hits the balance sheets of thousands of companies.\n\nTake a drive through the Port of Toledo. You will see mountains of  aluminum and steel stockpiled,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…didn't want to stand up and tell me about  the mental health crisis in America and how poorly we were doing. So  when the Mental Health Liaison Group starts off with that, it hits me  very hard.\n\nI still remember meeting with a guy in a New Jersey diner who had  mental health issues, was a teacher in a high school, and he stabilized  his mental health…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…400,000 injuries.\n\nThose crashes do not discriminate, Mr. Speaker. The victim could be  me, it could be you, it could be anyone in our families or in our  communities.\n\nThis issue hits close to home for me. There was a newlywed couple  from my hometown of Enterprise, Alabama, named Angel and Jeremy Seay. I  knew this couple personally. I knew their family.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…Imagine this: We have a snowstorm coming. A mom takes her kids out to  go to the grocery store. It is snowing, and they are trying to get some  groceries before the big storm hits. She swerves for a pothole. The  neighbor's pet gets in the way, and she swerves for that. A first  responder goes by. She pulls over.\n\nHer car says: You have one more swerve,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…forgotten  worker. We are going to fix healthcare. We are going to fix  affordability. Gas prices are already coming down. Grocery prices are  coming down. Wait until that tax cut hits in 2026.\n\nMr. Speaker, I urge support of H.R. 4593 and so should you.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Coach Timmy Wakeman and Assistant Coach Jamey  Mantz, who instilled belief in players like Kristen Hockman, whose bat  sparked the offense; Veronica Gordon, who delivered key hits; and  Keriana Stottlemyer, who set the tone with her patience at the plate.\n\nSerenity Burnshire and Carsyn Burton added crucial doubles, and  Vanessa Gordon's sacrifice fly…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…progress by removing Federal barriers  so homes can be built faster and economically at scale without new  Federal spending.\n\nToday, it can cost over $100,000 before a shovel ever hits the dirt  to build a new home, and builders often cannot build a home for less  than $250,000. This bill modernizes housing laws, improves coordination  between HUD and USDA,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699948/housing-for-the-21st-century"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$30 billion or something in a supplemental bailing  out farmers. What happens when we need more money for California  wildfires, or what happens when there is a hurricane that hits Florida  or, apparently, North Carolina or Tennessee? Is that $5 billion, $20  billion, $30 billion, $50 billion? You see, Congress doesn't have the  ability to say no to spending.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…a significant mental  health challenge. With 96 percent of farms in Ohio's Second  Congressional District being family farms, this demonstrates how close  to home this issue hits my district.\n\nWith the devastatingly high rate of mental health challenges and  substance abuse issues across our country, where a person lives  shouldn't dictate their ability…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Meuser). I think it is actually one of  the most important things to be focusing on right now.\n\nMr. Speaker, I take a lot of questions from folks back home. Utah is  a State that hits above their weight in academic outcomes. We have  large families. This is a big, big deal for us.\n\nThe confusion of why would you dismantle the Department of Education,  I will…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…career in  baseball and football. He went on to graduate from East Tennessee State  University, Mr. Speaker.\n\nKenny has cemented himself in American history with his timeless  hits. While I know the accolades mean very little to a man of his  character, I am going to name a few of them anyway.\n\nKenny has won four Country Music Association Entertainer of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689157/recognizing-kenny-chesney-on-his-birthday"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…go up and cause your electronics to go up, no one is going to help you;  you will just pay higher prices. If you think the cost of eggs is high,  just wait until the tariff hits.\n\nTariffs will raise the price of a car between $5,000 and $15,000.  Despite arguments to the contrary, Americans know that tariffs are a  tax they will have to pay. That is…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…cuts about $7 billion in new natural gas taxes on energy  producers--$7 billion of new taxes. Where did it come from? It came  from the Democrats.\n\nThis tax on American energy hits American families who use the energy  to heat their homes. It was mandated by the Democrats' reckless tax- and-spending bill. The Democrat tax penalizes oil and gas production…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…saves nine.\n\nThe same principle applies to flood resilience and mitigation  infrastructure. When we invest in levies and floodwalls, communities  are protected when the storm hits, and the Federal Government saves  billions in a recovery effort that never has to be done.\n\nIf you go down to South Louisiana, for example, you will see homes  elevated by…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…truth?\n\nNext year, for every dollar of tax collections, we are going to spend  $1.43. Let's say you are the most liberal Member here. Do you have any  understanding when this hits the wall, the devastation, the crushing of  poor people? How about if you are the most libertarian or free market?  Do you understand the crushing of the economic system, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…address water quality challenges using  voluntary, science-backed conservation practices that our landowners  and local partners are already engaged in implementing.\n\nThis issue hits particularly close to home for me. In the Hawkeye  State, we have seen some of the highest nitrate levels ever recorded in  our rivers and streams across Iowa. This year alone,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…legislation would give the courts the ability to deport  illegal aliens from America and bar them from reentry if they are  convicted of a DUI or a DUI-related charge.\n\nThis issue hits home for me. In my district, a 15-year-old girl and  her grandmother were killed by an illegal alien who was driving drunk.  This was a terrible, avoidable tragedy. Sadly, true…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}]