[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…supported him because he vowed to make the treatment  more accessible. How dare this man take that away from them.\n\nOur Nation has made great progress in the fight to eliminate HIV and  AIDS, building on an understanding of how to treat the virus and  getting closer to finding a cure--until now. Secretary Kennedy has now  cut funding for dozens of HIV-related…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…regional stability and mutual  security. These foreign military forces must be healthy and functional  to effectively engage with our forces and support these missions.\n\nThe HIV-AIDS epidemic has a devastating impact on many countries,  including on their militaries. It reduces readiness, unit deployments  become limited, and it saps the morale and capabilities…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Democratic  pet projects as some would have you believe. PEPFAR was established by  President George W. Bush and has saved more than 26 million lives,  while slowing the spread of HIV/AIDS around the world. Cutting these  kinds of funds is another death sentence for children and women who  depend upon lifesaving medication that costs us just pennies.\n\nIt cuts…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…part of a bogus  investigation into nonprofit support for undocumented immigrants.\n\nNo. 30, cut cancer research funding.\n\nNo. 31, cut diabetes research funding.\n\nNo. 32, cut HIV-AIDS research funding.\n\nNo. 33, cut heart disease research funding.\n\nNo. 34, cut mental health research funding.\n\nNo. 35, cut family caregiving research funding.\n\nNo. 36, cut funding…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Martinez Gonzalez. Omar is an advocate fighting for the resources that  immigrant, Black, Brown, and underserved communities need and deserve  to prevent, treat, and end the HIV/AIDS epidemic.\n\nAs a queer Latino immigrant, Omar has experienced firsthand the  importance of high-quality, culturally competent healthcare and HIV  prevention services. His experience…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…This bill doesn't make tough choices. It  makes stupid choices.\n\nThese rescissions would gut PEPFAR, a program that saved millions of  lives by preventing the spread of HIV and AIDS. It would slash funding  for malaria prevention, for maternal and child health, for clean water,  and for food assistance.\n\nThese programs are not giveaways. This money…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…slashed funding for  State and local health departments, substance use prevention and  treatment, mental health services, and eliminated funding for tobacco  prevention and HIV/AIDS prevention and treatment.\n\nTo top it all off, House Republicans continue to full-scale attempt  to eliminate public education, decimating support for children in K  through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…congressional spending directives they are  violating when they say they have terminated $1 billion in programs. It  could impact every single state.\n\nWe don't know how many HIV/AIDS patients have become sick because the  administration cut off funding for treatment or how many children are  sick with malaria or other preventable causes or how many malnourished…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…at home, because thanks to these programs around the world, we have  nearly eradicated polio, we have cut malaria deaths by half, and we  have saved 25 million lives from HIV/AIDS. And these successes  strengthen America's reputation on the global stage, they help counter  our adversary's influence, and they help us here at home, because it  means that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…vital investments in global health,  humanitarian aid, and economic and development assistance. There is  more than $9 billion for global health programs to help to fight HIV/ AIDS, malaria, TB, and polio. The funding also supports vaccination  efforts that the administration tried to eliminate and strengthens  maternal and child health programs.\n\nThe…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…American people.\n\nThe President claimed the United States was wastefully sending  condoms to Gaza. The fact is that they were sending them to Mozambique  to stop the spread of HIV and AIDS.\n\nThe President claimed that there was a wasteful $21 million grant to  India. The fact is the grant never existed.\n\nIt goes on from there.\n\nThe President claimed that there…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Outreach, Inc. (FMCO), providing critical support  services. Notably, he spearheaded initiatives like Job's Place, the  first assistance program for individuals diagnosed with HIV/AIDS in  Dougherty County, and collaborated with the City of Albany to combat  homelessness, successfully transitioning over 15 families to  sustainable living.\n\nOverseer Carter…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…PEPFAR. PEPFAR was  created by Republican President George W. Bush. He rallied our  government--Democrats and Republicans--to lead a national and  international effort to stop HIV/AIDS. For example, if a mother is  pregnant again and had HIV, the transmission of that disease to the  baby was, unfortunately, very common. We started finding ways to stop  it…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…funds had been made available for any Ebola response       activities.'' Whistleblower Nichloas Enrich, former Acting       Assistant Administrator for Global Health, USAID\n\nHIV-Aids Transmission And Deaths Are Increasing Because Of Cuts To                               Pepfar Funding\n\nCases of HIV have risen and they're seeing now       complications…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…leadership and taxpayer investments  in global health, including scientific, medical, and agricultural  research in my home State of New York.\n\nIt funds PEPFAR, which fights HIV/AIDS, well above the President's  anemic request. Since 2003, this program has saved over 26 million  lives. It also includes funding for programs that support the health of  moms…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…end subsidies that keep  health insurance affordable, or it is laying off thousands of  researchers working to help cure pediatric cancer or address ALS or do  research into HIV AIDS--decision after decision that moves us in  the wrong direction, that makes us sicker, poorer, and more divided.\n\nI am usually one of the first to walk across the aisle and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}]