[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…physical rigor, Gabriella and Emily have set and  achieved ambitious goals through perseverance and commitment.\n\nGabriella served the Blackfeet Nation in Montana, honed her field  hockey and Greek dance skills, and helped her family explore our  national parks.\n\nMeanwhile, Emily taught American Sign Language, distributed food, and  became a stronger swimmer…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…relationship  between America and Canada will take years to recover from.\n\nSenator Shaheen just mentioned airplane flights are down 75 percent.  America's national anthem is booed at hockey games. We had another  person in who ships whiskey--Virginia bourbon--up to Canada. If all the  tariffs are off tomorrow, which they will not be, it will be years, if  ever,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…course, for vacations. We  welcome Canadians all the time.\n\nI was, in fact, at the Minnesota Frost game in which they played the  Charge, a Canadian team, a women's professional hockey team. It was a  joyous event with our Canadian neighbors.\n\nYou see, we know now, the World Series, one of the most exciting  World Series between the Toronto Blue Jays and…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…totally intertwined. Robust  supply chains on both sides of our northern border make, grow, and  transport everything from autos to lumber to soil to energy to food and  even to hockey teams.\n\nThis damaging trade war with Canada has caused prices to rise, led to  more job losses, disrupted trade, and caused tourism to drop 31  percent. These are no victories.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699953/ending-the-trump-tariff-on-canada"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Mr. Speaker, I rise today to share the heartbreaking  and inspiring story of the Santa Clarita Lady Flyers, a 12-under hockey  team that plays in my district.\n\nWhile on the way to the Western Girls Hockey League playoffs, a  snowplow collided head-on with one of their team vans, injuring five  players…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700079/santa-clarita-lady-flyers-tragedy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Minnesota outlined.  They are going to three different locations. This is the highest  civilian award, and it makes that award to the members of the 1980 U.S.  Olympic men's ice hockey team, whose victory marked a pivotal moment in  American sports history.\n\nOn February 13, 1980, the U.S. hockey team historically defeated the  Soviet Union 4-3 at the Lake…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…these tariffs on Canada are unprompted,  unnecessary, and make no sense at all.\n\nAs a Minnesotan, the only thing I want to fight with Canadians about  is who has the better hockey team and who can catch the most fish in  the others' waters.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…learned to lead with Viking  Values, respecting one another, extending empathy, and acting with  integrity.\n\nThis class excelled across a wide range of fields, including field  hockey. I congratulate them on their State title there.\n\nThey have impressed the community with their art galleries and  theater performances. Without a doubt, they have excelled…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Jaffrey, Londonderry, North Hampton,  Belmont, and Gilford.\n\nDave is not only a diligent public servant but a man of outstanding  character and passion. His own family full of hockey players, Dave  spearheaded the Belmont-Gilford cooperative hockey team, cultivating  the 16-year-old program that put numerous players on the ice.\n\nIn all, Dave Caron represents…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…year to find ways to improve  it.\n\nThat is how responsible governments handle trade disputes, by  following the law, not through weird social media tantrums about  bridges and hockey trophies or through childish threats to annex a  sovereign nation and make it the 51st State.\n\nHis daily barrage against Canada does not make him look tough. It is  certainly…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Side Academy and Quaker Valley.\n\nIn girls' volleyball, they are Beaver, Avonworth, and Eden Christian.\n\nIn boys' golf, they are South Fayette and Shady Side Academy.\n\nIn field hockey, they are Pine-Richland, Fox Chapel, and Shady Side  Academy.\n\nIn boys' cross-country, they are Quaker Valley.\n\nIn girls' cross-country, they are Shady Side Academy.\n\nMr. Speaker,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699040/congratulating-wpial-champions"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Youth Club;       Female Athlete: Ayla Sayd, Volleyball, Marshall High School/      Coach Khayla Williams, Basketball, Herndon Optimist Club;       Parent: Martine Silve, Field Hockey, Herndon Reston Youth       Field Hockey.                              Franconia District\n\nMale Athlete: Bowen Kirui, Soccer, Lee- Mt. Vernon Sports       Club; Female Athlete:…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "Mr. FINSTAD. Mr. Speaker, I rise today to recognize the 2025 Class 1A  Minnesota State Girls Hockey Champions: the Dodge County Wildcats.\n\nOn February 22nd, the team won their first-ever state title at the  Xcel Energy Center in a suspenseful overtime game against Warroad.…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…can't handle the truth.  They can't handle the truth that 250 years after this Nation's  founding, we have so much to be proud of. We are proud of the gold  medal U.S. Olympic hockey team who brought golden glory back to the  United States 46 years after the ``Miracle on Ice.''\n\nWe are proud of our heroic soldiers like CW5 Eric Slover and the 100- year-old…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…now. Morrow up to Silk. Five seconds left in the game. Do you  believe in miracles? Yes.''\n\nWho can forget those legendary words on that Friday, February 22,  1980?\n\nWhat that hockey team did for our country during that time was they  beat the most powerful team in the world. These amateurs from our  college ranks, they beat the best team in the world.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…the playoffs.\n\nThis sustained success is a testament to the leadership of Head Coach  Claire Pearce, a Trinity Valley alum who has guided both the girls'  soccer and field hockey programs to multiple conference championships.  Under her leadership, the program has fostered a culture grounded in  teamwork, accountability, and high character.\n\nThe Trinity…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700251/congratulating-the-trinity-valley-girls-soccer-team-on-their-fourth-consecutive-3a-state-championship"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "Mr. RULLI. Mr. Speaker, I rise today to congratulate J.T. Miller on  his selection to the Team USA hockey roster for the 2026 Winter  Olympics. From East Palestine, J.T. Miller showcases the grit and  toughness of a community that is built on pride.\n\nJ.T. has represented his country…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699838/congratulating-jt-miller-on-his-selection-to-the-team-usa-hockey-roster-for-the-2026-winter-olympics"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate Izzy Soto and her  teammates on the United States National Development Team for winning a  gold medal at the 2025 Pan American Inline Hockey Championships in  Oaxtepec, Morelos, Mexico.\n\nRepresenting our Nation with pride and determination, the team  demonstrated remarkable resilience by winning four consecutive…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…In the second year, 47 members raised  $40,845. In the third year, despite a smaller membership of 44, they  raised $51,082.57. At the beginning of this year, the Lightning Hockey  Team awarded the WOG a $50,000.00 Hero's Award. Each year, during the  annual meeting, funds are donated throughout the Foundation's programs,  which include: Charity Care,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691906/recognizing-sue-simone"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…game. Do you  believe in miracles? Yes!''\n\nFriday, February 22, 1980, the game started at 5 p.m. Eastern  Standard Time, 4 p.m. Central Standard Time, where I was a bantam  hockey player, playing in the Pine Valley Ice Shelter. We had one of  our parents come out of the locker room, ``We beat the Russians. We  beat the Russians,'' because it was on tape…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…move to suspend the rules and  concur in the Senate amendment to the bill (H.R. 452) to award 3  Congressional Gold Medals to the members of the 1980 U.S. Olympic Men's  Ice Hockey Team, in recognition of their extraordinary achievement at  the 1980 Winter Olympics where, being comprised of amateur collegiate  players, they defeated the dominant Soviet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…of competing as part of Team USA in the upcoming Olympics and  Paralympic Winter Games starting this Friday, February 6.\n\nLiam Cunningham of River Falls is competing in sled hockey. Dan Rose  of Tomah and Matt Thums of Ogema are both competing in wheelchair  curling. They overcame tremendous obstacles and hardships to earn their  position with Team USA.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699752/congratulating-wisconsins-seventh-district-paralympic-athletes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…saying, ``I am fired up.'' I am fired up, Mr.  Speaker, because we are going to pass a great bill that promotes  America.\n\nWith the previous bill honoring the 1980 USA Gold Medal hockey team,  this is a great day in D.C. and all over the United States of America.\n\nIn closing, I urge a ``yes'' vote on this particular bill, and I  yield back the balance of my…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Congratulating Brock Nelson\n\nMrs. FISCHBACH. Mr. Speaker, I rise today to congratulate Brock  Nelson from Warroad, Minnesota, on his selection to the 2026 U.S.  Olympic men's ice hockey team.\n\nThroughout his career, Brock has defined himself through quiet  leadership  and an unwavering work ethic. Whether on the ice for the Avalanche or  representing the Stars…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 452) to award 3 Congressional Gold Medals to the members of  the 1980 U.S. Olympic Men's Ice Hockey Team, in recognition of their  extraordinary achievement at the 1980 Winter Olympics where, being  comprised of amateur collegiate players, they defeated the dominant  Soviet…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…through school, she worked at the university's copper mine  while remaining engaged in many extracurricular activities. She was a  member of the soccer, gymnastics, and women's hockey teams while also  participating in MTU Aquanauts and assisting in SCUBA instruction.\n\nFollowing her graduation in 1983, Ms. Prehoda was accepted into the  United States Marine…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…his friend Danny Wild-- until Danny's passing in 2025.\n\nSince 1994, Mac called play-by-play for Brainerd Warriors sports,  covering over 2,000 games in football, basketball, hockey, baseball,  and more. In 2017, he was inducted into the Brainerd High School Hall  of Fame for his remarkable coverage.\n\nOff the air, Colin served tirelessly--co-chairing United…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}]