[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…its agenda, they would have served as a  critical check on the Agency, as minority Republican Commissioners have  in the past. They could have used their dissenting voices to hold the  Agency accountable for any action that didn't serve to lower prices,  protect consumers, or even the playing field for small, innovative  businesses. If necessary, they…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…complete authority for D.C. to set  the date of special elections, the 2012 law did not include this home- rule principle.\n\nThe Home Rule Act originally required the Board to hold special  elections on the first Tuesday occurring more than 114 days after a  vacancy and allowed the Board to schedule special elections on the same  day as the next general…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697291/introduction-of-the-district-of-columbia-special-elections-home-rule-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…have paid into it with every paycheck       throughout our entire working lives, and the 66 million       seniors relying on Medicare could have their healthcare put       on hold or canceled. We deserve to know these programs will       be there for us. If Federal grants are limited, medical and       science research limited, including vaccines and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…because of fear. You have a major corporation. You have the right to  align yourself with the interests of your shareholders and the  interests of your future marketplace. Hold on to the DEI.\n\nMembers of this body, as coequal branches of government and the  United States, fundamentally disagree with President Donald J. Trump.\n\nMr. Speaker, I want Mr.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…policy that is centered by workers, industrial policy.\n\nOne of my colleagues who gets this idea of economic patriotism deeply  is Mr. Ryan. He is a West Point graduate. I won't hold that against him  too much. He deeply understands the fight that we need and understands  that our core of economic patriotism is what we are all about.\n\nMr. Speaker, I thank…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…believes didn't support him  politically.\n\nIn my opinion, this is the last reason any President should make a  decision about anything. An election is one thing, but once we hold  office, we have a responsibility to represent every American,  regardless of their political party, regardless of their politics.\n\nThe President's veto will inflict real harm…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…our shores and to the border, but the  administration won't even talk to Cubans about migration. How do they  plan to return those they want to deport? Do they think they can hold  Cubans in detention indefinitely?\n\nConditions in Cuba are far more desperate than during Trump's first  term. To be frank, President Biden disappointed me. He didn't do enough…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…because they  have some ideological fixation that, frankly, I don't understand.\n\nTwo hundred years ago, the private sector, which my friends on the  other side of the aisle hold up, had issued currency. It was called  scrip. Companies and banks issued their own currency, and this country  learned that this was a terrible idea and that, in fact, the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the Federal government; they are about delivering tax breaks  to billionaires on the backs of working Americans.\n\nThis bill is an absolute disgrace. The American people should hold  every Member who voted for it accountable when they are next up for  election.\n\nIt is the biggest Medicaid cut in our history. Over 900,000 people in  Connecticut rely on Medicaid…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…trying to work, raise families, and  contribute to our community. This is not about fairness or safety, and  it is not who we claim to be as Americans.\n\nCongress must step up and hold this administration accountable. We  must work in a bipartisan way to build an immigration system that keeps  people safe and ensures that people's rights are respected. Locking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…taking the floor and showing  the American people how horrible this administration is treating  average families--working families--in so many ways, and I know he  intends to hold the floor for a long time to make sure that that is the  case in letting America know how bad this is.\n\nNow, our healthcare is the main focus right now, and it is amazing, I…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this House this month. I  don't know that I will bring them to a vote this month, but I do know  that they will be presented to the House this month.\n\nThe President is unfit to hold the office that he has. The things  that he says and the things that he has done are clearly indicative of  an authoritarian presidency.\n\nMr. Speaker, I have been censured by…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…celebrating  in their Sunday best, as many call it, they were killed. They were  killed as they were celebrating Eid.\n\nAs we gather to celebrate Eid, we have to also recognize and hold in  our hearts all those facing violence and oppression around the world.\n\nMay this Eid bring peace, justice, and freedom for all.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689402/eid-mubarak"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, my office has been working with so many  constituents who have been harmed by the administration's new  immigration policies, one of which placed a hold on immigration  petitions and applications from 19 countries designated by the  administration.\n\nIn our district, families followed the law. They filed their  paperwork and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…constituents in Virginia who found a plan they could afford but with  higher deductibles. They are worried. They say they are just going to  wrap themselves in bubble wrap and hold their breath.\n\nBubble wrap doesn't help you, Mr. Speaker, if you are in a car  accident. Bubble wrap doesn't help you, Mr. Speaker, when you get sick.  Bubble wrap doesn't help…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of  the Arctic National Wildlife Refuge, also known as ANWR.\n\nThe 10-02 area of ANWR was specifically set aside by Congress for its  oil and gas potential and is estimated to hold anywhere between 4.25  and 11.8 billion barrels of recoverable oil.\n\nPrior to the passage of the Working Families Tax Cut law, which  requires four lease sales to be held over…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…engineering.\n\nThose of us with assets, we are doing great. You keep hearing people  talk about the K-shaped economy. What they mean by that is if you are  on the lower tier, you don't hold assets, particularly after the years  of inflation. Those with assets, the asset is inflated, and they are  just fine. If you didn't hold assets, you are poorer today.\n\nFor…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…House Committee on Small Business, it is my duty to support America's  small businesses, not fraudsters.\n\nMr. WILLIAMS of Texas. Mr. Speaker, this important legislation will  hold these fraudsters accountable, and I urge my colleagues to support  it.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I have no further speakers, and I  am prepared to close.\n\nMr. WILLIAMS…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…cities:  Stop being sanctuary cities. Comply with the law.\n\nWhen did complying with the Federal law become something that was  optional in America? It is incredible.\n\nAs we hold sanctuary jurisdictions accountable, we must recognize  that not every community in a sanctuary State is part of the problem. I  believe the amended bill draws that line distinctly,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…treatment firms were created.\n\nOur constituents are suffering. Before we ask them to continue to  suffer, we owe it to them to root out everyone who was involved in this  fraud and hold everyone accountable, and that is exactly what I intend  to do.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…continue supporting the library  and other community institutions in the years ahead.\n\nHer advice to the incoming 2026 Board is to support newly elected  Supervisor Mary Owens, ``hold tight'' to the Township's financial  stability, and examine every issue with the care required to secure a  better future for Warminster residents.\n\nBeyond her elected service,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…weight while their Guard members serve here in D.C. The  families' sacrifice and strength are a vital part of a successful  mission. Their dedication reflects the values we hold dear in South  Carolina. I am grateful to Governor McMaster for standing firmly behind  them on this important mission.\n\nMr. Speaker, in the coming days, I will be introducing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…It is now time for Congress to build on  his good work.\n\nH.R. 4922 is designed to begin to address many of the problems that  stem from the D.C. courts and their refusal to hold criminals  accountable. We need to start with recognizing that 19- to 24-year-olds  shouldn't be treated as youthful offenders.\n\nLocal news has recently reported that the number…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…students.\n\nI am grateful for educational programs that broaden our students'  horizons. I congratulate the winning students, and I look forward to  what their bright futures hold.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…certain Federal funds to States and localities across the  country that limit the use of cash bail; my Federal Carjacking  Enforcement Act would empower Federal prosecutors to hold carjackers  accountable; my Restoring Armed Career Criminal Act would reinstate an  important tool for prosecutors to seek enhanced penalties against  violent, repeat offenders;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…In  fact, they hate the President so much, they have shut down government.  They hate him so much that, if President Trump came out in favor of  breathing to live, they would hold their breath. It is not rational.\n\nI just don't know what else to do. All I can tell my Democratic  friends is: Look, reasonable people disagree, and I get it. But you are…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…We are not expanding the  scope of the CRA itself but, rather, simply refusing to narrow the CRA  by subjecting its use to GAO approval.\n\nLike my colleagues in the Senate, I hold our Parliamentarians in very  high regard. They perform and she performs a vital role in this  institution, and her wise counsel is critical to making this Senate  function.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…rely on Wyoming coal--and who always will.\n\nFourth, it is a win for Congress, reminding the agencies that we are  the primary policymaking branch of government and that we will hold the  agencies responsible for bad, unlawful regulations.\n\nI urge all of my colleagues to vote in favor of H.J. Res. 130.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…to deliver on our promise to America.  We must do what is best for them, including raising the debt ceiling by  $4 trillion to prevent Democrats from using a fiscal crisis to hold  Trump's agenda hostage.\n\nThe Speaker pro tempore (Mr. Ciscomani). The time of the gentleman  has expired.\n\nMr. NORMAN. Mr. Speaker, due to the previous Biden administration's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fund of Social Security is empty in 2033,  2034 the full year, I think $608 billion was our estimate on that first  year.\n\nThink about that. Think about that scale. Then you hold up a chart  like this. This is CBO's number for the next 30 years. Nondefense and  defense discretionary actually have a positive balance, meaning they  grow slower than tax…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}]