[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…beloved 37-year-old mom a  domestic terrorist.\n\nSecretary Noem and her rogue agents are the ones terrorizing our  communities, and she is breaking the law to do so. I will hold her  accountable, and I am filing three Articles of Impeachment against  Secretary Noem.\n\nNumber one, obstruction of Congress. Secretary Noem has denied me and  other Members of Congress…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…who might not share his political views, even though these jobs  are career, nonpartisan, and apolitical jobs.\n\nNext, he went after lawyers and law firms who tried to hold him  accountable to the law. He continues to do so. He has signed several  executive orders, trying to limit the ability of law firms to represent  their clients, one of the fundamental…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the way, also impacts Americans. If Mr. Netanyahu is  serious about working with the President in supporting the cease-fire  that he did agree to, he will take action to hold accountable those  responsible for the Americans killed by Israeli forces and illegal  settlers; Americans like Saif Musallet, a Florida teenager who was on  vacation visiting family…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Southeast Asia, the pattern  is the same: When authoritarian leaders feel threatened, they silence  critics, shut down independent groups and dismantle the checks meant to  hold them accountable. And the regimes that do this are the same ones  that threaten regional stability and our own security, which is why  supporting democratic movements and civil society…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…country are  being instructed to carry their Tribal IDs with them in case they are  stopped by ICE.\n\nDHS is not above the law, and neither is Secretary Noem. We must hold  them accountable, and we must prevent more death and violence.\n\nThat is why I voted against funding lawless, out-of-control agents  who are terrorizing our communities and why I continue…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699659/horrific-ice-abuses"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican affordability crisis. Every time Americans open their power  bill or see their lights flicker, Republicans are responsible. I think  the American people will hold them accountable.\n\nMadam Speaker, I urge my colleagues to vote ``no'' on this bill, and  I yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, I rise in opposition to the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…has an obligation to follow the Constitution. He  actually took an oath to do just that only 115 days ago.\n\nPOCCA, Protect Our Constitution and Communities Act, will hold him  accountable for doing so. It will empower American States, cities, and  individuals to fight back when they are harmed by the executive  branch's unlawful impoundment of funds.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…other Members of Congress  repeatedly raised concerns about him, and thankfully, on Thanksgiving  Day, he was released. It is now the Israeli Government's obligation to  hold accountable the soldiers who beat him and the jailers who  mistreated him.\n\nIsraeli authorities have defended this inherently flawed and  discriminatory system as a necessary response…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Port-au-Prince into the service  of criminal activity.\n\nMr. Speaker, we ignore the ongoing crisis in Haiti at our own peril.  We have a duty to make sure that we identify and hold accountable those  who perpetuate chaos.\n\nI thank my colleagues for working in a bipartisan manner because this  is the right thing to do, and I encourage my colleagues to join me…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…all else has failed, communities go to the court to get relief.  When it has been extremely hard to fight against larger, richer, and  more powerful entities and to hold them accountable, communities go to  the courts.\n\nRulings like Brown v. Board of Education, Obergefell v. Hodges, and  Roe v. Wade have been instrumental in ensuring that all communities…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…essential piece  of legislation eliminating the statute of limitations that has shielded  horrific criminals like Jeffrey Epstein and denied survivors of the  ability to hold them accountable.\n\nI thank Representative Teresa Leger Fernandez of New Mexico for  working with me on this bill.\n\nFor years, survivors who were abused, trafficked, and exploited by…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, we seem to have the bipartisan convergence that we need  to reverse the error of the interpretation that is in the Howard  decision to make sure we can always hold accountable the perpetrators  of this seriously corrosive crime.\n\nH.R. 6715 strives to right this wrong, and I am proud that we are  acting in a bipartisan way to do that. I urge…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…private right action for individuals, States, and local jurisdictions  that have been harmed by the administration's repeated violations of  the ICA.\n\nPOCCA would also hold accountable any public official with  decisionmaking authority who knowingly and intentionally violates the  ICA, such as Elon Musk.\n\nIt is time to stand up for the rule of law and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691297/stand-up-for-the-rule-of-law"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…finish line.\n\nThis bill also includes legislation like the Haiti Criminal Collusion  Transparency Act, which would curb the flow of illegal arms fueling  Haiti's crises and hold accountable those elites enabling it. They will  be put in check. It restores the State Department's Office of Haitian  Affairs in a bipartisan way. The NDAA preserves bipartisan…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…calling for  commonsense reforms--reforms like ensuring DHS officers wear clear  identification so people know who they are dealing with in law  enforcement and can hold them accountable; requiring DHS personnel to  wear body cameras so we have proper recordings of their conduct in  immigration enforcement; and requiring proper investigations after…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and appreciate his bipartisan spirit.\n\nI urge my colleagues to pass the Haiti Criminal Collusion  Transparency Act and make clear that the United States will expose and  hold accountable those who fund, enable, and profit from gang violence  in Haiti. It will shine a light on the criminal networks undermining  regional stability and ensure there are consequences…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…were created.\n\nOur constituents are suffering. Before we ask them to continue to  suffer, we owe it to them to root out everyone who was involved in this  fraud and hold everyone accountable, and that is exactly what I intend  to do.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…hurt his administration and what he is doing to  Make America Great Again.\n\nThe actions taken by Delegate Plaskett reflect poorly on the House,  and this body needs to hold her accountable.\n\nMr. Speaker, I urge all of my colleagues to vote to adopt this  resolution to show the American people that those who colluded with Mr.  Epstein, including Members…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…fraudulent funds in its COVID-era programs.\n\nThis level of fraud undermines the integrity of the SBA. It is  essential that we track these criminal fraudsters down and hold them  accountable for their actions.\n\nTwo of these SBA COVID-era programs, the Restaurant Revitalization  Fund and the Shuttered Venue Operators Grant, directed financial  assistance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…again if President Trump had been in  office. But with President Biden and then previously with President  Obama in office, he knew that paper tigers weren't going to hold them  accountable, and so they kept coming and taking whatever they could  grab. That makes the world a much more dangerous place.\n\nFrom the first year of his Presidency, President Biden…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…political  agenda.\n\nAnd I hope to God that every single family that is going through this  will hold the Senator from Vermont accountable, and the State of  Vermont will hold him accountable, too, because he is playing with  kids' lives. He is literally killing kids in front of us because of his  political movement, and it is ridiculous.\n\nMr. MULLIN. Just…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…(3) to promote the dignity and security of human life in       accordance with the Universal Declaration of Human Rights,       adopted on December 10, 1948; and\n\n(4) to hold accountable persons implicated, including       members of the Chinese Communist Party, in forced organ       harvesting and trafficking in persons for purposes of the       removal…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…any sex reassignment  surgery is 18. We should not fall behind these countries when it comes  to protecting our children.\n\nThe Protect Children's Innocence Act will hold those accountable who  perform or attempt to perform genital mutilation and chemical  castration on our children. This bill expands the covered offenses to  include body mutilation and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…have for some time. They tell us that their  taxpayer-funded gift is just a drop in the bucket, not worth our  attention. Nothing to see here. Yet, when we want to hold them  accountable, it is the end of the world.\n\nThey will weaponize their content against congressional Republicans.  They will hire lobbyists. They will buy ads. In fact, they have.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…this horrible man should brutally stab this innocent  woman, that is part of the national narrative right now. The fact that  we are dealing with that horror brings us to hold accountable every  judge that let him go and every prosecutor that refused to force  charges upon that man, every elected official and politician that stood  for cashless bail. Every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…hardworking  Americans. Every single Democrat voted to raise taxes on every  American. Think about that. We don't hear them talk about that.\n\nMadam Speaker, we need to hold them accountable to that vote because  Democrats want to raise our taxes.\n\nMadam Speaker, our work does not end with this historic legislation.  House Republicans will continue to work…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…legislative authority to the President so that  the  laws we live under are, in reality, written by bureaucrats who the  people do not know, will never meet, and cannot hold accountable  through elections.\n\nBut I don't want to let off both parties on this. The powers that  have been given to the President over trade have been given to the  President by…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Federal immigration  law out of our American communities.\n\nIt is vital that law enforcement officers and Border Patrol officers  have the tools they need to hold dangerous criminals accountable and  safeguard our communities, and this legislation does just that.\n\nPresident Trump has delivered on his promise to secure the border,  and this legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our communities,  but also to enforce our border in concert with local law enforcement  and how important it is that we stand alongside them, that we stand up  and hold ourselves accountable for doing that work and the proper  oversight and the proper leadership to secure our Nation.\n\nI yield to the gentleman from Louisiana (Mr. Higgins), my good  friend.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "John James", "party": "Republican", "sentence": "…Every hospital in America will have to post their real prices online  in plain English where everyone else can see them. If they don't hold  the prices, we fine them and hold them accountable to the people. Fines  will actually mean something.\n\nMr. Speaker, insurance companies will have to give you a straight  answer online, on the phone, or in the paper…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}]