[{"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…School Kids  Day, an all-day event providing food, games, activities, and free  haircuts for all of the children.\n\nHer love for her community was unprecedented. During the holiday  season, her organization would provide Thanksgiving dinner to the  homeless and those in need, toys for children, and blankets for the  sick and shut in. Even as she was in hospice,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…million people across 182 countries.\n\nVarious events throughout the United States will bring communities  together in a shared moment of peace and connection during the holiday  season, supporting mental well-being, resilience, and utility across  our cities.\n\nMr. Speaker, I invite my colleagues to join me in a moment of silence  in recognition of the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698102/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…see their premiums go up.\n\nIn fact, sadly, today is the last day for Americans to sign up for  January Marketplace coverage. And over the next 2 weeks, this holiday  season--this Christmas season, this Hanukkah season--millions of people  will see their skyrocketing premium amounts deducted from their bank  accounts, wondering how they are going to make…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…pronouncements by Trump has halted  investment and expansion of small businesses, and it has hindered basic  business decisions, like when to put in an order or how to plan for the  holiday season.\n\nI know they don't want to talk about tariffs and, instead, we are  debating these two bills.\n\nThe American Action Forum estimates that Trump's tariffs are costing  small…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…coordinating volunteers to  assemble baskets and deliveries. The entire community truly rallies  around Terri and steps up to ensure families will not go hungry in the  holiday season.\n\nTerri also created Operation Hope--a project where she collects and  restores used items such as furniture, clothes, and toys, to give to  any family that reaches out…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, no matter who you are shopping for this  holiday season, you will be paying a lot more due to Trump's illegal  tariffs.\n\nPrices for toys and games are up 17 percent. Clothing and shoes are  up 20 percent. Electronics are up…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698328/president-trumps-illegal-tariffs"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…coverage on January 1.\n\nI have heard heartbreaking stories from my constituents who have no  clue how they are going to make ends meet as we enter into what should  be a merry holiday season.\n\nMr. Speaker, I had a professor in college who was very clear in  calling us out when we were unprepared when we showed up for our class.  He would call us derelict, negligent,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…invest in our  youth, we are actually investing in peace. I congratulate Mario.                           Recognizing Rita Kollias\n\nMrs. RAMIREZ. Mr. Speaker, during this holiday season, which has been  so difficult for so many families, I rise to recognize the joy and hope  that Rita Kollias facilitates in DuPage County in Illinois' Third  Congressional…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Eastern Time, when events across Illinois, throughout the  United States, and around the world will unite communities in a shared  moment of peace and connection during the holiday season, supporting  mental well-being, resilience, and unity.\n\nThis meditation will be led by Gurudev Sri Sri Ravi Shankar. For more  than 45 years, Gurudev has dedicated his…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698204/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…actions. As a  result, as I mentioned, electricity prices are up 13 percent, and  natural gas prices are up 8 percent since the President took office.\n\nMr. Speaker, this holiday season, Americans are struggling to afford  record-high utility bills and skyrocketing grocery prices. Donald Trump  and the Republican Party were elected on their promise to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…fortunate to have an  abundance of locally owned small businesses bringing life and community  to our cities.\n\nMr. Speaker, as we approach Small Business Saturday and the holiday  season, I encourage everyone to shop small and take some time to  support your local businesses. By doing so, you are supporting your  neighbors, growing your local economy,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…won't get injured. When they do, whether they are insured  or not, they are showing up at the hospital, and the rest of us will  pay the cost.\n\nMr. Speaker, as we enter the holiday season, as a preacher's kid, I  have been thinking a lot about Matthew 25:31-40, where Jesus said:  ``Come, you who are blessed by my Father.'' He said when He enters into  his…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, as families in Ohio's 13th Congressional  District get ready for the holiday season, I will talk about something  that is weighing on many of them.\n\nThe cost of everyday life keeps going up and people feel it every  time they shop for groceries, pay their…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to recognize the charitable work in  Yonkers during this holiday season of Operation Santa Claus, raising  money to support organizations that work directly with individuals,  especially children with developmental disabilities.\n\nThe funds…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697681/operation-santa-claus"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…special place. This recognition not only celebrates the  creativity of our local artisans and businesses but also brings  positive economic impact to the region during the holiday season.\n\nI encourage everyone to experience this celebrated market while it is  open, and I thank all who worked to make it one of the best in the  Nation.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…sharing joy and  tradition with audiences across Minnesota and the region. And, for more  than 25 years, Denny brought magic and delight to children, and  families each holiday season playing the role of Santa Claus. Together  with his wife, Mary, he has shown tremendous love for the community's  elderly through their shared ministry of offering comfort,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698267/recognizing-the-retirement-of-dennis-eugene-denny-butcher-of-watertown-minnesota"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…to  food drives and volunteer with the Salvation Army and Gleanings for the  Hungry. Their community service impacts the community all year long,  including during the holiday season when families donate blankets to  the homeless and sing at retirement homes. These experiences at Hanford  Christian and within the community empower students to become…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…December 26, 2024, in the midnight  hour of the Biden administration and the day after Christmas, putting  in peril the livelihoods of hundreds of my constituents during the  holiday season.\n\nMadam Speaker, I should also note that the timing of this regulation  was 7 weeks after Americans overwhelmingly rejected the Biden-Harris  regulatory regime.\n\nTo my…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…supports our troops. It pays Federal workers. It fully  funds SNAP benefits until September 30 of next year. It compensates our  air traffic controllers right before a busy holiday season. In fact, it  takes a holistic approach in ensuring Federal services and programs are  operational. In the simplest terms, we are putting the government back  to work for…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}]