[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…bill actually punishes small businesses and immigrant  communities to score cheap political points, forcing the SBA to close  or relocate offices in cities like Los Angeles, my home, simply because  we refuse to bend a knee to the President and to MAGA Republicans'  anti-immigrant agenda, which is about retaliation, not good governance.\n\nImmigrants start…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691941/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…well.\n\nThe worst part of these bills is that these bills would actually  raise utility costs for consumers. Who asked for that? I mean, one of  these bills is H.R. 4626, the Home Appliance Protection and  Affordability Act. That is not the original name of the bill, though.  No. The original name is the Hands Off Our Home Appliances Act.\n\nRepublicans…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…would have to look at the       bottom bronze plans. Very little is covered. My premiums       would be lower but my deductibles would be astronomically       high.\n\nI am an in-home senior caregiver working part-time so I can       take care of my aging parents.\n\nOr Dennis from Milwaukee:\n\nFor thousands of Americans like me, the ACA is not a       political…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…members of law  enforcement as well as the military.\n\nWe were together, and we felt under threat together, but we decided,  when we were asked, that we would stay. We would not go home for the  night, as some of the security wanted us to do. We would stay to count  the votes. As dark as that moment was in the history of the United  States of America, we can…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…bedrock of faith. Introduced  to Christ early, he first joined Pleasant Hill Missionary Church in  Herod and later made Shiloh Missionary Baptist Church in Dawson his  spiritual home. For more than thirty years, he served as a Deacon and  as Chairman of the Deacon Board--roles he carried not as honors but as  responsibilities. In the church he found purpose;…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to recognize the month of May as  Asian American, Native Hawaiian, and Pacific Islander Heritage Month.\n\nVirginia is home to a dynamic and growing AANHPI community, a  community that across the country and in Virginia contributes in every  field, including business, education, science, technology,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Trump administration and the failed  leadership of DHS under Kristi Noem.\n\nTheir systemic refusal to prioritize public safety and adhere to any  semblance of due process in my home State of Minnesota has shown all of  us that the trauma and suffering are very much intended consequences of  their policies. Cruel indifference to constitutional rights and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…The  National Mall and not erased, as we have seen efforts to do over the  course of this year.\n\nDuring World War II, over 18 million women stepped forward to serve  on the home front, raising the number of women in the workforce to  nearly 40 percent between 1940 and 1945.\n\nThese women served in so many capacities: pilots, mechanics,  electricians,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Assistance Program, LIHEAP, are so critical. Yet earlier this year, the  Trump administration wanted to eliminate LIHEAP, a program that  supports over 200,000 people in my home State of Missouri.\n\nWe should be focused on lowering costs and strengthening essential  programs, not cutting critical, lifesaving programs that people rely on  to stay warm…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697917/in-support-of-liheap"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…before they could even speak any language, some of them, and many of  them here knowing only English, only the neighborhoods where they live  now, only this country as their home.\n\nDACA has offered safety, security, and hope to thousands of people,  including 3,000 active DACA recipients living in Connecticut alone.  They are our friends and neighbors.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…to address certain  issues related to economic development and public safety regulations  and mail delivery.\n\nFor example, Eastvale is a town in southern California that is home  to 69,000 residents. It currently shares two ZIP Codes with neighboring  jurisdictions.\n\nWithout a unique ZIP Code, Eastvale residents have reported mail  delivery issues for…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…Technology Transfer Program (STTR), have been contributing to U.S.  leadership in technological innovation through support for small  business research and development.\n\nMy home state of California has long been one of the Nation's leading  states for science and technology. Because of our rich and diverse  culture of innovation and entrepreneurship,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Trump administration would have you believe that they are  pursuing hardened criminals. Yet, according to ICE's own data, 85  percent of the people detained in Massachusetts, my home State, have no  criminal record.\n\nRogue, masked Federal agents are violating people's civil rights,  glorified bullies masquerading as public servants. They terrorize our  communities…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…patriots. Think of it instead as a lifeline.\n\nIt is the reason a child with asthma can breathe easier. It is the  reason a senior can receive the care they need in a nursing home--our  elders. It is the reason a low-income mother can take her child in for  vaccinations or a person with a disability can live with dignity and  independence.\n\nCongress is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…and Chinese influence have been cut in this bill. These  programs just don't support communities abroad, they actually stimulate  local businesses and economies right here at home. Feed the Future,  which is a part of the U.S. Agency for International Development,  supports local farmers by purchasing their products and distributing  them to people in…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…inefficient and unnecessary funding for defense programs. The NDAA  builds on efforts started in the Working Families Tax Cuts Act to  stimulate our economy and to bring jobs back home.            Addressing Misleading Advertising for Prescription Drugs\n\nMr. JOYCE of Pennsylvania. Madam Speaker, President Trump took  executive actions last week to address…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…have marked up those instructions already. There are  instructions on a big, beautiful bill to put America first and to  create national security. We will use our resources at home to allow  people in America to have a job and a career where they can raise  families and grow communities. We are working on policies to avoid a $4  trillion to $5 trillion…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…four every year.  Under this bill, everyday Americans will see lower income tax rates, a  larger standard deduction, and an expanded child tax credit. That means  more take-home pay, more money for groceries, gas, and healthcare.  Filing will be simpler. Refunds will be bigger.\n\nThis bill doesn't just cut taxes. It makes them fairer. It puts  kitchen-table…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…bill does not do. It does not  eliminate environmental review. It does not lower standards. It simply  says America should be able to responsibly produce what it needs here  at home instead of outsourcing our future to foreign powers.\n\nInstead of trying to score political points, Democrats should support  efforts to close the supply chain vulnerabilities…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…work, Nola leads numerous Veteran-focused  programs as Commander of VFW Post 2148 and volunteers in the community.  She supports troop care packages, family assistance, welcome-home  events, Veteran services, youth scholarships, and JROTC programs. She  is also a member of the Honor Guard and an adult volunteer with the  Waco Young Marines.\n\nRecently, she…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the years, Alan's  service with the fire company was marked by a deep sense of duty--a  reflection of his strong desire to serve and protect the community he's  always called home.\n\nIn 1994, Alan assumed the role of Roadmaster for Plumstead Township,  eventually rising to become the Director of Public Works--a position he  holds with great pride to this…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Wood County Committee on Aging was established  to provide comprehensive services to the county's seniors. These  services have grown over the decades to include programs for home- delivered meals, medical transportation, health and wellness  initiatives, caregiver support, and much more. With senior centers  across the county, the Committee has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…for others. Her passion for learning led her  to become a teacher, where she inspired countless young people and  passed on her joy for education to future generations.\n\nAt home, she poured her heart into raising her sons, who remember her  not only for her guidance but also for her playful spirit, often  joining them in the yard. Through her devotion,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695205/people-are-sick-and-tired"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Puppy's leadership, his command was ready for  any mission at any moment or any call to action.\n\nOn September 8, 2001, the USS Enterprise departed the Arabian Gulf,  bound for home with a scheduled port call in South Africa for the first  time in about 40 years. Just days later, while still south of the  Arabian Peninsula, those aboard the USS Enterprise…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…into a  $150 billion-a-year business. This is something that we also have  learned affects every town, city, and community in our Nation. It is  pervasive.\n\nIn Tennessee, my home State, there were 1,170 reports of human  trafficking through November of last year, and that is according to the  data we have from the Tennessee Bureau of Investigations.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…foreign markets are open to those goods by cutting through redtape and  breaking down trade barriers. That means more exports, more jobs, and  stronger communities here at home.\n\nOn enforcement, ITA plays a vital role in confronting dumping  practices, countering illegal subsidies, and ensuring that foreign  competitors play by the rules. For too long,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…I represent literally  lies at the crossroads of America, and industries such as these  represent key parts of the lifeblood of our economy.\n\nIndiana's Sixth continues to be home to safe and prosperous  communities in which to raise families. It was highlighted by my visit  with the leadership of Franklin College and a number of state of the  city addresses…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…time with our hardworking Hoosiers.\n\nFor 7 months, I have been working to deliver for our communities. I  look forward to sharing my work and bringing details of our wins back  home.\n\nMost importantly, this time will focus on listening. I look forward  to touring our local businesses, meeting with our 11 county sheriffs,  visiting the many district airports…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694159/kickoff-of-hoosier-heartland-tour"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…shaping the future of space. From producing cutting- edge technology to visionary companies, Utah is helping propel humanity  into the next frontier.\n\nUtah is also the proud home of the Dugway Proving Ground in the west  desert, which has become a prime landing location for returning space  missions.\n\nI want to highlight one of the most pivotal players…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Homeland Security. These are transparent bills, accountable  bills, and fiscally responsible bills.\n\nThis hasn't happened in years, and it sends a clear, powerful message  back home that the House is back at work. We are back to governing.\n\nThese bills strengthen our military, secure our border, invest in  health and workforce readiness, modernize transportation,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}]