[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…more affordable homes in our  neighborhood. It makes many long overdue improvements to housing  programs, expands local development opportunities, and broadens access  to homeownership.\n\nH.R. 6644 also includes a dozen bipartisan provisions to help small  banks like community development financial institutions, the CDFIs, and  minority depository institutions,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Insurance Rates\n\nMs. TLAIB. Mr. Speaker, I don't know about you, but I have no idea  that someone's income, occupation, education, ZIP Code, marital status,  credit score, or homeownership status have anything to do with  somebody's auto insurance rates or whether or not they are a good  driver. It has absolutely nothing to do with it. Yet, we are allowing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Liberty Bank, Seattle's  first black-owned financial institution which countered racially biased  restrictions on loans to African Americans and expanded opportunities  for homeownership in Seattle.\n\nMcKinney was a friend to many, including the noted fellow pastor and  civil rights leader, Dr. Martin Luther King, Jr. The pair had known  each other from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…community during segregation.\n\nBlack-owned businesses and venues along the Black Strip on Jackson  Avenue allowed culture to thrive . . .\n\n. . . while entrepreneurship and homeownership helped local community  members begin to accumulate wealth.\n\nAnd breakthroughs, like the Sands Hotel allowing Nat King Cole to  stay and perform there in 1955, challenging…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…ground beef, and $51 more for eggs  than they did in 2024.\n\nSimply put, our economy is not serving hardworking families and the  basic promises of the American Dream, like homeownership or putting a  child through college, are harder and harder to reach.\n\nGovernment works best when it is grounded in the needs of the people  that it serves. Our constituents…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699583/stop-the-republican-affordability-crisis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Home Loan Program has been a pillar of the American middle  class since the original GI Bill. It helped returning World War II  veterans achieve economic security through homeownership. Yet, today's  veterans, facing high costs, low wages, and an unstable economy, need  that same promise fulfilled.\n\nLet me be very clear. This is not a handout. These are…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…the 21st Century Act, which makes improvements to Federal programs  that will support housing development and affordability.\n\nThis bipartisan bill will broaden access to homeownership, expedite  new construction, and lay the foundation for more cost-effective  housing developments across the Nation.\n\nThis legislation includes 25 housing provisions that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Bloomberg Mayors Challenge.\n\nSelected from over 630 global applicants, Beaverton's bold initiative  reimagines housing through community-led, intergenerational models that  put homeownership within reach for more Oregonians.\n\nImagine a walkable neighborhood with vibrant shops, restaurants, and  community-led events for all residents, a neighborhood that sets…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693977/recognizing-the-city-of-beaverton-and-mayor-lacey-beaty"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…great education.\n\nThe next time we hear about workforce shortages or rising costs,  remember that this administration made the problem worse with this  move.               Homeownership Has Always Been the American Dream\n\nMr. SUBRAMANYAM. Mr. Speaker, homeownership has always been a  cornerstone of the American Dream. However, in my community in Virginia…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…For families trying to buy their first home, the challenge is  steeper, because mortgage rates may have dipped below 6 percent, but  high prices and limited inventory keep homeownership out of reach for  many in my district. We cannot ignore the inequities baked into the  system.\n\nIn Ohio's 13th District, the homeownership rate overall is nearly 69  percent,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…has been brought by this second Trump administration. From the  unpredictability of the tariffs, the rising costs of healthcare, and  the increasingly unattainable goal of homeownership, what is going on  in Washington should concern every single American in this country.\n\nCongress and the Trump administration should be doing more to lower  costs and improve…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…guardrails.  Instead, they caused millions of people to lose their jobs, their  homes, their savings, reversing and worsening any gains that had been  made in Black and Latino homeownership and wealth. The collapse of the  housing market during this time displaced approximately 10 million  Americans.\n\nAs Trump wreaks chaos on the stock market and broader economy,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…sense by banning the President from imposing  tariffs without congressional approval, capping the cost of childcare,  expanding health coverage, creating new pathways to  homeownership, raising the minimum wage, and expanding tax deductions  for working-class people.\n\nMr. Speaker, after Thanksgiving season, where so many families felt  the strain, the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…not because it is extraordinary but because it is  overdue.\n\nFor decades, chronic underbuilding in the United States has driven up  housing costs, priced millions out of homeownership, strained household  budgets, and constrained employers' abilities to attract workers.\n\nAmericans want their Representatives to act on the rising cost of  living. For most…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699796/housing-for-the-21st-century-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…increase  enhanced premium tax credits so millions of American families can  afford their healthcare.\n\nWhat we need is bipartisan legislation such as my bipartisan Rural  Homeownership Continuity Act that will reduce financing costs and  bipartisan legislation on permitting reform to get infrastructure like  energy, transportation, and housing projects…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…electrical  engineer volunteered nearly 400 hours across our construction sites and  ReStores. Mr. Quinn's impact is profoundly felt by the partner families  working toward homeownership. On construction sites, he shares his  expertise by teaching them essential home building and maintenance  skills. His mentorship empowers these families with practical…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…like radical policies from 2021 through 2024.\n\nMr. Speaker, I am proud to support the Affordable HOMES Act to cut  red tape and help more Americans achieve the dream of homeownership. I  very much thank the chairwoman for leading this charge.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698636/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…inventory shortage. Republicans are  offering solutions to provide more housing stock to lower the costs for  the American people and deliver on that American Dream of  homeownership.\n\nThis bill cuts through the regulatory choke hold that Washington has  imposed on housing. It streamlines permitting, modernizes outdated  Federal programs, and gets the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…President Trump to secure  historic SALT relief for Californians. That relief, combined with the  provisions in the Housing for the 21st Century Act, will bring the  dream of homeownership closer to reality for working families in my  district.\n\nFor far too long, working-class Americans have been priced out of the  housing market. The Housing for the 21st…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…be built on a permanently installed steel chassis, even after  the home is placed on a site, never to be moved again.\n\nThis bill will give millions of Americans a path to homeownership  without going over budget. It will provide young and low-income  families with the opportunity to build equity instead of being locked  into rising rents year after year.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…for its  citizens. It shouldn't be there with overbearing mandates that make  life more difficult and expensive, especially for something as  fundamental as property and homeownership.\n\nOne of the contributing factors to these regulatory costs is the  agenda informed energy codes that States like Colorado are mandating.  They ignore science, and they…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699810/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…House Republicans are taking meaningful action to address one of  the most pressing challenges facing our country.\n\nIndiana remains one of the most affordable States for homeownership  in the country, but I know the dream of owning a home is still out of  reach for many Hoosiers. Every day, I hear from families that work  hard, save their money, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…simply  trying to buy a home and live the once-attainable American Dream.\n\nOwning a home shouldn't be this much of a challenge. This bill will  help Ohio families check homeownership off the list, knowing they were  able to achieve exactly what they worked for.\n\nHouse Republicans are also reining in the Biden administration's  overregulation of everyday…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…waste, fraud, and abuse in our Federal  spending.\n\nHousing issues impact all Americans. I commend this administration  for their focus on restoring the American Dream of homeownership by  bringing down housing costs and cutting red tape. Our HUD programs play  a critical role in increasing the affordable housing supply and access  nationwide.\n\nHowever,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…affordability for rental units, with a       prioritization of units attainable to extremely low-, low-,       and moderate-income residents;\n\n(v) a range of affordability for homeownership;\n\n(vi) accountability measures;\n\n(vii) the long-term cost to residents and businesses if       more housing is not constructed;\n\n(viii) barriers to individuals seeking…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…affordability through  property tax limits and advocacy efforts. Her vision for communities  also includes pioneering affordable housing initiatives, advocating for  equitable homeownership opportunities, and launching partnerships far  beyond traditional boundaries.\n\nThese accomplishments are monumental but not what Amanda cherishes  most: the kindness and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689058/recognizing-amanda-brewer-for-womens-history-month"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Act, which was really nothing of the sort, homebuilders were buried  under costly green new scam mandates and overregulation, driving up  construction costs and pushing homeownership even further out of reach.\n\nThis was also known as the green new scam in action. House  Republicans are changing that. We are cutting the blue tape. We are  lowering costs.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…cost burdens like the ones created by section 3 HUD  requirements, and providing greater flexibility for cities and towns  across the country to use HOME dollars to promote homeownership.\n\nSection 301 makes important changes for manufactured housing. I give  a special thanks to Congressman   John Rose and his extremely important  bill that would remove…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…housing market, one that affects our  most vulnerable homebuyers. It reduces the upfront costs of buying a  home, making it easier for Americans to achieve the dream of  homeownership. The Affordable HOMES Act restores clarity by placing  manufactured housing standards back under the Office of Housing and  Urban Development where they belong and eliminating…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…served the  authority from May of 2021 until his departure during 2025. President  Arrington has worked at the authority since 2014 and was previously the  vice president of homeownership and public finance.\n\nThe ADFA was established by then-Governor Clinton in 1985 to promote  economic growth and community development across Arkansas.\n\nPresident Arrington…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}]