[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…seventy-four days ago, an American citizen did not  need to worry about carrying a passport or worry that they would be  pinned to the ground for being unable to prove that their hometown was,  in fact, the only home they have ever known.\n\nThree hundred and seventy-four days ago, immigrant families didn't  need to call on their neighbors or rely on the help…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…innovative and unique sound, which gave us go-go music. Go-go is the  beat of D.C., giving D.C. its own musical identity and reminding the  Nation that D.C. has always been the hometown of talented artists.  Chuck Brown was a strong supporter of D.C. statehood, including playing  a concert on a hot and humid day on the U.S. Capitol Grounds in 2010 in  support…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692742/introduction-of-a-bill-to-designate-the-facility-of-the-united-states-postal-service-located-at-3401-12th-street-northeast-in-washington-district-of-columbia-as-the-chuck-brown-post-office"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…year, 15 percent of high school students  reported hearing about deepfakes of nonconsensual intimate images that  depicted kids at their schools. It happened to one of my hometown  constituents, a 20-year-old, bright college student named Jack  Sullivan. He was sextorted by two men claiming to be a woman on  Instagram. They threatened Jack. They told…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "Mr. CUELLAR. Mr. Speaker, I rise today to honor a historic milestone  for my hometown--the 270th anniversary of the founding of the City of  Laredo, Texas.\n\nFounded in 1755 along the banks of the Rio Grande, Laredo stands as  one of the oldest communities in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…assured are from well-respected Ohio  companies: Libbey Glass, Owens-Illinois Glass, and Kraft Heinz.\n\nLet's talk about Libbey. This historic company holds deep roots in my  hometown of Toledo, long known as the Glass City. Glass requires lots  of energy. The firm has been working for years to maintain  competitiveness in a terrible international glass…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…and support from the Department of Homeland  Security's Securing the Cities program, which seeks to reduce the risk  of terrorist attacks in high-risk urban areas, like my hometown of New  Orleans.\n\nI want to specifically thank Ranking Member Bennie Thompson and  Congressman Clay Higgins for their support and for cosponsoring this  bill. I also thank…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…outrage about something that is  very important. There are 700,000 seniors in Texas who rely on Medicaid  and nursing homes.\n\nMr. DOGGETT. Mr. Speaker, half the children in my hometown, and  probably more in Mr. Green's, are at risk of losing their care as seen  in our Children's Hospital. Medicaid is a lifeline to individuals with  disabilities.\n\nHe was…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688501/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…businesses are truly the beating heart of New Hampshire's  economy, from our cutting-edge aerospace and life sciences companies to  our retailers on Main Streets. From my hometown, Nashua, all the way up  to the North Country, New Hampshire small businesses are truly world  class.\n\nAt a moment when big businesses in our economy are more consolidated…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Mr. Speaker, 7 years ago, on June 28, 2018, a gunman who  should never have been able to purchase a firearm, walked into the  Capital Gazette and killed five members of our hometown newspaper:  Gerald Fischman, Rob Hiaasen, John McNamara, Rebecca Smith, and Wendi  Winters.\n\nAmid the shock and horror, just hours after the shooting, the Capital  issued…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693114/capital-gazette-shooting"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…advocacy of the NAACP,  including the lifetime achievement of Dr. Hazel Dukes, who recently  passed away, but there are local heroes, too, who do exceptional work  in our hometown neighborhoods.\n\nLet me recognize some of these key branch leaders:\n\nIn Co-Op City, Leslie Peterson and Brenda Brown;\n\nIn New Rochelle, Aisha Cook and Jareca Lee;\n\nIn Yonkers,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…and advancing  it through the House of Representatives here today.\n\nThis year, the Association of National Estuary Programs' fall meeting  was held in Mobile, which is my hometown, a powerful reminder of Mobile  Bay's national significance and how this program brings people together  to share solutions across the country.\n\nThis program funds partnerships…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Operation Desert Shield and Operation Desert Storm. Upon his completion  of military service, he returned to Somersworth where he began his 33  years of public service to his hometown.\n\nOn behalf of my constituents in New Hampshire's First Congressional  District, I wish Chief McLin well in his retirement, thank him for his  commitment to the people of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688242/recognizingmc-the-achievements-and-retirement-of-somersworth-police-chief-timothy-j-lin"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…is about: If they will do this to a  sitting U.S. Senator in front of a room full of media, imagine what is  being done to powerless people in secret.\n\nIn Portland, in my hometown, we have had firsthand experience with  this kind of activity--faceless, unidentifiable agents with guns  staring down peaceful protesters. In Portland, it was a ``wall of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…Georgetown University.\n\nAt the start of the 116th Congress, in January 2019, Sarah joined my  office as my first Chief of Staff for Texas' 7th Congressional  District, serving her hometown and the people who live there  enthusiastically and tirelessly. Sarah dedicated herself to building a  team to serve the residents of Texas' 7th Congressional District at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695833/recognizing-sarah-kaplan-feinmann"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the bill brought  before the House by my fellow freshman and Congressional Women's  Softball teammate, Julie Fedorchak, to honor Commander Delbert Austin  Olson.\n\nHe is a hometown hero of Casselton, North Dakota, who served in World  War II, the Korean war, and the Vietnam war as a member of the United  States Navy. As part of Observation Squadron 67,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697597/commander-delbert-austin-olson-post-office"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…with the U.S. Olympic and Paralympic Committee headquarters in Colorado  Springs.\n\nToday, I am honored to highlight three incredible athletes on Team  USA who reside in my hometown of Colorado Springs: Amber Glenn, Danny  O'Shea, and Ellie Kam. They are among the 16 U.S. figure skaters  nominated to the 2026 U.S. Olympic team.\n\nMr. Speaker, Colorado's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699727/recognizing-olympians-from-colorado"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize a remarkable  landmark of our history from my hometown of South Dayton. For 150  years, the South Dayton Depot has been a center of connection, culture,  and community spirit. Since its founding in 1875, the South Dayton  Depot…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…Louisiana, Mr. Cassidy.\n\nMr. MULLIN. I, too, want to say I support community health centers.  As I said, they are very important in rural communities, very important  in my hometown of Westville. In fact, it is the only healthcare that is  available. I don't want them to be harmed; I want them to be well  funded, but that is a separate conversation we…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…only increase our  reliance on the Chinese Communist Party for critical minerals.\n\nMadam Speaker, the Biden administration ``exported their  environmental guilt.''\n\nIn my hometown, the Duluth Transit Authority bought electric buses in  2018. It was a big event. There was a ribbon cutting and all the  leaders were there. What they didn't tell you was…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…challenges brought by fluctuating markets.  You both strive to progress into new areas but are willing to take time  for one-off projects in order to help an individual in your hometown.\n\nFor Wyoming's business community and small businesses across our  great Nation, I am committed to ensuring that we pass legislation that  creates a legacy and regulatory…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…champion, Rory McIlroy.\n\nSince 1934, amidst blooming azaleas, towering pines, and flowering  dogwoods, the first full week of April brings the world's greatest  golfers to my hometown of Augusta, Georgia, to experience sport's most  unique and rewarding challenge: the Masters golf tournament, the first  major of the year.\n\nAs golf fans know, the iconic…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691315/congratulations-to-rory-mcilroy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…I will always be  grateful for the lessons I learned getting my start working in small  businesses. During the summers, my parents, who were educators, ran a  motel in my hometown of Murdo, and as is common in a lot of small  businesses, the whole family helped out.\n\nLater on, my first job was as a busboy at the Star Family Restaurant.  I later graduated…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…brother Bradley who works for the Columbia City Street Department,  gets up every morning. He happens to have a CDL. He drives the  snowplow. He works hard to keep our small hometown in northeast Indiana  clean and the streets taken care of.\n\nHe doesn't wake up like you and I do every day and think about  politics and what is going on in Washington, DC.…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Mrs. FISCHBACH. Mr. Speaker, I rise to congratulate Dominique  Claseman and Ahren Jurgensen of Olivia, Minnesota, on raising nearly  $120,000 for a veterans memorial in their hometown.\n\nMr. Speaker, 3 years ago, Dominique raised over $77,000 to construct  a memorial for veterans. Since then, he has enlisted in the U.S. Army  and is currently completing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Mr. Thomas  Pelissero for his heartfelt tribute to his hometown of Bessemer,  Michigan, in his book: ``Bring One Home: A Memoir of Boyhood,  Basketball, and Hometown Spirit.''\n\nThis book is not only a salute to Bessemer, but the tough,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…farmer and coal miner for the Southern Ohio Coal Company. Ray has  received numerous awards such as the National Grange Volunteer  Firefighter of the Year and was deemed a Hometown Hero by Modern  Woodmen. To this day he is an active fire chief and continues to give  back to southern Ohio.\n\nMadam Speaker, America is forever grateful for people like him…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…market. Perhaps most importantly, Rinnai  America is the only company that builds noncondensing tankless water  heaters on American soil.\n\nRinnai America is headquartered in my hometown of Peachtree City, and  3 years ago, it opened a state-of-the-art facility in Griffin, Georgia,  two cities I proudly represent in this Congress.\n\nOver 500 of my constituents…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…tires, et cetera, at some  point, they are going to look at doing it at the medium-sized  producers.\n\nThe Yokohama plant that employs a lot of people in my district, in my  hometown of Salem, Virginia, could be affected long term, but currently  it affects Danville. Now, that is about 16 miles from the edge of my  district. In my area, because it is a…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Saint Patrick's Day celebration, a signature event in  the city's history and culture.\n\nWTOC-TV represents the very best in local journalism, combining  heart, hustle, and hometown pride. Covering Savannah's Saint Patrick's  Day is no small task. It is an all-hands-on-deck event that calls for  early mornings, late nights, and unwavering dedication.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693027/recognizing-wtoc-tv-in-savannah-georgia"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…gained not just a trade, but a calling. From the very  beginning, Mike understood that real leadership isn't about titles-- it's about responsibility: to your people, to your hometown, and to the  future.\n\nWhen Mike assumed leadership of PennFab following his father's  passing in 2018, he did far more than carry on a legacy--he redefined  it. With bold…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}]