[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…of Venezuelan oil? Those are all hostilities  under domestic and international law. They are all hostilities. And  that is why Secretary Rubio, I think, being intellectually honest,  refused to give an affirmative answer to my colleague's question. He  said there are no troops currently in Venezuela, but he would not say  that the U.S. military is not…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…firings, or the young college student who makes the innocent  mistake of confusing a savings and checking account, anyone can be  affected by unnecessary junk fees.\n\nLet's be honest, it is our most vulnerable who will bear the brunt of  the harm. For the single parent who has to pay bills today with money  that is coming tomorrow, overdrafting may be their…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…prices on hard-working Americans to  give handouts to billionaires, then own it.\n\nYou should not be allowed to hide behind President Trump as you do  it. Be transparent. Be honest. Put these price increases into the bill.  Tell the American people what you really stand for, because when  Americans wonder why their grocery bills and their energy bills…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…universities  because we don't like that their student body read about the atrocities  that the Government of Israel is doing. That is what this is about. I  think people need to be honest what this is about and not shy around  about it.\n\nI will say the international court system that is in place was  created because of some horrific history that has happened…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…stand up for those who are  making that personal decision themselves.\n\nMr. AUSTIN SCOTT of Georgia.\n\nMr. Speaker, I know a lot of people who work in these centers. They  are honest, dedicated, hardworking people who care about the pregnant  mothers and the unborn children. I think that the attacks on them are  unfounded, unwarranted, and unprofessional.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…fairness. They are about power and about  stripping protections from the most marginalized so that the powerful  can operate without accountability.\n\nWe need to be open and honest about the truth. These actions will  increase discrimination in the workforce. They will make us less  productive, not more productive. They will turn the focus of Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…regard to energy  consumption.\n\nThe bills today show that is simply not true. It is not accurate when  they say that. I have to thank Secretary of Energy Chris Wright for  being honest about this. At a Committee on Energy and Commerce hearing  in June, he was very blunt. He said: ``These companies can find ways to  change conduct and take action, frankly,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…or threaten CIA  operations, blockades, and strikes on Venezuela.\n\nThis is no joke. This is serious. This is not about drugs. It is  about regime change. It is about being honest with the people of  America. That is what the Chief of Staff of the President just did. She  didn't talk about drugs. She talked about regime change. It is Trump  himself saying…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…news and assume the only thing we do around here is  fight, but I think the last three bills on the floor are a good example  that, indeed, is not the case.\n\nNow, let's be honest. None of these bills have been silver bullets  slaying the biggest policy challenges facing our Nation, but they are  real attempts at governing. The Save Our Seas Act, FMC…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…it manure. I won't refer to it as  the language that I usually call it when I am not on the Senate floor.\n\nI also thought it was important to tell people the truth and be  honest with the American people. What the good leader left out when he  was talking about the number of votes that Republicans voted on under a  Democratic President, under a Democratic…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…create deficits in the first 10 years.  Second, a reconciliation bill can't increase the deficit in any year  after the first 10 years. And third, it should be measured using honest  numbers from the independent, nonpartisan, scorekeepers.\n\nSo how did we go from every Senator voting for a special process for  deficit reduction in 1974, to almost every…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Americans, and  Hispanic Americans? I don't think so.\n\nI am sorry the gentleman doesn't think it is appropriate to talk  about anti-Semitism when we see it. We just have an honest difference  of opinion about that, but if the gentleman is interested in pursuing  it some other time, I would love to discuss it with him.\n\nI think my colleague will come…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…attack on democracy itself, and the timing could not be more ironic.\n\nAs we approach America's 250th birthday, our national parks should be  a place of reflection, learning, and honest celebration. Instead, we  are fighting simply to ensure that these public lands continue to  represent the full dimension of the American experience.\n\nNational parks are not…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…opportunity to be a new Member of the Senate, along with  Senator Schiff, who I know feels the same way to be working with  somebody like the Senator from Oregon, who is just honest and true and  totally grounded in his commitment to the people whom he serves and the  Constitution that all of us serve. It is just a gratifying experience  for us to be your…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…finally acknowledged as part of our Nation's past, we see the Trump  Administration trying to strip away Black history. Banning books,  censoring lessons, and eliminating honest conversations about race is  not about education, it is about control. We must ensure that  Juneteenth is not just a day off but a day of truth.\n\nIn 2005, I partnered with…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…in other tax havens across the world, it encourages them to keep it  there or put it there instead of investing back into America.\n\nI wish my Democratic colleagues were more honest on this, because  they know and they see the numbers, too. When you create a competitive  environment, you are able to actually raise that revenue for the U.S.  Companies want…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise to provide an 11-month update to the  American people.\n\nWhile most media outlets struggle to be honest with the American  people, under the administration of President Donald Trump, a  Republican House, and a Republican Senate, America is back.\n\nIt is a fact that inflation is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…against their own interests. That  is precisely what has happened here.\n\nWe now have the actual language that will appear on the ballot for  California voters. If this were an honest description, it would simply  say that we are tearing up the map drawn by California's independent  redistricting commission and replacing it with a map drawn by  politicians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of supporting officers who want safer alternatives to  deadly force, Democrats are trying to scare the public with cherry- picked statistics and misleading claims.\n\nLet's be honest. If Democrats were truly concerned about public  safety, they would not oppose a bill that encourages de-escalation and  reduces the likelihood of fatal outcomes and encounters.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…olds.\n\nWe can sit here and blame each other, but it is just demographics. It  is happening over the entire industrialized world, but we are not  allowed to actually have an honest discussion about it because the  moment you say something, the other side is writing political  commercials to rip your face off  because you told the truth about math and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…the dictionary,  Charlie Kirk's name would come up.\n\nI don't know if I could stay as calm as he did while he was talking  with some of these confused young students, to be honest with you. But  Charlie always rose above it and extended grace, even to the people he  disagreed with the most. That was clearly because of his Christian  faith, which influenced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…built by American  workers, American engineers, and American manufacturers.\n\nIndyCar reflects who we Hoosiers are: competitive, inventive, always  pushing forward. I will be honest, Washington could use a little less  gridlock and a little more green flag.\n\nThis event isn't simply a race. It is a statement. America leads.  America builds. America innovates.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699865/freedom-250-grand-prix"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…at our  universities, and I have a bill that will deal with that. That is  because when people hear lies that come from the universities that they  believe are truthful and honest, and when they hear lies about what is  going on in the world, it inflames them and leads to the actions that  we have seen in the past couple of weeks.\n\nThe murderer--I don't…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Wall Street Journal on Medicare Advantage and  all these others. Many of them, when all added up, are a trillion-plus  dollars. Are we capable of actually being intellectually honest and  walking through?\n\nOne of the charts--we are going to come back to this again--you have  been hearing the Armageddon being said, that it is Medicaid.\n\nI used to do my State's…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…work, and  determination, serve as a reminder of what the American Dream is all  about: that anyone, from anywhere, can come to the U.S. the right way,  work hard, make an honest living, and succeed. That is what it is all  about.\n\nMany of the small businesses I represent are family owned and  operated. As the fifth generation to grow up on my family…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…lost; trillions of dollars spent not on one, but two forever wars over  the last 20-plus years that we should not have started in the first  place; and, most importantly, no honest conversation with the American  people about what would be required, what blood and treasure would be  spilled halfway across the world.\n\nNow, we are seeing it all play out…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699360/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…did Bashar al-Assad run? He ran for safe haven to  Moscow--that is where he went--to be under the protection of Vladimir  Putin, who seeks to make us believe that he is an honest negotiator.  Nicolas Maduro was wisely counseled to flee Venezuela. If he had run,  where would he have run? He would have run straight to Moscow. For  decades, Russia has…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "The committee issued this report on January 31, 2026, as required by  the Honest Leadership and Open Government Act of 2007.\n\n31, 2026]              Annual Report of the Select Committee on Ethics                       119th Congress, Second Session\n\nThe…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…not fooled by the chaos. They are not  happy with the chaos. They are watching this body to see who will fight  for them and who will fold to Trump.\n\nMr. Speaker, let's be honest. This administration isn't governing. It  is looting. Trump's cronies are lighting the house on fire so their  billionaire friends can sell the ashes for profit.\n\nWith this…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…work  that are keeping our skies safe, that are keeping our Nation safe. Two  weeks later, we haven't done it.\n\nThis isn't partisan.\n\nSearch your conscience. Ask yourself, honest to God, if a plane,  another plane--a plane has fallen out of the sky. I am not saying it is  because of air traffic control, but you heard of 500 safety instances.  Our air…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}]