[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Alex Pretti, and to  demand changes that will protect our democracy. It will be a vote to  uphold the values I brought with me to Congress, which are the values  of Minnesota: honesty, respect, and caring for our neighbors.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…question. It will be  costly in terms of the future of the United States of America if we are  not explicit and honest with the people of this country. Now is the  time for that honesty.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…integrity, responsibility,  and the basic respect for the people who we serve. What Republicans did  was an insult to every hardworking taxpayer who plays by the rules and  expects honesty from their government.\n\nRepublicans could have voted it down. They could have passed an  amendment to remove that provision from the bill. Despite being given  the opportunity…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Social Security since Franklin Roosevelt put  the program together? Why? It is simple: So they can cut taxes for the  rich.\n\nThis is a heist. If JD Vance had any intellectual honesty, he would  acknowledge he was wrong when he said ``40 percent of the people who  are calling are actually committing fraud,'' but I am not holding my  breath.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…going to say  no to magic math that lies to the American people about the cost of  their bill, driven by massive tax cuts to the richest Americans.\n\nIt is a simple request: honesty and integrity. We should not be  engaging in a big lie, and Democrats will have no part of it. We are  going to be honest about what every provision of the reconciliation…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…textbooks could not. For over a decade, he spoke to classes at  Marblehead High School, helping students understand the human cost of  war through his firsthand accounts. His honesty and devotion left  lasting impressions on Marblehead students, making the lessons of  history real and deeply felt.\n\nHarry never wanted to be far from Marblehead Rock. He…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690561/harry-christensen-remembered-for-decades-of-public-service"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…to help our  children build confidence, discipline, and a strong sense of teamwork.\n\nBurbank National Little League's mission is focused on core values,  good sportsmanship, honesty, loyalty, courage, and respect for  authority. These are the very principles that shape not just great  athletes but great civic leaders.\n\nIt is all about teamwork, a true…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689732/congratulating-burbank-national-little-league"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…CORREA. Mr. Speaker, I rise today to recognize East Fullerton  Little League's 70th birthday.\n\nLittle League's mission is to instill in children the values of  sportsmanship, honesty, loyalty, and courage, aiming to produce well- adjusted, stronger, and happier children.\n\nThe hundreds of volunteers who take the jobs of running a Little  League are usually…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700082/east-fullerton-little-league-70th-anniversary"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…for  providing it.\n\nLives are at stake, and the American people are watching. They do  know what it means when elected leaders say one thing and do another,  and they deserve honesty and real action.\n\nMr. Chair, I thank my colleague from New Jersey for this debate.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…relation to the January  6, 2021, attack on the United States Capitol and in retaliation for  attorneys upholding their ethical and legal obligations, including  candor and honesty to the courts.\n\nB. Directed and permitted the evasion and defiance of binding court  orders. Specifically, he has removed persons from the United States to  El Salvador, despite…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…costs are up, unemployment is  rising, the holidays are more expensive and stressful than ever, and  tariffs are taxing people to no end.\n\nIf Donald Trump had any shred of honesty and self-respect and self- insight, he would look into the camera tonight and say to the American  people: I have failed you.\n\nI mean, just last week, Donald Trump seriously…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…member of the Committee on House Administration, the  committee with jurisdiction over campaign finance legislation, I look  forward to continuing to work to restore trust and honesty to American  governance.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Honestly, they are hurting our  hearts.\n\nI think about that big red, white, and blue flag right behind the  Speaker's chair and what that flag represents: opportunity, access,  honesty, integrity. What we have seen last week and what we are seeing  this week from the House majority when it comes to this reconciliation  bill is silence. It is silent on these…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…vulnerability, see our frailty. In fact, in many ways,  Andy  Kim has shown that often the greatest courage is found in the depths of  our frailty, our vulnerability, and our candor and honesty with our own  struggles.\n\nI am a man of great physical stature relative to my smaller Senator,  but I hope everybody in America knows this: I may have greater physical  stature,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…healthcare, we are  being asked to sign off on a deal that lines the pockets of the very  people who wrote it. That is an insult to every hardworking taxpayer  who expects honesty from their government.\n\nThe contrast could not be clearer. Republicans are operating in the  currency of cruelty and corruption while Democrats are fighting with  courage…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696691/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…not isolated. The  Government Accountability Office estimates that the Federal Government  loses up to $521 billion to fraud every single year.\n\nThe American people expect honesty, fiscal discipline, and respect  for their sacrifice. I am proud of the Republican Conference for doing  just that.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…implications for both our civic culture and the way we approach  legislation.\n\nI believe this thoughtful reflection is a meaningful reminder of the  importance of clarity, honesty, and shared understanding in democratic  discourse.                         [From the Odessa American]                       Campbell: The Nature of Truth\n\nTruth is ephemeral…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…also served  on the Surfside Beach Town Council, the board of directors for the  Horry County Council on Aging and the Waccamaw Regional Council of  Governments. He brought honesty and common sense to local government  and was loved by all.\n\nWhen you look at the iconic Surfside Beach pier, know that it was  Bob's tireless efforts, advocacy, and grit…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Smith explored our rugged coast more than 400 years  ago, he wrote in his journal that settling this untamed region would  take, ``the best parts of art, judgment, courage, honesty, constancy,  diligence, and industry.'' I know of no better description of the  spirit that guides the New England Council. Congratulations and happy  birthday.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696025/100th-anniversary-of-the-new-england-council"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Christopher, who had passed away from cancer at just 11 years old.\n\nBefore his passing, Christopher wrote a story about a brave knight  seeking the four diamonds of courage, wisdom, honesty, and strength,  qualities his parents knew were essential in the fight against cancer.  In his memory, they created Four Diamonds to support families facing  the same battle.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can  actually get those types of bond rates if we demonstrate to the world  that we are creditworthy, disciplined, sensible, seeing long term, and  actually understanding the honesty of our demographics.\n\nInstead, a bunch of the brain trusts here in Washington spend their  time attacking Moody's for downgrading us and telling the truth. The  problem is,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…was not just casual contact. There were  deliberate communications, and they shaped her official line of  questioning in a congressional hearing.\n\nThe American people expect honesty. The American people expect  integrity  and judgment from their elected officials. They expect Members of  Congress to conduct themselves with one word--decency--not to seek…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John James", "party": "Republican", "sentence": "…hammered by  these bills.\n\nMr. Speaker, cosponsor the Patients Deserve Price Tags Act. Let's  finally give the American people, all of the people who sent us to  represent them, honesty and the control they deserve.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…hero, Neal Broten, from Roseau, Minnesota; my hero, Mark  Pavelich, from Eveleth, Minnesota; and my other hero, Phil Verchota,  from my hometown of Duluth. It was integrity, honesty, hard work,  dedication, and the will to win.\n\nMr. Speaker, the name on the front of our jersey, USA, means more  than the name on the back. I am thrilled to be able to vote…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…hospitality means that we help neighbors who truly need it,  but fraud turns this virtue into a target, and hardworking Hoosiers  foot the bill.\n\nThis is not left versus right. It is honesty versus the dishonest,  trust versus waste. For every dollar stolen by fraud, it is a dollar we  cannot spend on public safety, on our national security, or on helping  working…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699028/trust-versus-waste"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, for over 40 years, Jerry Sanok has been  a cornerstone of the Republican Party--a principled leader whose  honesty, strategic mind, and dedication have earned him respect across  Alden and beyond. It is only fitting that his hometown now honors a  lifetime of unwavering service.\n\nOn June…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692272/recognizing-jerry-sanok-for-forty-years-of-committed-service-and-leadership"}]