[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I am honored to recognize this week's  constituent of the week, Ernisha Hall, on her work as cofounder,  president, and CEO of the Virginia Black Chamber of Commerce.\n\nFor over half a decade,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694877/constituent-of-the-week-ernisha-hall"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Program from over 100 countries to learn from his practices  and spark ideas they can carry back home.\n\nKentucky is proud to call Mr. Neville one of our own, and I am  honored to recognize his remarkable contributions to our home and the  world. I once again congratulate him on receiving the Citizen Diplomat  Award and wish him the best in his future work.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I am honored to recognize Robert Upton, a  Culpeper native who is training to join the U.S. Navy Submarine Force.\n\nRobert is currently a student at the Naval Submarine School, training  to serve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694938/recognizing-robert-upton"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…career in the skilled trades.\n\nWe in Wisconsin are so grateful to WRTP BIG STEP for helping to  uplift our workforce and create the next generation of leaders. I am  honored to recognize the 50th anniversary of WRTP BIG STEP and look  forward to its continued success in Wisconsin for years to come.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…service through the North Carolina Council of Churches where  she serves on the Board of Directors, the Delta Sigma Theta Sorority,  and health advocacy networks. I am honored to recognize Rev. Dr. Della  J. Owens-Barber on her fourth anniversary as Senior Pastor at the Saint  James Christian Church and salute her for her passionate service to her  community…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…spirit, neighbors helping neighbors and lifting each other up in times  of need. His work reminds us all that small acts of kindness can have a  profound impact.\n\nI am honored to recognize Steve Martin today. Let's thank him for his  unwavering commitment to making our communities a better place for all.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…of exceptional bravery and quiet heroism that can be  found all across my district.\n\nThese two police officers represent the very best of law enforcement,  and I am honored to recognize their service to my community back home.\n\nOn behalf of my office, the Sixth Congressional District of Georgia,  and the United States House of Representatives, I thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695085/commending-myesha-cooper-and-robert-johnson-south-fulton-police-officers"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "Mr. MOULTON. Mr. Speaker, I am honored to recognize my friend, Father  Shaughnessy.\n\nI was at a marine reunion this weekend, and we heard remarkable  stories of heroism from ordinary Americans who signed up for the Marine…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692558/recognizing-father-paul-shaughnessy"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…grateful to be a part of this process and for the  work my colleagues here are putting into this, as well.\n\nIn addition to the reconciliation work, House Republicans are honored  to recognize Police Week and highlight the important work of our law  enforcement officers that they do each day.\n\nI just was walking through the Capitol rotunda, and I saw a few…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I'm honored to recognize Mr. Brian Wisler on  his well-earned retirement after 35 years.\n\nMr. Wisler was hired by the Central York School District in 1990 as  an elementary physical education…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690717/recognizing-brian-wisler"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I'm honored to recognize Corporal (Cpl)  George Ivanoff, United States Marine Corps (USMC), on the auspicious  occasion of his 100th Birthday on July 24, 2025.\n\nCpl Ivanoff, born in Harrisburg…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…including his wife Helen Tolar--who  was also a decorated House and Senate senior staff member--and their  three children Walker, Mary Mac, and Oliver.\n\nMr. Speaker, I am honored to recognize Mac Tolar for his outstanding  contributions and overall impact on our Nation. Whether it was in the  military, local or state government, or as an employee of the House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…destination, and its contributions have had a positive and lasting  impact on the region.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize the Tahoe Yacht Club for their 100-year  anniversary.               national teacher appreciation week: danna mccoy\n\nMr. KILEY of California. Mr. Speaker, in the spirit…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…success and workforce advancement is  truly inspiring, and her retirement marks the closure of a remarkable  career devoted to improving lives through education. I am honored to  recognize her for her extraordinary service and congratulate her on her  well-earned retirement. I wish Dr. Quirk-Bailey and her loved ones the  very best in the years ahead.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…serve as a solution to the issues that are  facing our communities and the Nation at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions for reaching  this significant milestone and for their ongoing dedication to  protecting the beauty of Lake Tahoe's shorelines for generations…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, I am honored to recognize the  life of my good friend, Mr. Bobby Beagles, who passed away on February  16, 2025, and is survived by his loving wife, Vickie, son, Thomas,  daughter, Rachel, and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I am humbled and honored to recognize the  life and legacy of Stanley R. Lawson, Sr., a veteran and trailblazer in  Pennsylvania.\n\nBorn and raised in Harrisburg, Stan was a loving father, son,  community…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Speaker, I am honored to recognize Chief Master  Sergeant Robert S. Smith on his retirement from service to our Nation  in the United States Air Force and Air National Guard.\n\nChief Smith entered the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Veterans Preference--demonstrates his steadfast  commitment to our veterans and Nation.\n\nJerry Landkamer embodies the very spirit and service of the American  Legion. I'm honored to recognize his election to National Vice  Commander and know his family and community share in the same pride of  this well-earned achievement.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695830/recognizing-norfolks-jerry-landkamer-on-his-election-as-national-vice-commander"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…drivers. She emphasizes the need to stay fit and healthy is vital  as a long-haul truck driver. Karen is also the proud mother of two sons  and has one granddaughter.\n\nI am honored to recognize Karen Partin for completing this unique and  coveted milestone.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…serve as a  solution to the issues that are facing our communities and the Nation  at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions for reaching  this significant milestone and for their ongoing dedication to  protecting the beauty of Lake Tahoe's shorelines for generations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…the professionals,  scholars, and organizations who advance the discipline and underscores  the importance of transparency, accountability, and lawful practices.\n\nI am honored to recognize February 26 as National Open-Source  Intelligence Day.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700249/recognizing-national-open-source-intelligence-day"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…four decades. Mike's commitment to his community is truly inspiring,  and his retirement marks the conclusion of a remarkable career devoted  to serving others. I am honored to recognize him for his extraordinary  service and congratulate him on his well-earned retirement. I wish Mike  and his loved ones the very best in the years ahead.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697208/congratulating-mike-oltman-on-his-retirement-with-the-woodford-county-emergency-management-agency"}]