[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…over arrogance.\n\nMr. Speaker, I ask my colleagues to join my wife Vivian, and me,  along with the more than 765,000 people of Georgia's 2nd Congressional  District in honoring the life and legacy of Adrian Earl Jenkins, Sr.  Our city, our Nation and the world are better because he walkdd among  us. We mourn his loss but celebrate a life whose enduring…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…colleague shared, serving as a board member of the Make-A-Wish  Foundation of the Hudson Valley and chairman of the March of Dimes.\n\nI encourage my colleagues to join me in honoring the life of Sheriff  Anderson by naming a post office in Holmes, New York, after him.\n\nMs. RANDALL. Mr. Speaker, I urge my colleagues to support this  legislation, and I yield…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697691/sheriff-adrian-butch-anderson-post-office-building"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…a  symbiosis in Houston, having people of different hues, different  ethnicities, from different places around the world come together.\n\nFinally, we have a resolution honoring the life and enduring public  service of Congresswoman Sheila Jackson Lee.\n\nI--personal pronoun--will not allow their legacies to be stolen. I  will not. And I will not allow…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…shot while undercover  investigating a double homicide. His sacrifice while serving in the  line of duty deserves to be honored.\n\nI encourage my colleagues to join me in honoring the life of Officer  Mazurkiewicz by naming a post office in Avon, New York, after him.\n\nMs. RANDALL. Mr. Speaker, I have no further speakers. I urge passage  of this bill, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697615/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…should all aspire.\n\nMr. Speaker, I ask my colleagues to join my wife Vivian and me, along  with the more than 765,000 people of Georgia's Second Congressional  District in honoring the life and service of Mrs. Juanita Carson Booker  on the occasion of her 95th birthday.", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…That night, Mr.  Gomez did show us what true bravery is all about.\n\nMr. Speaker, I pray that Otoniel's family continues to recover from  the loss of their home.           Honoring the Life and Legacy of Doris Ann Derleth Hirota\n\nMr. CORREA. Mr. Speaker, I rise today to honor the legacy of Doris  Ann Derleth Hirota.\n\nDoris was a Santa Ana resident, the youngest…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "Ms. OCASIO-CORTEZ. Mr. Speaker, I thank the gentleman from Texas (Mr.  Green) for yielding to me.\n\nToday the Republican House majority brought to the floor a resolution  honoring the life and legacy of Charlie Kirk.\n\nCharlie Kirk's assassination was a horrific and vile attack. It was  an incident of political violence, and condemning the depravity of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…people and to so many who  came to know her. May her name be honored forever. I thank the Speaker  for allowing me to enter her story into the Record.                      Honoring the Life of Timothy Haase\n\nMs. KAPTUR. Mr. Speaker, I rise to honor the life of Timothy Haase, a  devoted son, brother, caregiver, and the steady heart of Dino's Family  Restaurant…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…letter carrier for an impressive 40  years before his passing in 1949.\n\nMr. Speaker, I urge strong support for this legislation by  encouraging my colleagues to join me in honoring the life of Oscar  Upham by naming a post office in Guthrie, Oklahoma, after him. I yield  back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697637/oscar-j-upham-post-office"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…America elects a President  devoid of sympathy and compassion.\n\nMay this be the last time that we choose someone so heartless and  cruel, who denies the basic dignity of honoring someone's life when  they have been murdered.\n\nMay this be the last time we choose someone who divides us instead of  unites us.\n\nMay this be the last time we elevate and celebrate…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698116/president-trumps-offensive-post"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…will continue to, fight for every  student, every family, and every school in America, including those in  the San Joaquin Valley that I represent.                       Honoring the Life of John Harris\n\nMr. COSTA. Mr. Speaker, I rise today sadly to pay tribute to John  Harris, a good friend and a giant of California agriculture and the San  Joaquin Valley.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…continuing this work in Congress and fighting to  lower tolls even further and pushing for policies that put more money  back in the pockets of working families.             Honoring the Life and Memory of Supervisor Bob Weir\n\nMr. SUBRAMANYAM. Mr. Speaker, I also rise today with profound sadness  to honor the life and memory of Supervisor Bob Weir, who served…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…strengths. As a woman who was one in a million,  she continued to prove to the people who surrounded her, that they were  also just as special.\n\nMr. Speaker, please join me in honoring the life of Alice Kitchen.  Her passing is devastating, but the legacy she leaves behind reminds us  that no matter how short life tends to be, we can still make a world of  difference.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…also participated in multiple sit-ins in Atlanta while a  minister at Ebenezer Baptist Church, where Dr. King held a pastorate.\n\nI encourage my colleagues to join me in honoring the life of Reverend  Middlebrook by naming a post office in Knoxville, Tennessee, after him.\n\nMr. Speaker, I urge strong support from all of our colleagues for  H.R. 1372.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697618/reverend-harold-middlebrook-post-office-building"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…place because of Cliff.\n\nMr. Speaker, I ask my colleagues to join me, my wife Vivian, and the  more than 765,000 people of Georgia's Second Congressional District in  honoring the life and legacy of Mr. Clifford Odell Rutledge. We extend  our deepest sympathies to his family, friends, colleagues, and all  those who mourn his loss. May we all find comfort…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…no doubt that he will  bring the same integrity and dedication as he embarks on a new chapter.  Doina and I wish Nate and his wife, Lauren, the very best.               Honoring the Life of Anthony ``Tony'' DeFeciani\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Anthony  ``Tony'' DeFeciani, who passed away peacefully on December 23, 2025.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…academic excellence for her students. Lake County is fortunate  to have such an excellent servant, and I am honored to congratulate her  on receiving this award.              Honoring the Life of Julius ``Jules'' Kwiatkowski\n\nMr. FINE. Mr. Speaker, I rise today to honor the life of Commissioner  Julius ``Jules'' Kwiatkowski, a faithful public servant who served…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…celebrate that ray of  light that is never dimmed. May BEAM continue to shine, lighting the  path forward for those who need it most for years to come.                 Honoring the Life of Carrol Eugene Franklin\n\nMr. BEAN of Florida. Mr. Speaker, today I rise with a heavy heart but  a grateful spirit to honor the life of my friend, Commissioner Carrol…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…coaches, and community. I congratulate him on  this incredible achievement and wish him all of the best and continued  success in the years that lie ahead.                 Honoring the Life and Service of Jim VanWert\n\nMr. MACKENZIE. Mr. Speaker, I rise today to honor the life and  service of Jim VanWert, a dedicated member of the Lower Macungie Fire  Department,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…New Year's Day.\n\nAt that time, I heard from his son, Charles Peltz, who found himself  caught in a maze of bureaucratic VA red tape. Instead of being able to  focus on honoring the life and service of his father, the Peltz family  was forced to contend with a system that failed the very veteran it was  designed to serve.\n\nHero Ernest Peltz did everything…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…who loves being with people and is a  wonderful friend, aunt, and, most of all, mother.\n\nMr. Speaker, I wish Eileen a very happy 100th birthday.                       Honoring the Life of Bob Sekerak\n\nMr. MILLER of Ohio. Mr. Speaker, I rise today to honor the life of  Bob Sekerak, a proud Clevelander.\n\nBorn to John and Mary, and beloved husband to Linda,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Lawrence for his exceptional contributions, and I thank him for the  example he sets.\n\nMr. Speaker, I congratulate Marlon on this well-deserved recognition.                   Honoring the Life of Ms. Elizabeth Pryor\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the life of  Ms. Elizabeth Katherine Pryor, a civil rights activist, educator, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…University.\n\nThe Glenvar Highlanders have made their school and community proud. I  ask my colleagues to join me in congratulating these outstanding young  athletes.\n\nHonoring the Life of Justice Lawrence Larkins Koontz, Jr.\n\nMr. CLINE. Mr. Speaker, I rise today to honor the extraordinary life  and legacy of Justice Lawrence Larkins Koontz, Jr., of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…aisle must unite to reject political violence in all  forms across the country.\n\nMelissa Hortman was a dedicated public servant, and we join Minnesota  and the Nation in honoring her life and the life of her husband, Mark.  We also pray for the speedy recovery of John and Yvette Hoffman and for  peace and unity in the face of tragedy and division.\n\nMr.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I appreciate Mr. Moore doing this Special  Order this evening. It is truly an honor and a privilege for me to join  my colleagues in honoring the life and the legacy of our good friend,  Doug LaMalfa.\n\nThroughout my time in Congress, I worked hand in hand with Doug on  the many issues that face the American West. He…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Huntingdon Area School District, Superintendent  Mitchell, and the school board directors on the district's designation  as one of Pennsylvania's great schools.            Honoring the Life and Community Impact of Tina Pelesky\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise to honor the life and  community impact of Tina Pelesky, a dedicated advocate for…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…of New York, I wish him the  very best in his retirement and have no doubt that his voice and his  witness will continue to inspire for years to come.                    Honoring Life of Alfred ``Al'' Magnatta\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Alfred  ``Al'' Magnatta, who passed away just a week before what would have  been…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…deliver a  product that is worthy of support. I have not decided whether I will be  able to support it. We will find out whether it has what is needed.                      Honoring the Life of Diana Denman\n\nMr. ROY. Mr. Speaker, I do want to take one second before I yield to  my friend from California to honor a dear friend of mine who passed  away a couple…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…removing dangerous criminals from our streets.  Just 3 months into his term, the results of these policies truly speak  for themselves: Promises made, promises kept.\n\nHonoring the Life of Lieutenant Colonel Boyd ``Buzz'' Wagner\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor World  War II ace pilot and Johnstown native, Lieutenant Colonel…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}]