[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…leadership, he did a commendable job  modernizing and expanding North Metro Fire, and he improved  collaboration for emergency services in surrounding communities.\n\nChief Ramos honorably served this community for decades through  numerous challenges, and he has been widely regarded as a mentor and a  friend to many. Throughout his career, he was a visionary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695834/recognizing-fire-chief-david-ramos"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…from South Girard High School in Phenix City and furthered  his education at Alabama A&M University in Huntsville, Alabama.  Following his studies, Cliff served our country honorably in the United  States Army from 1950 to 1953 during the Korean Conflict.\n\nIt has been said that ``Education is the passport to the future; it  belongs to those who prepare…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. NEAL. Mr. Speaker, I rise today to recognize the distinguished  service and extraordinary career of Colonel David L. ``Moon'' Halasi- Kun, who has honorably served our Nation for more than twenty-five  years and most recently as the Wing Commander of the 104th Fighter Wing  at Barnes Air National Guard Base in Westfield, Massachusetts.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…nearly ten years as President of  the International Brotherhood of Electrical Workers (IBEW), Local Union  68.\n\nPresident Buchanan dedicated his life to service. He served honorably  for 17 years in the U.S. Army before enrolling in the Denver Joint  Electrical Apprenticeship program, and went on to become Vice President  of IBEW 68 and eventually President.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…killed in  action while serving in the U.S. Armed Forces. It represents not just  injury, but sacrifice--the physical cost of defending our freedoms.\n\nCorporal Donald served honorably for over six years, including  deployments to both Afghanistan and Iraq. His time in uniform coincided  with some of the most dangerous years of conflict, ending in 2011.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the United States stood behind Congress's  decision and enlisted in our services and risked their lives in combat  in Afghanistan. It was a terrible assignment. They did it honorably.  They did it effectively.\n\nOne of the keys to their success in eliminating Osama bin Laden and  many of his followers was the support of some Afghan people who risked  their…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…delayed the runoff election another 3 months, these  Texans finally have the representation that they deserve.\n\nAt this moment, we remember the life of Sylvester Turner, who  honorably served Houstonians for a decade or more as mayor and State  representative, and who took over after the passing of our colleague,  Sheila Jackson Lee, who we all remember…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Colonel Dinh was commissioned as an  officer in December 1995 and graduated from the Armor Basic Officer  Leader Course in September 1996.\n\nColonel Dinh served our country honorably for 35 years, culminating  in his service as commander of the 455th Chemical Brigade in Sloan,  Nevada. Colonel Dinh's leadership positively impacted the lives of  countless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…our community today. Judy left the Mayor's Office in 2010 to  launch her campaign for the Columbus City Council.\n\nElected to the Columbus City Council in 2011, Judy served honorably  for four terms representing District Nine (At-Large). She diligently  assumed the role of Budget Chair for several Council cycles, always  focused on fiscal responsibility…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…later, that we will  not rewrite the history of January 6.\n\nI urge my colleagues to support this amendment and to remember the  men and women who have defended this country honorably--those who  upheld their oaths, who protected our democracy--and those who continue  to serve with courage and sacrifice.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Service Cross. Following the fighting at D-day, Mr.  Lomell continued to serve his country in other battles, earning a  Silver Star. After receiving another injury, he was honorably  discharged in December of 1945.\n\nAfter the war, Mr. Lomell returned to New Jersey, where he settled in  Toms River. He graduated from Rutgers University Law School, married…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…doing very well, thank you.\n\nI am also proud to welcome Alissa Ellman, a disabled Army veteran  recently fired from the VA in Lockport, NY, in Western New York. Alissa  served honorably in Afghanistan and was diagnosed with a rare cancer  associated with toxic burn pit exposure.\n\nEven while receiving treatment, she wanted to work; she wanted to  serve her…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…origin.''\n\nMany servicemen wrote to President Truman. Perhaps the most pivotal  letter that Truman got came from Isaac Woodard, Jr., a World War II  veteran who, hours after being honorably discharged from the United  States Army, was dragged off a bus and beaten to near death and blinded  by police in Batesburg-Leesville, South Carolina.\n\nIn response to Woodard's…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…to do things that they wouldn't  ordinarily do.\n\nWho are we to say: ``Get a job, you bum?''\n\nMany of them are people who served in our armed services and who have  served honorably protecting our flanks in foreign lands.\n\nWho are we to say: ``Get a job, you bum?''\n\nWho are we to judge them, to roll our window up quickly and speed off  as if we didn't…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…colleagues to join us in opposing the  previous question so that we can take up this important measure to  restore the livelihoods of veterans who have served our country  honorably and who have continued to do so through civilian service.  Let's reverse course immediately and get these veterans their jobs  back.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Commendation. His life and career reflect hard  work and selfless service to his nation and Central Texas\n\nEnlisting in the Army after graduating from high school, COL Wilson  honorably served on Active Duty for 29 years and the Texas National  Guard for 3 years. During his career, he courageously served our nation  in both Iraq and Afghanistan. His exemplary…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Army Field  Artillery School in Fort Sill, Oklahoma, and was deployed to Korea with  the 7th Infantry Division, where he helped defend the Demilitarized  Zone. After being honorably discharged as a First Lieutenant in 1963,  Jay worked for Ford Motor Company and later earned an MBA in Finance  from Columbia University. In 1965, he married his wife, Arleen.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691577/recognizing-jay-post"}, {"senator": "John Carter", "party": "Republican", "sentence": "…U.S. Army,  Retired, with a Congressional Veteran Commendation. His service to both  the Army and  his Nation exemplifies our Nation's altruistic spirit.\n\nMG Hamilton served honorably in Armor and Cavalry units in the Texas  Army National Guard for 35 years. He served full time in operational  assignments including Director of the Joint Staff, Chief of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689353/saluting-the-service-of-major-general-patrick-hamilton"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…country.\n\nRalph is a veteran of the Second World War and served with the United  States Army from 1943 to 1946. He participated in the South Pacific  campaign, and after being honorably discharged, he joined the Army  Reserves in 1948 where he remained until 1985. For his distinguished  service, Ralph has received the Meritorious Service Medal, the Southern…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…during his time in  the reserves, Walt's expertise and commitment to service were clear. He  deployed to Afghanistan in 2010 to 2011 with the Army Reserves, where  he served honorably before being medically discharged.\n\nAfter leaving active service, Walt continued his commitment to  helping fellow Veterans by becoming involved in Veteran organizations,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…was born in a 1920, a defining moment in history  when the world faced the threat of tyranny and oppression. Answering  his Nation's call to service, Captain Blair served honorably in the  United States Army Air Forces during the Second World War, where he  demonstrated the incredible valor that were the hallmarks of America's  Greatest Generation.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697045/recognizing-captain-floyd-blair"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "Mr. DUNN of Florida. Mr. Speaker, I rise today to recognize a truly  outstanding man, a man who served all of the people in Florida  honorably, with wisdom, and admirable class.\n\nMy dear friend, John Thrasher, passed away on May 30 at the age of  81.\n\nJohn Thrasher was a highly decorated soldier, Speaker of the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692063/recognizing-john-thrasher"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Bougainville,  and Green Island, in which he was awarded a Unit Citation for his  meritorious actions. He later worked in aviation electronics in North  Carolina before being honorably discharged in 1945. During the conflict  in Korea, Walter was also briefly called back to duty from the  Reserves.\n\nAfter his service, Walter has continued to be an upstanding…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Madam Speaker, I rise today in honor of Tiffani  Jaseph, who was honorably named the 2026 Arizona Teacher of the Year.  Tiffani serves as a special education teacher at Copper View Elementary  School in the Sahuarita Unified School District.\n\nTiffani…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…I will tell you  what I have told Mr. Crane privately. I will say it publicly. I revere  his service to the country. We must always thank those who served, and  he served honorably.\n\nOn this amendment, the bill that we are debating right now  substantially reduces spending, while strengthening our national  security.\n\nPart of the strategy is to ensure…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…proud Clevelander.\n\nBorn to John and Mary, and beloved husband to Linda, Bob's greatest  joy was his son, Brian.\n\nDrafted into the Army during the Vietnam war, Bob served honorably as  a medic in Seattle.\n\nAfter the war, he returned home to Hinckley, where he spent happy  days swimming in the lake and enjoying barbecues with his family and  friends.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…coclerks that he has worked with at the Tenth Circuit  and the U.S. Supreme Court.\n\nLike Mr. Dunlap, I believe Mr. Tung will make a phenomenal judge and  serve this Nation honorably and with distinction. I encourage my  colleagues to support both of these fine circuit court nominees.", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…commitment to God and  country, and to serve and protect us against our enemies. They serve a  noble cause. May they ever carry the torch of liberty and continue to  serve honorably for the next 250 years.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Command and General  Staff College, where he graduated with honors. He held a series of  command positions and earned numerous service awards and medals. He was  discharged honorably as a Lieutenant Colonel.\n\nFollowing his military service, Mr. Ziegenfuss started an  environmental company, which he subsequently sold, was vice president  of operations…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690124/recognizing-hollister-city-administrator-rick-ziegenfuss"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…and devoted his life  to the American Dream.\n\nBorn in Marks, Mississippi, and raised in Memphis, he was very proud  of his country. Fred Smith was a true patriot, serving honorably as a  captain in the United States Marine Corps in Vietnam. After that  service, he returned home with a bold idea: a company that could  deliver packages overnight around…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}]