[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, it is my honor to recognize Chief Brian  Layton on his retirement from the Fredericksburg Police Department  after three decades of service.\n\nChief Layton has served in the department since 1994…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697520/recognizing-chief-brian-layton"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…from Marquis Who's Who In  America. Additionally, he was in the Global Directory of Who's Who as  the Top Doctor of 2013.\n\nFor his outstanding accomplishments, it is my honor to recognize Dr.  Huu Vo. His service and commitment to both California and our Nation  are worthy of the highest commendation.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, it is my honor to recognize George Hinckley  on his work in founding Smart Community STEM Camp.\n\nThis camp is a youth program that teaches kids coding and how to fly  and operate drones, provides…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698648/recognizing-george-hinckley"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…she worked in the supply chain and logistics department. She retired in  2003, leaving behind a legacy of excellence in both her workplace and  her community.\n\nIt is an honor to recognize Norma Thom during Caribbean American  Heritage Month. Her enduring legacy continues to uplift Rochester and  inspire future generations.", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692568/recognizing-norma-thom"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the  greatest benefit to humankind.'' In 2025, a record-breaking number of  them came from one public university system: the University of  California. Today, it is my honor to recognize each of California's  five Nobel laureates for their achievements.\n\nFrederick J. Ramsdell, an alumnus of the University of California,  San Diego, and the University…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…William O. Wagstaff, IV; her daughter-in-law,  Christina; and bonus children, grandchildren, great-grandchildren,  cousins, and friends who have become family.\n\nIt is an honor to recognize Lynne on the House floor today.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today with great joy and honor to  recognize the Igbo Community Association of Nigeria (ICAN) DFW and its  annual Igbo Day Celebration.\n\nFor over 25 years, ICAN DFW has played a pivotal role in preserving  the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…people is not  forgotten. Mel is committed every day to increasing awareness. I'm  proud to support the work of Mel and so many others who serve our  community. It is an honor to recognize his accomplishments and service  thus far.\n\nMel is a great community leader, author, and musician. His  preservation efforts remind us that, as a community, we benefit…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, it is my honor to recognize Joseph Seebode  on his retirement from the United States Army Corps of Engineers. Mr.  Seebode has dedicated 44 years of Federal service to USACE and his many  achievements…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, it is a profound honor to recognize His  All-Holiness Ecumenical Patriarch Bartholomew, known throughout the  world as the ``Bridge Builder'' and the ``Patriarch of Peace.'' As the  spiritual leader of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…for  Agate Housing and Services, Groveland Emergency Food Shelf, and  Sabathani Food Shelf.\n\nTed truly embodies what it means to live a life of service. It is  truly an honor to recognize him here today.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690796/recognizing-ted-pouliot"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "Ms. PINGREE. Mr. Speaker, it is my distinct honor to recognize  Patrick Keliher as the 2025 recipient of the Atlantic States Marine  Fisheries Commission's Captain David H. Hart Award. This recognition  honors Pat's remarkable leadership…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise to honor and recognize Reverend Sarah  Yvonne Williams Carr, a truly remarkable woman who has dedicated her  life to serving the Ebenezer Baptist Church and the Alexandria  Community.\n\nReverend…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Senator Bob Wieckowski and also  contributed her expertise as a member of Assemblymember Anthony  Rendon's State Blue Ribbon Commission on Early Childhood.\n\nIt is my honor to recognize Parvin Ahmadi for her decades of service,  leadership, and enduring impact on public education. Her legacy is one  of integrity, dedication, and a deep commitment to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "Ms. PINGREE. Mr. Speaker, it is my distinct honor to recognize Annie  Watson as the 2026 recipient of the Maine Department of Agriculture,  Conservation and Forestry Commissioner's Distinguished Service Award.  This recognition honors…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…which forgets its defenders will be itself  forgotten.'' His words perfectly encapsulate the importance of  remembering our Vietnam War veterans.\n\nI rise today with great honor to recognize the legacy and great  sacrifice of our Vietnam War veterans through The Wall That Heals,  which will be on display in Nassau County, Florida, from April 17th  through…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…a record of 24-3-2. Their championship  win marks the first state title--not only for the program--but for any  girls hockey team south of the Twin Cities.\n\nIt is my honor to recognize this year's Class 1A Minnesota Girls'  Hockey Champions today. Thanks to the strong leadership and  encouragement from Coach Gunderson, and relentless support by the…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…I congratulate the world champion McCutcheon Mavericks Robotics team.                     Recognizing Sergeant Rodney Jenkins\n\nMr. BAIRD. Mr. Speaker, I rise today to honor and recognize Sergeant  Rodney Jenkins, a dedicated public servant who devoted over two decades  to law enforcement in Montgomery County, Indiana.\n\nAt 19, Rodney became one of the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…needs of the  nation have evolved. Throughout it all, the men and women of the 55th  Wing have never wavered in their mission to fly, fight, and win. It is  my great honor to recognize their achievements and salute their history  today. Once again I say, happy birthday to the men and women of the  Fightin' Fifty-Fifth.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…look forward to the 54th annual trip  next year.             Honoring 2025 Graduating Class of Leadership Rocklin\n\nMr. KILEY of California. Mr. Speaker, I rise today to honor and  recognize the 2025 graduating class of Leadership Rocklin. This  prestigious program is run by the Rocklin Area Chamber of Commerce and  provides an opportunity for participants…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…embodies the highest ideals of service,  both in uniform and as a citizen leader. His legacy is one of valor,  compassion, and unwavering devotion to others. It is an honor to  recognize him today with the 2025 Congressional Veteran Commendation.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696272/recognizing-christopher-aaron-mcgowen-with-a-congressional-veteran-commendation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Mr. Michael A.  Tarr for being named the 2025 Marquette County Veteran of the Year.  This well-deserved honor reflects his steadfast dedication to his  fellow Servicemembers,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…activities, as well as  plenty of vendors in the heart of downtown. It is a fitting way to  honor the town's impressive history while celebrating its bright  future.\n\nIt is an honor to recognize this special anniversary. I applaud the  community leaders and volunteers who dedicated their time and energy to  celebrate Fort Laramie's rich Western heritage. What…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mrs. FISCHBACH. Mr. Speaker, I rise today to honor and recognize the  distinguished career of Mary Krinkie.\n\nFor 25 years, Mary has served as the vice president of government  relations at the Minnesota Hospital Association. She is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698583/recognizing-mary-krinkie"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, I rise to honor and recognize my  friend, Reba Y. Mazak as the 2025 Woman of the Year in Agriculture for  the State of Florida. Today, she was honored at the Florida State  Fair--America's Sunniest…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…educating the public, and building the kind of trust that only comes  from a hundred years of walking the walk.\n\nAs the Representative for New York's 23rd District, it is my honor to  recognize this incredible milestone and to thank every past and present  member of the Kennedy Fire Department for their service. Their legacy  is not only one of bravery, but…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…us all. I am forever grateful to him and other members  of the Greatest Generation for sacrificing and fighting to preserve the  freedoms that we hold dear. It is my honor to recognize his life and  his service before the United States Congress.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690221/in-memory-of-vaughn-p-drake-jr"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…decades of selfless service to this  great Nation. His legacy of leadership, sacrifice, and patriotism will  continue to inspire generations to come, and it is my distinct honor to  recognize him as our Veteran of the Month.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Mr. Thomas  Pelissero for his heartfelt tribute to his hometown of Bessemer,  Michigan, in his book: ``Bring One Home: A Memoir of Boyhood,  Basketball, and Hometown…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Health Care to assist rural communities in  obtaining accessible healthcare.\n\nMr. Speaker, Dr. Hotz represents the best of compassion and community  service, and it is an honor to recognize him and his many  accomplishments.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}]