[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…delegations and districts will be raising awareness of  the urgent need for policies that improve cancer prevention, early  detection, treatment, and patient support. It is truly an honor to have  these advocates with us this week sharing their stories of resilience,  loss, determination, and hope.\n\nLike so many of these advocates, I know firsthand the impact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…values, and it honors the community that has spent  decades repairing the damage caused by a Federal infrastructure that  was built without Tribal consent.\n\nAs someone who has the honor of representing the Lower Elwha Klallam  Tribe, I am proud to lead this legislation alongside Senators Cantwell  and Murray. I recognize the dedication and work of my predecessor,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…stand here before  you a proud graduate of the Harvey S. Firestone High School, the  founder of the Firestone Tire and Rubber Company.\n\nYes, we are proud in the city of Akron to honor the legacy of rubber  workers in my district. As the centerpiece of downtown Akron's Main  Street corridor, you can find a statue of a rubber factory worker  standing tall…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…overseas during  World Wars I and II were put to rest on foreign soil without the full  picture of who they were as people. In life, these servicemen and - women showed courage, honor, respect, dignity, and sacrifice. In death,  some have been unfortunately misrepresented.\n\nNot because of malice, but more often circumstances of time, space,  and uncertainty,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…generations of students will remember his dedication to  higher education long after his retirement.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Joe Garcia and thank him for his  commitment to the people of Colorado.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize and honor Chief  Brian Tholen for his distinguished career in law enforcement and his  lifelong commitment to serving the people of Minnesota through  education, volunteerism, and public…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…enables small businesses to reach new  markets, assists families in cultivating bonds across borders, and  supports Americans in representing our Nation's values abroad.\n\nWe also honor the great people who make up this institution; their  professionalism and diligence have made possible the extraordinary  journeys of so many. On behalf of the Commonwealth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…testament to Ricky's hard work, determination, and perseverance at  Jefferson Jr./Sr. High School and is clearly just the beginning of a  bright and promising future.\n\nIt is my honor to congratulate Ricky Martinez on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690401/recognizing-ricky-martinez"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…legal system and the  need for reform as we continue to fight for reproductive freedom across  our Nation.\n\nOn behalf of Michigan's Third Congressional District, I am proud to  honor Tammy Myers for her advocacy and leadership. We thank her for her  tireless work in fighting for her children--Eames, Ellison, and  Corryn--and the hard-working Michiganders…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691857/recognizing-tammy-myers"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, it is my honor to recognize Chief Brian  Layton on his retirement from the Fredericksburg Police Department  after three decades of service.\n\nChief Layton has served in the department since…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697520/recognizing-chief-brian-layton"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, today, I rise to honor an exceptional  member of my staff who is moving on to his next chapter.\n\nMarc Rabourdin, my deputy district director, has served the people of  Virginia's Seventh Congressional…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Ms. STRICKLAND. Mr. Speaker, I rise today to honor Willie Adams,  former president of the International Longshore and Warehouse Union,  who recently retired. For more than 40 years, Willie focused on  supporting working families,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695163/congratulating-willie-adams-on-his-retirement"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, it is with a heavy heart that I rise,  together with my colleagues from the New York delegation, to honor the  memory of former Congresswoman Carolyn McCarthy from New York's Fourth  Congressional District.\n\nShe was a trailblazer in Congress and a visionary leader who turned  an…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…a testament to Elijah's hard work, determination, and perseverance  at Mandalay Middle School and is clearly just the beginning of a bright  and promising future.\n\nIt is my honor to congratulate Elijah Stimpfl on achieving the Arvada  Wheat Ridge Service Ambassadors for Youth Award.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691283/recognizing-elijah-stimpfl"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, it is my honor to recognize Dorothy Giamboi  on her conclusion of service to the Borough of Metuchen Council. After  fourteen years, Dorothy stands as the longest-serving Council Member in…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "Mr. FONG. Mr. Speaker, I rise today to honor the life and legacy of  my friend and colleague, Doug LaMalfa.\n\nDoug was a steadfast champion of rural California and for the issues  that matter most to millions of Americans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698728/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…generations of Americans by reigniting pride in our  shared American values and our constitutional Republic.''\n\nThis bipartisan bill will give our Nation the opportunity to honor  John Adams and his family with the memorial they deserve. As America  approaches its 250th birthday, there is no better time to honor a  family whose ideas and sacrifices…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I rise today to honor Anna  Kathleen Cummins Kennedy of Poplar Bluff, Missouri, whose life  exemplified service to country, devotion to family, and tireless  commitment to community. Born on January…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…model for her children and grandchildren. I am pleased  to commend Kay for her distinguished career as an educator for our  youth, and I wish her continued success.\n\nIt is an honor to bestow Kay with the Patriot Award for her  exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor and commend Mayor  Joe Taylor of Langhorne Borough, Bucks County, Pennsylvania, a devoted  public servant whose life's work reflects unwavering commitment,  integrity, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…national recognition of his outstanding technical expertise and  dedication to keeping his unit mission-ready.\n\nThese two Mississippians embody the core values of the Coast Guard:  honor, respect, and devotion to duty. I am incredibly proud to  represent them and PSU 308 in Congress. Their service makes our Nation  stronger and our Gulf Coast proud.\n\nMadam…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690914/recognizing-bm1-bradley-walker-and-mk1-james-lang"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Master Sergeant  (MSgt) Gerald Timmins for his valiant service with the U.S. Marine  Corps as a member of the Medevac crews during the Vietnam War. This  recognition…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…marked the end of World War I.\n\nThe holiday is often marked by tributes and other ceremonies to show  our gratitude to our family, friends, and neighbors who have served.\n\nIn honor of Veterans Day, my office typically hosts a Veterans  History Project event to collect stories from Iowa veterans and submit  those stories to the Library of Congress to honor…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania  is the hub of AI development throughout this great land.                           honoring ritchey's dairy\n\nMr. JOYCE of Pennsylvania. Madam Speaker, I rise today to honor a  family-owned and operated dairy business in Martinsburg, Pennsylvania,  that has been a cornerstone of the dairy industry in Blair County for  85 years.\n\nRitchey's Dairy…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…in making that shutdown much  less likely.\n\nI thank the Presiding Officer for the opportunity to speak to you and  my colleagues.\n\nMr. MORAN. Mr. President, today, I rise to honor the passing of a  101-year-old Kansan, World War II veteran, and American hero, Horace  ``Jim'' Sharp.\n\nMr. Sharp was born in Morris County, KS, and he spent his early years…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…the  National Certified Dietary Manager (CDM), Certified Food Protection  Professionals (CFPP) Day, which this year fell on Friday, November 28,  2025.\n\nThis day is meant to honor the contributions these professionals have  made in the foodservice management profession and their vital role in  America's healthcare industry and particularly long-term…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697863/recognizing-the-national-certified-dietary-manager-cdm-and-certified-food-protection-professionals-cfpp-day"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…All Angels Episcopal Church in Dallas.  Trinka has truly made an incredible impact on the world around us, and  I wish her continued success for many years to come.\n\nIt is an honor to bestow my friend Trinka with the Patriot Award for  her exceptional service to the people of North Texas.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…students demonstrate not just academic achievement but also  strong devotion to our country. Young students like these will become  our Nation's leaders in the future.\n\nIt was my honor to call these students this weekend to congratulate  them on this true accomplishment.\n\nMr. Speaker, I congratulate Libby Russell and Zanna Paraskevas, who  were accepted to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689824/congratulating-floridas-eighth-districts-student-accomplishments"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…piece of legislation.\n\nMr. Speaker, I rise today in support of my bill, H.R. 3497, the Medal  of Sacrifice Act. Its purpose is singular. It is of the highest  importance to honor fallen law enforcement officers and first  responders.\n\nThis bill, this medal, came to be in this way on November 21, 2024,  because my community lost three Palm Beach County…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…thousands of students. John is a former  Carroll County Commissioner and a member of the Carroll County Farm  Bureau Hall of Fame.\n\nSelection for the Hall of Fame is a high honor that has been accorded  to only 257 Ohioans since 1966. Consideration for induction is given to  those who have made outstanding contributions to agriculture, Ohio's  top industry.…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}]