[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…community service through the North Carolina Council of Churches where  she serves on the Board of Directors, the Delta Sigma Theta Sorority,  and health advocacy networks. I am honored to recognize Rev. Dr. Della  J. Owens-Barber on her fourth anniversary as Senior Pastor at the Saint  James Christian Church and salute her for her passionate service to her…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I am honored to follow the chairman of  the Armed Services Committee, particularly in his remarks on the  Executive order that Donald Trump issued on Inauguration Day to declare  a nonexistent…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…service academy, in 1984.\n\nMidshipman Kristen Dickmann, a Naval Academy freshman and volleyball  player, tragically passed away at the age of 19 in 2008. Her memory is  now honored every single year, for over the last decade, via a  tournament in her honor.\n\nMidshipman 1st Class Sydney Barber, the Naval Academy's first  African-American female brigade…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689167/womens-history-month"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Castle Royale in Yonkers, where State Senator Nick  Spano is chairman with Tom Meier and Gail Burns as co-chairs.\n\nWe salute their good work and the individuals and groups honored at  this year's breakfast, including Dr. Iyad Annabi, who is receiving a  Lifetime Achievement Award.\n\nMr. Speaker, I congratulate all involved.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697681/operation-santa-claus"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "Mr. MOULTON. Mr. Speaker, I am honored to recognize my friend, Father  Shaughnessy.\n\nI was at a marine reunion this weekend, and we heard remarkable  stories of heroism from ordinary Americans who signed up for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692558/recognizing-father-paul-shaughnessy"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…failure  of policy but a moral failing. His leadership reminds us that  stewardship of our planet is inseparable from justice for our  communities.\n\nHis leadership has been honored across the world. In 1997, he  received the Congressional Gold Medal here in the United States, and he  has been recognized internationally as one of the most influential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, this morning I am honored to have my dear  friend, Father Jonathan Slavinskas, pastor of St. Bernard's Church of  Our Lady of Providence Parish in my hometown of Worcester,  Massachusetts, give today's…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700103/welcoming-reverend-jonathan-slavinskas"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I am honored and proud to be here  today with the Presiding Officer in the Chair, a veteran--albeit of the  Navy, not the Marine Corps--and to be accompanied by a fellow marine,  Senator…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…told three impatient visitors at the door that the place was       closed.\n\nAnd in 1989, a heart surgeon and coin collector from       California arrived in New York to be honored by the society       for his beneficence, only to be arrested--and later       convicted--instead. During his occasional visits, the good       doctor had been pocketing rarities…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…so important. It will ensure that  the young people who achieved their own challenging goals and who  helped their communities with their volunteer hours are recognized and  honored for their work.\n\nMr. Speaker, I thank my cosponsors again for their support and  Chairman Tim Walberg and Ranking Member  Bobby Scott for their  assistance and support of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…legislation and encourage my  colleagues to do the same.\n\nI ask all of my colleagues to join me in passing S. 201. I thank  Representative Pfluger for this legislation. I am very honored and  pleased to be able to support it, and I ask all of my colleagues to do  the same.\n\nBefore I yield back, I do want to say that there are many more of our  veterans who…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, the core of NATO is Article 5:  An attack on one is an attack on all.\n\nSince the end of World War II, the U.S. and our allies have honored  and operated on this mutual trust. President Truman called it a  neighborly act.\n\nThere is no article for if a NATO member attacks another because for  80 years, we have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Newlands from the fountain. On April  19, 2022, the Montgomery County Council introduced a resolution  affirming the county's support for this bill. Newlands should not be  honored on federal land.\n\nI urge my colleagues to support this bill.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, today I am honored to introduce the  ``Transportation Emergency Relief Extension Act'' to safeguard federal  funding for disaster-recovery projects. I thank U.S. Senator Alex  Padilla (D-CA)…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…How about making sure that America's girls are not  being raped? That is what it means to be America First. It doesn't mean  going and meeting with Saudi princes.\n\nI am so honored to be here and to work together with Congressman    Thomas Massie, who has shown so much courage and principle. I am so  honored to be here next to Congresswoman Marjorie…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…team from Savannah, Georgia, the dedicated staff of WTOC-TV  and congratulate them on their recent Emmy Award win at the 2025  Southeast Emmy Awards.\n\nThis remarkable team was honored with the award for best morning  newscast in a smaller market, recognizing their exceptional coverage of  Savannah's 200th Saint Patrick's Day celebration, a signature event…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693027/recognizing-wtoc-tv-in-savannah-georgia"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…care within the ambulance industry. In 2020, on  the 50th anniversary of the Wedworth-Townsend Paramedic Act, the  California Ambulance Association and the National EMS Museum honored  Hall Ambulance for its foundational leadership, recognizing the  organization among seventeen native Californians who helped shape  emergency medical services nationwide.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…air, space, and cyberspace.\n\nThroughout our history, American Airmen have demonstrated tremendous  courage and strength, beating back tyranny to the ends of the earth.\n\nI was honored to sponsor Kai's nomination, and I am confident that  his talents will distinguish him among his peers both during his time  at Air Force Academy and thereafter.\n\nI congratulate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692699/congratulating-kai-agyemang"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…TASER 10, that are not  designated to be lethal, are not included under the NFA's taxes and  regulations design for firearms for use by municipalities, not  individuals.\n\nI am honored to be a cosponsor of this bill along with, I think, at  least 22 commonsense Democrats, and I strongly supported its passage  through the House Ways and Means committee.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700029/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I am honored to welcome Jared Anderson and  the Friends of Club 21 Choir here to Washington, D.C.\n\nThe choir, composed of talented individuals living with Down syndrome  and who are based…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699252/welcoming-jared-anderson-and-friends-of-club-21-choir-to-washington-dc"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…advancing the cause of liberty.\n\nThe town is now home to Georgia's only colonial museum and serves as  one of the First District's most important cultural landmarks.\n\nI am honored to celebrate the one-hundred-year anniversary of the  town's incorporation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694770/recognizing-the-city-of-midway-georgia-on-its-centennial-celebration"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I am honored to be here this afternoon  to talk about what is so important to all of us, and that is  healthcare, not just health insurance.\n\nA clean, 3-year extension brought by the minority…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, it was an honor to visit Gateway Nursing and  Rehab in Lenoir, North Carolina, this past Friday and attend a program  that honored veterans who are receiving care there.\n\nI commend Shannon Price, the director of social services, as well as  members of the staff for taking the time and making the effort…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690222/recognizing-gateway-nursing-and-rehab"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…mourn the loss of Minnesota Speaker Melissa Hortman and her  husband, Mark. We pray for the swift recovery of my friend, Senator  John Hoffman, and his wife, Yvette. I was honored to serve with both of  them in the Minnesota Legislature.\n\nWe are still processing this senseless act, and I stand with my  colleagues today as we say that there is no place…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…air, space, and cyberspace.\n\nThroughout our history, American Airmen have demonstrated tremendous  courage and strength, beating back tyranny to the ends of the earth.\n\nI was honored to sponsor John's nomination, and I am confident that  his talents will distinguish him among his peers both during his time  at Air Force Academy and thereafter.\n\nI congratulate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692743/congratulating-john-epps"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…spent  countless hours writing and studying right here in the House Press  Gallery. Even after his tenure in the gallery, he often would return to  the Capitol.\n\nCongress has honored Douglass with a portrait and plaque in the  gallery and a statute in Emancipation Hall. This  resolution permanently renames these famous offices off of the House  floor for…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…progressives on the left would rather  defund the police or even abolish them entirely, but not me and not my  colleagues that are here with me today.\n\nThis National Police Week, I am honored to stand behind our law  enforcement as they keep our communities safe. I am especially proud to  stand  today and speak on behalf of H.R. 2240, the Improving Law Enforcement…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Illinois State  University and earned his Juris Doctor from the University of Illinois  College of law in 1973. While in law school, Jim was an editor of the  Law Review and was honored as a member of the prestigious national law  school honors society, the Order of the Coif.\n\nJim began his judicial career as a law clerk to Illinois Supreme  Court Justice…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…stabilized his wounds, and she is credited with saving the  man's leg and possibly even his life.\n\nIt is selfless acts like these that exemplify the best of our  community, and I am honored to recognize Judie's heroism today.\n\nMr. Speaker, it is a privilege to share her story, and I thank her  for her amazing service and resolve.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688226/recognizing-judie-kent"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…exemplify the  best of law enforcement. His actions not only protected a life that day  but also set a standard of excellence for his department and  colleagues.\n\nHe was rightfully honored with the lifesaving ribbon commendation bar  by Sheriff Carl James. We are beyond grateful for his bravery and  service to the Ware County community.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688323/recognizing-hunter-thomas"}]