[{"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…democracy.\n\nTaxpayer money should not be used to provide a military funeral to  someone who took part in an attack on this Capitol. This is about  accountability. It is about honoring those who have truly served with  integrity, and it is about making clear, 5 years later, that we will  not rewrite the history of January 6.\n\nI urge my colleagues to support…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…simple through line to all of this, Mr. Speaker. We all  know why Republicans are doing this with the Epstein files. We all know  why Republicans refuse to display the plaque honoring the brave law  enforcement officers who protected our democracy and protected all of  us on January 6. We all know why Republicans vote again and again and  again for all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Heart and Navy Commendation Medal with  Valor.\n\nThe Senate unanimously passed a similar version of this bill during  the last Congress. I urge my colleagues to join me in honoring the life  of Commander Olson by naming a post office in Casselton, North Dakota,  after him.\n\nMs. RANDALL. Mr. Speaker, I urge strong support for this bill, and I  yield back…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697597/commander-delbert-austin-olson-post-office"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Scisco is helping build a culture of safety and connection in  our schools, one relationship at a time. I thank him and the Cape  Henlopen School District.                      Honoring North Shores Beach Patrol\n\nMs. McBRIDE. Mr. Speaker, I rise today to honor the extraordinary  heroism of the North Shores Beach Patrol lifeguards who, while off  duty, sprang…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…welcome him and Lady Katrina to New Rochelle from the  floor of the House of Representatives, and I look forward to his many  contributions in the days to come.                  Honoring the Birthday of C. Nathan Edwers\n\nMr. LATIMER. Mr. Speaker, I rise to honor Archbishop C. Nathan  Edwers, spiritual leader and senior pastor at Friendship Worship Center…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…represent such an extraordinary citizen of  Batavia, Illinois, who exemplifies what it means to be a good neighbor  and a true public servant. I ask my colleagues to join me in honoring  Robert ``Bob'' P. Hubbard for his remarkable lifetime of service and  congratulating him on being named the 2024 Citizen of the Year.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…the immigrant community.\n\nMadam Speaker, we are going to miss her in Santa Ana, but we know at  her next post she will continue to be successful.                           honoring rick whittington\n\nMr. CORREA. Madam Speaker, I rise today to honor the career of Rick  Whittington and his valuable service to our community and our Nation.\n\nMr. Whittington…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the most important Founding  Fathers accessible to the millions of visitors who have the privilege  of touring the Capitol each year.\n\nThis legislation would change that, honoring one of the greatest  minds and patriots in American history.\n\nBenjamin Franklin was a statesman, diplomat, scientist, inventor,  political philosopher, and businessman. His…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…indelible mark on the 104th Fighter Wing,  and his service has brought great pride to the Commonwealth of  Massachusetts and to our Nation.\n\nI ask my colleagues to join me in honoring Colonel David ``Moon''  Halasi-Kun for his decades of service and sacrifice. We extend our  deepest gratitude to him, his wife Gretchen, and his son Luke for their  steadfast…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, I rise today to encourage every Member of  this Chamber to support this legislation honoring one of Santa Barbara  County's own, Brigadier General Frederick R. Lopez.\n\nMy bill would name the South Patterson Avenue post office in  recognition of General Lopez's distinguished…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…should all aspire.\n\nMr. Speaker, I ask my colleagues to join my wife Vivian and me, along  with the more than 765,000 people of Georgia's Second Congressional  District in honoring the life and service of Mrs. Juanita Carson Booker  on the occasion of her 95th birthday.", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…congratulating these  outstanding individuals for their extraordinary volunteerism and in  recognizing the indispensable role the Area Agency on Aging of Broward  County plays in honoring and serving our older citizens.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the pardons that Trump gave to all those who committed these  terrible crimes on that horrific day.\n\nSilence.\n\nWe can't even get the Speaker of the House to hang a plaque honoring  the men and women in law enforcement who defended us.\n\nWhat is wrong with this place?\n\nViolence is wrong no matter whom it is committed by. The difference  here is that Governor…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…background, HIV status, or citizenship status  receive every single thing they need and deserve to live healthy,  thriving lives. I congratulate Omar.                             Honoring Mario Vega\n\nMrs. RAMIREZ. Mr. Speaker, I rise today to honor Mario Vega for his  work to create spaces that uplift our young people and build safe and  thriving communities.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…often a thankless job, and I hope the House  will join me in thanking the nurses, doctors, and staff that keep  hospitals like Fauquier Hospital running.                     Honoring Puller Veterans Care Center\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate the Puller  Veterans Care Center on its grand opening on the historic grounds of  the former…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Pennsylvania's 1st Congressional District, I extend my  appreciation and recognition to the UASC Tryzub for their extraordinary  service of 75 years. I ask my colleagues to join me in honoring the  UASC Tryzub's 75th anniversary, which will inspire generations to come.  May their example remind us of the boundless potential within each of  us to make our communities,…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…and this momentous milestone will be joyfully celebrated with her  family and friends in Umatilla, Florida, on December 6, 2025.\n\nIt is my pleasure to join her loved ones in honoring Sylvia's long  and admirable life and in reflecting on the profound impact she has  made on all who know her. For Decades, Sylvia has exemplified steadfast  dedication to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…judgment,  and dedication have left a lasting impact on the judicial system in our  region.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in honoring Judge M. William Boller for his many years of  devoted service and in wishing him the very best in his retirement.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699266/recognizing-the-honorable-m-william-boller"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…patients across Georgia.\n\nMr. Speaker, I thank Mr. Barth for all his hard work and for being a  trusted and compassionate professional in his field.                         Honoring Nurse Barbara Harn\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Barbara  Harn, a breast health nurse at Northside Hospital Cherokee, who has won  the 2025…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the authorization of the  Adams Memorial Commission until 2032, allowing its members to continue  their work to create the first memorial in Washington, D.C., dedicated  to honoring the Adams family. The bill would authorize a new site for  the memorial just south of the White House, where John and Abigail  Adams were the first Presidential family to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…result. Their hard work and dedication,  both on and off the track, in achieving this accomplishment should be  commended.\n\nMr. Speaker, I ask my colleagues to join me in honoring the Seneca  East High Boys 4 x 800 Meter Relay team. On behalf of the people of the  Fifth District of Ohio, I am proud to recognize this great achievement.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693381/special-recognition-of-seneca-east-high-schools-boys-4-x-800-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today in support of my bipartisan  resolution honoring the brave men and women who serve in local law  enforcement.\n\nThese officers work tirelessly to protect and serve, putting their  lives on the line every day to uphold the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…they waited for EMTs to arrive. When asked about who was in her mind  during this traumatic experience, she responded: Jesus.\n\nMr. Speaker, I ask my colleagues to join me in honoring this  remarkable young woman. Because of her decisive actions, her mother is  alive today and doing much better.\n\nI also want to recognize and thank Brenda Dawes for her service…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699061/recognizing-josie-pethan-and-brenda-dawes"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Initiative. Their  dedication to building stronger fathers is building a stronger Spokane  and a brighter community for every child in our community.                        Honoring Scouts Across America\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to honor Scouts Across  America. Scouts Across America carries forward with a remarkable legacy  that began…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…capacity  have made him an indispensable member of the Wendelville Volunteer Fire  Company.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in honoring Gary Braunscheidle for his remarkable 62 years of  service and in wishing him continued success and fulfillment in his  ongoing commitment to the community.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…activities, and coastal relaxation.\n\nSavannah's distinctive blend of cultural richness and coastal beauty  makes it an ideal destination for newlyweds.                            Honoring Robert Headley\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor Mr. Robert  Headley, for receiving the Student Organization Leader of the Year  Award at Georgia…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…the aisle must unite to reject political violence in all  forms across the country.\n\nMelissa Hortman was a dedicated public servant, and we join Minnesota  and the Nation in honoring her life and the life of her husband, Mark.  We also pray for the speedy recovery of John and Yvette Hoffman and for  peace and unity in the face of tragedy and division.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…contribution.\n\nWe recommit to raising awareness of elder abuse and implementing  protections for those in our society who protected us first. I urge my  colleagues to join me in honoring older Americans this month.\n\nIn the Senate Judiciary Committee, which I chair, I am working to  support Protect Our Seniors. So tomorrow, I am holding a hearing to  examine…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Full Committee in moving this critical legislation to the       House floor. JWV urges swift passage of H.R. 2701 to start       the process of properly marking graves and honoring these       brave Jewish American servicemembers.\n\nThe Fallen Servicemembers Religious Heritage Restoration       Act requires the American Battle Monuments Commission (ABMC)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…result. Their hard work and dedication,  both on and off the track, in achieving this accomplishment should be  commended.\n\nMr. Speaker, I ask my colleagues to join me in honoring the Marion  Local High Boys 4 x 400 Meter Relay team. On behalf of the people of  the Fifth District of Ohio, I am proud to recognize this great  achievement.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693368/special-recognition-of-marion-local-high-schools-boys-4-x-400-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}]