[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…gun dealers who are selling  guns on to the black market. That is a policy most Americans would see  as common sense, but the DOJ announced that it was going to let off the  hook gun dealers who are violating the laws.\n\nNow, throughout the last 100 days, the Trump administration has been  sending all sorts of signals that they are deprioritizing the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…still  holds.\n\nIn addition to his civil service, Steve has dedicated much of his  time and energy to a myriad of local organizations. He is a former  volunteer for West Haven Hook and Ladder Company 1, a longtime member  of the West Haven Irish American Club, a lifetime member of West  Haven's Elks Lodge 1537, and a former member of the Knights of St.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…wounded 58 more. We lost  sons and daughters and friends and neighbors, all full of life and full  of aspiration, loved by family and loved by friends.\n\nA few months later, Sandy Hook shook the entire Nation to its knees.  Twenty first graders--twenty first graders--and six teachers were  killed in mere moments.\n\nWe hoped then that Congress would finally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…include clean energy sources like wind and solar,  which this order deliberately excludes.\n\nSo what does this Executive order do? It lets big oil and gas  companies off the hook on following our environmental laws and  regulations. And those are the rules that make sure that you have clean  air to breathe and clean water to drink.\n\nWhy would Donald…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…were shot in Colorado, it is  gut-wrenching and sorrowful that our Nation continues to go through  this plague of gun violence.\n\nMadam Speaker, it has been 13 years since Sandy Hook in my home State  of Connecticut. It is long overdue for Congress to have a vote.  Universal background checks are a commonsense way that we can deal with  this, and I see no…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…flag laws to keep guns away from abusers.\n\nState laws are not enough. Guns can easily be trafficked across State  lines.\n\nThoughts and prayers didn't save children at Sandy Hook, Uvalde, or  in that Minnesota church. They won't save the next victims unless we  act. We have to keep weapons of mass death out of the hands of those  who would use them to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695226/calling-for-substantive-action-on-shootings"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…insurance on the planet that       covers the edge cases of human existence for somebody with       medical complexities like Leda.\n\nTonight, like every night, my wife and I will hook our       daughter to an oxygen concentrator and a pulse oximeter, then       we will lie down and ``say no to death.''\n\nThe only reason we can sleep at all is because Medicaid…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…struggling to make ends meet, Republicans are  attempting to finish the job by further continuing their nonsensical  attack on clean energy.\n\nThis bill would aim to make it harder to hook clean power up to the  electric grid and would remove safeguards intended to ensure that the  entities in charge of our power grid can't discriminate against clean  energy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…see another disaster like we saw off the  coast of Oregon, a Meta subsidiary dumping drilling fluid and drilling  equipment on the seafloor, then leaving the taxpayers on the hook to  clean up the mess. Yes, did I say taxpayers? Yes, they are the ones who  paid.\n\nFinally, my amendment would maintain the status quo and allow NOAA to  collect a fair market…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…is also bad for Americans, especially through their energy bills.\n\nConsumers still pay for natural gas that is wasted, but this  resolution will let those polluters off the hook. It also hurts  American companies that are innovating new technologies enabling leak  detection and repair, creating whole new pollution reduction  industries.\n\nThese new technologies…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…road and wait to take action. As our  kids are forced to grapple with this reality, I am sick and tired of  Republican efforts to let Big Oil and corporate polluters off the hook.\n\nThe methane polluter fee that would be rolled back by this resolution  corrects a serious market failure that makes it cheaper for polluters  to waste methane than install…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688175/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Weatherization  Assistance Program, which reduces energy costs by increasing the energy  efficiency of homes. These cuts are compounded by the fact that  ratepayers in Ohio are on the hook for a corrupt bill that adds  hundreds to energy costs to bail out a coal plant in Indiana. Ohioans  cannot afford any more Republican malfeasance that literally costs  Ohioans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…for a moment about another constituent of mine who paints  just a different angle on what it looks like to cut Medicaid. I will  tell you that our phones are ringing off the hook. People understand  what is going on. They are worried for their health, for the health of  their families, and for the health of their parents. They get what will  happen to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…from many  Federal firearm requirements.\n\nLet's talk about who opposes this bill. It is opposed by Brady,  Everytown for Gun Safety, GIFFORDS, Newtown Action Alliance, Sandy Hook  Promise Action Fund, Jewish Women International, Catholics for Family  Peace Education and Research Initiative, Illinois Accountability  Initiative, Just Solutions, Legal Momentum,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700038/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…homeowners have to pay for  it.\n\nA recent study by Grid Strategies found that, if the administration  refused to let a single fossil fuel plant close, Americans would be on  the hook for $6 billion per year and increased costs by the end of the  Trump administration.\n\nRepublicans' obsession with coal is going to cost Americans billions  of dollars and pollute…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…After what Representative Massie  has said, the car is going to be the judge, jury, and sentencer for  your crime in the car. The next thing is going to be that we need to  hook this thing up to the government so we can dispatch the police.\n\nI am just going to tell you what is going to happen next. They are  going to be shutting your car off when they…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699282/amendment-no-1-offered-by-mr-massie"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…this provision in the continuing resolution to reopen the  government late last year. We must strike down this provision  immediately. American taxpayers should not be on the hook for this  inappropriate payout.\n\nMr. Speaker, it is time to bring this process to a close. It is time  that we return this legislative body to regular order and move forward…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…the temporary quarterly fees used to pay for  the United States Trustee Program within the Department of Justice and  bankruptcy judgeships. Ensuring taxpayers are not on the hook for the  administration of the Bankruptcy Code is critical. The only way to  ensure the bankruptcy system is funded far into the future is to  maintain the current fee schedule.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…subsidies paid to health insurers on behalf of       GAO's fake identities exceeded $12,300 per month.\n\nData analysis shows widespread systemic fraud with       taxpayers on the hook for costs.\n\nIn 2023, one SSN was used to enroll in more than 125       different insurance policies, accumulating over 26,000 days       of subsidized coverage--the equivalent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…funds to Yemen to help the Houthis.\n\nWhat else have they done other than funding terrorist groups? They  have threatened to kill American officials: President Trump, Brian  Hook, General McKenzie, Robert O'Brien, Mike Pompeo, former Secretary  of Defense Mark Esper. All these people were involved in the Soleimani  attack.\n\nWhy did we go after Soleimani?…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…for the Iron  Dome, we are creating the capability for the United States to defend  itself as well.\n\nI have news. We have a nuclear weapon, too. That doesn't get you off  the hook with those who are out to get you.\n\nWhen we oppose this amendment, when we vote it down, we are not only  standing with Israel. We are standing with the best interests of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693692/department-of-defense-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…that we have seen recently with checks,  like in Representative Malliotakis' district, for example.\n\nIf Congress doesn't correct this, taxpayers could potentially be on  the hook for late penalties through no fault of their own.\n\nH.R. 1152, the Electronic Filing and Payment Fairness Act, is  bipartisan legislation that will harmonize IRS deadline rules…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689373/electronic-filing-and-payment-fairness-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…healthcare, it is my opinion that we ought  to do it after we fully open the government, but if we are not willing  to do that, let's at least let the Federal workers off the hook.\n\nI applaud Senator Johnson. I applaud Senator Sullivan. I applaud  Senator Cruz.\n\nWe want to be able to keep Americans safe who are getting in  airplanes every day.\n\nWe want…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696599/9999"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…private financing. My amendment would expand  the private financing opportunities for equity and private credit  providers. This ensures that the taxpayer alone is not on the hook for  defending our entire national security. Just today, I spoke to another  Member who wanted to invest another $100 billion into private  initiatives to help protect our country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…companies. If the goal of this bill is to increase investor  opportunities and expand public markets, then Congress should be  cutting friction, not adding a new compliance hook that falls on public  companies and ultimately on shareholders.\n\nMr. SELF. Mr. Chair, as the chairwoman referenced, organizations that  want to do this are already doing it…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…you have ever seen the usdebtclock.org, the website,  the numbers are spinning literally out of control. To put this debt in  perspective, every American household is on the hook for over $238,000  to cover Uncle Sam's reckless spending spree.\n\nTo put it bluntly, the state of our Nation's fiscal health is bleak.  The government now spends over a trillion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…replaced the Old Carver Fire Hall, which originally opened  for service around 1880.\n\nThe Old Carver Fire Hall stored the volunteer Carver Fire  Department's one horse-drawn hook and ladder wagon and one horse cart.  Now, the department serves the community with three fire engines, one  rescue truck, one tanker, one brush utility vehicle, one command…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…supplier, holding the rest of the world  hostage.\n\nOf course, there is the fact that China has never seen a piece of  intellectual property that they aren't willing to steal, so by hook or  crook, they are going to try to outcompete us, and we need to maintain  our diligence and be vigilant when it comes to this threat.\n\nChina is aggressively investing resources…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…three times the rate for employer- sponsored healthcare plans that most Americans get through their work  and from their employer. As these premiums go up, taxpayers are on the  hook to subsidize not the individual but, guess what, the insurance  company. The subsidy doesn't go to the individual; it goes directly to  the insurance company.\n\nOur colleagues…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}]