[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…share my deep frustration and  anger for the people of northwest Indiana's First Congressional  District as they open their heating bills that have skyrocketed this  winter.\n\nHoosiers understand that utility rates are regulated at the State  level, but they also understand, just as we do here, that Federal  policy plays a role in whether our Nation is increasing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…heat islands--trapping heat,  raising energy bills, and degrading quality of life. This is not  theory. It is science.\n\nInvesting in greener, healthier neighborhoods benefits Hoosiers and  Americans. These cuts undermine that very goal.\n\nI urge the USDA to reverse its course, and I call on our colleagues  to join us in demanding the restoration of these…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, I rise today to recognize the hundreds of  young Hoosiers who just participated in our annual Special Olympics  Indiana Youth Basketball Tournament.\n\nBasketball is a beloved tradition in my Hoosier State, and this  tournament is…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690567/special-olympics-indiana-youth-basketball-tournament-pride"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…impact  wherever he has worked. Deputy Larkin plans to continue working with  the Hamilton County Sheriff's Office in a civilian capacity after his  retirement. My fellow Hoosiers and I appreciate his commitment and  dedication to our community.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…number one Ohio State 13-10.\n\nThe pundits said Ohio State brought the third-most talented roster in  the country. Indiana was ranked 72 at the start of the season, but our  Hoosiers refused to be defined by those numbers. They responded with  discipline, toughness, and a belief in one another that reshaped  Indiana football.\n\nThis championship is a testament…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698048/on-to-the-rose-bowl"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…excellence. Her calm under  pressure, strong organizational skills, and unwavering dedication  helped our office serve the people of Indiana's Second District at the  highest level. Hoosiers who visited the Capitol often commented on her  customer-service-driven approach.\n\nOver the past 2\\1/2\\ years, I have come to rely on Mariah not only as  a trusted colleague…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Trophy reflect what can  be accomplished when a team fully commits to the standard set before  them.\n\nOn behalf of Indiana's Ninth District, the home of our Indiana  University Hoosiers, I commend Coach Cignetti, quarterback Fernando  Mendoza, and players on the team like Charlie Becker, D'Angelo Ponds,  Pat Coogan, Elijah  Sarratt, and the entire Indiana…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…It was as sheriff that Mr. Retter met with the U.S. Customs and  Border Protection to diligently detain illegal criminal migrants,  making the Sixth District far safer for Hoosiers to live and work in.\n\nIt was this past Tuesday in the joint session that I had the  privilege of hosting Sheriff Retter as my guest for the President's  joint address to Congress.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688602/recognizing-sheriff-randy-retter"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "Mr. MESSMER. Mr. Speaker, I rise today to speak about something very  important to me, my family, and the majority of Hoosiers in Indiana's  Eighth District: the protection of the unborn and the 2026 March for  Life.\n\nAs a devout Catholic, I am grateful that from my position in  Congress, I can support…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699378/march-for-life"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…tremendous impact  of the One Big Beautiful Bill Act.\n\nDuring the August work period, I traveled across all 11 counties in  my district, hitting over 40 stops, meeting with Hoosiers where they  live and work.\n\nI heard from Chuck at Allie's Cafe, who shared about how limiting tax  on tips puts more money directly into workers' pockets.\n\nI spoke with Camping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694794/promises-made-promises-kept"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, last night the country watched something  nobody predicted: Indiana, national football champions. Our Hoosiers  beat Miami 27-21, and finished a perfect season and brought the title  home to Indiana.\n\nI say that as a proud IU alum, former chairman of our IU Alumni  Association, over…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699173/indiana-college-national-football-champions"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…largest tax cut in American  history for working class families, like yours and mine, a tax cut that  is significant.\n\nIn Indiana right now, by the way, early tax returns for Hoosiers, a  10.9-percent increase in those tax returns from a year before. That is  real. That is significant money in the pockets of hard-working Hoosier  families, people who go…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…championship. In the stunning 55-33 win, the South Knox  Spartans earned the school's first statewide championship victory.\n\nBasketball is a foundational part of our identity as Hoosiers, and  they even gave us a term, ``Hoosier Hysteria,'' to describe just how  seriously we take this sport and how many top players we produce.\n\nCongratulations once again to…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689185/congratulating-south-knox-girls-basketball-team"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…terrific Hoosier teams  to claim top honors. Coach Jason led The Exothermics, Greenfield  Central's team, comprised of juniors Simon, Hayley, and Brayden.\n\nThese talented young Hoosiers will again showcase their talents at  VEX World competition in Dallas later this year. These students  exemplify the best of the next generation of innovators, engineers,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690023/congratulating-greenfield-central-high-school-for-winning-the-indiana-state-robotics-championship"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…forward to  beginning my first summer district work period.\n\nAs I move about Indiana's Sixth District over the weeks to come, I am  eager to share this time with our hardworking Hoosiers.\n\nFor 7 months, I have been working to deliver for our communities. I  look forward to sharing my work and bringing details of our wins back  home.\n\nMost importantly, this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694159/kickoff-of-hoosier-heartland-tour"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Indianapolis. It is rooted in a  tradition that goes back more than a century, built by American  workers, American engineers, and American manufacturers.\n\nIndyCar reflects who we Hoosiers are: competitive, inventive, always  pushing forward. I will be honest, Washington could use a little less  gridlock and a little more green flag.\n\nThis event isn't simply…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699865/freedom-250-grand-prix"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…I rise to offer an epilogue on my just- completed Hoosier Heartland Tour across Indiana's Sixth District.\n\nI participated in 45 events. I engaged meaningfully with 1,800  Hoosiers. I reported back on my work in Congress. I listened to their  concerns and priorities.\n\nI met with leaders in our communities, including our Governor, to  discuss how our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}]