[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…the government is truly accountable to the people it  represents. And as the ranking member of the Appropriations  Subcommittee that handles election funding, I hope my colleagues will  join me in restoring funding for election security grants to the States  to the total of $75 million. If you are serious about election fraud,  then give the secretaries…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…high cost of living, including energy costs.\n\nMr. SPEAKER pro tempore. Is there objection to the request of the  gentleman from Ohio?\n\nMr. LANDSMAN. Mr. Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMr. LANDSMAN. Mr. Speaker, I have a motion to recommit at the desk.\n\nMr. LANDSMAN. Mr. Speaker, on that I demand the yeas…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698058/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the proposed relocation of covered offices, including a  justification for how these moves could possibly serve small  businesses.\n\nMr. CISNEROS. Mr. Speaker, I hope my colleagues will join me in  voting for this motion to recommit.\n\nI also submitted a separate amendment for consideration that would  have prevented the implementation of this bill if…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692102/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Taiwan policy that works for us and Taiwan  while upholding our longstanding One China policy, which has kept  Taiwan safe for over four decades.\n\nMadam Speaker, I hope my colleagues will join me and support this  bill, and I yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690684/taiwan-assurance-implementation-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…to ensure that experts in  the commission can effectively develop safety standards for permanently  affixed and no affixed amusement park rides.\n\nMr. Speaker, I hope my colleagues will join me in supporting this  legislation and ensuring every American can enjoy a safe experience on  permanently affixed amusement park rides.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688551/introduction-of-the-national-amusement-park-ride-safety-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Jersey residents to have NOW-NJ as a resource for guidance and  leadership. NOW-NJ's legacy of resilience will live on for generations.\n\nMr. Speaker, I sincerely hope my colleagues will join me in honoring  NOW-NJ for their exceptional contributions to the community and  congratulating them on their 50th anniversary of service.", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697164/recognizing-the-50th-anniversary-of-the-national-organization-for-women-of-new-jersey"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…has to stop  because so many innocent people are victims of these bombs, of this  starvation, of this forced displacement.\n\nThe Senate today can demand an end. I hope my colleagues will join me  in passing this resolution.\n\nMr. WELCH. Mr. President, I thank my colleague, the senior Senator  from New Hampshire. I really appreciate her very practical presentation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…country.\n\nI thank my colleagues again for their steadfast support and  leadership on this issue in support of Georgia's ambitions to join NATO  and the EU, and I hope my colleagues will join me and support this  bill.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…promote academic success.\n\nAgain, Mr. Speaker, this is a decision that belongs to the pregnant  student, not to Members of Congress.\n\nMs. BONAMICI. Mr. Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMs. BONAMICI. Mr. Speaker, I have a motion to recommit at the desk.\n\nMs. BONAMICI. Mr. Speaker, on that I demand the yeas…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…that this bill does not compromise the  private medical records of a minor or result in parents and doctors  being thrown in jail.\n\nMs. BALINT. Madam Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMs. BALINT. Madam Speaker, I have a motion to recommit at the desk.\n\nMs. BALINT. Madam Speaker, on that I demand the yeas…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698348/protect-childrens-innocence-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…organizations.\n\nTaiwan is a vibrant democracy that contributes to the global  community, and it deserves to participate in fostering peace and  cooperation.\n\nMr. Speaker, I hope my colleagues will join me in supporting this  bill, and I yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…decisions cannot  undercut workers and their families. Raising the minimum wage is not  only good for the worker, but for their families.\n\nMr. NORCROSS. Mr. Speaker, I hope my colleagues will join me in  voting for this motion to recommit.\n\nMr. NORCROSS. Mr. Speaker, I have a motion to recommit at the desk.\n\nMr. NORCROSS. Mr. Speaker, on that I demand the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…bill, this body can send a clear message to Donald Trump  that he must do more to protect American technology and safeguard U.S.  national security.\n\nMr. Speaker, I hope my colleagues will join me and support this bill,  and I yield back the balance of my time.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…what was broken. Too bad the market can't do it  alone.\n\nEvery year of delay compounds the harm. The Susan Muffley Act will  finally make these workers whole. I hope my colleagues will join me in  voting for the motion to recommit.\n\nMs. KAPTUR. Mr. Speaker, I have a motion to recommit at the desk.\n\nMs. KAPTUR. Mr. Speaker, on that I demand the yeas…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…and increased penalties for  violations of overtime and minimum wage requirements, a real  commonsense solution for working people.\n\nMs. BUDZINSKI. Mr. Speaker, I hope my colleagues will join me in  voting for the motion to recommit.\n\nMs. BUDZINSKI. Mr. Speaker, I have a motion to recommit at the desk.\n\nMs. BUDZINSKI. Mr. Speaker, on that I demand the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Gaudry--Navigation Systems,  Tim Dolan--Operations and Rescue and Survival Systems, Mark Kolupa-- Secretary/Records, and Andre Skoinezny--Vessel Examinations. It is my  hope that my colleagues will join me in thanking the men and women of  Clearwater Coast Guard Auxiliary Flotilla 11-1 for their 75 years of  service to our community and for a job well done.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in her memory.\n\nThis bill would actually codify President Trump's Executive order and  ensure that future generations will remember Jocelyn for years to come.  I hope my colleagues will join me in renaming this Texas wildlife  refuge in her honor.\n\n1596 and  the Senate proceed to its immediate consideration.\n\nMr. CORNYN. I know of no further debate on…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691123/jocelyn-nungaray-national-wildlife-refuge"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and I know that she will serve the people of Delaware and the circuit  with distinction.\n\nPresident Trump made an excellent selection in Professor Mascott, and  I hope my colleagues will join me in voting to support her nomination  so she can serve on the Third Circuit.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…popular. They are coal-fired power plants--love it--when grid  reliability experts are warning of a shortage of baseline power.\n\nI am fully against this CRA, and I hope that my colleagues will join  me in that.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…resolution that  would put our Kentucky hemp farmers out of business. I will be working  to add language to the continuing resolution next week to fix it. I  certainly hope all my colleagues will join with me in supporting this  language to help our Kentucky farmers as well as the hundreds of jobs  that have been created because of industrial hemp in Kentucky.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698983/industrial-hemp-in-kentucky"}, {"senator": "James Risch", "party": "Republican", "sentence": "…who  have committed the atrocities against Israel, have caused this chaos in  the Middle East, and have endangered American national security again  and again.\n\nI hope my colleagues will join me in opposing this resolution.", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694433/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "James Risch", "party": "Republican", "sentence": "…China. He has to be.\n\nWe need a strong leader like David Perdue at the front of our fight  with the Chinese Government to execute on President Trump's vision, and  I hope my colleagues will join me today in supporting Mr. Perdue to be  Ambassador to China.\n\nMr. President, I would ask unanimous consent that we commence the  vote on the nomination.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…policies and who decide to drive drunk or  under the influence--we can't allow them to continue to endanger the  American public in this way. For this reason, I hope all of my  colleagues will join me and support the Stop Illegal Aliens Drunk  Driving Act.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]