[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…use my time to continue to craft the  legislation on quantum and on reauthorizing NSF and NIST that I am so  proud to see making its way through the Committee on Science. I hope  that my colleagues will join in to pass those bills.\n\nToday, we use our voices to call out the harms of an antiscience  agenda, the setbacks it means for equity, the setbacks…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Republican colleagues joined Democrats  today in doing the right thing by voting to extend the ACA tax credits  for 3 more years to protect access to affordable healthcare. I hope  that my colleagues in the Senate follow suit by passing this bill  immediately, but I also know that it is not enough.\n\nWe need a universal healthcare system, a system where…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…autocracy, this  authoritarianism, and we have to speak up.\n\nI don't ask others to do what I do. I don't mind standing alone. If  it means standing alone, I will stand alone. I would hope that there  would be others of goodwill who would stand also. If they don't, I  leave that to them to deal with as they choose to navigate their way  through this Congress and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…people I represent.\n\nTheir service isn't just about providing information on legislation  or assistance with benefits. In moments of hardship and frustration, my  staff offer hope and wise counsel. They make people feel heard and  understood and appreciated. In a very practical sense, they make real  our Constitution's promise to every American of the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the devastation where       the forest once had stood.\n\nShe was no more mere observer, now she'd fight to save and       teach, And she traveled `round the planet, bringing hope       within her reach. On three hundred days of travel, every year       for decades long, Speaking, begging, preaching, pleading,       singing out her urgent song:\n\n``Every…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…district, constituents will gather this evening at the  Douglas County Museum of History & Art for a reflection on the history  of the city and a celebration of the progress they hope to make in the  future.\n\nI want to commend Mayor Rochelle Robinson, the Douglasville City  Council, and every resident who made this week's celebration possible.  It is thanks…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688019/recognizing-the-city-of-douglasville-georgia-on-its-sesquicentennial-birthday"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…insurance, they are  going to have more costs, and many of them are going to be facing a  healthcare crisis without the aid and help of insurance to get them  through it.\n\nI hope we can do better than that. I hope that we can learn from the  fact that expanding affordable health insurance to Americans is a  winning concept. It is worth achieving. I hope…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the Republicans are doing with  today's CRA vote. Today's vote will show the American people, once  again, who is on your side and who is on the side of Big Oil and Gas. I  hope everyone watches closely.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…leader, another friend and political ally of  Trump.\n\nThese are not economically based decisions. These are purely  personal, whimsical decisions that harm American families.\n\nThe hope is that any Chief Executive is going to look thoughtfully  and rationally, measure benefits and costs, and make decisions that  benefit this country. That is not the case with…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…bill to repeal this provision because they knew  it was wrong.\n\nWe should be here working to lower costs for our constituents and not  using taxpayer dollars irresponsibly. I hope my colleagues will join me  in righting this wrong today.\n\n6019, which was received from the House  and is at the desk.\n\nMr. PETERS.  We received this last night, but I think…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…dollars in tax cuts to your  cronies.\n\nDon't tell me you give a shit about the middle class when all you are  doing is shitting on the middle class.\n\nMr. McGOVERN. Mr. Speaker, I hope when the President comes here next,  you will admonish him for the language he uses.\n\nMcBride).\n\nI don't want to close, but I am prepared to close.\n\nMr. Speaker, this bill is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, our vote today represents hope, the hope of  millions to access their family physician, the hope for so many  Americans who have wondered how they will be able to afford healthcare,  hope that by using an…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698798/breaking-the-gridlock-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…past decade resulted  in many of those drugs being discovered and being sold to American  families and bringing relief to them in ways no one imagined.\n\nThat progress and the hope it brings to patients and families is why  I am absolutely dismayed to see how President Trump has dismantled  medical research in America during his 100 days in office.\n\nWas…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…suicides have decreased by 50  percent. That is lifesaving work. It is being recognized, too. Joliet  recently received the Congressional Fire Service Award for Excellence.\n\nI hope to support this effort in any way I can. Illinois recently  received Federal approval to use Medicaid to cover preventive mental  health services in the community, which can…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…The way I have heard it, I think it just sounds like he is  expecting the one gender to carry this load, and it is a challenge if  you are doing it just to get money. I would hope that people wouldn't  say: Well, I am going to have a child because I can get $5,000.  Probably there are very few people who will, but you are changing the  dynamics or desire…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…essential       book of blood, pain and love. Amir Tibon gifted Israeli       author and noted journalist's recent The Gates of Gaza (A       Story of Betrayal, Survival, and Hope In Israel's       Borderlands), Little, Brown and Company. 2024 is bound to be       a classic.\n\nThis literary masterpiece offers eye-witness report from       that ``Black…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…character, and their  steadfast commitment to the people and places they serve. They are the  foundation upon which our communities stand--the ones who lift others  up, inspire hope, and, in doing so, call us all to higher standards of  service and compassion. Throughout their years helping the community,  the UASC Tryzub embodies this spirit of honor in…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…New Freedom Farm has served as a place of healing for  veterans, first responders, and rescue animals, offering a sanctuary  where pain met purpose and isolation gave way to hope.\n\nThrough Lois' tireless dedication, lives were transformed and bonds  were forged between heroes and horses. As the farm prepares to close on  July 31, we reflect not with…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…in another jurisdiction, as my friend  acknowledged.\n\nWe cannot possibly add another $10 billion--$9 or $10 billion of  entitlement money--to this DOD authorization act and hope to pass it.\n\nAnd that is the reason that in Democrat majorities and Republican  majorities--House Democrat majorities and Senate Democrat majorities-- and in Democratic administrations,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…whose husband, an advocate for democracy in Russia, died in a  Russian prison. Yulia will once again speak with us as a delegation  about the cost of freedom.\n\nWhat gave me hope last year at this conference was a panel I  participated in with three legislators from three other countries-- young women serving in the legislative bodies of Ghana, of Burma,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "James Risch", "party": "Republican", "sentence": "…terrorists who  have committed the atrocities against Israel, have caused this chaos in  the Middle East, and have endangered American national security again  and again.\n\nI hope my colleagues will join me in opposing this resolution.", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694433/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Senators who have the courage to break with the political  idiocy we see right now on their side.\n\nVote with us. Reopen the government. They know it is the right thing  to do. I hope that happens.\n\nVote on S. Res. 412", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696006/en-bloc-nominations"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…with PTSD, undergoing  physical training, or coming to terms with the loss of a loved one,  national parks play a vital role in their health and well-being.\n\nIt is my sincere hope that this bill can play a small role in helping  military families, like the Belos, find peace in their loss and honor  their loved ones who are taken from them too soon.\n\nThis…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…trafficking have not only  impacted the lives of thousands but have sparked systemic change across  the Nation. With over 7,000 survivors of human trafficking having found  hope, healing, and a new chance at life through Selah Freedom's  programs, Laurie's legacy continues to shape a future where survivors  are empowered and human trafficking is eradicated.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…many are unhappy. So  many wind up dying from murder, dying of drug overdoses, and just, in  general, leading unhappy lives.\n\nMr. Speaker, these are some of the things that I hope we begin to  take up next week. I hope our leadership team realizes that, while we  are doing a good job on the economy, and we are growing private-sector  jobs, and we are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…responsible choice to reopen  our government and pass three official full-year appropriations bills.  Mr. Speaker, eight Senate Democrats saw reason and did exactly that. I  hope House Democrats do the same.\n\nTrue courage is taking responsible action for the Nation even when  politics makes it inconvenient. Let's reopen the government and get  back to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I rise today to recognize Place of Hope on the  occasion of its 25th anniversary of serving children and families in  crisis across Florida's 21st Congressional District.\n\nFounded on faith, Place of Hope has dedicated…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…happens. Great things are ahead for this  country. We are the greatest country in the history of the world. We  are finally going to restore that great American Dream and that hope  for those families who have been waiting way too long. That help is  coming.\n\nWe are going to pass this bill. President Trump is going to sign it.  It is going to be a great…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$86 trillion over the next 10 years. We are just trying  to save $1.5 trillion of that massive increase for crumbs to have $50  trillion of debt at the end of that rainbow.\n\nI hope we will come together. I hope we will unite to deliver a  product that is worthy of support. I have not decided whether I will be  able to support it. We will find out whether…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…they spent two weeks installing vital electrical  infrastructure for Navajo families who have lived without power for  generations. Their efforts brought light, safety, and hope to  communities long overlooked, allowing children to study after dark,  families to preserve food, and elders to live with greater comfort.  Despite daunting challenges and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692592/recognizing-gary-steele"}]