[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…next week, this case is going  to be heard in the Supreme Court. So small businesses have already won  twice, and now they are going for the final round in the Supreme Court,  hoping that they won't engage in creative legislative history  reinterpretation of that Republican unanimous vote in 1977 that allowed  Jimmy Carter to become a King on tariffs.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I thank the ranking member for yielding.\n\nMr. Speaker, once again, my Republican colleagues are selling  Americans on a bill with a flashy title and hoping that they don't read  the fine print.\n\nThe so-called Tipped Employee Protection Act implies that something  in this bill might actually benefit workers who work for tips. In…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698962/tipped-employee-protection-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…rules. Moreover, instead of coming clean and holding a  straightforward vote on the corrections, they are trying to bury it in  this rule for the DOGE rescissions package, hoping that nobody will  notice. Think of it like a Trojan Horse, Mr. Speaker.\n\nLet's be clear: The rescissions could be brought to the floor  anytime. You heard that right, Mr. Speaker,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…premium multiplied by a factor of four. It is currently set to be four  times as much for health insurance as it was this year. I didn't go  ahead and enroll yet because I am hoping Congress gets their heads in  the game to do what is right. I am not making any more money this year  than I did last year. My income is the same. Rent is going to increase.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696766/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…CISNEROS. Mr. Speaker, I will close by thanking the chairman for  his commitment to working on behalf of small businesses to open up  avenues of financing for small businesses hoping to contribute to the  reshoring of manufacturing.\n\nMr. Speaker, I support this legislation, and I yield back the balance  of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…break or something  new from what was seen earlier in the year; it is sort of a  continuation of something that has been a pretty painful chapter in  Virginia.\n\nSo what are we hoping for or, rather, maybe, not to put words in  anybody's mouth, what am I hoping for out of this?\n\nThe House prepared a short-term continuing resolution under  instructions from…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…because you have been conned  by Trump that there is nothing in the files, or you are afraid that  there might be something in the files. You are in charge.\n\nBy the way, I was hoping the majority leader would tell us when he is  going to schedule the vote on his meaningless bill on the Epstein  files, but I think we will have to wait until he gets back…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, imagine being a farmer choosing between  insurance and seed, a small business owner weighing a doctor's visit  against payroll, families hoping nothing goes wrong because they are  one ER visit away from being homeless. This is the reality for rural  America today.\n\nThe big, ugly bill took a sledgehammer to rural healthcare,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…the ballot  box, imposing a modern-day poll tax and a dangerous show-your-papers  mandate.\n\nUnder this bill, Americans would be required to appear in person or  by mail, just hoping that the elections clerk accepts their  documentation, and present either a passport or a birth certificate to  register to vote, and every single time they want to cast a…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Speaker, by our Republican colleagues that I just don't understand. I  mean, I am flummoxed by some of these statements. I have always wanted  to use that word, y'all.\n\nI was hoping to seek some clarification at some point after I am able  to yield the floor, but I am still here to take my sweet time on behalf  of the American people because it was totally…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…over 3 months, ``King'' Donald's reign has rained down chaos  and corruption and cuts and crisis on the American people. And he is  counting on you not to pay attention. He is hoping you don't notice  that, every day, costs are rising, retirement savings are sinking, and  families are living paycheck to paycheck and they are bearing the  burden of the Trump…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…could be accomplished by just  writing a letter to GAO, along with the chair of the Education and  Workforce Committee. That would be faster than sticking it on this bill  and hoping the bill passes.\n\nWe may draw the conclusion that this amendment was made in order so  that the Republican majority could say they have an open process on  this flawed bill…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…before I get to healthcare,  Mr. President, to come to the floor to speak about the National Defense  Authorization Act. I see it was just delivered here from the House. I  was hoping that our House colleagues would have stopped that  legislation and actually made a fix to it. That is section 373, of this  year's Defense Authorization Act, which really undermines…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…fear and trauma that no one  should have to endure in our country.\n\nLast week, we returned after 54 days with the House shuttered,  including a 43-day shutdown. We returned hoping for Democratic unity.  Therefore, I was shocked to be called out in a resolution on the House  floor.\n\nI think you would agree with me that voters don't want these  arguments…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…stroke or some other chronic episode  like that, you learn that time is not on your side. You are not  thinking about how expensive those hospital bills may be. All you are  hoping is that you can get to see a medical professional who might be  able to save your life. By the grace of God, by the love of my family,  Senator Merkley, I am here. I am alive…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…were on the gym floor,  trying to decide whether or not to ask--we didn't have the courage to  ask the girls to dance.\n\nBy the time we were in the 10th or 11th grade, we were hoping they  would notice us in the hall. By the time we were seniors, maybe we had  the courage to ask them on a date, and maybe they said yes.\n\nThe decisions they are wanting to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…you know can't pass on its own, well then,  what do you do?\n\nWell, perhaps what you want to do is pair it with a bunch of other  bills that are themselves noncontroversial, hoping that it won't get  noticed or hoping that there will be enough other Senators who will  say: I guess we have to take it or leave it; so let's let it all pass.\n\nThey might say:…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…about military strikes with his  family, his personal lawyer, and a journalist.\n\nThey don't want to vote on Signalgate, so they are rigging the rules  to block us. They are hoping maybe this issue will pass over. Maybe we  will forget about this lapse of judgment, this utter failure, this TV  personality who, I guess, still wants everybody to know what…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…that. We passed the no tax on tips. People  working on tips income won't be paying tax on their tips.\n\nI come from the world of manufacturing where people work hard all  week hoping for overtime over the weekend so they can earn more money  for their families. Now there is no tax on overtime to make things  affordable for people and give them more money…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I thought, was  unacceptable.\n\nIt was one of the hardest votes I made, and I can't make up my mind  how much I regret it. Sometimes, I really regret it. Some moments, I am  hoping that the leadership team that said they would work with me-- because I believe we can find a trillion dollars in savings in just  modernization. Remember, those inefficiencies…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…political idiocy coming  from the other side, and my colleagues on the Democratic side are  really starting to get frustrated, not with us but with their own  leader.\n\nI am hoping on this vote, in the next hour or so, for the American  people, for the institution of the U.S. Senate, we have a couple more  Democrat Senators who have the courage to break…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696006/en-bloc-nominations"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…universities, while  conducting vital research related to defense, energy sciences, and  other sensitive industries. Many colleges and universities have  accepted CCP funding, hoping to simply expand their foreign language  learning. They have, unfortunately, opened the doors for our biggest  foreign adversary to exploit breakthroughs for Chinese strategic…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…classrooms, and  refurbishing its gymnasium so that it can serve even more children and  bolster its educational and recreational programming.\n\nTo do so, the Boys & Girls Club is hoping to acquire the current  building and surrounding land from the city of Paducah. However, these  plans are stalled by an outdated Federal deed restriction put in place  by the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…accomplished what the Democrats have never been  able to do; that is, executing Maduro's demise.\n\nDespite a long, laundry list of Democratic bills and resolutions  seemingly hoping for Maduro's eventual removal, Democrats now choose to  attack those who were able to make reality their previously voiced  ambitions. Yet merely because it was the Trump administration…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…China.\n\nIf we can secure this area in the Middle East because of the  President's bold actions, we finally have security and certainty, which  so many American families are hoping for.\n\nThis is the kind of leadership that people expect out of Washington,  D.C., and probably why I chose to run for office once again. It simply  wasn't working in Washington,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…employees said.\n\nGovernor Tim Walz is 100% responsible for massive fraud in       Minnesota. We let Tim Walz know of fraud early on--\n\nThat is the employees talking--       hoping for a partnership in stopping fraud, but no, we got       the opposite response. Tim Walz systematically retaliated       against whistleblowers using monitoring, [using] threats,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…people of  Venezuela if they are better today than they were before  President Trump snatched up Maduro. They will tell you they are. They  are more free today, and they are hoping for more and more freedom each  and every day.\n\nPresident Trump has brought hope to our homeland by protecting this  homeland that has been ignored for so long. He has brought…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…before I do a yield here. We are going to spend $86  trillion, and I am partially doing this off the top of my head, over  the next decade.\n\nThis budget reconciliation we are hoping to get, let's say we are  blessed and we get $2 trillion in offsets, so that creates a couple  trillion dollars in additional borrowing, we are talking a fraction, a  couple…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…hold.      Humble as the day was long, all a part of his life's and our             Lord's song.      As year after year, visitors walked up to the front desk             hoping he'd appear.      Creating bonds of friendship throughout all those years.      And why it hurts so bad, knowing what a wonderful friend we             once had here.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…home  State. The great flood of 1993 ravaged nine States in America's  heartland.\n\nThis reminds me of a poster we in the Midwest showed at that  particular time, and I was hoping I could round it up and show it again  to the Senate. But it had a picture of the Great Lakes in the  satellite, and then it had a picture of the flooded areas of the  Midwest.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}]