[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…correct to  think that because the origin of renaming the Gulf of Mexico was from a  joke.\n\nIn 2011, Stephen Colbert joked about renaming the gulf during the  2010 Deepwater Horizon oil spill, stating that: ``I don't think we can  call it the Gulf of Mexico anymore. We broke it; we bought it.''\n\nWhen the big, ugly bill was being marked up in the Natural…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…from Connecticut and to build on some of the arguments that he has made  so well. We are here because our democracy is in crisis. It is not some  potential catastrophe on the horizon that is distant or hypothetical.  It is real. It is now because of the lawlessness and recklessness of  this administration.\n\nAnd it is the result of a contempt for the law,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…hearing. I proudly serve as the Co-Chair of the House Haiti       Caucus, a caucus that had been dissolved that I worked       actively to reassemble, not knowing what was on the horizon.       And so it is in that role--as the Congresswoman for the       Massachusetts Seventh and as the Co-Chair of the House Haiti       Caucus--that we arrive here today.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…be seen together as  something deeper and broader. It is the sum and substance of  totalitarianism--not at some distant point in the future, not a vague  storm cloud on the horizon, but the destruction of democracy here and  now.\n\nAs we approach our democracy's 250th anniversary, we can't afford the  luxury of defeatism or despair or complacency. We…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…for Drug Legalization.\n\nNational Legal Aid & Defender Association; Neighbors for       Justice; Network for Developing; Conscious Communities; Open       City Advocates; Open Horizon; Pathways to Housing DC; Project       love u; Public Justice Center; Sasha Bruce Youthwork Inc;       School Justice Project; The Bail Project; The Festival       Center;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…and extreme  Republicans have offered no real plans, no real solutions, just more  empty promises with painful cuts and a whopping Federal deficit  increase looming on the horizon.\n\nThat is why I have been tracking congressional inaction day after day  after day on my social media, because families in Maryland and across  the country cannot afford to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689057/voters-sent-us-to-congress-to-lower-costs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…by the American people.\n\nNow let's talk about 1 month into the Trump administration. So, on  his first day in office, Donald Trump promised a golden age was coming  over the horizon. But when Donald Trump speaks tonight, his promise of  a golden age will feel like ancient history.\n\nSo this morning, let's talk about Donald Trump's many broken  promises.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…This week,  Republicans are expected to begin marking up the text of their  reconciliation bill.\n\nWith so many problems facing our country, with a threat of recession  on the horizon, with tariffs driving costs up, and Elon Musk taking a  meat cleaver to Social Security, to veterans' care, and to cancer  research, what are Republicans in Congress spending…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…or a particular license or a particular  Executive decision from years ago, it is all up for grabs under this.\n\nAnd the third, of course--other than breaking open the time horizon  of the Congressional Review Act and breaking open the subject matter  horizon of the Congressional Review Act--is to clear out the police of  the Congressional Review Act,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…DSA, Migrant Solidarity Mutual Aid, Miriam's Kitchen, More       Than Our Crimes.\n\nMovement for Freedom, Neighbors for Justice, Neighbors       United for DC Statehood, Open Horizon, Pretrial Justice       Institute, Raise One Teach One Dalaneo Martin Foundation,       RebuildingTheCommunity, Reframe Health and Justice, School       Justice Project, Scrofano…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…publicly suggest the name change was not Donald  Trump or the author of this bill. It was comedian Stephen Colbert on  ``Comedy Central.'' It was a joke back when the Deepwater Horizon oil  spill was happening.\n\nEleven people died in that disaster. Entire ecosystems collapsed. The  Louisiana coast was wrecked, along with industries and livelihoods that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…there in Mar-a- Lago. There is a lot bigger country to see.\n\nOur nuclear Navy is the best in the world. Their work matters. They  are behind. We need your help. We are on the horizon of advanced  nuclear. We need your help.\n\nOur farmers, too, have figured out how to grow a range of biofuels.  One-half of their crop now goes into fuel. Come. Meet them.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…to climate change, there is no  time to waste in securing water reliability for southern Nevadans.\n\nMy bill would allow a portion of the Southern Nevada Water  Authority's Horizon Lateral water pipeline project to tunnel beneath  Sloan Canyon National Conservation Area. This pipeline will increase  water reliability for over a million southern Nevadans.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698163/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Lennox's comments also state: ``The final rule provides  regulatory predictability regarding . . . energy conservation standards  through 2031, providing a stable planning horizon.''\n\nThese comments are an important reminder that regulatory uncertainty  from killing a standard, as the resolution before us today would do,  costs businesses money. My…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…This practical and bipartisan legislation is about honoring the lives  we lost by doing everything possible to prevent and mitigate future  attacks. With major events on the horizon, including America250, the  FIFA World Cup, and the Los Angeles Olympics, we must ensure every  necessary security measure is in place to protect the millions of  visitors…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Affordable Care Act, is not affordable to anyone in America.\n\nIt is a fact that Space Command is coming to Redstone Arsenal in  north Alabama and the Golden Dome is on the horizon.\n\nIt is a fact that President Trump and our Republican majority is  making America better for the people. America is back.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…``57,728''.\n\n(b) Right-of-Way.--Section 605 of the Sloan Canyon National       Conservation Area Act (16 U.S.C. 460qqq-3) is amended by       adding at the end the following:\n\n``(h) Horizon Lateral Pipeline Right-of-Way.--\n\n``(1) In general.--Notwithstanding sections 202 and 503 of       the Federal Land Policy and Management Act of 1976 (43 U.S.C.       1712,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…location and timing       capabilities. The system can provide wide-band high-assurance       self-healing networking capabilities and Mobile User       Objective System over-the-horizon capabilities. Each       transceiver is software programmable and operates in the 30-      512 MHz and 764-2600 MHz frequency ranges.\n\n8. The highest level of classification…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…secure.  Enlistments are up. Respect is back around the world.\n\nLook at the scenes we are seeing overseas and the respect the United  States enjoys once again. Peace is on the horizon, both in Ukraine and,  of course, now that we have negotiated a deal with India and Pakistan.\n\nThis is about promises kept and about leadership met. That is why I  am so excited…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…State illegally.\n\nIt was recently revealed that this is costing California taxpayers  $9.5 billion this year alone. Right now, we are talking about costs  over a 10-year time horizon, so let's consider what that cost will be  here.\n\nThe cost is surely going to grow in terms of the year-over-year cost  given, A, the rising cost of healthcare; and, B, increased…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}]