[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "That is  when hospitals or health plans agree to pay a small tax to keep  Medicaid running."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "Senator one last thing from you: a War Production Board much like what we had in WWII, is the federal government, is there talk about that and why has the President not asked American industries to start producing things that hospitals desperately need?"}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Ventilators are necessary for both standing hospitals and alternate care sites."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "I'm also pushing for things that will make a difference for small businesses and employers as well as making sure we are focused on delivering resources to our hospitals, physicians, people working in healthcare industries."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Instead of being sent to hospitals, they would  be sent to jails."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Meanwhile, millions more are about to watch  their healthcare premiums skyrocket and their local hospitals close,  not to mention the astronomical cost of living that is rising more and  more each day, thanks to Trump's tariffs."}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "So the last pillar of the five pillars that we are spending time on  is in the support for hospitals, community health centers, other health  clinics, healthcare professionals, and supporting childcare for them."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Dear Chairman Barra:\n\nWe write to urge you to reopen your plant in White Marsh, Maryland to produce much-needed ventilators for hospitals."}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Additionally, hospitals like Olive View Medical Center in Sylmar,  where over 70 percent of patients rely on Medicaid, will suffer, and  services at health centers throughout my district, including El  Proyecto del Barrio and Northeast Valley Health Corporation will be  cut."}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "They are  going to freeze this thing called a provider tax, which means that the  Federal Government is going to give $600 billion less to hospitals  across this country."}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "It is mostly rural with  rural hospitals hanging on by a thread."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "President Trump has frozen funding to university labs and hospitals  across the board."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Senators Jeanne Shaheen (D-NH) and Maggie Hassan (D-NH) and Representatives Annie Kuster (NH-02) announced today that New Hampshire rural hospitals and health care providers will receive $115.4 million in a third installment of federal grants established under the bipartisan Coronavirus Aid, Relief, and Economic Security (CARES) Act that was passed by Congress and signed into law."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Lowincome Americans are more likely to live in areas with physician shortages and closed hospitalsas healthcare access follows wealthier privately insured patients to more affluent areas."}, {"senator": "Robert Menendez", "party": "Democrat", "sentence": "Congress has the ability to disapprove of the sale unless an emergency is declared -- as it was last year.Last year's \"emergency\" arms sales debacle should serve as a warning to prevent history from repeating itself.To review, as the Senate Democrat with jurisdiction over US arm sales, I initially stopped the $8 billion sale until the administration could prove that Saudi Arabia had stopped bombing Yemeni markets, funerals, school buses full of children, and hospitals."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "On Protections for Frontline Workers, Schools, and Universities:\n\n\"Our redline is going to be liability protections for those who are brave enough to begin to open up the economy again in the wake of the trial lawyers who are descending already on hospitals and doctors and businesses."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "I plan to continue to work with FDA to set a reasonable standard that protects public health and gives Iowa ethanol producers the flexibility to aid Iowa hospitals and communities,\" Grassley said."}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "He further demonstrated his compassion and  solidarity by volunteering at local VA hospitals and participating in  funeral escorts to honor fallen service members and veterans."}, {"senator": "Patrick J. Toomey", "party": "Republican", "sentence": "It gives billions of dollars in aid for hospitals treating the sick, researchers developing a vaccine, and healthcare workers and first responders on the front line of this fight."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "The CARES Act is far from perfect and includes many provisions I would not support in ordinary circumstances, but hospitals need supplies, small businesses need loans, farmers and ranchers need certainty and folks who are out of work, through no fault of their own, need relief."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "As part of the initial distribution of the second tranche of funding, $14,108,992 will go to 40 providers in North Dakota, and will be used to provide support to health care providers and hospitals serving significant Medicare populations, with additional funds expected."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "We  literally have Army field hospitals on the way to being set up in our  major American cities."}, {"senator": "David Perdue", "party": "Republican", "sentence": "We have hospitals now in Georgia working together to make sure that anybody who needs to be tested is getting tested."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Department of Health and Human Services will be providing $111,503,248 for Montana hospitals and providers during the ongoing Coronavirus pandemic."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "The law also lets hospitals impose cost sharing for nonemergency  services provided in the emergency department."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "Regardless of geography, Colorado's health care system, including hospitals, physicians, community health centers and Rural Health Clinics, nursing homes, and other critical providers have been financially devastated by COVID-19."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Rural hospitals have seen few if any cases of coronavirus but have been financially devastated by the pandemic."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.) announced today that hospitals and medical providers in Oklahoma will receive nearly $355 million in additional funds from the Department of Health and Human Services as authorized by the CARES Act."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "I've been -- you know, I've just been making phone calls, probably making a couple hundred phone calls a day talking to mayors, police chiefs, sheriffs, hospitals, just trying to connect people."}]