[{"senator": "Becca Balint", "party": "Democrat", "sentence": "Rural hospitals will close.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "They don't want our rural hospitals to close.", "title": "What Americans Want", "date": "2025-06-27"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "In the aftermath of this one big, ugly bill that just passed this  Chamber and has been signed into law that explodes the debt by more  than $3 trillion, and then asks everyday Americans to pay for part of  the expenses in the bill by ripping away healthcare for more than 17  million Americans, hospitals will close, nursing homes will shut down,  and community-based health clinics will be unable to provide services  to everyday Americans.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Democrats believe  we must address this healthcare crisis before millions of people lose  their health coverage, see their costs spike, and their hospitals  close.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": null}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "In many ways, we share a faith, and I know he believes he is  answering the highest calling of his country and his faith to  help those who come with nothing because when hospitals close and when  Medicaid staff lose their jobs, tired communities lose access to care.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "It is  going to mean, unfortunately, that rural hospitals close.", "title": "Introducing Legislation on Drug Pricing", "date": "2025-05-14"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Too often, they live miles from the nearest hospital or clinic,  particularly in these rural areas, these rural parts of America, where  we are seeing hospitals closed.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "If you cut Medicaid, a whole lot of hospitals will close.", "title": "Medicaid Benefits All of Us", "date": "2025-05-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Hospitals  will close.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "We are going to talk about this when rural hospitals close.", "title": "One Big Beautiful Bill Act", "date": "2025-07-14"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "The reason we did it is because we had rural hospitals that were about  to close.", "title": "Stories From Home: the Human Cost of Expiring Healthcare Tax Credits", "date": "2025-11-17"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Here are the facts: 170,000 Alabamians will lose their healthcare;  700,000 Alabamians will lose or have reduced their nutrition  assistance; five Alabama hospitals will close, and it adds $5 trillion  to the national debt.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Meanwhile, millions more are about to watch  their healthcare premiums skyrocket and their local hospitals close,  not to mention the astronomical cost of living that is rising more and  more each day, thanks to Trump's tariffs.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "These cuts would gut funding for rural hospitals, eliminate access to  care for thousands of Texans with disabilities, and put even more  pressure on emergency rooms that are already stretched very thin,  causing hospitals to close and making it even harder to find care.", "title": "Republicans' Assault on American Arts, Culture, and Public Knowledge", "date": "2025-05-15"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Hospitals will close, including all throughout rural America, Mr.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Speaker, since ObamaCare has passed, we have seen 150-plus  hospitals close their doors.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}]