[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…testament to  the value of public libraries as a resource to our communities and the  growing diversity of our region, as well.\n\nPublic libraries, including where our office hosts our office hours,  continue to be an asset for all communities and age groups. I am proud  that a library in my district is at the forefront of being that space  for constituents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…power  should be frightening to every single American. We need to stand up,  and we need to call it out, which is what you are doing today. Even  dictating what late night TV hosts are doing is part of this whole  picture that you have been describing.\n\nBut I came to the floor today as your partner on the Appropriations  Committee. We serve on that together.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…solution in search of a problem. In 2018, Congress  passed provisions prohibiting the Department of Defense from providing  funds to any U.S. institution of higher education that hosts a  Confucius Institute, unless that institution receives a waiver from the  Department. Since its passage, no waivers have been issued, and the  number of Confucius Institutes…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…townhall that I have held in my career: undersea cables. It  just hasn't come up.\n\nMaybe my colleague in New York has a different experience. I don't  know. I don't know if he hosts townhalls. I would encourage him to do  it. Maybe undersea fiber optic cables are a big deal in his district. I  can tell you that they are not in mine.\n\nMy constituents aren't…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…administration calls for media fairness, the  kind perhaps shown by FOX, OAN, and Newsmax. Maybe.\n\nMeanwhile, Stephen Colbert, host of the show ``Late Night,'' number  one amongst hosts in his slot and a Trump critic, has his show canceled  by CBS, a financial decision it is said. Oh, yeah.\n\nMeanwhile, CBS' great news leader, Edward R. Murrow, rolls over in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694145/meanwhile"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…opinion is.\n\nThe FCC was created to ensure that the public airwaves--our shared  national resource--are used in the public interest. It was not created  to dictate what late-night hosts may joke about. It was not created to  punish networks for broadcasting opinions that government officials  dislike. It was not created to be the speech police for the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…go-to destination for events, employing  hundreds across southeastern Pennsylvania, and bringing 1.6 million  people to our community last year.\n\nI have been proud to honor hosts like the Japanese Ambassador to  Longwood Gardens, and I am always grateful for Paul's graciousness and  hospitality.\n\nThis week, for his steadfast dedication to our community…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691475/recognizing-paul-redman"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…American is violence against us all. Yet what  did we hear in the immediate aftermath? We didn't have space for grace  or respect for families left behind. We heard Fox News hosts declare  this is a war.\n\nMr. Speaker, that is not what America needs right now. That instinct  to weaponize tragedy betrays our humanity because political  disagreements, even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…emergency strikes.\n\nLocal public media also plays an important role in supporting  national security and law enforcement efforts. In the Thumb region,  Delta College Public Media hosts transmitters for the FBI and the Coast  Guard to ensure that they can effectively communicate during emergency  situations. Eliminating funding for that partnership, as this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Wildlife Refuge, an area known to the Gwich'in people  as the sacred place where life begins. The Coastal Plain is the heart  of the Porcupine caribou's calving grounds. It hosts nearly 200  migratory bird species annually, connecting the rest of the United  States and also the world to this cradle of our natural heritage.\n\nEqually vital, the 9,000-strong…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cultural bridge between Hungary and the  Hungarian American community through history, arts, and tradition.\n\nIn 1989, AHF established the Hungarian Heritage Center. The Center  hosts a rich curation of historical archives which fosters a space for  meaningful lectures, cultural events, and workshops for all to enjoy.  Over the past few decades, AHF has…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…drawing 350 attendees to experience the orchestral brilliance of the  works of Mozart, Bach, Beethoven, Dvorak, and other great composers.\n\nIn addition, the symphony organization hosts an annual jazz  institute, a young artists concerto competition for students of all  ages, an apprenticeship with New Rochelle High School musicians, and so  much more.\n\nBarry…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696750/saluting-the-work-of-barry-hoffman"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and helping military families.\n\nThe history of the Rotary Club of Grass Valley is a testament to the  power of community spirit and collective action.\n\nToday, the Rotary Club hosts several community events meant to  support the numerous programs and activities that provide the resources  needed to promote the quality of life of Grass Valley residents,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…less employees.\n\nI can think of many better ways to utilize a Wage and Hour  inspector's valuable time than harassing restaurants about their  bartenders helping out cooks, hosts, and other nontipped employees, all  who often work in a fast-paced environment.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…correctly.\n\nThis town produces a plethora of summertime fruit, supplying much of  the state and the Southeast region with a sweet, refreshing treat to  beat the heat.\n\nCordele also hosts the Watermelon Days Festival which invites  thousands of visitors each year.\n\nToday, we congratulate the town of Cordele on being recognized for  another agricultural contribution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694766/cordele-watermelon"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…families  in Bernards Township have worn the uniform of Liberty Corner Fire  Company, making it both a proud tradition and a vital lifeline.\n\nMr. Speaker, as Bernards Township hosts its upcoming First Responders  Appreciation Night, I am especially proud to commend Liberty Corner  Fire Company for its unwavering commitment and remarkable legacy of  more…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694757/recognizing-liberty-corner-fire-companys-115th-anniversary"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Federal bureaucracy.\n\nThe most rewarding part of being a Representative is helping  individuals and families get the assistance that they need. Throughout  the year, my staff hosts office hours across the 18 counties in the  15th Congressional District to assist constituents with issues related  to the Social Security Administration, Department of Veterans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Ranch  was opened in 1947 by the Wilson family, who hosted their first potluck  in 1953. It has evolved into the entertaining and iconic dinner and  show that it is today which hosts hundreds of people on a regular  occurrence.\n\nThe Flying W Wranglers band, which was formally named in 1957, have  performed at every show at the ranch since 1953 and are the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694939/recognizing-the-flying-w-wranglers"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…addition to preserving this incredible chapter in Fairbanks'  history, Jay has invested in Fairbanks' future. Let me tell you about a  few of his other endeavors. Each summer, Jay hosts the Yukon 800 boat  race, the longest, toughest, roughest speedboat race in the world. It  starts at Pike's, up to the Chena, gets out on the mighty Yukon--huge  race.\n\nJust…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…is often marked by tributes and other ceremonies to show  our gratitude to our family, friends, and neighbors who have served.\n\nIn honor of Veterans Day, my office typically hosts a Veterans  History Project event to collect stories from Iowa veterans and submit  those stories to the Library of Congress to honor those individuals and  their service for…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…and Exchange Commission created an Office of the Advocate  for Small Business Capital Formation.\n\nEach year, the Office of the Advocate for Small Business Capital  Formation hosts events across the country, including California.\n\nThese events aim to support small businesses and better understand  the issues that they face in raising funds. Unfortunately,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…policies that impact the  university and students. Each year, Lion Caucus organizes and executes  Capital Day, Penn State's annual State advocacy event.\n\nThe organization also hosts seminars for students across campus,  holds meetings in Harrisburg with legislators and lobbyists, and  welcomes elected officials to University Park.\n\nLion Caucus is made…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697393/welcoming-penn-state-lion-caucus-to-capitol-hill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…significant mineral wealth. The country is home to the       world's fourth-largest uranium reserves--resources that could       support the U.S. nuclear renaissance. Today, Namibia hosts       three active uranium mines--Rossing, Husab, and Langer       Heinrich--all of which have significant Chinese ownership       through entities such as the China National…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…National D-day Memorial in Bedford as the Nation's monument to D-day,  and President George W. Bush dedicated the memorial in 2001.\n\nEvery year, the National D-day Memorial hosts an anniversary event to  pay tribute to and recognize the sacrifices of America's valiant  soldiers. That would be tomorrow, and Bedford is not that far away.\n\nAs a former…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…of the  new fire station Chief Trimbo helped envision.\n\nChief Trimbo has also made connecting with the community a priority.  Throughout the year, the Carver Fire Department hosts and participates  in numerous community events including National Night Out, Touch a  Truck, an Open House, and a Trunk or Treat event.\n\nThroughout his career at the Carver…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…encouraging economic growth.\n\nToday, with a population exceeding 2,000, Howey-in-the-Hills is a  thriving, family-oriented resort town. The beautifully restored Howey  Mansion hosts custom-designed events, while the town's 1920s mission- style architecture and the Community Church, built in 1949, add  cultural depth to this charming municipality.\n\nWhether…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "James Risch", "party": "Republican", "sentence": "…aren't really about arms sales to our allies  in Qatar and UAE. If they were, the discussion would be about how Qatar  is one of our designated, major non-NATO allies, how it hosts the  largest U.S. military base in the Middle East, and how it is our 12th  largest foreign military sales customer. It would be about how the UAE  has fought alongside the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}]