[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…clear: There is no conceivable legal justification. It was  not self-defense, and it was not authorized by Congress.\n\nThat is why I am introducing a resolution to terminate hostilities  against Venezuela and against the transnational criminal organizations  that the administration has designated as terrorists this year.\n\nMr. Speaker, I urge all of my colleagues,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695306/venezuela-ftos-and-war-powers"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Christians, Jews, and Muslims for the purpose of advancing  greater cooperation and mutual understanding. An advocate for peace,  His All Holiness has called for an end to the hostilities between  Ukraine and Russia.\n\nHe is known worldwide as the ``Green Patriarch'' as he makes  conscious efforts to support clean air legislation. I feel grateful  that His…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President from going to war in the first place. The  legislative history of the War Powers Act makes that abundantly clear.\n\nMy colleagues might object: Well, these aren't yet hostilities.\n\nYet people are already dying.\n\nThey might object: Well, this is not yet imminent.\n\nYet with the kind of military force being brought to the region,  there is a danger…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…make that decision.  And nobody has more credibility in making that case than you do.\n\nAnd both of you have already stated the factual predicate here that  we are engaged in hostilities. We have 10 percent of our Navy out  there. The President is saying that he is going to do land strikes and  then changing his mind on it. But, you know what, he is also…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…with studied care, vested that power in       the legislature.\n\nThe War Powers Resolution exists for moments like this. It ensures  that before we send American forces into hostilities, the people's  representatives have debated and voted on that decision. It ensures  accountability. It ensures legitimacy.\n\nIf we allow these unauthorized operations to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…country'' and seize control of Venezuelan oil production. He stated  that ``we are ready to stage a second and much larger attack if we need  to.'' So the possibility of hostilities certainly still exists in the  President's mind, and he expects to be involved in Venezuela for years  to come. This is not really a plan; it is an aspiration. Even the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…We are here because we are standing for our constitutional right to  be consulted on the most consequential decision that the United States  can make: whether we engage in hostilities and put young men and women  at risk.\n\nThe chairman's summer stock theater and cringey antics  notwithstanding, this has nothing to do with whether there are troops  on…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699372/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…was voted down.\n\nLet's examine briefly an excerpt from the resolution.\n\nThe resolution reads: ``A joint resolution to direct the removal of  United States Armed Forces from hostilities within or against Venezuela  that have not been authorized by Congress.''\n\nRemember, this is the President, who consulted with corporate America  but not the Congress of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Control Expert Act, I move  to discharge the Committee on Foreign Relations from further  consideration of S.J. Res. 59, to direct the removal of U.S. Armed  Forces from hostilities against the Islamic Republic of Iran that have  not been authorized by Congress.\n\nMr. KAINE. Madam President, we will begin a couple of hours of debate  on this resolution…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…States to respond to that imminent attack. But in the  absence of an imminent attack, there is no exception. There is no  ability to go around Congress.\n\nIn the case of the hostilities against Iran that the President began  last weekend, there was no imminent threat against the United States.  There was no Army marching in this Nation. There was no nuclear…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Under Trump, the United States has pulled away from NATO and grown  closer to authoritarian dictators like Xi, Kim, and Putin, who Trump  idolizes. He has engaged in repeated hostilities against our closest  European democratic allies and cozied up to anyone who will shower him  with gifts or praise or both.\n\nHe is enabling Russia's plans to carve up Ukraine,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Congress the power to declare a war and article II  gives the President the power to be the Commander in Chief to execute  the war. Senator Kaine's War Powers Resolution says hostilities in Iran  must be explicitly authorized by Congress, but that does not, in any  way, prevent the United States from defending itself from an imminent  attack should that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…show that in between the issues  that we do think are legitimate businesses on TikTok, that there is a  bias and anti-American content being pushed about even the current  hostilities now in Iran. That is why I would like to submit for the  Record a report by Rutgers University entitled ``A Tik-Tok-ing  Timebomb: How TikTok's Global Platform Anomalies…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in support of H. Con. Res. 61 and  H. Con. Res. 64, War Powers resolutions that direct President Trump to  remove the U.S. military from hostilities in the Caribbean and against  Venezuela unless explicitly authorized by Congress.\n\nSince September 2, 2025, the Trump administration has conducted 25  military strikes on…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…into Venezuela should the President order it.\n\nLet's talk about hypocrisy. In the 118th Congress, this body voted on  two War Powers Resolutions to remove Americans from hostilities that  had not been authorized by the Congress. In those two votes, 52  Republicans and 47 Republicans, respectively, thought that Congress  ought to have a say about our…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699367/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…actually does. They didn't  say a word about it. Let's quote their own bill for them, since they  clearly don't want to talk about it.\n\nThey want to ``remove U.S. Forces from hostilities in Venezuela.''  That is what the bill says. Anybody can go and read it, black ink,  white paper. Let's get straight to the point.\n\nThe U.S. is not at war with Venezuela.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…administration authorizes covert CIA action in Venezuela and  surges U.S. forces to the region, including our most advanced aircraft  carrier, the risk of imminent involvement in hostilities is evident.\n\nIt is time that the first branch of government puts America first.  The majority party of this institution should stand by the principles  of restraint as espoused…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to build a pier, was sending them into a war zone.\n\nInterestingly, every Republican Senator at that time voted against a  point of order, and the point of order said no hostilities existed. The  point of order at the time said Gaza is not a war. And every Republican  voted against that point of order because every Republican considered  that Gaza was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…up the concurrent resolution (H. Con. Res. 61)  directing the President, pursuant to section 5(c) of the War Powers  Resolution, to remove United States Armed Forces from hostilities with  presidentially designated terrorist organizations in the Western  Hemisphere, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "James Risch", "party": "Republican", "sentence": "…here--not  we, but what the other side is trying to do here.\n\nIt says:\n\nCongress hereby directs the President to terminate the use       of the United States Armed Forces for hostilities within or       against Venezuela.\n\nLet me say that again: We are directing ``the President to terminate  the use of . . . Armed Forces for hostilities within or against…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "James Risch", "party": "Republican", "sentence": "…cetera. But this is the  operative language. It is very clear:\n\nCongress hereby directs the President to terminate----\n\nterminate--\n\nthe use of the U.S. Armed Forces for hostilities within or       against Venezuela.\n\nThat is what we are voting on today. We are attempting to direct the  President to terminate the use of the U.S. Armed Forces for hostilities…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the Senate, we should not adopt the resolution,  which states, in part:\n\nCongress hereby directs the President to terminate the use       of United States Armed Forces for hostilities against the       Islamic Republic of Iran . . . unless explicitly authorized       by a declaration of war.\n\nWith continuing threat from Iran against Israel, the dangers…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…which followed 13 months of       conflict between Hezbollah and Israel.\n\n``Sustainment of the A-29 fleet will support the LAF's role       in maintaining the cessation of hostilities by ensuring       maintenance of this critical aircraft, which is used for       Close Air Support in ground maneuver operations, as well as       manned Intelligence, Surveillance…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Secretary Rubio confirmed again to Congress on January  14 that there are currently no U.S. troops in Venezuela and that the  introduction of U.S. Armed Forces into future hostilities will be  undertaken consistent with notification of the War Powers Resolution if  required.\n\nMr. Speaker, the hypocrisy of House Democrats is palpable this  afternoon in…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…one of the Founders, assured Americans at the  Pennsylvania Ratifying Convention that the proposed Constitution would  not allow one man or even one body of men to initiate hostilities.\n\nIn Federalist 69, Alexander Hamilton stated the Constitution gave the  Presidency fewer war powers than those of the British Monarch and that  the American President would…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…that might want to establish themselves or attack  elsewhere in the Western Hemisphere.\n\nInstead of considering this resolution, which carries little or no  consequences for hostilities that don't exist, this Chamber should  focus on supporting the President's efforts to deter the growing  national security threat from Venezuela.\n\nHundreds of Americans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698245/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…so  aren't even here, at a time when numerous facts have changed, after  Saddam Hussein was captured in 2003 and was executed in 2006, when  troops were withdrawn and the hostilities were over in 2011, and then  we went back in--regarding ISIS--and then out by 2021, that we should  not be operating under a 23-year-old authorization of the use of  military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695255/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…country. So let's look at what it says.  Let's look at the actual language:\n\nCongress hereby directs the President to terminate the use       of United States Armed Forces for hostilities against any       organization designated on or after February 20, 2025--\n\nHis date of inauguration--       as a foreign terrorist organization or specially designated…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…when they substituted ``declare war'' instead  of ``make war'' among Congress' enumerated powers.\n\nThe supporters of this resolution are correct. Congress has to  initiate hostilities, but neither of these resolutions are applicable  to current events. H. Con. Res. 64 orders the President to remove  forces from Venezuela that are not in Venezuela. Until…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…be party to international organizations that seek to  preserve that order.\n\nChina's position in multilateral economic institutions will be at  risk should they engage in hostilities toward Taiwan. We simply cannot  overlook the value of deterrence and preparedness.\n\nChina should understand the economic and diplomatic repercussions of  threatening international…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}]