[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…of Commerce,  Ms. Fragoso helped secure an ARPA grant as part of the Re-open Merced  Businesses initiative. She was instrumental in another grant for the  Arts Community to host 2 Art Corners, where local artists participate  and are paid. Under her watch, the MCHCC launched Vamanos Magazine  which showcased Merced's agricultural landscape, small businesses,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the thousands of Greek Orthodox constituents who call  the Massachusetts 7th Congressional District home and the more than 300  million followers worldwide, it is an honor to host the longest serving  Archbishop of Constantinople in the Church's history and a humbling  opportunity to say thank you for his efforts on behalf of the entire  human family.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Colorado in the district that I serve.\n\nMy job is to be accessible to my constituents regardless of their  political beliefs. I understand that Republicans are scared right now  to host townhalls because my colleagues on the other side of the aisle  know that the policies that the majority is pursuing in Washington are  deeply unpopular.\n\nIf I spent my week…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…leadership at the Department of Defense is also a  national embarrassment. The mess Secretary Hegseth creates regularly  shows the consequences of picking an inexperienced FOX News host to  lead a massively complex life-or-death Federal Agency. Donald Trump is  learning it the hard way: If you pick a FOX News cable host to lead the  largest, most complicated…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…year old parents of our 53 year old, nonverbal       autistic son who we had become physically unable to care for       him in our home anywhere. We were able to place him in a host       home May 29, 2024, where he is being provided a safe and       caring environment. He requires 24/7 supervision, to be given       his needed daily medication, and seeing…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…adventures. Visitors to Astoria this summer will also be welcomed to  the Oregon Film Museum, which eagle-eyed fans may recognize as the  former Clatsop County jail, which played host to the Goonies iconic  jailbreak scene.\n\nJust as the original Goonies fans and stars have grown and matured  since the film's release in 1985, so has Oregon's film industry.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…outstanding high school  basketball champions. I am confident that these young student athletes  have bright futures ahead of them.\n\nThis weekend, the city of Birmingham will host the NCAA women's  basketball Sweet 16 and Elite 8 in the Magic City. We welcome all of  the teams to Birmingham, Alabama, and wish them much success.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…inclusion.\n\nDuring her confirmation hearing, Mrs. McMahon seemed unsure whether  this edict meant that schools can't celebrate or teach classes on  African-American history or host clubs like Special Olympics or Girls  Who Code.\n\nAs a reminder, by law, the Secretary of Education may not interfere  with the content that schools teach, nor the academic standards…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…growth and popularity of social media platforms we are now grappling  with. For nearly 30 years, social media platforms have enjoyed blanket  immunity for the content they host. They have failed to adequately  police harmful content on their sites, despite their terms and  conditions mandating them to do so.\n\nWhile most of the conversation surrounding…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…foreign affairs and public  service using the language skills gained through this scholarship  program.\n\nThis year, Avi will travel to Germany to attend school, live with a  host family, and collaborate with the Department of State to promote  cultural exchange between Americans and the German people.\n\nOn behalf of the people of Colorado's Seventh Congressional…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693199/recognizing-avi-bender"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Financial.\n\nBut this crypto corruption is, again, just one more of the ongoing  corrupt con games that President Trump has helmed. LIV Golf, backed by  the Saudi Government, will host a tournament at Trump National Doral  resort later this year, and the Trump Organization has announced new  real estate developments on government-owned land in Serbia and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the respect that everybody else is accorded. This  is not a world where you are going to relegate some human beings to a  lower life form simply because it pleases you and a host of people who  you happen to communicate with. This is unacceptable.\n\nSo right here, I sat on this row. I was over one seat away from the  aisle, but when the President approached,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…years old, Allen had become the youngest  comedian ever to appear on The Tonight Show. Following this historic  and meteoric ascent in the comedy scene, Byron Allen became a host- correspondent on NBC's reality TV show Real People and secured a  leading role in the 1988 film Case Closed. After both projects wrapped,  Allen hosted The Byron Allen Show,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…tariffs  are costing people an extra 1,200 bucks per year.\n\nRegular people can't afford the rent, and Republicans are letting  Trump gild his bathroom and build a ballroom to host the rich and  powerful elites who own the GOP.\n\nThese guys are bailing out Argentina. They are giving $40 billion to  an entirely different country rather than helping the 42…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…from entities that they didn't want  to do business with, never sought to do business with, finding out that  they are applying for a mortgage and then harassing them with a host of  texts and calls, et cetera.\n\nH.R. 2808 is supported by a wide range of groups, including the  National Consumer Law Center, the National Association of Home  Builders, the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…based, infrared countermeasure system for rotary-wing, tilt-      rotor, and small fixed-wing aircraft across the DoD. CIRCM       provides near spherical coverage of the host platform to       defeat infrared-seeking threat missiles. CIRCM receives an       angular bearing hand-off from the Common Missile Warning       System and employs a pointing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…at the highest level, with basketball, the Utah Jazz; soccer, Real Salt  Lake; and hockey, the Utah Mammoth. They have already hosted the Winter  Olympic Games and are set to host another in 2034.\n\nIf you travel across the State, Mr. Speaker, you will find  communities with baseball fields, football fields, soccer fields,  pickleball courts, tennis courts,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate Augusta radio  host Austin Rhodes on the recent announcement that he will be inducted  into the Georgia Radio Hall of Fame.\n\nFor over 30 years, Austin has been a consistent and dependable voice…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…study, work, and volunteer in Germany and  the United States. The participants fully immerse themselves in the  other culture, attending university, interning, and living with host  families all over both countries.\n\nCBYX is an excellent example of how cultural and political exchange  amongst citizens can positively impact international relations in a…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688275/recognizing-41st-anniversary-of-cbyx-exchange-program"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…DUNN of Florida. Mr. Speaker, I rise today to welcome his All- Holiness Ecumenical Patriarch Bartholomew to the United States this  week. My colleagues and I are honored to host him here in the House of  Representatives and I know my Greek-Orthodox constituents are excited  to have him visit our Nation's Capital. His All-Holiness is a champion  of religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695798/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Americans show an ID to board a plane.  Americans show an ID to drive a car. Americans show an ID to open a  bank account. Americans show an ID to enter Federal buildings and for a  host of other reasons.\n\nOf course we should expect it for American elections. It doesn't  silence voters. It empowers voters. It only ensures that Americans are  voting in American…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Scars Uncovered, and the Hoosier Burn Camp for Kids.  The five chapters in Kentucky include Lexington, Louisville,  Campbellsville, Sturgis, and Paintsville. Together, they host the Burn  Run, a two-day event for charity that has resulted in more than  $300,000 in funding for pediatric burn victims.\n\nEvery day, our firefighters bravely answer the call…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…American  education. Our classrooms must remain places of learning; not foreign  influence.\n\nThe PROTECT Our Kids Act sets a simple but necessary safeguard: If a  school chooses to host a CCP-funded Confucius program, then it should  not receive Federal taxpayer dollars. It is as simple as that. This  bill upholds academic integrity, protects parents' rights…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697527/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…simultaneously  become vastly more efficient.\n\nDuring the 4 long years of the Biden-Harris administration, however,  the Department of Energy used EPCA authorities to regulate a host of  everyday products like dishwashers, freezers, and dryers. But these  regulations were neither based on what consumers need or focused on  affordability. They were rooted…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…protect  our children from the malign influence of the CCP.\n\nThe PROTECT Our Kids Act would prohibit Federal funding for any  elementary or secondary school that continues to host a Confucius  Classroom. Schools will be notified of these requirements and given  guidance for how to comply.\n\nTo be clear, this legislation is only concerned with programs…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…movement in America, 97 Milk, including the leadership of  Bernie Morrissey and Sherry Bunting, Nelson Troutman, Krista Byler,  Christine Ebersole, Dr. Edward Silverman, and a host of parents and  dairy farmers. I thank each and every one of these individuals who  put their mark on this bill in a meaningful way.\n\nI encourage all of my colleagues to support…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…than any other ethnic group in the country.\n\nThey had a situation when so many--and I mean thousands and  thousands--of Alaskan Natives were serving in Vietnam. When a whole  host of Americans didn't want to serve in Vietnam, Alaska Natives  answered the call. So we have tens of thousands of Vietnam vets.\n\nAnd when they came home, like a lot of Vietnam…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Natrona County as it celebrates the 25th  anniversary of its largest fundraiser, the Kids' Art a la Carte Gala.\n\nOn May 3, 2025, the Natrona County Child Development Center will host  its annual fundraiser at the Ford Wyoming Center in Casper, WY.  Proceeds from this special event go directly toward supporting the  CDC's services and programming. It is a…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…they intended to do.\n\nMr. Speaker, included in those police-related policy matters in the  act that they, indeed, passed in 2022 was subtitle S of the CPJRA,  which imposed a host of restrictions on police pursuit of criminal  suspects.\n\nIn doing so, the D.C. Council essentially made it illegal for police  to pursue and apprehend criminals if they were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…(SEAL) at Millersville University.\n\nSEAL is a STEM competition sponsored by the Office of Naval Research.  Millersville University is one of the many schools in the Nation that  host this program, bringing in teams of high school students from  across the region. The competition requires that students design and  build robotic systems to use in challenges…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694803/recognizing-penn-manor-high-school-students-for-their-achievement-in-the-sea-air-and-land-challenge"}]