[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…associated with it.\n\nAlso, in Vermont, just as in Indiana, our small businesses are really  a big deal. I have been hearing from them. I am hearing from bed and  breakfasts, hotels, brewers, distillers--any industry. I will give a  few stories, a few quotes.\n\nSimon Perkins at Orvis in Manchester:\n\nThe reality is that, in a rapidly changing tariff…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…visitor spends about $4,000 when they come to  America.\n\nWe are not going to eat their food. We are not going to go to their  restaurants. We are not going to stay at their hotels. We are not going  to fish in their lakes.\n\nYou name it, that is what the people in my State are seeing. And  everything from manufactured parts to whiskey have dropped sharply.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…tipped workers?\n\nAll across America, and especially in my home State of Nevada, tipped  workers show up every day, serving food and cleaning rooms. They keep  our restaurants, hotels, and casinos running. They work hard. They  deserve to be paid fairly for every hour that they work.\n\nUnder current law, there is a commonsense protection in place. A  worker…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698970/tipped-employee-protection-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…now a billion- dollar industry across the country, and it keeps growing. It is  revitalizing local, rural, and small-town workforces. The tourist  dollars are also expanding hotels, restaurants, and businesses nearby.\n\nThese farms also offer unique educational and recreational  opportunities for children and families and help connect the public to  our…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…rise to speak in support of H.R. 1479, the Hotel Fees  Transparency Act.\n\nFar too often, when consumers go to check out of their hotel rooms,  they are hit with surprise fees. Hotels and online travel agencies have  many names for these types of fees: resort fees, amenities fees, and  facilities fees, to name just a few. Regardless of what they are  called,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…businesses across the economy--including in labor-      intensive and low-paid sectors like construction, home and       health care, janitorial and       building services, hotels and hospitality, and warehousing       and logistics--use similar contracting arrangements to       insulate themselves from accountability. Limiting employer       accountability…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…on other countries with no  clear strategy, and when you bad-mouth our allies, they don't want to  come visit here anymore.\n\nWe have a hospitality industry in Rhode Island--hotels, restaurants,  and other small businesses--that is facing crushing costs from tariffs  and less business from international travel. In addition, by the way,  their domestic…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…hard-earned vacations go as planned. I thank Representatives Kim,  Mullin, and Fry for partnering with me on this bipartisan legislation  that will increase cost transparency for hotels, motels, and short-term  rentals.\n\nMr. Speaker, have you ever planned a vacation and when you searched  online, you thought you found a great deal at a hotel or a short-term…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…and Elon Musk try to pressure government workers  to do their bidding and to help themselves personally and politically.\n\nIn his first term, Donald Trump profited from his hotels in violation  of the Constitution. Yet, now, his conduct is even more extreme. Just  days before his inauguration, Trump launched a meme coin. Buyers can  now funnel money…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…from children, Trump is making sure his billionaire buddies get higher  tax breaks.\n\nWhile families stress over how to make ends meet with high costs,  Trump is flaunting hotels and golf courses.\n\nWhile House Republicans debate which critical funding to cut, Donald  Trump is raking in the excess to expand his personal empire.\n\nDonald Trump is making…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…increases despite unanimous and passionate public  opposition, Mr. Speaker.\n\nI want folks to imagine how it feels for many of our residents in  Detroit who have been living out of hotels for weeks after a massive  water main break flooded their neighborhood, their homes, and even  their vehicles. Now they are going to have to be paying more for their  water.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…still  working from home in 2023. Need to find the nearest unlocked restroom?  Just email them.\n\nIndeed, the employees who provide most of the visitor amenities, such  as the hotels, shops, and restaurants, don't even work for the Park  Service. They work for the park's private concessionaire.\n\nIt is true that hiring seasonal employees was delayed for…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…by Alaskans and tourists--not an easy task--and this person is my  friend Jay Ramras.\n\nLike many Alaskans, Jay is a jack-of-all-trades. He owns restaurants  and beautiful hotels. He has had a successful political career. He is a  prolific philanthropist. He loves history. And more importantly, he  loves Alaska and especially his great hometown of Fairbanks--by…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Wyoming, our  national parks, and other national parks. They do it every year.\n\nUnder a Schumer shutdown, those plans will be forced to be canceled.\n\nLocal businesses like hotels, restaurants, they will lose revenue.  Park staff are reduced to skeleton crews. Trash piles up. That is not  stewardship. That is neglect.\n\nThat is what the Democrats are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Manufacturers, which sells to restaurants and so forth. It says these  costs must be passed on to customers, many of which are small  businesses like restaurants, bars, retailers, hotels, grocers, and  schools. As the Department of Energy acknowledges in its own analysis,  the increased capital expense caused by these standards may take more  than--not many…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Bilirakis for yielding.\n\nMr. Speaker, I rise in strong support of my bill, H.R. 1479, the  Hotel Fees Transparency Act.\n\nHidden fees on short-term lodging, whether it is at hotels, motels,  inns, resorts, or rentals, make it harder for families to plan for a  trip.\n\nToo often, what looks like an affordable overnight stay online turns  out to be far more…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690198/hotel-fees-transparency-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…apologize for if we hold  the number of people here to those numbers.\n\nThere are some people who feel that we need more people here for our  farms, more people here for our hotels, more people here for our  factories. If that is true, Congress can expand the number of work  visas that are available, but it doesn't mean we open up the floodgates  of the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to offer care  and support for children in need. By doing so, they provide shelter for  children who would otherwise be forced to stay in caseworker offices,  hospitals, or hotels. However, many of these same parents, for any  number of reasons, stop serving as foster families after only 1 year.\n\nIn short, there is a dire need for more foster families…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…seller may assert an affirmative defense if such intermediary       or third-party online seller--\n\n(A) established procedures to receive up-to-date price       information from hotels or short-term rentals, or agents       acting on behalf of a hotel or short-term rental;\n\n(B) relied in good faith on information provided to the       intermediary or third-party…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…includes requiring voter ID, something 83 percent  of Americans support.\n\nYou need an ID to board an airplane, buy certain medicines, apply for  jobs and bank accounts, check into hotels, rent a car, donate blood,  and purchase a lottery ticket. Why should voting in our elections have  a lower verification standard than purchasing a lottery ticket? Surely,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]