[{"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…now out of a job--people who were promoted because  they did such a good job.\n\nOne person I was trying to get their job back was actually working  with the Veterans Crisis Hotline. They were doing such a good job  answering the phones that they were promoted to trainer. As soon as  they were promoted to be a trainer to help other people to answer those…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…International, Catholics for Family  Peace Education and Research Initiative, Illinois Accountability  Initiative, Just Solutions, Legal Momentum, and the National Domestic  Violence Hotline.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700038/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Speaker, I rise in support of the LGBTQ community to  celebrate Pride Month, and to call out President Trump's reckless  decision to shut down the 988 specialized LGBTQ youth hotline. This is  a devastating decision that will affect people in every corner of our  country.\n\nI will put this into perspective: In 2024, 12 percent of LGBTQ youth  attempted…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693105/supporting-the-lgbtq-community"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Tape Act, or the DUMP Red  Tape Act. While H.R. 4305 is less objectionable than the other anti- regulatory bills, it is simply not necessary.\n\nTo begin with, a deregulatory hotline already exists on  regulations.gov. Establishing another creates duplication and drains  SBA resources. Isn't this contrary to everything Republicans, the  administration,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…anonymously, warning that these job  cuts are affecting veterans' care and leading to many errors. Some of  the people let go were even working on the veterans suicide crisis  hotline.\n\nVA services are already stretched thin. These job losses are making  it worse. That is why I am proud to introduce these crucial bills and  to host Roland ``Coopdawg'' Cooper…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…ago we saw more than 1,000 staff  being fired at the VA. Then, this week, 1,400 more staffers were fired  at the VA.\n\nWho are these folks?\n\nThey support the veterans' crisis hotline. They take care of medical  research, studying cancer, mental health, you name it, and burn pit  exposure.\n\nMr. Speaker, remember that the Federal Government is the largest…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688314/staffing-cuts-at-the-va"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…hours  expired. We will accommodate your imperative to get this done if you  needed to get it done by the end of next week. We said: Sure, keep  negotiations open. And we ran a hotline on that, and it cleared our  hotline.\n\nWe had some very difficult conversations with Members who hate this  idea. But just to keep the aperture open to renegotiate and to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…talking to himself,  Mr. Speaker, shadowboxing with no shirt on, clearly, they have been  sleeping on the street, consider calling 9-1-1. Consider calling the  mental health hotline. Consider calling not the police because you  think it is unsavory to see this, Mr. Speaker, but consider calling a  mental health hotline to get them help.\n\nThat is because…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Speaker, today we will vote on the Destroying  Unnecessary, Misaligned, and Prohibitive (DUMP) Red Tape Act, which  would require the SBA's Office of Advocacy to codify a Red Tape Hotline  to receive submissions on burdensome regulations and to report on those  submissions. I will vote ``no'' because this bill is redundant--there  is already a hotline in place…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697466/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are bringing to  the floor this week. There are two bills for small businesses. That  sounds good, right? Do my colleagues know what those bills do? One of  them creates a hotline that already exists. Wow, that is  groundbreaking. Neither of them does anything about the number one  issue that I hear from small businesses, and that is tariffs.\n\nEvery…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hurt and such  policies of foolishness. Donald Trump promised to take care of  veterans. Yet DOGE tried to fire hundreds of critical staffers from the  VA, including crisis hotline staff and funding for cancer treatments.  Housing costs are up. Electricity bills are up.\n\nIf there is any golden age to be had under Donald Trump, it is a  golden age for…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise in opposition to this bill.  Codifying the so-called Red Tape Hotline, an anonymous inbox, the  contents of which, as the ranking member articulated, we know virtually  nothing about, will do nothing to help small businesses.\n\nWhile the majority…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…potentially limiting  access to capital.\n\nTo ensure we are hearing directly from those affected, the Small  Business Administration has also now launched recently a red tape  hotline, giving small business owners and manufacturers a direct  channel to report excessive or unworkable Federal regulation so we can  act on them. As a matter of fact, their hotline…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Gallego. It is important to him in Arizona, and this is  really important to me.\n\nI explained the Alaska Native Vietnam vet bill. So we lifted the  holds. Republicans cleared the hotline.\n\nSo that is what has happened.\n\nNow, I guess, unless he is here to talk about how he supports my  bill--so 2 hours ago, we thought this was going to clear. Gallego's  bill.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the  Child Access Center in Bellefonte.\n\nWhile Centre Safe began as an agency by women, for women, it works to  support all survivors and victims. It offers a 24-hour crisis hotline,  emergency shelter, crisis counseling, legal advocacy, legal  representation, and transitional housing.\n\nCentre Safe also works to address violence before it begins by  educating…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…VA, which often leads to things getting lost and delays in their  benefits.\n\nIn fact, it was not that long ago when I was in college and required  to manually call in to a hotline for the VA every month to notify them  that I was still a student enrolled in courses to receive my GI Bill  benefits.\n\nH.R. 3481 fixes these issues by authorizing the VA…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…order to consider in the House the bill (H.R. 4305) to direct       the Chief Counsel for Advocacy of the Small Business       Administration to establish a Red Tape Hotline to receive       notifications of burdensome agency rules, and for other       purposes. All points of order against consideration of the       bill are waived. The amendment…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…the curtain back on how this  process operates--the way the process operates is, when you are seeking  to pass something by unanimous consent, you circulate what is called a  hotline, and every Senator gets the chance to say: Are you going to  object?\n\nAnd on the Republican side, every Senator said: Nope, good by me.\n\nAnd on the Democrat side, every Senator…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…bureaucratic barrier and  allowing more veterans to be served on college campuses across the  country is in lockstep with that mission.\n\nThis bill would also establish a VR&E hotline that would allow  veterans to call and receive correct information without having to sit  on hold at a call center that may or may not be able to answer their  questions.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, pursuant to House Resolution 916,  I call up the bill (H.R. 4305) to direct the Chief Counsel for Advocacy  of the Small Business Administration to establish a Red Tape Hotline to  receive notifications of burdensome agency rules, and for other  purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…their Ohio CareLine available 24 hours  a day and 7 days a week to offer emotional support. By simply dialing  988, anyone in our Nation can access the national mental health  hotline, which offers free and confidential support from trained  counselors around the clock.\n\nI thank our local mental health providers, support workers, and first  responders for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…well as veterans, their families,       caregivers, and       survivors on how to identify, report, and avoid fraud and       scam attempts.\n\n``(3) Promoting the VSAFE Fraud Hotline and VSAFE.gov       website of the Department (and any successor resources) and       identifying other identity theft resources available to       veterans, their families,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…ever- shifting OSHA paperwork requirements that eat up their time better  spent on the jobsite.\n\nEarlier this year, the Small Business Administration created the Red  Tape Hotline under its Office of Advocacy. This hotline gives small  businesses a seat at the table to highlight the prohibitive red tape  regulations from across Federal agencies that…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…General.--The Secretary of Housing and Urban       Development shall, not later than 1 year after the date of       the enactment of this Act, establish a program--\n\n(1) to establish a hotline to provide tenants of covered       federally assisted rental dwelling units with counseling,       resources, and referrals to available assistance relating to       eviction-related…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…break the stigma around  suicide and advocate for brain health awareness and suicide prevention.\n\nAs a young college student, I actually was one of the people on a  suicide hotline, so I know how tenuous it is and that people need  support and help.\n\nThis day reminds us that every life has value and every person  deserves support. Let us work together…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…to respond to a couple of points.  First, the bills to which my Democratic colleagues are referring have  been cleared. They have been cleared through what is known as our  hotline, cleared for passage on the Republican side--not one objection  from one Republican.\n\nIt is the Democrats that are holding it up here. We are not the ones.\n\nSecondly, I want…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…placed in safe, private, and  secure locations where a victim can view them without fear. Each one  includes a QR code that links directly to support resources, as well as  a hotline for those without internet access. In under 30 seconds, a  victim can quickly connect to confidential help, shelter options, and  emergency services.\n\nWith the support from…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}]