[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sort of on their own. They are trying to say: Hey, wait a minute. We  want to work.\n\nThey work hard. The gentleman from Pennsylvania should sit in front  of a glass furnace 8 hours a day in 90 degrees blowing in his face.  That won't happen to people from Harrisburg, largely because they are  more of a middle-class community. They are a State capital.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…for his life to the mob, saying he had  four daughters of his own. He had a heart attack. Will we not honor  Michael Fanone?\n\nWill we honor Officer Harry Dunn who fought for hours and hours,  enduring not just other physical attacks but savage racial epithets and  abuse?\n\nWill we honor Officer Hodges who nearly died trying to stop the mob  from entering…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…closure, residents, likely on a fixed income,  will have to travel much longer distances: to Albany, to New Haven, or  to the south Bronx at greater expense, in some cases 4 hours one way on  public transit.\n\nThis is a financial and logistical hardship for people already  fighting for support. With the Westchester County government, my office  and I…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, Minnesota and our Nation suffered an  unthinkable tragedy in the early hours of January 14th, when our  state's elected officials were attacked in politically-motivated  shootings.\n\nMinnesotans are devastated by the assassinations of Speaker Emerita…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…signed up to serve and there was no waiting line, and when he comes  home to this country and he wants to vote, he finds out that there is a  waiting line in the hot Sun for hours; he finds out that his vote in  one location, which he figures out, for the primary is different from  where he votes in the general and then is different from where he votes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…monthly costs have gone from $1,287 to  $3,026 for next year. As a working family with a daughter who has an  autoimmune disease, we are struggling, and I am working 50-plus hours a  week just to pay the insurance.\n\nHere is another one: With the Health Connector, I was paying $264 per  month, acceptable seeing that I am healthy but not young. Without…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…their doors open. They  are parents lying awake at night wondering how they will afford  medicine for a sick child or how they will keep food on the table if  they lose their hours.\n\nHere are the facts: 170,000 Alabamians will lose their healthcare;  700,000 Alabamians will lose or have reduced their nutrition  assistance; five Alabama hospitals will…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693197/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…all of America is watching. If some people are not up at this  hour, watch it tomorrow. It is inspiring.\n\nAnd I would just ask my colleague a question. I was there. I spent 4  hours with John McCain before he voted. We talked and talked and talked  and went over the courage of his father and his grandfather in the Navy  and the courage that he hoped to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…protections guaranteed at the Federal level and take money out of the  American worker's pocket.\n\nThe concept of overtime is very simple. If you work more than your  traditional 40 hours a week, then you make more money, and you get to  take home what you earn.\n\nNow, instead of protecting that very basic principle, my Republican  colleagues are trying to make…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699004/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…both of  our heart rates dropped. I remember thinking as the oxygen mask came on  my face, please let me be asleep before my doctor starts cutting, and I  was.\n\nI woke up a few hours later, and I had a baby girl, but I didn't get  to see her until the next day. As I waited those 24 hours to see if she  would make it, I realized that I almost became one…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…order of  September 17, 2025, with respect to S.J. Res. 71.\n\nMr. KAINE. Mr. President, I rise to begin a discussion that we will  have over the course of the next couple of hours about this Senate  joint resolution--a privileged motion pending before the Senate that I  filed, together with Senator Heinrich, to terminate a Presidential  declaration of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…community. He has been in  ICE detention for the past month, separated from his family and  friends.\n\nLast week, ICE transferred Benjamin from California to Arizona. Less  than 24 hours later, Benjamin was slated to be transferred again to  Louisiana but was instead sent back to California. This all occurred  without his family knowing.\n\nThis is why I introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694911/ice-is-out-of-control"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Fortnite skins,  whatever kids buy. If he accidentally spends more than he has, $35, in  my opinion, is too high of a penalty. The average American kid would  have to work 5 hours at the Federal minimum wage to get that back. I  think that is crazy.\n\nEvery American should have the opportunity to participate in our  economy and not be on their knees when…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689843/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the mouth of the FCC Chairman of the Federal  Government, with vast legal authority to punish Disney and ABC and  their affiliates.\n\nThe chilling effect was immediate. Within hours, Disney and ABC  indefinitely suspended Jimmy Kimmel from the air. A comedian was  silenced because a government regulator, the Chairman of the Federal  Communications Commission,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that.\n\nBut there was a difference. We had insurance through the University  of Vermont where my wife was a professor. He had no insurance. He was  working late nights, long hours, raising these two kids by himself, and  he was trying to pay off a $335,000 medical bill. That is not right.\n\nBut that example you just mentioned or this Wyoming family or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…reported on the House and Senate  action, keeping the African-American community informed during  Reconstruction after the 13th, 14th, and 15th Amendments. He spent  countless hours writing and studying right here in the House Press  Gallery. Even after his tenure in the gallery, he often would return to  the Capitol.\n\nCongress has honored Douglass with…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…administration ignored  our concerns and the complaints by Floridians and, instead, forced  these harmful regulations into our States and into our industries in  the waning hours of their administration, I am proud to now be here in  the Senate to help continue the fight against these sprawling, harmful,  nonsensical policies that were pushed by these…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Mr. Sean Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…today to recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Ms. Lynn White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691191/recognizing-lynn-white"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…coming. What I mean by that is  the grid is going to melt down. Simply, all one has to do is go back in  time three Christmases ago, when the American grid pretty much was  hours away from melting down.\n\nMr. Speaker, look at California and Texas. Look at the meltdowns that  have happened there. The grid is not stable.\n\nThe grid needs to be redone, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…communities. Often, they arrive at scenes of great adversity and  trauma, to which they reliably bring strength and composure. These  brave men and women spend hundreds of hours in training so that they  are prepared when they get ``the call.''\n\nThirteen years ago, I established the 16th District Congressional  Fire and Rescue and EMS Awards to honor…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…working one on one with  families, at 3 of 5 Hernando preparation sites, equaling a total of 5  days a week since February (logging over 135 TD). This doesn't include  her endless hours assisting the organization with event prep,  administrative services, and partnership planning. Donna works  beautifully in a group setting, as well as independently being…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…on the walk over from  the parking lot to the University of Utah Huntsman Center basketball  game. There are always a few police officers there directing traffic  for the few hours of that. I had four boys under the age of 10 at the  time. I was trying to help get them out of their shell, talk to other  adults, and be a little bit more engaging with folks.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…tragically lost their son,  Zach, to fentanyl poisoning. Unfortunately, they are not alone in this  pathway to pain. Last year, one Pennsylvanian died from an overdose  every 2 hours, with the overwhelming majority of these resulting from  fentanyl poisoning.\n\nWe owe it to our future generations to end this plague on our society  by passing the HALT Fentanyl…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…speech lined  up. We were going to do something just simple and pleasant for  everyone. We were going to walk through Medicare financing for a while,  and they wouldn't give me 3 hours or 4 hours to do it, so you are stuck  with me for a half an hour.\n\nThen, earlier today, CBO actually did their update. Okay. Let's see  if I can make this make sense.\n\nWhen…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…voiced  ambitions. Yet merely because it was the Trump administration which  graciously performed the seemingly impossible, these Democrats now  oppose one of America's greatest hours.\n\nTo this end, we introduced a resolution today to make clear that the  House of Representatives is supportive of the efforts of our brave  patriots who deftly brought an end…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…security  patrols to provide for the defense of our Nation's and in our case  Florida's coastline and waterways.\n\nLast year, the Flotilla 11-1 members volunteered more than 9,100  hours in support of the Coast Guard. The group conducted ten boating  safety education classes with more than 200 graduates, including over  100 children ranging from kindergarten…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…comfort the hurting, and keep our healthcare system  running.\n\nI began my own medical career as a nurse. My sister was a nurse, and  my husband was a nurse. I understand the long hours, emotional toll,  and deep responsibility, commitment, and gratification that come with  the job.\n\nToday, we face a nationwide shortage of nurses, especially in rural  areas…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…rise today to recognize the outstanding  contributions that Mr. Eric Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}]