[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, I rise today to wish everyone a  joyful and proud Pride Month.\n\nIn Houston, pride runs deep. We hosted one of the first nighttime  parades in the country, and today it is the fourth largest in the  Nation. It is not just a parade.\n\nGroups like Fundacion…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692139/happy-pride-month"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…What this administration is  doing with ICE is not enforcement. It is lawlessness. It is cruelty.  They have turned ICE into a force of masked thugs. In my community in  the Houston area, people are paying the price.\n\nLuis Gustavo Nunez Caceres died in ICE custody near Houston. DHS  claims it was heart failure, but this administration has shown such…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699665/horrific-ice-abuses"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Districts constitute unconstitutional racial       gerrymanders, under the logic and reasoning of Petteway.       Specifically, the record indicates that TX-09 and TX-18 sort       Houston voters along strict racial lines to create two       coalition seats, while creating TX-29, a majority Hispanic       district. Additionally, TX-33 is another racially-based…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…However, Republicans never come here to talk about poverty or hunger  or the sick. It is always about tax cuts, the rich, and the  billionaires.\n\nTonight I rise for one of the Houston families they are attempting to  hurt.\n\nLuisa and Roberto are seniors in my district. They have worked their  whole lives, and now they are afraid. They are afraid of what…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691445/snap-and-medicaid"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…research institutions. This  funding supports critical work at UT Southwestern in Dallas, where  scientists are pioneering new cancer treatments; at Baylor College of  Medicine in Houston, where researchers are leading the fight against  Alzheimer's and heart disease; and at the University of Texas at Austin  and Texas A&M, where cutting-edge biomedical research…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…they have no tree canopy. There is       this great program to try to build sidewalks, put in trees,       and address some of these challenges that--it gets real hot       in Houston, and this is a really important program. But I       know the funds for that have been revoked.\n\nAnd so is the statement that this won't do anything to       those, but there…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…hails from Chicago,       Illinois, and is the Founder & Senior Pastor of the       Reflections of Christ's Kingdom World Outreach International       (R.O.C.K.) church in Houston, Texas, serving ministry for 40       years full-time through Executive and Pastoral leadership       roles; and\n\nWhereas, Apostle Dr. Dana Carson is a testament to…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Governor to do this. The Governor  got with the attorney general. The two of them worked it out such that  seats were taken in Texas.\n\nI am just going to focus on one of them. In Houston, Texas, we had  the 18th Congressional District, historic as it is called quite often-- and I concur with the persons who would call it such; the historic 18th  Congressional…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…sometimes? They get down there; they go  through another screening; and the Federal agents say: OK. Sorry about  that. We made a mistake. And they just dump them on the streets of  Houston or wherever they may be.\n\nNo documents, no identification--how are they going to even get home?  That is happening in this country right now. And if they are not  released,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Ebenezer  Baptist Church (EBC) in Northern Virginia, was born on September 19,  1953, in South Carolina. Her family moved to Virginia, where Reverend  Carr attended Charles Houston Elementary and Parker Gray High School  and joined Ebenezer Baptist Church. It was at Ebenezer that Reverend  Carr was first baptized as a child by Reverend A.A. Booker, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…example  of how to respond to one of these terrible situations.\n\nMr. President, it should never have to be this way. I remember  Columbine as if it were yesterday. I was in the Houston Airport coming  home from a work trip when I saw our Colorado high school flashing on  the screens of every single television set in the terminal. It filled  me, as it did…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, yes, that is me in 1977. I was a  young law student representing Texas at the historic International  Women's Year conference in Houston.\n\nAnn Richards was right behind me. She was getting ready to make a  speech on the ERA. She would go on to be Governor, and I went on to  serve in the city, county, State,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…he attempted to return  home.\n\nWilmer Chavarria is a community leader. He is a school superintendent  in my State. He was held and interrogated for hours yesterday in the  Houston airport by CBP agents and given no reason for his detainment.  Wilmer called this experience psychological terror.\n\nAgain, we are talking about a U.S. citizen here. When we…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694000/cbp-turns-houston-airport-into-trap"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, Saturday was a great day for progress in  Texas, from Houston to Fort Worth. For almost a year after the tragic  death of our late colleague, Sylvester Turner, the citizens of the 18th  Congressional District of Texas in Houston have…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Congressional Patriot Award. Trinka has dedicated herself to faithfully  serving our community.\n\nA sixth-generation Texan, Trinka was born in Dallas, Texas, and grew  up in Houston. She attended Rice University before transferring to the  prestigious Cornell University, where she earned her bachelor's degree  in architecture. Her passion for architectural…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Mr. President, Jocelyn Nungaray was a 12-year-old girl  who was sexually assaulted and murdered just north of Houston last  June. The two suspects who committed this ghastly crime were illegal  immigrants who never should have been in our country in the first  place.\n\nTo commemorate Jocelyn's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691123/jocelyn-nungaray-national-wildlife-refuge"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Thomson Reuters; Oliver, Ashley:       Washington Examiner; Omeokwe-Davis, Amarachukwu: Bloomberg       News; O'Reilly, Eileen: Axios; Orol, Ronald: Daily Deal.\n\nOsborne, James: Houston Chronicle; Oshima, Takashi: Asahi       Shimbun; Oswald, Rachel: CQ Roll Call; Ott, Matthew:       Associated Press; Ouchi, Kiyoshi: Sankei Shimbun; Overberg,       Paul:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…distinguished Brevard County resident and Army veteran, Lyndsay Gray.\n\nEnlisting in 2006, Ms. Gray served over a decade as a radiology  technologist.\n\nAfter training at Fort Sam Houston and Fort Leonard Wood, she was  stationed at Walter Reed, where she led the mammography department and  was selected as a cadre for the Combat Medical Badge course.\n\nShe later…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691773/recognizing-lyndsay-gray"}, {"senator": "John Rose", "party": "Republican", "sentence": "…financial program manager for the U.S. Army,       Installation Management Command--G9 (Morale, Welfare and       Recreation) Child and Youth Services (CYS) at Fort Sam       Houston. In or around December 2016 through at least August       29, 2023, Mello formed a business she called Child Health and       Youth Lifelong Development (CHYLD). The sole…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…brought a gun, zip ties, and body armor,  was pardoned by Donald Trump.\n\nNot only that, they have gone after their pardons, and they haven't  stopped the criminal spree.\n\nA Houston man was pardoned by Trump and then arrested on sex charges.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Mechatronics Team  3133, the Alexandria Area High School's robotics team, on winning the  Impact Award.\n\nThis prestigious award will send the team to the world championship  in Houston, Texas. This is their third Impact Award, and it is clear  why. The team is extremely dedicated, having offered hours of their  time in the summer to work with elementary…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689758/congratulating-alexandria-high-school-robotics-team"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…people.\n\nDr. Yancey Cook Arrington is an eighth-generation Texan who, for over  25 years, has served as the teaching pastor at Clear Creek Community  Church in the bay area of Houston.\n\nHe is joined today in the Chamber gallery by his lovely wife,  Jennefer. They are proud parents of my three nephews, Thatcher, Haddon,  and Beckett.\n\nMr. Speaker, I am eternally…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697518/welcoming-dr-yancey-c-arrington"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Bronson, Joyce Button, JoAnn Compton Taplin, James Dahl, Chad       Davenport, Thomas Davis, David Ford, Jerry Fraley, Thomas       Garland, Larry Grow, Eldon Hendrix, Orville Houston, John       James, William Kendrick, William Koreger, Walter Lindner,       James Little, Kenneth Montgomery, Dennis Paul, Richard       Seehawer, Patrick Smith, Gelacio Valdez,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…CAMMACK. Mr. Speaker, I rise today to recognize the 2025 men's  basketball NCAA national champions, the Florida Gators.\n\nOn Monday night, the Gators defeated the University of Houston in the  national championship game to become the three-time national champions,  winning the first title since the 2006-2007 season.\n\nLed by Coach Todd Golden, the Gators…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690032/recognizing-the-florida-gators"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…little crazy.\n\nEvery week when I do these, I try to come here with something that is  optimistic. A few years ago, I got behind this microphone and talked  about a University of Houston drug that basically takes fentanyl in  your system--and I am sure I am describing it partially wrong, but I am  doing my best--and attaches a protein to it, and, therefore,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Nowhere can this be seen more clearly than comparing the socialist  utopia of California with the free State of Texas.\n\nLast year, more housing permits were granted in the Houston and  Dallas metropolitan areas than in all of Gavin Newsom's California. The  median price of a home in Texas is $345,000. In California, it is  $900,000.\n\nTake healthcare.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…that, with this rescissions package, the first of its kind in 25 years,  we are taking one small step to cut wasteful spending but one giant  leap toward fiscal sanity. Yet, Houston, we have a problem. We are  still $37 trillion in debt. This year alone, we will run a $1.7  trillion deficit. With this small step today, let's commit to the giant  leap.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693715/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…contributor to the  SWOSU general scholarship fund, ensuring that future pharmacists have  the essential resources to succeed. He is also an adjunct professor at  the University of Houston College of Pharmacy and an active member of  its Mading Society of benefactors. He remains a dedicated advocate for  the advancement of pharmacy, continuously supporting the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…His  exceptional military career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American service.\n\nMaster Sergeant King is a native of Houston, Texas, who answered the  call to serve his country in February of 1994 at the young age of 18.  He completed basic training at Fort Jackson, South Carolina, followed  by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}]