[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…come down.\n\nAs chair of the New Democrat Coalition's Affordable Housing Task  Force, I helped develop a housing action plan with more than 20  recommendations to increase housing supply, reform zoning and  permitting, strengthen Federal incentives, grow the construction  workforce, and improve transparency.\n\nMr. Speaker, housing is the foundation of opportunity.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…crisis, though, lies right in our backyards.  The solution has many names: granny flats, backyard cottages, or  accessory dwelling units, but all expand our affordable housing supply.\n\nWhen I was mayor of San Jose, we made building backyard apartments  easier by enabling thousands of homeowners to be able to get their  permits online in a single day.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693705/america-faces-a-housing-crisis"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…how hard it is to find affordable housing.\n\nOregon ranks 45th in the Nation in housing affordability, and it is  getting worse. Our population has grown faster than our housing supply,  driving costs up for buyers and renters.\n\nI refuse to leave Oregonian families hanging. That is why I am  fighting on the Financial Services Committee to make a difference.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688671/make-housing-affordable"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…for the  21st Century Act would streamline regulations, expand affordable  housing financing, and modernize Federal housing programs to  significantly expand the Nation's housing supply. Passage of this bill  would be historic not because it is extraordinary but because it is  overdue.\n\nFor decades, chronic underbuilding in the United States has driven…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699796/housing-for-the-21st-century-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…771,000 people  experiencing homelessness on any given night in this country.\n\nRents and home prices are surging, and families are being priced out  of their communities. Housing supply is not keeping up with demand. As  a result, more and more families are pushed out onto the streets or  forced to choose between paying rent or buying groceries.\n\nAcross…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…vulnerable, such as youth aging out of our Nation's foster care system,  while promoting affordability through flexible, locally driven programs  that allow communities to expand housing supply without the  micromanagement of the Federal Government.\n\nIt does all these things while saving millions of hard-earned  American taxpayer dollars.\n\nI thank my subcommittee…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Contents.--The table of contents for this Act       is as follows:  Sec. 1. Short title; table of contents.               TITLE I--BUILDING SMARTER FOR THE 21ST CENTURY  Sec. 101. Housing Supply Frameworks. Sec. 102. Accelerating home building grant program. Sec. 103. Federal guidelines for point-access block buildings. Sec. 104. Unlocking Housing Supply Through…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…housing more expensive in the first place.\n\nIt encourages zoning reform the right way. It respects local control  and gives communities tools and flexibility to expand housing supply,  rather than forcing one-size-fits-all mandates from Washington.\n\nIt expands opportunities for rural housing developments by ensuring  rural communities aren't left behind…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…legislation rejects the left's obsession with  central planning and embraces free enterprise, local control, and  common sense. It puts builders back to work and expands housing supply,  and it helps bring costs down for hardworking Americans.\n\nThat is why I urge my colleagues to support Housing for the 21st  Century Act, deliver real America First solutions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…restoring the American Dream of homeownership by  bringing down housing costs and cutting red tape. Our HUD programs play  a critical role in increasing the affordable housing supply and access  nationwide.\n\nHowever, the success of HUD's programs relies on the Department's  ability to root out fraud, waste, and abuse. The HUD Transparency Act  aids…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…legislation will lower housing costs for millions of Americans,  including tens of thousands of Tennessee families whom I represent.\n\nI am proud that my bipartisan bill, the Housing Supply Expansion Act  of 2025, was included in the Housing for the 21st Century Act. My bill  removes an outdated Federal chassis requirement that has stifled  manufactured housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…hard to bring  forth a bipartisan housing bill that addresses housing affordability.  The Housing for the 21st Century Act cuts costs, slashes red tape, and  will increase housing supply.\n\nThere is no question that the legislation before us is a historic  rewriting of our housing laws to bring our housing market into the 21st  century.\n\nAccording to the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Big Beautiful Bill Act, which this House passed last month,  includes a key provision that expands tax credits to incentivize the  building of more workforce housing. While increasing housing supply has  no silver bullets, expanding the low-income housing tax credit is a  major step in the right direction.\n\nAccording to the National Association of Realtors,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…facilitate these changes as opposed to more bureaucracy or rules that  stand in the way of American talent and ingenuity. By embracing these  reforms, we can help grow the housing supply, expand opportunity, and  unlock the American Dream for millions of Americans.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}]