[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…distressed urban,  rural, and tribal communities. CDFIs leverage capital from the CDFI  Fund to catalyze investment in the Twin Cities that grows our small  businesses, develops housing units, increases access to financial  services, and creates jobs. Over the past year, President Trump has  proposed eliminating the CDFI Fund, has fired CDFI Fund staff, and…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Colorado.\n\nFirst created in the fall of 1975, Foothills Regional Housing has  worked to meet the growing housing needs of Jefferson County by  preserving existing affordable housing units and developing new ones.  In addition to supporting low-income renters by administering over  1,800 vouchers through the Department of Housing and Urban Development,  FRH…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…leading efforts to address homelessness, advancing mental health  initiatives and promoting sustainable transportation. His  administration created over  3,800 affordable housing units and acquired 1,400 supportive housing  units through the Health Through Housing program. Dow supported the  creation of the King County Immigrant and Refugee Commission…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "French Hill", "party": "Republican", "sentence": "…identifies the number of permits issued by the eligible       entity for housing development using designs from such       pattern book; and\n\n(4) identifies the number of housing units produced in       developments of the eligible entity using a design from such       pattern book.\n\n(f) Availability of Information.--The Secretary shall--\n\n(1) to the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…the largest  expansion ever of affordable housing tax credits. Our reforms to the  low-income housing tax credit are predicted to create 1.2 million  additional affordable housing units over the next decade, helping  millions more Americans access the high-quality affordable housing they  deserve. We have also passed legislation like the SPEED Act, clearing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…these to, but the  requirements are not stringent. Some people point out that they can  almost take people at random in the street, and that would be enough to  fill their housing units. It really doesn't do a lot to help the so- called low-income people.\n\nIt does help, however, because the government is giving so much  money, it does encourage developers…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Department of Veterans Affairs to create Victory I Apartments, a  community built on part of the former St. Joseph Hospital site. It  provides 90 permanent, supportive housing units for formerly homeless  veterans. This project was more than a renovation. It was the creation  of a lifeline for men and women who once protected our Nation but  returned…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…for veterans' medical care and  $262.1 billion for mandatory veterans' benefits.\n\nIn addition, we are delivering $19.8 billion to support military  construction and family housing units, which are important to both  readiness and morale. Our bill will give the Department of Defense the  resources it needs to project power globally, enhance our warfighting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}]