[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Republican majority chooses to spend the American people's money on tax  breaks for billionaires instead of spending it on our kids, and instead  of spending it on childcare, housing, healthcare, on things that really  make people's lives far more affordable.\n\nWhat is the worker getting in return in this situation? It is just  the opportunity to work. I think…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…to do. That is what we worked to do in  the National Defense Authorization Act. We worked in good faith to find  common cause on cracking down on the high costs from housing to  healthcare that are crushing our servicemembers and military families  and to crack down equally on Pentagon waste, fraud, and abuse.\n\nMs. GOODLANDER. Madam Chair, we worked in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695157/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…corporations and the  most wealthy amongst us and cronies of the President's, and to do  nothing in the process to lower the cost of living, to help families  afford housing or healthcare, or to secure a future for our children.\n\nMs. HOULAHAN. Mr. Speaker, I am struck by the fact that we are at a  place where we have maligned others in the past for brutish…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…2026. This budget is only  skinny on the cuts that it would cut for the American people, $163  billion for vital programs that serve our communities, Tribal programs,  housing, healthcare, opioid reduction, and addiction recovery programs.\n\nThis is on top of the catastrophic attacks of DOGE on veterans,  teachers, Social Security, and vital programs,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690663/skinny-budget-for-2026"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…like the  rest of us, and two, it will generate trillions of dollars that will be  invested back in the American people. There will be trillions to help  people with housing, healthcare, and education. It will help us pay  down the debt. It will fix nearly everything that is broken in this  country.\n\nThe economy belongs to all of us, not just the superwealthy.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…chain saw to Social Security, but no. Today, the  Republicans don't even want to address the real challenges facing our  neighbors, helping them with the cost of living, housing, healthcare,  and electric bills. This bill will simply make matters worse.\n\nThese DOE standards are long overdue. It has been, I think, at least  6 or 7 years since they have had…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…by awards and titles, but by  the lasting impact of his work. He forged partnerships between unions  and civic groups and strengthened the role of labor in addressing  housing, healthcare, and education challenges. Additionally, he led  efforts to remove systemic barriers to union jobs for communities of  color and championed a public education campaign…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…least secure. Across the nation, this damage is in  addition to his erratic  and senseless tariffs and the dramatic reductions or eliminations of  essential supports for housing, healthcare, food, and education and so  much more. These policies threaten the livelihoods of individuals and  our nation's economy--all so the obscenely wealthy grow more secure…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…long, and as these  corporations consolidate more power, the rich get richer, and everyone  else is just struggling to get by just on the basics. They need  groceries, housing, healthcare, basic medications.\n\nPrivate insurance companies are now buying up your local healthcare  clinics and doctors' offices. In my home State of Washington, a handful  of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Ms. RANDALL. Mr. Chair, I was going to say some nice things about  rising in support of a bipartisan NDAA that supports housing,  healthcare, and childcare, but I have sat here appalled at the language  that we have heard on the House floor from the other side of the aisle.\n\nI stand in strong opposition to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695249/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Minnesota, fear has become a policy  for ICE and CBP, and cruelty has become their strategy. They take money  that is taxpayer money that could be used for affordable housing,  healthcare, and bringing down the cost of living, and they are spending  it to terrorize our communities.\n\nFollowing the Constitution, respecting the First, Fourth, and 14th  Amendments…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…PFAS remediation efforts at military installations.\n\nThe T-HUD bill includes $295 million for Lead Hazard Reduction and  Healthy Homes grants.\n\nMore generally, we know housing is healthcare. This bill provides $74  billion in discretionary spending for housing programs.\n\nMr. Chair, I urge my colleagues to join me in supporting this  package, and I thank…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…promise in its Social Security program.\n\nThe second big issue that people raised was the cost of living and  lowering costs. Families feel it everywhere: gas, groceries, housing,  healthcare. It just costs too much to live.\n\nPeople are working just as hard as they always have, but they are  falling behind. That is why I have been fighting to extend the ACA's…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…spectacularly, and the American people know it.\n\nThey have now had 12 months, a full year to do something, anything,  to bring down prices, to lower costs, and to focus on housing,  healthcare, food prices, or transportation. That is what I hear about  when I talk to people back home. They want the government to focus on  housing costs, healthcare, childcare,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…immigrants, amounting to as high as 20  million people who illegally crossed into our country during Biden's  term in office.\n\nTaxpayer-funded awards paid for illegal aliens' housing, healthcare,  education, even music lessons, therapy. You name it, the taxpayer  covered it.\n\nUsing NGOs as a proxy, the Biden administration sent a clear message  that our laws…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…firsthand the horrible effects, the dangerous effects, and the  lasting effects that weak borders have had on our wonderful country. Of  course, there are pressures on housing, healthcare, and education  wherever there are millions and millions of illegal aliens allowed to  come into the country and then placed throughout our country.\n\nOf equal, if not…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…and accelerates the delivery of Next Generation  aircraft and autonomous systems.\n\nJust as important, it puts our troops first, with $8.5 billion to  improve barracks, housing, healthcare, childcare, and career support  for military families.\n\nAt a time when global threats are growing, this bill ensures America  leads from a position of strength, not…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…70 new apartments for veterans and partnered with the VA to  deliver a new community-based outpatient clinic for Lincoln's veteran  population. Victory Park combines housing, healthcare, and supportive  services in one location, a community that restores independence,  connection, and pride for those who once served our Nation.\n\nThrough efforts like…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…is nearly $150 billion to secure the border and  deport criminal illegal aliens. We are restoring order at the border  and restocking our military.  We increase pay, housing, and healthcare for our servicemembers. We  rebuild our naval fleet, modernize our air traffic control system, and  restock the munitions America needs to defend itself.\n\nFinally,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…is available whether seniors take the standard  deduction or itemize. It will benefit millions of Americans on fixed  incomes, providing meaningful relief as costs for housing, healthcare,  prescriptions, and groceries continue to rise.\n\nBut our work is not done, Mr. Speaker. To many seniors, they still  see their Social Security benefits taxed. That…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…solve this market. When they do, you can expect the same  high prices and decline in quality that they have already delivered in  every field that they have solved, from housing to healthcare.\n\nIt comes down to four simple words: Freedom works. Socialism sucks.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}]