[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "We owe it to the survivors who need counseling and stable housing to  help them sleep through the night again.", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "That  is, again, why the homebuilders are warning us at this time of a  housing crisis.", "title": "Cost of Living Still High", "date": "2025-03-31"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "This includes housing, groceries,  healthcare, and more.", "title": "Delivering for the American People", "date": null}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "Democrats are ready to  work with anyone to make housing more affordable, to make childcare  more affordable, and to make everyday goods like groceries less  expensive.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Instead, even small financial conditions for  pretrial release often force poor defendants to remain in jail, which  can cost them their jobs and housing and leads to more convictions and  longer sentences.", "title": "District of Columbia Cash Bail Reform Act of 2025", "date": "2025-11-19"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Madam Speaker, why is our focus on this when what I am hearing from  constituents is that Republicans are falling short in addressing the  cost of groceries, healthcare, and housing?", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Speaker, I hear from everyone I talk to, from my constituents to  my kids, about how hard it is to find affordable housing.", "title": "Make Housing Affordable", "date": "2025-03-06"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "As Chief Program Officer of the Ibero-American Action League, Lucia  leads with vision and determination, overseeing vital health  initiatives that strengthen families across the region by addressing  social determinants such as access to care, nutrition, and housing.", "title": "Recognizing Lucia Colindres", "date": null}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "On top of that, FEMA approved over $150 million in housing and other  emergency assistance.", "title": "Marking Anniversary of Los Angeles Fire", "date": "2026-01-07"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "In the coming weeks and  months, Democrats will lay out cleanly and comprehensively how we can  lower costs for the American people on a number of different topics-- from health to housing, to groceries, to childcare, to energy costs,  and beyond.", "title": "Cost of Living", "date": "2026-01-05"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "The cost of everything from groceries to housing  continues to rise.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Formerly the Robin Hotel, MACV has  transformed the century-old property into 14 units of safe, stable  housing for Veterans working to rebuild their lives.", "title": "Recognizing the Minnesota Assistance Council for Veterans", "date": null}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "I am working to take the $75  billion that Republicans gave to ICE in the big, bad bill and invest  the money where it belongs, which is in expanded healthcare and  affordable housing.", "title": "Holding Ice Accountable", "date": "2026-02-10"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "Families in the United States are paying more for  groceries, cars, housing, utilities, the basic necessities.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "In her role as a Constituent Advocate, Kathryn handled a wide range  of complex and often deeply personal issues, including IRS cases,  housing matters, student loan concerns, and many other challenges faced  by families across the district.", "title": "Recognizing the Service of Kathryn Angell", "date": "2026-02-11"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Bill has served on the Cameron Housing Board, as member and director,  and currently serves on the Board of Directors for the North Milam  Water Supply District and served as a city councilman for years.", "title": "Recognizing William ``bill'' Forest Harris with A Congressional Veteran Commendation", "date": "2025-10-21"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(f) Definitions.--In this section:\n\n(1) Appropriate congressional committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Foreign Affairs of the House of       Representatives; and\n\n(B) the Committee on Banking, Housing, and Urban Affairs of       the Senate.", "title": "Undersea Cable Control Act", "date": null}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "5184) to       prohibit the Secretary of Energy from enforcing energy       efficiency standards applicable to manufactured housing, and       for other purposes.", "title": "Providing for Consideration of H.R. Saving Homeowners From Overregulation with Exceptional Rinsing Act; Providing for Consideration of H.R. Affordable Housing Over Mandating Efficiency Standards Act; and Providing for Consideration of H.R. Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-07"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "(b) Transmission of Report.--The Secretary of the Treasury       shall transmit the report required under subsection (a) to       the Committees on Financial Services and Foreign Affairs of       the House of Representatives, the Committees on Banking,       Housing, and Urban Affairs and Foreign Relations of the       Senate, and to the United States representatives at relevant       international organizations, as appropriate.", "title": "China Financial Threat Mitigation Act of 2025", "date": "2025-07-23"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "6644, the Housing  for the 21st Century Act.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "``(II) Consultation on omitting materials.--If a Federal       banking agency determines particular materials described       under subclause (I) should not be published, the Federal       banking agency shall consult with the chair and ranking       member of the Committee on Financial Services of the House of       Representatives and the chair and ranking member of the       Committee on Banking, Housing, and Urban Affairs of the       Senate.", "title": "Systemic Risk Authority Transparency Act", "date": "2025-12-01"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Right now there is a provision in the tax code called low-income  housing tax credits, and what it means is that if a developer wants to  build a new development, they would get a credit equal to 10 percent of  the cost of the building over 9 years, which, right off the bat, sounds  like the government is paying for 90 percent of the value of the  building.", "title": "Big, Beautiful Bill", "date": "2025-05-08"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "287.699       1,113.882       2,104.071 Banking, Housing and Urban Affairs     Budget Authority............................................", "title": "Fiscal Year 2025 Enforcement Filing", "date": "2025-05-21"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Also while I was at home, I ran into somebody who is in a low-income  housing unit that receives the low-income housing tax credits.", "title": "Events in Milwaukee", "date": "2025-07-14"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "His tariffs are raising the costs of housing.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy- Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''; Providing for Consideration of H.J. Res. Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; the `omnibus' Low NoX Regulation; Waiver of Preemption; Notice of Decision''; and for Other Purposes", "date": "2025-04-29"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "It devotes funding to improve quality of life, including childcare  and housing resources for military families who help carry the weight  of their loved one's service.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "Well, among other things, they do a lot,  including a whole lot of them in spending on ``woke, wasteful, and  unjustified'' spending: for recipients to fund housing and legal aid  for illegal aliens; puberty blockers for kids; building EV charging  stations, part of the ``green new scam''; subsidize California's  disaster rail system; fund infrastructure and renovation projects at  the wealthy Met Museum and the Michigan AFL-CIO; a dance festival in  Massachusetts; DEI initiatives.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-01-30"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Currently, too many of our veterans struggle with the difficulties of  transitioning back into civilian life and far too many continue to face  homelessness or housing instability.", "title": "Recognizing Essential Legislation That Supports Our Nation's Veterans", "date": "2025-03-10"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Post-storm,  the team was responsible for helping shelter residents whose homes were  no longer safe, find appropriate alternatives for housing.", "title": "Recognizing Rebecca Seils", "date": "2025-06-04"}]