[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, I rise today to wish everyone a  joyful and proud Pride Month.\n\nIn Houston, pride runs deep. We hosted one of the first nighttime  parades in the country, and today it is the fourth largest in the  Nation. It is not just a parade.\n\nGroups like Fundacion…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692139/happy-pride-month"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…What this administration is  doing with ICE is not enforcement. It is lawlessness. It is cruelty.  They have turned ICE into a force of masked thugs. In my community in  the Houston area, people are paying the price.\n\nLuis Gustavo Nunez Caceres died in ICE custody near Houston. DHS  claims it was heart failure, but this administration has shown such…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699665/horrific-ice-abuses"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Districts constitute unconstitutional racial       gerrymanders, under the logic and reasoning of Petteway.       Specifically, the record indicates that TX-09 and TX-18 sort       Houston voters along strict racial lines to create two       coalition seats, while creating TX-29, a majority Hispanic       district. Additionally, TX-33 is another racially-based…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…However, Republicans never come here to talk about poverty or hunger  or the sick. It is always about tax cuts, the rich, and the  billionaires.\n\nTonight I rise for one of the Houston families they are attempting to  hurt.\n\nLuisa and Roberto are seniors in my district. They have worked their  whole lives, and now they are afraid. They are afraid of what…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691445/snap-and-medicaid"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…research institutions. This  funding supports critical work at UT Southwestern in Dallas, where  scientists are pioneering new cancer treatments; at Baylor College of  Medicine in Houston, where researchers are leading the fight against  Alzheimer's and heart disease; and at the University of Texas at Austin  and Texas A&M, where cutting-edge biomedical research…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…they have no tree canopy. There is       this great program to try to build sidewalks, put in trees,       and address some of these challenges that--it gets real hot       in Houston, and this is a really important program. But I       know the funds for that have been revoked.\n\nAnd so is the statement that this won't do anything to       those, but there…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Governor to do this. The Governor  got with the attorney general. The two of them worked it out such that  seats were taken in Texas.\n\nI am just going to focus on one of them. In Houston, Texas, we had  the 18th Congressional District, historic as it is called quite often-- and I concur with the persons who would call it such; the historic 18th  Congressional…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…hails from Chicago,       Illinois, and is the Founder & Senior Pastor of the       Reflections of Christ's Kingdom World Outreach International       (R.O.C.K.) church in Houston, Texas, serving ministry for 40       years full-time through Executive and Pastoral leadership       roles; and\n\nWhereas, Apostle Dr. Dana Carson is a testament to…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…sometimes? They get down there; they go  through another screening; and the Federal agents say: OK. Sorry about  that. We made a mistake. And they just dump them on the streets of  Houston or wherever they may be.\n\nNo documents, no identification--how are they going to even get home?  That is happening in this country right now. And if they are not  released,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Ebenezer  Baptist Church (EBC) in Northern Virginia, was born on September 19,  1953, in South Carolina. Her family moved to Virginia, where Reverend  Carr attended Charles Houston Elementary and Parker Gray High School  and joined Ebenezer Baptist Church. It was at Ebenezer that Reverend  Carr was first baptized as a child by Reverend A.A. Booker, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…example  of how to respond to one of these terrible situations.\n\nMr. President, it should never have to be this way. I remember  Columbine as if it were yesterday. I was in the Houston Airport coming  home from a work trip when I saw our Colorado high school flashing on  the screens of every single television set in the terminal. It filled  me, as it did…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "Ms. GARCIA of Texas. Mr. Speaker, yes, that is me in 1977. I was a  young law student representing Texas at the historic International  Women's Year conference in Houston.\n\nAnn Richards was right behind me. She was getting ready to make a  speech on the ERA. She would go on to be Governor, and I went on to  serve in the city, county, State,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…he attempted to return  home.\n\nWilmer Chavarria is a community leader. He is a school superintendent  in my State. He was held and interrogated for hours yesterday in the  Houston airport by CBP agents and given no reason for his detainment.  Wilmer called this experience psychological terror.\n\nAgain, we are talking about a U.S. citizen here. When we…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694000/cbp-turns-houston-airport-into-trap"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, Saturday was a great day for progress in  Texas, from Houston to Fort Worth. For almost a year after the tragic  death of our late colleague, Sylvester Turner, the citizens of the 18th  Congressional District of Texas in Houston have…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, I rise today to recognize Mr. Dan  Houston on the occasion of his retirement and to honor his more than 40  years of service at Principal Financial Group. From his first role in  the retirement division to serving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…people.\n\nDr. Yancey Cook Arrington is an eighth-generation Texan who, for over  25 years, has served as the teaching pastor at Clear Creek Community  Church in the bay area of Houston.\n\nHe is joined today in the Chamber gallery by his lovely wife,  Jennefer. They are proud parents of my three nephews, Thatcher, Haddon,  and Beckett.\n\nMr. Speaker, I am eternally…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697518/welcoming-dr-yancey-c-arrington"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today to recognize President Alisa  White of Sam Houston State University for her dedication, devotion and  leadership in service to Sam Houston State University, its students and  all Texans. Like Sam Houston himself, Dr. White…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…brought a gun, zip ties, and body armor,  was pardoned by Donald Trump.\n\nNot only that, they have gone after their pardons, and they haven't  stopped the criminal spree.\n\nA Houston man was pardoned by Trump and then arrested on sex charges.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…financial program manager for the U.S. Army,       Installation Management Command--G9 (Morale, Welfare and       Recreation) Child and Youth Services (CYS) at Fort Sam       Houston. In or around December 2016 through at least August       29, 2023, Mello formed a business she called Child Health and       Youth Lifelong Development (CHYLD). The sole…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…they are the foundation of opportunity for countless  Texans.\n\nHis impact on the community spans beyond Lamar State College. Johnson  began his career as an officer in the Houston Police Department, where  he served in a variety of patrol and administrative positions before  retiring from a 20-year law enforcement career.\n\nDr. Johnson's leadership has…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…opportunity to engage directly with cutting-edge technologies and  robotics shaping our future.\n\nMost recently, Rebel Robotics stood out at the FIRST Championship  held this year in Houston, Texas. Competing against top teams from  across the country, they earned the prestigious Inspire Award, which  recognizes excellence in programming, robot design, engineering…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…join NASA's next  astronaut program. That is rarefied air by any measure.\n\nOver the next 2 years, Yuri and an elite cohort will train at NASA  Johnson Space Center down in Houston as they prepare for missions to  the International Space Station, the Moon, and whatever comes next.  Yuri reflects the kind of scientific talent that Indiana grows.\n\nPurdue,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697430/recognizing-future-astronaut-yuri-kubo"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and have no intention of  assimilating into it.\n\nA new Muslim community in Texas, not even a few days old, with a  150,000-square-foot Muslim community center, was opened in Houston,  called EPIC City. It is in Plano, outside of Dallas-Fort Worth and it  has raised all sorts of questions about their intentions to create an  effectively Muslim-only community…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…CAMMACK. Mr. Speaker, I rise today to recognize the 2025 men's  basketball NCAA national champions, the Florida Gators.\n\nOn Monday night, the Gators defeated the University of Houston in the  national championship game to become the three-time national champions,  winning the first title since the 2006-2007 season.\n\nLed by Coach Todd Golden, the Gators…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690032/recognizing-the-florida-gators"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Bronson, Joyce Button, JoAnn Compton Taplin, James Dahl, Chad       Davenport, Thomas Davis, David Ford, Jerry Fraley, Thomas       Garland, Larry Grow, Eldon Hendrix, Orville Houston, John       James, William Kendrick, William Koreger, Walter Lindner,       James Little, Kenneth Montgomery, Dennis Paul, Richard       Seehawer, Patrick Smith, Gelacio Valdez,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Nowhere can this be seen more clearly than comparing the socialist  utopia of California with the free State of Texas.\n\nLast year, more housing permits were granted in the Houston and  Dallas metropolitan areas than in all of Gavin Newsom's California. The  median price of a home in Texas is $345,000. In California, it is  $900,000.\n\nTake healthcare.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…that, with this rescissions package, the first of its kind in 25 years,  we are taking one small step to cut wasteful spending but one giant  leap toward fiscal sanity. Yet, Houston, we have a problem. We are  still $37 trillion in debt. This year alone, we will run a $1.7  trillion deficit. With this small step today, let's commit to the giant  leap.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693715/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…contributor to the  SWOSU general scholarship fund, ensuring that future pharmacists have  the essential resources to succeed. He is also an adjunct professor at  the University of Houston College of Pharmacy and an active member of  its Mading Society of benefactors. He remains a dedicated advocate for  the advancement of pharmacy, continuously supporting the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I rise today to congratulate my friend and  fellow Iowan, Dan Houston, on his retirement from Principal Financial  Group after 41 years of service.\n\nFrom starting his first job with Principal in 1984 to eventually  becoming chairman, president,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}]