[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…just 2 days on  January 15. How many Americans like Eric or Nancy are being forced to  give up their health insurance this year? How many more will consider  selling their houses or their cars just to make sure that they can  afford sometimes lifesaving care?\n\nNow, on top of this, the Trump administration is pushing a rule to  kick even more families…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…incredible investment for jobs  today and for the future of our country.\n\nI am going to keep fighting for the families across my district who  need NASA satellites to know if their houses are going to be safe from  fires, for seniors who need medical advancements to live long and  healthy lives, and for red States and blue States that will be hit by  tornadoes…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…I am introducing the  Multigenerational Family Tax Credit Act. My bill gives  multigenerational families a tax credit for expenses that they incur  when they upgrade their houses to make them more accessible for their  aging parents who live with them. This includes upgrades like grab  rails in the shower, an additional bathroom or bedroom, or even…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…That is why I am  fighting on the Financial Services Committee to make a difference. I am  fighting to make it easier to buy or rent a home, and I am fighting to  build more houses and increase our supply.\n\nMr. Speaker, I will always fight to lower costs and make life just a  little bit easier for Oregonians.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688671/make-housing-affordable"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…It didn't just happen  on accident. There are villains here. Corporate power and corruption  have been eating away at the American Dream.\n\nHedge funds, speculators buying up houses, jacking up the cost of  that housing are becoming lousy landlords, pricing people out of what  could be a nest egg for their retirement, their home.\n\nMonopolies are jacking…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…continue. They had to agree to allow  campus police to arrest protesters. They had to essentially agree to  receivership, Federal receivership, over an academic department  that houses professors who are critical of Trump and his policies.  Effectively, the President of the United States got to pick the person  who will oversee the Columbia Department of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…friends say,  because of this budget, more kids will go without food. More kids will  be malnourished. Because of this budget, parents and grandparents will  have to sell their houses to afford medical care. Because of this  budget, more consumers will get ripped off. Because of this budget, our  air and water will have more toxic chemicals. That is the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Forest Service brings out of  those national forests, mill those, turn it into cross-laminated  timber, mass produce walls, roofs, and the building materials you need  to build houses quickly and cheaply.\n\nYou can do rezoning, permitting for land to use for housing, and then  you can build houses quickly, starter houses, houses to just help young  people…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…At age 69, she traveled to the Mosquito  Coast of Honduras on a human rights observation mission. She took her  mission on headfirst and investigated bullet holes in boats, houses  that had burned down, and wounded villagers with her international  activist group, the Cross Border Network. Alice never stopped looking  for a way to improve the lives of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…should be anonymous,  without a first name, a last name, and a shield number. We want to  mandate body cameras with strong protocols; protect sensitive  locations, including houses of worship, schools, and hospitals; and  restrict the use of deadly force.\n\nWe also want to enforce humanitarian standards in ICE and CBP  custody, ban military-grade equipment,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Act (CRA)\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and the       Comptroller General for review before the rule can take       effect. 5 U.S.C. Sec. 801(a)(1)(A). The report must contain a       copy of the rule,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Salvador until another determination was  made. Not only did they send him to El Salvador in violation of that  order, they sent him to one of the worst jails in the world, which  houses MS-13, which is the exact group that that judge said he was  supposed to be kept away from. That is where they sent him.\n\nThe Supreme Court said: You need to facilitate his…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…were fired work every day to uphold, is  enhancing the health and well-being of all Americans. These mass  firings are a direct affront to that mission.\n\nThe building that houses the Department of Health and Human Services  is named for Minnesota's ``Happy Warrior,'' Vice President Hubert  Humphrey. It has been that way through Democrat and Republican…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…our own terms.\n\nWe are the best people to make those decisions for ourselves. Mr.  Speaker, there are a lot of brilliant minds here in this legislative  Chamber and in State houses and in courts all across the country, but  women do not need them to be in our most intimate decisionmaking  moments. As a Representative of Ohio's 13th Congressional District,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and to the       Comptroller General for review before a rule can take effect.       The report must contain a copy of the rule, ``a concise       general statement…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…hallowed halls of Congress--just ask her about the Senate  chandelier.\n\nLeveraging her naturally spirited personality and proven expertise as  a Parliamentary Intern in the Houses of the Oireachtas, Ireland, and  clerk in the Iowa House of Representatives, Nicole remains successful  in bringing people together to accomplish great things.\n\nMost importantly,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…clothing, and household necessities-- empowering individuals and families to start over after experiencing  homelessness, crisis, or hardship. These efforts help transform empty  houses into warm, livable homes filled with hope. They also provide  essential supplies for those currently experiencing homelessness,  including tents, food, and ongoing support,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…with the Omaha through their Chief, Big Elk,  who welcomed the pioneers, understanding the trouble they had recently  escaped. The pioneers would stay in residence, building houses,  planting gardens and fields, and then move on after 2 years to ensure  all of their number had enough time and resources to make the trip  West. Afterwards, the improvements…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…cities should not be reserved only  for those who can afford luxury units. They should be accessible to all  working Americans who  keep our cities running and keep them safe. Houses shouldn't be limited  to those who have a lifetime of accumulated assets. They should be  available to young families and those just starting out who have  scraped and saved…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and to the       Comptroller General for review before a rule can take effect.       The report must contain a copy of the rule, ``a concise       general statement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and to the       Comptroller General for review before a rule can take       effect.\\25\\ The report must contain a copy of the rule, ``a       concise general statement…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and to the       Comptroller General for review before a rule can take       effect.\\17\\ The report must contain a copy of the rule, ``a       concise general statement…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…drunkenness, want of economy, imprudent and hasty  marriages--you don't hear that one anymore, but they  thought it was one of the top 10--lotteries, pawnbrokers, brothels,  gambling houses, and the most interesting one, the vice of charities  that gave away money too freely.\n\nWhen we return next week, let's remember the wisdom from the Society  for the Prevention…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693754/dont-give-away-charity-too-easily"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reconciliation where we are going to tell the markets that we will  start limiting the spending so we get lower interest rates and so we  can have more market growth. People can afford houses, all the input.  Instead, you have a government that for every dollar we spend, we have  to borrow another 43 cents. This is insane.\n\nI was going to try to walk through some…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…November, voters gave Republicans a mandate. President Trump  won the electoral vote, the popular vote, and every single swing State,  and Republicans won the majorities in both Houses--in the Senate and in  the House of Representatives. And passing the Big Beautiful Bill was an  important step in keeping our promises to the American people and  advancing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we always like to add that word ``equity,'' except no one has  gotten broadband.\n\nThe Tribal president of the Navajo Nation and a number of the  communities called chapter houses basically said screw this. I am not  willing to wait another 20 years. You know what they did, something  just crazy? Instead of being patient and waiting for us to spend…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…bank accounts for Canadian truck  drivers who were protesting COVID policies in Canada. It wasn't that  they were stacking SWAT teams or special operators outside the door of  houses. The one ring to rule them all, the massive amount of power, was  your access to your own money. You can't even buy groceries. You can't  pay rent. You have no means of payment.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…the Dalai Lama, and Archbishop Desmond Tutu.\n\nIn his previous visits to the United States, His All Holiness has had  visitations with five Presidents, he has spoken to both houses of  Congress and has been awarded the Congressional Gold Medal; the highest  award that civilian Congress can bestow. His next trip will maintain  that longstanding tradition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Review Act\n\nCRA, enacted in 1996 to strengthen congressional oversight       of agency rulemaking, requires federal agencies to submit a       report on each new rule to both houses of Congress and to the       Comptroller General for review before a rule can take effect.       The report must contain a copy of the rule, ``a concise       general statement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…40  years.\n\nUnder President Joe Biden, families paid more for everything, for  food, housing, transportation, and energy. It all exploded on their  watch when they ran three Houses of government.\n\nEnergy prices surged roughly 20 percent. In many parts of the  country, electricity rates rose 30 percent. Democrats didn't just miss  the problem. They caused…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]