[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…administration.\n\nThose are a few of the facts that were omitted from the Republicans'  resolution. The truth is, Governor Newsom, Mayor Bass, and House  Democrats, including my House Democratic Caucus colleagues from  California, have repeatedly supported the right to peacefully protest  and quickly condemned any acts of violence that have taken place.\n\nThis…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692962/republicans-are-putting-forward-a-resolution-that-targets-los-angeles"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…this for nutritional assistance.\n\nRepublicans turn their backs on making life affordable for our most  vulnerable in order to help billionaires afford another yacht.\n\nMy House Democratic Caucus freshmen colleagues and I are focused on  making life better for the American people and driving down grocery  prices, utility bills, rent and mortgage payments,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Members and the Coalition.\n\nWhile we will deeply miss her at New Dems, I am so proud and excited  to see her step into  a new opportunity with Chairman Pete Aguilar and the House Democratic  Caucus. I have no doubt Emma will bring the same compassion,  professionalism, and excellence to the House Democratic Caucus that  made her so effective with the New…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…women,  breast cancer research, the Rock & Roll Hall of Fame in Cleveland, and  the NASA Glenn Research Center, to name a few. Eventually, she moved  into the ranks of House Democratic leaders where she firmly stood as  vice chair of the Democratic Caucus.\n\nAs the first Arab-American woman, the first Syrian-American woman,  and the first Lebanese-American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…inflicted by this  reckless and cruel administration.\n\nIt was an all-hands-on-deck moment with roles for Congress, the  courts, and for we the people.\n\nOn February 10, House Democratic Party Minority Leader Hakeem  Jeffries formally established the Rapid Response Task Force and  Litigation Working Group, chaired by assistant leader   Joe Neguse and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…administration is taking action every single day against its own  people that are unconstitutional, un-American, and unconscionable.  People are talking about it everywhere. In our House Democratic Caucus,  we are talking about what we can do about it.\n\nThe only place where we are not talking about it is here in this  Chamber on the floor of the United States House…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699596/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the leadership and initiative to bring this forward. I  also thank my colleagues in the Congressional Black Caucus, as well,  for taking a stand on this issue and the House Democratic Caucus  overall.\n\nThis is the issue that we fought about with respect to the government  shutdown. This is the issue that has not gone away. I suppose the White  House…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…and cuts over 10 years, I get $200 billion a year.\n\nMadam Chair, I yield such time as she may consume to the gentlewoman  from Massachusetts (Ms. Clark), the whip of the House Democratic  Caucus.\n\nMr. BEYER. Madam Chair, to add to the distributional impacts, the top  5 percent pay 38 percent of the taxes, but they have more than 60  percent of the wealth.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…impact on the New Dems and the  values we fight for.\n\nWhile we will miss her leadership, I am excited to see Emma take on a  new role with Chairman Pete Aguilar and the House Democratic Caucus. I  know she will continue to serve with the same skill and dedication that  made her so effective with the New Dems.\n\nI thank Emma for her service, and I wish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695681/recognizing-the-service-of-emma-weir"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…paying tribute not only to a Michigan legend but an  American legend.\n\nWe recognized Mr. Dingell in so many ways. We recognized Mr. Dingell  in speeches on the House floor from the Democratic leadership under Ms.  Pelosi and Mr. Hoyer. If we remember him, even Mr. McCarthy gave some  nice words for Mr. Dingell. I was so surprised that a Member of the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Hoyer of Maryland, for co-anchoring this  Congressional Black Caucus Special Order hour.\n\nI rise tonight with my colleagues of the Congressional Black Caucus  and the House Democratic Caucus to reflect on the solemn anniversary of  the January 6 attack on the United States Capitol.\n\nThe deadly insurrection of January 6, 2021, was not merely an attack…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…of  Medicaid, would not be able to afford medical treatments for his  children.\n\nCutting Medicaid will be a disaster for families across the country.  I stand with my House Democratic Caucus colleagues in protecting it  from Republicans' cruel and extreme budget.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691409/gop-tax-scam-hurts-women-and-families"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the assistant Democratic leader,   Joe Neguse.\n\nKayla, I can say to you that your Congress Member is fighting hard to  protect you, just like every single member of the House Democratic  Caucus.\n\nAshley writes to us from Colorado and says: ``My life was saved by  the Affordable Care Act. Because of this act, I was able to stay on my  parents' health insurance…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…plan.  Just empty promises from an administration that has been dead set on  cutting public education to the kids who need it most.\n\nThe Congressional Black Caucus and House Democratic Members are  committed to continuing the work to make sure that these cuts do not go  unchallenged because if they were as good as the President and his  cohorts, Secretary…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Democrats  blocked it.\n\nThey are the party of ``no.'' And the bizarre part is no one is quite  sure why, until one of their leaders said the quiet part out loud. The  House Democratic whip acknowledged that Democrats are allowing people  to suffer because of the shutdown but said:\n\nThere will be families that are going to suffer . . . but       it is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…his Schumer shutdown.\n\nAnd for Democrats--I think they have wanted this. They planned for  it, and they wanted to see it happen, so they got it.\n\nNow, over on the House side, the Democratic whip made it very clear  during a recent interview--and I will quote her. She said:\n\nShutdowns are terrible, and of course there will be       families that are going…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…make those  changes, but they took the country in the wrong direction.\n\nThat is why the country, at the ballot box, made the changes that  they made. They took the House out of Democratic hands and made  Republicans lead the House of Representatives. Then, they did the same  with the Senate and the White House in 2024.\n\nThat is the report card that…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}]