[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…for being selected as 1 of 50 finalists in the  2025 Bloomberg Mayors Challenge.\n\nSelected from over 630 global applicants, Beaverton's bold initiative  reimagines housing through community-led, intergenerational models that  put homeownership within reach for more Oregonians.\n\nImagine a walkable neighborhood with vibrant shops, restaurants, and  community-led…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693977/recognizing-the-city-of-beaverton-and-mayor-lacey-beaty"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and generating economic activity       for my local community. I run a construction and real estate       business that is helping to rebuild and revitalize housing       throughout my community. Over the past few years, my company       has worked on 56 houses. I'm proud of my team's ability to       fix up homes and provide high-quality housing to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and give  people a hand up by helping them improve their financial security and  job skills. Trump even wanted to eliminate several programs that  support affordable housing and community development.\n\nThis bill says no to all of that. It says that we are not going to  stop making progress, and we are not going to stop building affordable  housing and…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…congratulate Carlos Ramirez-Rosa.\n\nMrs. RAMIREZ. Mr. Speaker, in commemoration of National Fair Housing  Month, I rise to recognize my constituent, affordable housing resident,  and community advocate, Deborah Suggs.\n\nFor over 50 years, Deborah has called home the Marian Park  Apartments, a Wheaton affordable housing community serving seniors and  families.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…to emphasize voluntary  treatment.\n\nShe expanded crisis and early intervention services, championed a  more diverse mental health workforce, and worked to strengthen housing  and community-based support services.\n\nHer compassion extended to her home where Ms. Abderholden and her  family fostered children with disabilities and youth aging out of  foster…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…mitigation counseling to  delinquent borrowers and raises the public welfare investment, or PWI,  cap to 20 percent to free up capital for historic investments in  affordable housing and community development.\n\nAmong other community bank reforms, H.R. 6644 includes my bill to  modernize the treatment of reciprocal deposits to help small- and mid- size banks,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Fundacion Latinoamericana De Accion Social, Legacy  Community Health, and the Montrose Center are doing the work every day  making sure that our LGBTQIA+ neighbors have care, housing, community,  and support. That is what we should be focused on. There is so much  good that we can be doing.\n\nInstead, my Republican colleagues are using their power to bully and…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692139/happy-pride-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…PROVIDERS  Sec. 501. Requirement to testify. Sec. 502. Improving public housing agency accountability.          TITLE VI--STRENGTHENING COMMUNITY BANKS' ROLE IN HOUSING  Sec. 601. Community Bank Deposit Access. Sec. 602. Keeping Deposits Local. Sec. 603. Supervisory Modifications for Appropriate Risk-based Testing. Sec. 604. Tailored Regulatory Updates…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…system has left these  families behind.\n\nFor the first time since 2006, we are finally increasing the capital  that financial institutions can invest in affordable housing and  community development projects. There is finally the willingness to  tackle this housing crisis head-on.\n\nMrs. KIM. The Housing for the 21st Century Act builds on the success…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Springs  Chamber of Commerce for hosting the chamber fly-in to Washington, D.C.,  this week.\n\nOver 90 members of the Chamber, from the Aerospace and Defense,  Energy, Housing, and Community Development sectors, among others, made  the journey to our Nation's Capital.\n\nI had the opportunity to meet with several of these business leaders  individually. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695829/2025-colorado-springs-chamber-of-commerce-dc-fly-in"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Offutt  Air Force Base in Bellevue, Nebraska. There, Burlington Capital  partnered with the United States Air Force to redevelop and manage the  base's military family housing community. Through a long-term public- private partnership, Lisa and her team delivered $240 million in  redevelopment that transformed outdated housing into modern  neighborhoods…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…tenure as a vocal advocate for people with disabilities.\n\nBefore his position with UDS, Bill was the Chief Operating Officer  for the Inglis Foundation, a Philadelphia housing and community  services organization for disabled individuals, and he was Regional  Vice President for Apria Healthcare and CEO for the Kairos Foundation.  Additionally, he served…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690790/congratulating-bill-kepner-on-his-retirement"}]