[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Speaker, I rise in support of H.R. 1724, the No Dollars to Uyghur  Forced Labor Act.\n\nCongress has a history of bipartisan cooperation to call out  Beijing's genocide and human rights abuses against Uyghurs and members  of other minority groups in Xinjiang.\n\nWe passed the Uyghur Forced Labor Prevention Act, which was signed  into law by President Biden in…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690653/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…international  law, but my colleagues are not interested, of course, when it comes to  that sort of transparency. My colleagues are not interested in holding  countries with human rights abuses accountable. They are not interested  in voting to uphold international law, Mr. Chair. They are only  interested in voting to protect governments like the Israeli…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Commission,  named after our former colleague, the only Holocaust survivor to serve  in the United States Congress, I have spent years documenting and  standing up to human rights abuses carried out by authoritarian regimes  against their own people.\n\nLet me say this plainly: A functioning democracy does not execute  people in the street. That is the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…basic resolution.\n\nEveryone in this body, knowing that Americans have been deported  without due process to a prison in a foreign country that has a  grievous record of human rights abuses, should at least want to get  information about the circumstances of that confinement, about whether  that prison is according American residents any semblance of due…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…entirely at his whim, and we know how unpredictable,  vengeful, and punitive he can be.\n\nWhile I support AGOA, I do not support extending it to countries with  serious human rights abuses, nor to those engaging in serious  environmental destruction, such as the devastation of Africa's  rainforests.\n\nIn Tanzania, bodies filled morgues as more than 700…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…responsible and in  a way that is sustainable. Demand for these  minerals is growing rapidly. Yet, global supply chains remain highly  concentrated and often linked to serious human rights abuses and  environmental harms.\n\nThis should push us toward thoughtful policies that strengthen  domestic supply chains and not reckless ones that endanger our  environment…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…to bring  more hospital closures.\n\nTrump's attacks on the Federal Reserve could cause another financial  crisis. Masked agents are roaming our streets, and reports of human  rights abuses at ICE detention facilities are growing. Far from ending  the wars in Gaza and Ukraine, Trump has amassed naval forces off the  coast of Venezuela and could provoke…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to address the ongoing protests  in Iran.\n\nFor decades, the Iranian people have faced human rights abuses,  extrajudicial killings, and economic turmoil.\n\nProtests have been going on for almost a month. The military is  cracking down, and at least thousands have died. The…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…impact on the  provincial economy.\n\nThe CCP holds an ownership interest in several PRC companies tied to  drug trafficking, including a PRC Government prison connected to human  rights abuses, owning a drug trafficking chemical company, and a  publicly traded PRC company hosting thousands of instances of open drug  trafficking on its sites.\n\nThe PRC failed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…much help from the Biden administration. Huawei and  SMIC are two of the CCP's national champions and play a critical role  in supporting China's military buildup and human rights abuses.\n\nIt is essential that Congress has visibility into how many licenses  are being approved for the worst actors on export control blacklists,  known as the Entity List.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "John James", "party": "Republican", "sentence": "…strengthen domestic production, and invest in innovative technologies  that expand American mineral independence. It equips our Nation to  counter anticompetitive tactics and human rights abuses in global  markets while ensuring our own energy systems are resilient, secure,  and self-reliant.\n\nThis is about unleashing American energy. This is about reshoring…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…children. These so-called little red classrooms were sold as  opportunities to teach Chinese language and culture. In reality, they  required teachers to omit discussion of human rights abuses, present  the CCP in a positive light, and rabidly celebrate the regime.\n\nStudents in these classrooms rarely learn about events such as the  Tiananmen Square massacre…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…U.S. colleges, the CCP established Confucius Institutes to  push false narratives, whitewash history, and endear American students  to the CCP while obscuring its brutal human rights abuses. However,  these propaganda operations didn't stop at higher education. In K-12  schools, Confucius classrooms sprang up, aiming to shape the minds of  our youngest…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…cultural practices. Xinjiang  authorities have detained Uyghurs in internment camps without formal  charges, forced them into slave labor, and have committed numerous  other human rights abuses against the Uyghur people.\n\nThis includes severe physical abuse, as well as the forced collection  of biometric data like DNA and fingerprint samples.\n\nWhile the Chinese…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…could  not impose sanctions on Nicaragua last year because it was a CAFTA  party. Instead, we recognized that legitimate national security  grounds, including Nicaragua's human rights abuses, warranted the  economic pressure.\n\nThird, it was only yesterday that we confirmed Jamieson Greer as the  U.S. Trade Representative to serve as the principal adviser…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…The National Endowment for Democracy is a critical tool for ensuring  that prodemocracy movements have the resources they need to counter  authoritarianism and confront human rights abuses. Countries such as  Ukraine, Bosnia, and Georgia face constant pressure and interference  from Russia, and the National Endowment for Democracy is on the front  lines…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…builds  off of these efforts and prohibits the Department of Homeland Security  from procuring batteries from companies that have deep ties to the CCP  and engage in human rights abuses.\n\nH.R. 1166 helps our Nation take a step forward in advancing our  efforts to decouple from the PRC and safeguard critical supply chains  from exploitation.\n\nI am proud…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…industry, where more than 20  percent of the world's cotton is a product of Uyghur forced labor. We  need to make sure that our economy is not subsidized by the CCP's human  rights abuses.\n\nThe United States must show through words and through actions that we  will have Uyghurs' backs in their fight against the CCP's tyranny. We  must leverage U.S. soft…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…rights. The best example  of that is the genocide that they commit against the Uighur Muslims in  China, and the world pretty much looks the other way while they do  human rights abuses that are way over the top.\n\nSo, Senator Perdue--David--you have your work cut out for you. This  is going to be a challenge as we go forward, particularly over the next…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of the 111th Congress that conduct reporting       and investigative journalism focused on the XUAR, including       in local languages, to ensure that further PRC human rights       abuses are reported on;\n\n(10) work with international partners to raise awareness       concerning acts of transnational repression against Uyghur       Americans or Uyghurs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…CCP asserts its control over the Uyghur people through threats,  intimidation, confinement, and physical and emotional abuse. Failing to  confront China empowers gross human rights abuses and allows for the  spread of such atrocities to be determined by the CCP.\n\nOur legislation will ensure that our State Department plays no part  in the forced slave…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…deaths       occur frequently, raise significant concern. China's       prominence in the sector also presents a raft of policy       considerations regarding labor and human rights abuses,       environmental degradation, national security threats, and       more.\n\nThe Duluth Complex in northern Minnesota is a world-class       mineral deposit containing…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…States, his neighbors, they all agree Maduro stole the election in 2024  and compounded it by annulling the results.\n\nThe regime was one long string of repression and human rights abuses.  Over 8 million Venezuelans have fled Venezuela, their home country,  because of Maduro.\n\nRepublicans and Democrats have acknowledged that Maduro has been a  national…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}]