[{"senator": "Al Green", "party": "Democrat", "sentence": "…this to go unnoticed  when there is a headline that reads: Growing leftwing violence blamed  for deadly shooting.\n\nI believe in specificities. I believe in the decency that human  beings should afford each other.\n\nI am going to continue to do that because Dr. King was and is right.  We do have to learn to live together, all of us, as brothers and  sisters,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…Americans and their  right to survive.\n\nI am calling on every Member in this House to look beyond party  politics, party games, and trying to get the limelight to actually put  human beings' lives front and center.\n\nThe shutdown may be over, but our responsibility to protect the  health and dignity of the American people is not.\n\nIf we do not pass the ACA tax…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697212/medical-bills-are-too-high"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…just through their caricature. I  had caricatures of Representative Greene, Representative Massie, and  Representative Mace.\n\nWhat I saw was they cared as Americans and human beings. They stood  with courage. They looked at this not from politics, but they looked at  this as what is right. I am proud today to be a Member of Congress. I  am proud to…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is about simple human  decency. Our divisions run deep, but we are still all Americans. We may  disagree sometimes, many times, maybe most of the time, but we are  still human beings. The victims this weekend--no matter what party they  belonged to--still leave behind kids who now will never speak to their  parents ever again.\n\nSo I say to my colleagues:…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…least understood forms  of trafficking but one that experts believe may be growing. Like sex  trafficking and labor trafficking, it is ultimately a crime that  exploits human beings for economic profit.\n\nThe State Department's 2023 Human Rights Report highlights troubling  allegations regarding the Government of the People's Republic of China  forcibly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…quotas, DHS is proposing to turn an industrial  warehouse in a Phoenix suburb into a 1,500-bed detention facility.  ICE's Acting Director called it Amazon Prime but with human beings.\n\nPeople across the political spectrum are strongly opposing this and  for good reason. They don't want human beings held in a makeshift jail  down the street from their…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699702/chaos-at-department-of-homeland-security"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…that to happen.\n\nThis bill is about justice, healing, and true restoration. It affirms  that survivors are more than the crimes that they are forced to commit.  They are human beings deserving of opportunity, safety, and hope.\n\nMr. Speaker, I urge my colleagues to support putting survivors first  and support this bipartisan legislation. I thank Representatives…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…widely known as ``the  Green Patriarch.'' He famously declared shortly after he assumed the  ecumenical throne in 1991 that ``crime against the natural world is a  sin.'' Human beings and the environment, he stated, ``compose a  seamless garment of existence, a multicolored cloth, which we believe  to be woven in its entirety by God.'' The world, he told…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…cause.\n\nThese are facts, and they are demonstrated by sound science. Not only  is climate change a demonstrated fact recognized by all sound science  on the topic, but human beings have been aware of this scientific fact  for over a century. The fossil fuel industry has worked to suppress  that fact for nearly 60 years, but it is still a fact.\n\nOne…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…by an agency that has made a determination that they are  not accountable to anyone, to no law, no rule of law, and even no  higher calling of understanding how you treat human beings.\n\nThey have run roughshod over United States citizens. No one here  believes that criminals in this Nation shouldn't be deported or that  they shouldn't face the legal system…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…their eyes, or pretend that they are  not Palestinians, they would care, that they would care that  Palestinians have been forced to eat grass and animal feed--they are  human beings--while thousands of trucks carrying food sit blocked at  the border.\n\nThe Israeli Government is using starvation as a weapon of war. Now,  the Israeli forces are deliberately…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693848/starvation-in-gaza"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…ill health. And we as an entire  country would suffer.\n\nThink about this not as that slur where they try to call this in ways  that try to shift public opinion away from human beings, fellow  Americans, our patriots. Think of it instead as a lifeline.\n\nIt is the reason a child with asthma can breathe easier. It is the  reason a senior can receive the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…tonight not just for myself as a legislator, but for all of  those who never made it to this mike, for all of those who did not have  the opportunity to be viewed as full human beings in our great country,  for those who marched in the dust, for those who bled on the bridges,  for those who faced the dogs and the batons right here in the United  States…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…radicalization.\n\nWe need to invest in connection in this country: in schools, in civic  spaces, in mental health services, and in communities where people can  see one another as human beings again.\n\nEmpathy is action against the viciousness of unchecked social media.  Cruelty isn't an accident of these platforms. It is their business  model.\n\nWhen algorithms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…personal  stories, right? It is important to understand that we are giving a talk  on the Senate floor, and we are talking about numbers, but at the end  of the day, these are human beings, and I am sure your phones are as  flooded as mine are with people who want to tell their personal  stories.\n\nI will say, for me, it feels like ``Groundhog Day'' because…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…available for both animals and humans so that veterinarians  and healthcare professionals can act quickly, if necessary. This  parasite doesn't just affect cattle. It affects human beings, too, and  it is a horrific, horrific thing.\n\nSecondly, USDA is investing significantly in the renovation and  construction of new sterile fly facilities in both the United…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…simple policy change would actually reduce border  crossings significantly. When we do that, we take away the power that  the cartels have. When the cartels are in power, human beings suffer.  There is no other way to look at it.\n\nCustoms and Border Protection data from earlier this month show that  Southwest border crossings are the lowest they have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…this atrocious act, who made these  Molotov cocktails, and who fashioned a flamethrower was an illegal  immigrant with a bad history.\n\nThere would be people who are good human beings in this country who  would be alive if we didn't have an open-door border policy. That is  the simple truth. It is not complicated.\n\nThat is not using Jews. It happened…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…biting during arrests to vehicle-ramming, open  gunfire, and throwing Molotov cocktails--all because they are doing  their jobs that they took an oath to do to protect other human beings.  From January 21, 2024, through November 21, 2024, there were only 19  recorded assaults against ICE law enforcement. At the same time this  year, ICE law enforcement has…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…this shutdown is just further proof  that human evolution is a slow, slow process. With this shutdown, what  you are witnessing now is just further proof about why it took human  beings thousands of years to learn how to stand upright. This shutdown  is bone-deep, down-to-the-marrow stupid.\n\nSome shutdowns are based on policy. Some shutdowns are based…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Officer Mendoza, Laken Riley, Rachel Morin, and  Kayla Hamilton.\n\nWhy do I know their names? It is because I met their families, and I  have talked to them, and they are human beings. They were Americans who  were living their lives and going to college and going to school and  serving their country, and they are dead because people decided, for  political…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Wall Street Journal, and they just happened  to pick out my State. I love Arizona. Look, if you get to represent  Phoenix and Scottsdale, you are one of the most blessed human beings in  life, but the point that The Wall Street Journal was trying to make in  putting up this chart is that, in Arizona, we put money--$363 million-- back in the general fund…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…effectively partnering with those cartels.\n\nThere is a partnership in whatever criminal activity they are engaged  in. At our southern border, the criminal cartel traffic human beings  and drugs into our country. In 2021, 2022, 2023, and 2024, the  executive branch of our government--the prior President and Secretary  of Homeland Security--effectively…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…will  make you feel better. If that pill doesn't make you feel better, take  two of these pills type of thing. We have to get rid of that because it  doesn't help.\n\nWe are human beings, and I would suggest to you that one of the  options we have to promote the idea of post-traumatic stress is to get  behind some good things. Both Democrats and Republicans…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}]