[{"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Health  Association, and Catholic Charities USA--urged lawmakers to protect and  strengthen Medicaid as a matter of faith.\n\nThey wrote:\n\nThe Catholic Church teaches that human life is sacred, and       all people have inherent dignity and worth. As Catholic       bishops and organizations that provide health care and social       services on behalf…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…blocked by the House majority.\n\nThese terrible and horrible hazards endanger personal property,  businesses, local economies, critical infrastructure, and, most  importantly, human life and safety. This bill allows irreparable,  preventable damage in our communities, and I urge all of my colleagues  to vote ``no.''", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698035/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…knows what these votes mean, not just for the precedent and  procedures of the U.S. Senate but for the health of my constituents in  California and about the real threat to human life that comes when  California is denied the ability to control toxic air and greenhouse  gas emissions.\n\nBut before I do, I want Senators and the American people to fully…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…stand up against the  power and our resources of this country being used in such ways.\n\nI am a physician. I am a mother. I believe in the sanctity, the  universal worth, of human life. That belief does not change based on  who you are or where you live.\n\nEach of our lives has innate, incalculable value. Our shared humanity  must be recognized and preserved,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697114/genocide-in-gaza"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…and save  lives before disaster strikes.\n\nRather than protect workers from these deadly hazards, Republicans  want to repeal this commonsense rule, rolling the dice with human life  in the name of corporate profits. They wrap it all up in a phony pitch  about prices like they are standing up for the little guy while they  look the other way when their…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…America. Fentanyl and  fentanyl analogues have literally been responsible for lowering the  life expectancy for Americans. It is one of the greatest crises we have  seen to human life in America in my lifetime. There is so much data- driven evidence and evidence-based answers to this, of how we can  approach this crisis, but yet the only bill that we seek…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…cause to Haitian individuals,       families, and communities. Preserving TPS is essential to       protecting not only legal status, but mental health, dignity,       and human life.            Respectfully submitted,\n\nMassachusetts-based Haitian Community Mental Health       Organization (on behalf of Haitian clients and families).…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…What they aren't accustomed to       acknowledging--and what constituent pressure should demand       they face--is that the latest weapons systems further       endanger human life on Earth.\n\nThe history of the last eight decades tells us that       Americans will go along with astronomical spending for       nuclear weaponry if they believe it makes…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…horrific weapons from the face of  the Earth, or we will use them and abolish humanity instead.\n\nThe only sane position and the only legitimate position for anyone  who values human life is abolition.\n\nIn addition, more than one-half of the countries in the world have  now formally agreed signing on to the TPNW. We should join them.\n\nThat is because just…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…we stand at a crossroads. The world is once again  drifting toward a future where nuclear weapons are not just tools of  deterrence but urgent threats hanging over every human life.\n\nMr. Speaker, we cannot afford to look away, not when the lessons of  the past are still very visible amongst us. Look to the people of the  Marshall Islands. Many of them…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…recognized as the patron saint of immigrants, a title that  honors her tireless advocacy for all those who migrate and her  unwavering belief in the sacred dignity of every single human life.\n\nIn Chicago, many know her from the former Cabrini-Green public  housing development, which stood as a symbol both of the challenges of  poverty and  segregation, and of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…security.\n\nThis crisis has resulted from deliberate actions and       obstructions by leadership at USAID, the Department of State,       and DOGE. Their reckless disregard for human life and       national security prevented me and my team from implementing       lifesaving assistance.\n\nUltimately, with nearly all of the awards terminated, and       with…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…abortion  in America, but it said: We have disagreements on abortion as  Americans, but at a minimum, we should agree American tax dollars  should not pay for the taking of human life; that healthcare is about  protecting life, not taking life; that in a controversial issue like  abortion, at least we should all agree we don't use tax dollars to pay  for…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…was a step in the right direction, there is still much to be done  to protect the lives of our Nation's most innocent.\n\nModern science objectively proves that new, distinct human life  begins at the moment of conception. It is truly incredible that, with  today's technology, we know that a baby's heartbeat starts at just  about 22 days after conception,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…concerned.\n\n(b) Requirements.--In developing each preparedness plan       under subsection (a), the Commandant shall ensure that the       plan--\n\n(1) minimizes the loss of human life;\n\n(2) maximizes the ability of the Coast Guard to meet the       mission of the Coast Guard;\n\n(3) is included in the emergency action plan for each Coast       Guard unit…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…infrastructure to persecute millions of not only Falun Gong  practitioners but also Uyghurs, Tibetans, Christians, and others it  deems a threat.\n\nThe CCP's utter disregard for human life shocks the conscience. This  barbaric practice must end, and it must end now.\n\nH.R. 1540 is a historic step forward, the first binding commitment by  Congress to take decisive…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…systems with effective enforcement mechanisms in       bilateral diplomatic meetings and in international health       forums;\n\n(3) to promote the dignity and security of human life in       accordance with the Universal Declaration of Human Rights,       adopted on December 10, 1948; and\n\n(4) to hold accountable persons implicated, including       members…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…immigrants who were basically killed in  the back of that truck in the San Antonio area. The only reason that  that type of thing happens is because the cartels don't care for human  life. The cartels that were running the border over the last 4 years do  not care about the plight of an immigrant searching for a better life  and a unique work opportunity.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…volcanic eruptions can swing wildly, depending  on many factors, but are almost always severe, underscoring the need  for early warning and monitoring.\n\nObviously, protecting human life is our paramount concern in  monitoring volcanic activity, but it is not just people on the ground  who are at risk. Aircraft that are flying within 1,000 miles of a  volcanic…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…over the past few decades.\n\nDuring that time, these incredibly destructive wildfires have led to  significant property loss; recovery costs; and, in some cases, the loss  of human life.\n\nI visited some of the afflicted areas, including Paradise,  California, where the devastating Camp fire occurred in 2018. It is our  responsibility as elected officials…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…high as a pioneering beacon of light,       learning and enlightenment in our postmodern new age with       revolutionary promise as well as colossal dark threats to       human life, the painstakingly garnered civilization and the       very survival of all life on our planet Earth. Greenberg       attributes the impetus to writing this inspirational…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Shield families resolution. Out  of all of the priorities that we face in this Chamber, Mr. Speaker,  none is more fundamental than ensuring public safety and protecting  human life. It is the foundation for everything else--our economy, our  freedoms, and our way of life--so the people on the front lines of that  effort are our first responders.\n\nPolice…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…and empowering these brilliant  performers through the arts and education.\n\nI thank them for dedicating their time, their energy, and their  passion in advocating for every human life.\n\nMr. Speaker, I ask that you join me in giving a warm welcome to the  Friends of Club 21 Choir.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699252/welcoming-jared-anderson-and-friends-of-club-21-choir-to-washington-dc"}]