[{"senator": "André Carson", "party": "Democrat", "sentence": "…not have answers.  It is imperative that Congress receives the information needed to  conduct the necessary oversight. We must ensure no taxpayer dollars  contribute to human rights violations or anyone's death--most  especially an American abroad.\n\nAs an American, Ms. Abu Akleh was entitled to the full protections  afforded to U.S. citizens living…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…international  law, but my colleagues are not interested, of course, when it comes to  that sort of transparency. My colleagues are not interested in holding  countries with human rights abuses accountable. They are not interested  in voting to uphold international law, Mr. Chair. They are only  interested in voting to protect governments like the Israeli…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…States House of Representatives to ensure that no communist  regime can rewrite our history.\n\nAs we mark this solemn milestone, let us reaffirm our commitment to  freedom and human rights and honor the indomitable spirit of the  Vietnamese diaspora.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…spiritual guide,  but a community builder who tripled the size of his congregation during  his time as pastor at Mount Zion. McKinney was a founding member of  Seattle's First Human Rights Commission, which successfully fought for  the Seattle's first Fair Housing Act, establishing protection for  tenants of protected classes and marginalized communities.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…For  over 50 years, emergency authorities have been declared. What have they  been? Yes, they have been for civil wars. Pandemics? I think that is an  emergency. A massive human rights crisis could be an emergency.\n\nCanada is none of those things. Canada isn't a threat. Canada is our  friend. Canada is our ally. Canadians have fought alongside Americans,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Democratic and Republican Presidents? The existence and  activities of transnational criminal organizations, malicious cyber- enabled activities that target the United States, human rights  violations that affect the United States, corruption that affects the  United States, pervasive strategies by foreign nations to evade  sanctions imposed by the United…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Western Pennsylvania. Since  his election as the 270th Archbishop of Constantinople-New Rome in  1991, His All-Holiness has continuously worked to promote religious  freedoms, human rights, and stronger environmental protections.\n\nThrough the tireless work to promote international peace and  religious tolerance, His All-Holiness was awarded the Gold Medal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…families and with hopes for a better future.\n\nThere is no doubt that the aspirations of the people of Cuba are  stymied by their own government. It denies them fundamental human  rights. It does not meet their basic needs. It must do better, much  better, to listen to what people are asking for and address their  concerns in a real way, and our government…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…cruelty, but it is lawlessness. It is a direct  assault on our values and the rule of law. He was abducted from his  home and sent to a foreign prison infamously known for human rights  violations. When the President defies the courts, he crosses the line  into tyranny. He is even arresting judges whom he sees as standing in  his way.\n\nWhen tyranny takes…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…human right. I believe that access to  food, water, shelter, and safety is a human right. I believe that  justice, freedom, and access to the criminal justice system are human  rights. I believe that basic dignity is a human right. That is why I  implore my colleagues to stop with these divisive political tactics  every day and these bills attacking…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…humanity. He is internationally  recognized for his efforts to protect the environment--earning the  nickname ``the Green Patriarch''--as well as for his work in advancing  human rights, reconciliation among faiths, and support for religious  communities living under persecution.\n\nHe has been welcomed by presidents and prime ministers around the  world,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that he has ``the look,  the brain, the whole thing.'' President Trump has no problem with the  actual horrors of communism today, like the Chinese Government's  massive human rights violations against the Uyghurs, Tibetans, and  political dissenters in their country. ``He's a brilliant guy,'' and,  ``He controls 1.4 billion people with an iron fist.''…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…honest work, charity, volunteerism, and sharing with those in need.\n\nMr. Speaker, it is altogether fitting that the House recognize Guru  Tegh Bahadur's supreme sacrifice for human rights and religious  freedom, and encourage all Americans to join in its observance on  November 24, 2025.", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…one of the world's  oldest monotheistic religions. Its legacy includes significant  contributions to history and civilization, including influencing  democracy, universal human rights, and international trade and  commerce.\n\nIn fact, Cyrus the Great, a follower of Zoroastrianism, recorded the  first declaration of human rights, emphasizing freedom of…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688922/introducing-a-resolution-to-recognize-march-as-zoroastrian-legacy-and-heritage-month"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…ethnic violence in the Democratic Republic of the Congo  (DRC). Dr. King famously said, ``injustice anywhere is a threat to  justice everywhere.'' The United States, credible human rights  organizations, and civil society have documented and published reports  and findings that implicate the Democratic Republic of the Congo and  Rwanda in aiding and collaborating…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Let's talk about what is in the bill.\n\nThey are going to be voting against $6 million that was spent for net  zero cities in Mexico, and $8 million for the anti-Israel U.N. Human  Rights Council, a group that is anti-Israel. Why should $8 million of  American tax dollars that are being borrowed from other countries be  going to that organization? How about…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…high- risk national security activities involving access to controlled  technologies such as advanced AI chips.\n\nOne example would be conducting surveillance to undermine human  rights through spyware location tracking or biometric identification.  That is not good stuff. We don't want the Chinese and our countries of  concern to be using the best American…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698858/remote-access-security-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I move to suspend the rules and pass  the bill (H.R. 2635) to support the human rights of Uyghurs and members  of other minority groups residing primarily in the Xinjiang Uyghur  Autonomous Region and safeguard their distinct identity, and for other  purposes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Bank to maintain a strict pause on disbursements in  new financing commitments to the current government in control of  Burma.\n\nSupporting democratic movements, defending human rights, and  advancing stability in Southeast Asia are in our American interest.  When international institutions inadvertently enable authoritarian  regimes through new financing,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…girls, and men, too, by the  way.\n\nThree of the 10-point plan is a commitment to individual and social  freedoms and rights in accordance with the Universal Declaration of  Human Rights: disbanding all agencies in charge of censorship and  inquisition, and seeking justice for massacred political prisoners,  prohibition of torture, and the abolishment of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…children. These so-called little red classrooms were sold as  opportunities to teach Chinese language and culture. In reality, they  required teachers to omit discussion of human rights abuses, present  the CCP in a positive light, and rabidly celebrate the regime.\n\nStudents in these classrooms rarely learn about events such as the  Tiananmen Square massacre…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…diplomatic meetings and in international health       forums;\n\n(3) to promote the dignity and security of human life in       accordance with the Universal Declaration of Human Rights,       adopted on December 10, 1948; and\n\n(4) to hold accountable persons implicated, including       members of the Chinese Communist Party, in forced organ       harvesting…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…violence and persecution. They are attacked in the streets,  held as political prisoners, and have little recourse.\n\nThe discrimination they face not only violates their basic human  rights, but also undermines Egypt's rich cultural diversity and  history, as well as Egypt's own legal commitments to its citizens.\n\nIt is critical for the international community…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…powers of  globalists, defunding UNRWA, the dollars that were going to Hamas  against Israel and against our national security interests. He defunded  the United Nations Human Rights Council. He defunded the World Health  Organization.\n\nEach one of these were things that I had introduced legislation on  and many of my Republican colleagues had introduced…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…decades, the House of Representatives has been raising alarms  about organ harvesting perpetrated by the Chinese Communist Party. We  spoke about it earlier.\n\nAs United Nations human rights experts stated in 2021: ``Forced organ  harvesting in China appears to be targeting specific ethnic,  linguistic, or religious minorities held in detention, often without…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…country and let them deal with it instead of dealing with them here in  America, where we, again, have the most stringent rules, have the  highest expectations, protect human rights, protect the environment,  and promote occupational health and safety.\n\nShow me some place in the world that does that better than we do. It  is certainly not Communist…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…by supporting democratic movements, opposing tyranny, and       providing humanitarian aid.\n\nThe U.S. has historically used its influence to encourage       the spread of human rights and liberty worldwide, embodying       the belief that freedom is a universal right, not just an       American ideal.\n\nOur next winner is Grey Landreth, who is in the 11th…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…cultural practices. Xinjiang  authorities have detained Uyghurs in internment camps without formal  charges, forced them into slave labor, and have committed numerous  other human rights abuses against the Uyghur people.\n\nThis includes severe physical abuse, as well as the forced collection  of biometric data like DNA and fingerprint samples.\n\nWhile the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John James", "party": "Republican", "sentence": "…strengthen domestic production, and invest in innovative technologies  that expand American mineral independence. It equips our Nation to  counter anticompetitive tactics and human rights abuses in global  markets while ensuring our own energy systems are resilient, secure,  and self-reliant.\n\nThis is about unleashing American energy. This is about reshoring…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…going to lower our standards.  This extension maintains the most stringent eligibility criteria of any  trade preference program, with annual reviews to defend IP rights,  human rights, market access, and the rule of law against corruption. To  be eligible, countries must also ensure they are not undermining  America's national security or foreign policy…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}]