[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…with little transparency and no due process.\n\nWe must demand accountability, transparency, and protection of civil  rights to ensure enforcement respects due process and human dignity.  The American people are seeing the reality of this enforcement: fear,  brutality and injustice. They will not stand for it.\n\nMr. Speaker, I will echo again what I said…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…she presided over the  first same-sex marriages in Washington State, standing at the forefront  of a historic civil rights milestone. Her compassion, warmth and belief  in human dignity are evident in the many cases she has handled.\n\nOff the bench, she has mentored countless law students, new attorneys  and law clerks, taught as Jurist in Residence at…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Templeton Prize for his groundbreaking  harmonization of faith and science in service of environmental  protection. The Templeton Prize, given to singular champions of human  dignity and progress such as Mother Teresa and Archbishop Desmond Tutu,  honors people who have harnessed the power of the sciences to explore  the deepest questions of the universe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…fondly remembered  as Dharam Di Chadar, or, ``Shield of the Religions,'' for his ultimate  sacrifice to protect the rights of others and uphold the universal  principles of human dignity, freedom of conscience, and the right to  worship according to one's beliefs.\n\nPennsylvania's Sikh community, whose roots trace back to the State of  Punjab in India, began…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…must be transparency and  accountability.\n\nThat is why I introduced the Humanitarian Standards for Individuals  in ICE and CBP Custody Act to prevent death and to protect human  dignity.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…facing harassment  by foreign governments and attacks by extremists, he has remained  steadfast in his mission to promote reconciliation, environmental  stewardship, and human dignity.\n\nHis contributions have been recognized around the globe. In 1997, he  was awarded the Gold Medal of the United States Congress. The Guardian  identified him as one of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…United States and the Ecumenical Patriarchate.\n\nIt is my honor to welcome His All-Holiness to our Nation's capital  and to recognize his tireless efforts in promoting peace, human  dignity, and spiritual leadership across the globe.\n\nI ask my colleagues to join me in honoring this important visit and  in celebrating the Ecumenical Patriarch Bartholomew.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695495/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…gangs or drugs or any of the disgusting  tropes the other side will paint against hardworking immigrants. It was  about seatbelts in vans, safety on the job, and the simple human  dignity of not being punished for demanding better conditions.\n\nWhat has this administration done? They have proposed stripping those  protections, both for transportation safety…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…different points of view meet and are reconciled  . . . And--most important to the Orthodox Church during many dark  ages--in these halls human rights are preserved and human dignity is  enhanced.''\n\nEcumenical Patriarch Bartholomew is a leading figure in the dialogues  of the Abrahamic Faiths--Judaism, Christianity, and Islam, and his  presence in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…and the United States. As we  prepare to welcome His All-Holiness once again, we recognize not just  the leader of a faith, but a global advocate for justice, peace, and  human dignity.\n\nOn behalf of Virginia's 7th District Greek Orthodox community, it is  an honor to welcome him to Washington.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…in opposition to the  amendment.\n\nMs. JACOBS. Mr. Chairman, I yield myself such time as I may consume.\n\nTrans people, including trans servicemembers, deserve the basic human  dignity and common decency of safely using the restroom.\n\nBesides that, let's take the gentlewoman's point at face value. She  wants  to protect women. Great. So do I. Bathroom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…without  congressional approval. Nearly 1,400 Federal staff at the Department of  Education may be fired, including those tasked with protecting the  civil rights and the human dignity of students.\n\nThe Court's decision sets a dangerous precedent as it tells the  executive branch that it can effectively dismantle the very agencies  that Congress has created…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…and the Ecumenical  Patriarchate.\n\nOnce again, I welcome Ecumenical Patriarch to Washington and in  honoring his decades of global leadership, his commitment to peace and  human dignity, and his enduring contributions to our shared moral and  spiritual life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…violating basic rights  while refusing basic oversight. It pours money into detention and  enforcement without guardrails, without transportation, and without  respect for human dignity.\n\nI want to be clear. Security does not require cruelty. Enforcement  does not require lawlessness, and immigration policy should never  require us to abandon our values.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…District, home to  thousands of Ukrainians and Ukrainian Americans, it is my honor to  commend Dr. Mariya Dmytriv-Kapeniak for her tremendous leadership and  commitment to human dignity, to peace, and to democracy.\n\nMr. Speaker, I thank Mariya and congratulate her.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…Christians throughout our land, welcome this visit with joy. My  constituents are particularly proud of the fact that Patriarch  Bartholomew has been an outspoken defender of human dignity and has  reached out to Jewish and Muslim leaders throughout the world.\n\nMr. Speaker, I ask my colleagues to join me in welcoming His All- Holiness Ecumenical Patriarch…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Korean-born naturalized citizen of the United States. Dr.  Jaisohn dedicated his life to strengthening democracy, expanding  opportunity, and advancing the ideals of freedom and human dignity.\n\nSince its founding in 1975, the Philip Jaisohn Memorial Foundation  has served as a beacon of cross-cultural connection and advancement.  Through its programs, scholarships,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…leading figure in interfaith dialogue among Judaism,  Christianity, and Islam. His presence here reminds us that faith has a  vital role to play in protecting liberty and human dignity.\n\nMr. Speaker, it is my honor to welcome him to Washington and to thank  him for his steadfast leadership in advancing religious freedom around  the world.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…continues to grow stronger as the months and years go on.\n\nAs President Reagan once said: ``For the people of Israel and America  are historic partners in the global quest for human dignity and  freedom. We will always remain at each other's side.''\n\nOur values are one and the same, and our joint commitment to  advancing freedom and human dignity will never…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690754/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…were brutally murdered. Sarah was one of  our own: a Kansan, a native of Overland Park, and a proud graduate of  the University of Kansas who cared deeply about the shared human  dignity of all people.\n\nThen, just days ago, at a peaceful pro-Israel demonstration in  Colorado, a Hamas sympathizer threw Molotov cocktails into a crowd and  injured more than…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Madam President, I rise today to speak about a grave matter  and a clear violation of religious freedom, human dignity, and the rule  of law.\n\nIn China, Christians are fighting daily for their religious freedom  against the Chinese Communist Party. And on October 10, 2025, the  Chinese…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…governance. The individual's responsibility of work,       education, and industry are crucial elements of self-      governance in society and the preservation of human dignity.\n\nThe rights of a free people are protected and preserved       through honorable, virtuous, leadership which invokes the       nobility inherent in all men and women.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…halls different points of view meet and are reconciled. . . And most  important to the Orthodox Church during many dark ages--in these halls  human rights are preserved and human dignity is enhanced.''\n\nThis week, His All-Holiness Ecumenical Patriarch Bartholomew will  return to Washington as part of his visit to the United States, where  he will also receive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…are being killed so  that their vital organs can be removed and sold. This is a billion- dollar black market built on murder. It is a direct assault on every  principle of human dignity and decency.\n\nH.R. 1503, the Stop Forced Organ Harvesting Act of 2025, is a  bipartisan moral imperative. It holds perpetrators accountable and  targets the heart of this…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…loved ones from the  North Korean regime. To this day, tens of thousands of Korean families  remain separated by a system that tears apart communities and crushes  basic human dignity.\n\nNow more than ever, as socialist ideas gain traction here at home-- and as our Nation's largest city and financial capital has elected not  just a socialist, but a communist…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…veterans.\n\nDon Johnson's tireless leadership and commitment to the non-profit  sector has left a lasting impact on Central Illinois. His work has  advanced economic opportunity, human dignity, and community well-being.  I congratulate Don on his retirement and wish him, his wife Kim, and  their two daughters all the best in this next chapter of life.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…President explained  this as a vital step to defend our sons and daughters against online  predators.\n\nMy fellow colleagues, this is not about politics. This is about basic  human dignity. This is about protecting children who are the most  vulnerable among us. As I just mentioned, the Commander in Chief called  on us to act on this law in this very Chamber…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…authority. We must use our position as leaders in the  world to curb these practices and send a clear message to everybody  that not only will we not tolerate this assault on human dignity, on  humanity itself, but that no country, no people should.\n\nMr. Speaker, I urge a vote in favor of H.R. 1540. Let us stand  together not just for Falun Gong practitioners…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Madam Speaker, if you have associated with Hamas, then you are  persona non grata in America, as you should be in any corner of the  world that values peace, justice, and human dignity.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…marching  shoulder to shoulder with African Americans and others, united in  support for equal rights, equal protection under the law, and the  recognition and respect of human dignity; and\n\nWhereas, the Jewish community has prominently participated in  virtually every civil rights effort in the American experience,  fighting against discrimination and…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}]