[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…was  simple: In exchange for $1 billion, he told them, he promised to  prioritize their preferences in the next election.\n\nWell, those fossil fuel leaders delivered hundreds and hundreds of  millions of dollars in election spending and lobbying. And what did  Trump do? He delivered for them. He gave them $18 billion in new and  expanded tax breaks.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…and the impact will be clear. It  means longer waits and travel times to get the benefits people have  earned, putting those benefits at risk.\n\nMy office has gotten hundreds and hundreds of calls from constituents  who are worried about their Social Security benefits. My Social  Security telephone townhall had nearly 18,000 people. More than 2,000…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…year and was  found brutally murdered 2 weeks later off of U.S. Highway 60.\n\nMonths later, her case remains unsolved. Emily Pike, like Hanna  Harris 30 years ago and hundreds and hundreds of native women and  girls, should be alive today.\n\nIt is far too common that their cases go cold and that loved ones are  left without answers and without justice.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…think people quite  understand. They are all over our State. They are in the suburbs. They  are in small towns.\n\nThe number of calls that we get--my office is handling hundreds and  hundreds of cases right now, but the cases of just someone who is in  the store and gets stopped because they are someone of color or the  videos of two White friends with one…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and the enactment of each of these bills takes power back  from this corrupt President. Unlike the yearlong CR that passed last  March, these bills provide literally hundreds upon hundreds of specific  funding levels and directives that this administration must now, by  law, follow. Is that the answer to all of this administration's  corruption? No. But…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…scholarship. I will tell you right now,  when  Andy Kim walked in that room, he blew away every one of the  interviewers.\n\nI like to brag around New Jersey now that while now hundreds and  hundreds of thousands of people have voted for  Andy Kim, I was perhaps  the first person to do so.\n\nWhat I saw in a young college student decades ago has only blossomed  so…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…table.\n\nIn every State, hundreds of thousands of seniors, children, and  working families could lose their health insurance, thanks to  Republicans' plan to cut those hundreds and hundreds of billions of  dollars from Medicaid.\n\nIt would impose, they seek, burdensome work requirements for people  on Medicaid. The last proposal coming from Republicans…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, we are dealing with a crisis that all  hundred Members of this body understand has taken the lives of hundreds  and hundreds of thousands of people, and that is the scourge of  fentanyl.\n\nOne of the things we have been doing as a result of that is  temporarily scheduling fentanyl analogs,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…secession and violent attack on the  Federal Government.\n\nNeither of my colleagues who is on the floor has said a word  explaining why they won't put the plaque up to honor hundreds and  hundreds of police officers on the Capitol Police force, the  Metropolitan Police Department, and the Montgomery County Police  throughout the region who came to defend us.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Advantage  plan.\n\nOkay. But we aren't telling the truth about the math. There is this  thing that is called the MedPAC reports. They are big orange reports  like this, hundreds and hundreds of pages. If we go through them, there  will be this section in there that says that it turns out Medicare  Advantage is coming in, according to the MedPAC report--and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Judiciary Committee that will address Arctic Frost and the Arctic Frost  investigation that targeted President Trump, elected Members of  Congress, including me, and hundreds--hundreds--of conservative groups  and individuals.\n\nNow, the subcommittee I chair is on Privacy, Technology, and the Law.  And we called before us the general counsels--legal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it  would require thinking in math.\n\nTo get a little more sarcastic, we actually are fixated on just some  of the budgetary problems. We actually believe there are hundreds and  hundreds of billions of dollars that are subject to rescission. They  have been sitting in accounts for years. Instead, we just did an  appropriations bill a little while ago,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Advantage  because you have seen The Wall Street Journal and ProPublica stories  of, functionally, the criminality that is going on. The MedPAC report  basically shows hundreds and hundreds of billions of dollars of waste  and fraud because of what some of the insurers are doing.\n\nI am a big fan of a capitated healthcare delivery model because your  incentive…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Intelligence Committee. I am the most senior Republican  on the Intelligence Committee. I have seen the film from what Hamas did  on October 7. These were animals. They killed hundreds and hundreds of  people. They took hostages. They cut babies out of their mothers. They  killed children in  front of their parents. They killed parents in front of their children.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689526/motions-to-discharge-sj-res-33-and-sj-res-26"}]