[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Florida, Florida's largest utility has proposed the  largest utility rate hike in U.S. history, amounting to $10 billion,  that will raise Floridians' electric bills by hundreds of dollars every  month.\n\nMr. Chair, Republicans in Congress are now making it worse. Their  big, ugly bill, which was passed in July, already is projected to crush  working families…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…China is the big winner, American consumers are the big losers. If  these credits are functionally repealed, the average American could see  their utility bills rise by hundreds of dollars per year.\n\nThis is a lose-lose. It is bad for people's wallets. It is bad for  building a strong, competitive economy. It sells out current and future  generations to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692366/american-energy-jobs-at-risk"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…not be available to you. You might have to drive 2 or  3 hours for care, even emergency care.\n\nNo. 3, starting next year, tens of millions of people are going to  pay hundreds of dollars a month more for health insurance.\n\nThis is what, I think, we should linger on because now that the fight  over ObamaCare is sort of in the rearview mirror, people just…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…transparency when it comes to holding police accountable for  misconduct. Instead, States and cities all across our country have  started adopting new laws to charge the public hundreds of dollars in  fees to view or access police body camera footage.\n\nThese videos are public records and are essential for accountability  and justice for victims of police violence.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…on those subsidies. Four out of five were previously able to find  plans for $10 or less per month. That safety net is now gone. Families  are seeing premiums jump by hundreds of dollars a month or thousands of  dollars a year. Across the country, more than 4 million Americans have  already lost or are at risk of losing their healthcare coverage  entirely.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…unmanageable. Families in my district are projected to pay hundreds  more each year, even when usage stays the same. I have heard from  constituents whose bills jumped hundreds of dollars and more in just a  matter of months. That is not sustainable, and it is not acceptable.\n\nPart of the problem is growing demand from energy-intensive data  centers.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…objections of congressional  Republicans and Big Pharma, who were complaining about how negotiating  drug prices was socialism--socialism. Now seniors will be saving  hundreds of dollars a month because Democrats rolled up our sleeves to  deliver price cuts on prescription drugs.\n\nWhat has President Trump done to make healthcare more affordable?  Nothing.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the Senate right now that  has such incredible consequences, putting $2.4 trillion more of debt in  our country and raising the energy costs on the average American by  hundreds of dollars; this bill that would raise the premiums of people  in our Nation by hundreds of dollars; this bill that merits debate and  discussion because it is so violative of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Finally, after 10 months in this administration, and, yes, one of the  first bills that we voted on, H.R. 1949, actually increases Americans'  utility bills by even more, by hundreds of dollars, in fact.\n\nSo, once again, we are back here, and we are doing things that  actually raise costs on the American people. So with tariff policies  that promote monopolies…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697138/affordability"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…coffee grew more than 5 percent.\n\nThe Department of Agriculture expects grocery prices to rise again  this year. These cost increases amount to grocery bills that are  hundreds of dollars higher for less food. This is compounded by the  SNAP cuts in the one big, ugly bill and cuts to food banks all across  this country.\n\nHowever, it is not just food and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…disgusting abomination. He said: ``Shame on those who voted for it. You  know you did wrong.''\n\nNow, let that sink in. Let that sink in. Elon Musk, the man who spent  hundreds of millions of dollars to elect Donald Trump and other  Republicans, is now saying Members should be ashamed of themselves for  voting for this disgusting bill.\n\nRemember when Republicans…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…energy at the very moment families  are struggling with rising energy bills.\n\nAcross this country, households and small businesses are seeing  electricity costs rise by hundreds of dollars. Demand for power is  rising quickly, and this year, utilities have already proposed major  rate hikes to the tune of $34 billion. Instead of helping lower bills  with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…corrupt bill that adds  hundreds to energy costs to bail out a coal plant in Indiana. Ohioans  cannot afford any more Republican malfeasance that literally costs  Ohioans hundreds of dollars a year.\n\nEven more, this bill does not adequately fund two authorities in my  district that were created under the Water Resources Development Act of  2024. The bipartisan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…are actually going to increase costs,  particularly as it relates to the energy bills that everyday Americans  pay. It is estimated that energy bills will increase by hundreds of  dollars a year. That has nothing to do with lowering the high cost of  living and making this country a more affordable place. It does the  exact opposite.\n\nIt is an all-out…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…our veterans, Congress must intervene to eliminate the red  tape and provide the necessary assistance our veterans deserve.\n\nThis bill would do just that and would save hundreds of dollars for  disabled veterans across the country. It would also ensure that the  disabled veterans have the ability to get to a job and earn money to  support themselves and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…vital role that frozen foods play  in American households. Frozen food is more than just a convenient  option. It is a solution to food waste and a way to save families  hundreds of dollars.\n\nStudies show that frozen produce is less likely to be wasted compared  to fresh produce that spoils over time, giving consumers access to  affordable, nutritious food…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}]