[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…has accomplished with  geothermal energy since the 2010 Olympics. They have really had a plan  and strategy that is remarkable.\n\nCheck out a city in Europe called Szeged, in Hungary. That is Toledo,  Ohio's sister city for 40 years.\n\nThe good news is the Trump administration appears ready to posture  across America to draw forth geothermal power, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…mention, as I think about and reflect when I was first  elected to Congress, there was a Congressman from California named Tom  Lantos. He was a Holocaust survivor. He was from Hungary, and he was  imprisoned by Hitler. He used to come to the floor, and he fought so  hard for the fall of the Soviet Union and for liberty across Europe.\n\nI remember him and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…most virulent signs of the decline of  our democracy, at the risk of an authoritarian regime taking hold of  this country, are the attacks on our universities. We see this in  Hungary and elsewhere. When rulers start to attack the independence,  the academic freedom of our universities, it is a sure sign of a  democracy in trouble. When a President tries…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…progress was stunted.\n\nMr. Speaker, if we do not learn from our history, we are doomed to  repeat it. We are witnessing the same pattern repeating in our own  lifetime.\n\nIn Hungary, Viktor Orban has taken over universities, closed  independent institutions, and forced academic programs to shut down  when they contradict his political goals.\n\nIn Russia,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…agree  with it, but if it disagrees with you, then out it goes.\n\nThat is the way it is in Putin's Russia and in Kim Jong-un's North  Korea. That is the way it is in China, Hungary, and Iran. That is not  America.\n\nAmerica believes in something good and greater: free speech, free  thought, free practice of religion.\n\nWhen we silence American voices,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…greedily and happily waiting to fill the  gaps that this administration is deliberately creating.\n\nOn Monday, the United States joined Russia, North Korea, Belarus,  Sudan, and Hungary--I will name them again: Russia, North Korea,  Belarus, Sudan, and Hungary--a group of countries I never would like us  to be associated with, in voting against the United…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…frankly, chillingly, mirrors the tactics  that other leaders have used to transition real democracy into pretend,  fake democracy.\n\nIt always starts with journalists, from Hungary to Belarus, to  Venezuela--countries that have elections but elections where one party  just keeps on winning. These are places where journalists are subject  to a nonstop…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…It is not a story about anything that has  happened in this building. It is a story about a very humble Catholic  parish in Northside Richmond, VA, called St. Elizabeth of Hungary. It  is a humble parish. It is a small parish. It is slightly over 100 years  old. It is the church where my wife and I were married more than 40  years ago, where all three…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Congress, and we should be consulted.\n\nI have raised concerns about troubling patterns that we have seen  emerging in our country, patterns that echo tactics of regimes in  Hungary, North Korea, and Venezuela. These are not governments we  admire. Yet, this latest move fits that mold.\n\nThe Library of Congress is the world's largest library and a symbol…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691272/attacks-on-library-of-congress"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…demonize them, satanize them, take away their basic  freedoms, and even deny their very existence.\n\nIt is happening to gay people right now in Putin's Russia and in  Orban's Hungary. It is happening to Uyghurs and Tibetans in China. It  is happening to Christians and free-thinkers in Pakistan. It is  happening to Muslims in India. Now, it is happening…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Foundation (AHF) in New Brunswick, New Jersey as it  celebrates its 70th Anniversary this year. Since its incorporation in  1955, AHF has provided a cultural bridge between Hungary and the  Hungarian American community through history, arts, and tradition.\n\nIn 1989, AHF established the Hungarian Heritage Center. The Center  hosts a rich curation of historical…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Putin does not get to dictate who may or may not become a  member of the NATO alliance, just as his Soviet predecessors could not  stop the membership prospects of Poland or Hungary or Germany. To  preemptively surrender admission to NATO is national security  malpractice and only benefits Vladimir Putin.\n\nFinally, Secretary Hegseth declared that Europe…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Major General Coburn has more than 6,000 flight hours in the  T-37, T-38, C-141B, C-123, KC-135, C-17A, C-40, C-130H/J, including 279  combat hours in support of operations in Hungary, Iraq, and  Afghanistan.\n\nMajor General Coburn has been a close partner in improving our  Nation's tactical air mobility operations capability through  recapitalization of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "James Risch", "party": "Republican", "sentence": "…36(b)(5)(A), AECA)\n\n(i) Prospective Purchaser: NATO Support and Procurement       Agency (NSPA) as Lead Nation for Belgium) Czech Republic,       Denmark, Finland, Greece, Hungary, Italy, the Netherlands,       Norway, Poland, Portugal, Spain and the United Kingdom\n\n(ii) Sec. 36(b)(1), AECA Transmittal No.: 22-17; Date: June       22, 2022; Implementing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…France: 90; Germany: 62; Italy: 53; Poland: 44; Denmark: 43;       Spain: 35; Romania: 27; Netherlands: 25; Turkey: 15; Czech       Republic: 14; Norway: 10; Estonia: 9; Hungary: 7; Sweden: 5       (partner at the time); Latvia: 4; Slovakia: 3; Finland: 2       (partner at the time); Portugal: 2; Albania: 2; Belgium,       Bulgaria, Croatia, Lithuania,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]