[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…The budget would cut crucial programs for the poor and working  families. That is a fact. It is not being made up. It is right there.  It is going to take food away from hungry children. It will let people  die from the lack of healthcare coverage. They are even cutting, again,  trillions of dollars so that we can continue to fund a budget that  can't…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…farmers here in America who grow the corn, wheat, beans, and  peanuts. It is dairy farmers in Vermont who produce the powdered milk  that USAID uses to feed millions of hungry children in Africa, Central  America, and Asia.\n\nIt is American companies that manufacture the generators, water  pumps, trucks, and computers for USAID's programs, and American…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Illinois. Mr. Speaker, I rise in strong opposition and  can never vote for this big, bad, inhumane, and ugly bill because it  will wreck healthcare delivery. It takes food from hungry children. It  sentences seniors to early deaths. It eliminates jobs and destabilizes  our economy just to give the superrich and wealthy more influence, more  power, and more wealth.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…pro-life to take away  a newborn baby's healthcare. It is not pro-life to take away healthcare  from 65,000 children in my district. It is not pro-life to take away  food from hungry children.\n\nWe were promised that president Musk and the MAGA majority would  lower costs for the American people from day one. This does none of  that. Instead, they are trying…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…healthcare for 17  million Americans by gutting Medicaid and dismantling the Affordable  Care Act. It shuts down rural hospitals, it takes food away from more  than 4 million hungry children, it makes college more expensive  for families, and it ends clean energy investments to fight climate  chaos. All to make tax cuts permanent and help billionaires get…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…big, ugly bill, people  will die.\n\nIt is an all-out assault on healthcare and the largest cut to  Medicaid in American history. It also rips food out of the mouths of  hungry children, seniors, and veterans. All of this is being done to  provide massive tax breaks to billionaires.\n\nThen, Mr. Speaker, in this one big, ugly bill that has now been  signed…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Medicaid.\n\nUnder the GOP budget, over 136,000 of my constituents would lose  their healthcare, including over 42,000 children. This budget would  also take food away from hungry children and deny healthcare to sick  veterans.\n\nWhy are House Republicans pushing such an immoral and cruel agenda?\n\nIt is not to reduce our deficits. In fact, their budget adds…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688058/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…can no  longer afford lifesaving treatment. If my colleagues don't have the  courage to tell them to their face, then don't support this bill.\n\nThis bill takes food from hungry children. SNAP helps more than  775,000 Oregonians, 50 percent of whom are children, put food on the  table. This bill would lead to a significant reduction in food benefits  for…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that issue, Mr. Speaker, the one big,  ugly bill will rip nutritional benefits away from millions of  Americans, including children. It will rip food from the mouths of  hungry children, hungry veterans, and hungry seniors.\n\nThat is unacceptable. It is one of the reasons why we stand in strong  opposition, Mr. Speaker, to this one big, ugly bill.\n\nRepublicans…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…wealthiest Americans.\n\nIn an attempt to cover the cost of tax write-offs for private jets  and yachts and multiple houses, Republicans are cutting back on food  assistance for hungry children. I don't know how else you would  describe this, but for me I think it is cruel, ugly, and evil.\n\nMr. OLSZEWSKI. Mr. Speaker, I thank my colleague for her remarks  tonight.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…healthcare of the American people.\n\nEnough is enough. We need to reverse the damage that has been done,  not do more.\n\nThe big, ugly bill steals food from the mouths of hungry children,  seniors, and veterans. Why? Once again, it is to pay for massive tax  breaks to Republican billionaire donors. This is unacceptable and  unconscionable.\n\nThis motion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…eat.  We will make it harder for people to get the care that they need.\n\nThe President of the United States fought all the way to the Supreme  Court to keep from feeding hungry children with money that Congress  appropriated for that purpose in the event of a shutdown.\n\nWe passed legislation that will strip an estimated 17 million  Americans of their…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…of Somali ancestry. That is just a fact.\n\nNow, what these criminals did was they had three very elaborate  schemes. The first scheme was centered on supposedly feeding hungry  children in the Somali community. A group, a nonprofit run by some  people of Somali ancestry--the name of the nonprofit was ``Feeding Our  Future.'' Feeding Our Future went to…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…those who are watching on TV and for those listening, we have  gotten a steady diet of the same old, worn-out tactics: rich, poor,  divinity politics, taking food from hungry children. They haven't used  granny is going over the cliff yet, but I assume that is coming.\n\nMy question to my good friends on the other side is: Where were they  the last 4…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688063/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…give tax cuts to the biggest  corporations, as well, so they have to cut funding from low-income  college students trying to get ahead and steal food from the mouths of  hungry children, and that hurts our farmers and ranchers, too. These  are the hungry children that Ranking Member McGovern fights for every  day.\n\nMillions of Americans will suffer so…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…million in watershed conservation in Representative  Clark's district. It is a vote against Federal workers. It is a vote  against healthcare. It is a vote against feeding hungry children, and  it is a vote against common sense.\n\nThe material previously referred to by Mr. McGovern is as follows:\n\nAn Amendment to H. Res. 873 Offered by Mr. McGovern of Massachusetts…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]