[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…began with his birth to Dock and Willie Mae Rutledge.  He graduated from South Girard High School in Phenix City and furthered  his education at Alabama A&M University in Huntsville, Alabama.  Following his studies, Cliff served our country honorably in the United  States Army from 1950 to 1953 during the Korean Conflict.\n\nIt has been said that ``Education…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise today to honor a remarkable citizen,  Mr. David Cook of Huntsville, Alabama, on his well-deserved retirement  from Torch Technologies. Dave Cook's distinguished career is a powerful  testament to the American dream, and a lifetime dedicated…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Mr. Speaker, I am honored to present a Congressional  Veteran Commendation to a member of our greatest generation, retired  USAF Lieutenant Colonel Charles H. Wagamon, of Huntsville, Texas. Lt.  Colonel Wagamon served as a Captain, Bombadier and Navigator flying in  B-25 Mitchell Bombers with the U.S. Army Air Corps during World War II.  His servant's…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…historic importance for our Nation's security and for the people of  north Alabama: the decision to base the United States Space Command  headquarters at Redstone Arsenal in Huntsville, Alabama.\n\nFor more than 60 years, our community has been at the heart of the  American space story. North Alabama has been at the forefront of  innovation, from the rockets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I am honored to present retired USMC  Colonel John Battista Airola, of Huntsville, Texas, with a  Congressional Veteran Commendation. His servant's life reflects the  hard work and dedication that exemplifies the best of our Nation's  values.\n\nColonel…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…core mission and ensures that  our dedicated FBI agents are back in the field and out of the beltway.  There is no better place to achieve this than the FBI Redstone in  Huntsville, Alabama. We are making America safe and secure again.\n\nThis is a responsible bill that supports law enforcement, strengthens  national security, and puts America first.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be RTX Corporation, located       in Waltham, MA, and Huntsville, AL; Lockheed Martin, located       in Bethesda, MA, and Huntsville, AL; LEIDOS, Inc., located in       Reston, VA, and Huntsville, AL; and KBR, located in Houston,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699127/arms-sales-notification"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise to celebrate the 23rd anniversary of  an exceptional U.S. Army entity at Redstone Arsenal in Huntsville,  Alabama, the prototype integration facility, also known as the PIF.\n\nI would be remiss if I didn't mention this facility is named after  Dr. Larry O. Daniel, the beloved…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691922/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I am honored to present Richard Reagan  Horn, of Huntsville, Texas, with a Congressional Veteran Commendation.  His servant's life reflects the hard work and dedication that  exemplifies the best of our Nation's values.\n\nRichard entered…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}]