[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…more money instead of  holding on to some sense of morality, you feel angry. Resources may be  in short supply for American families right now, but there is more than  enough hurt and anger to go around. This administration is hurting  Americans--the ones who voted for this President and Americans who  didn't. They are hurting Americans who didn't vote…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…question of whether you are going to win, it is will you take a  principled stand. That is what the times require, a principled stand.  Yes, there may be consequences. Don't hurt anyone. Don't destroy any  property. Get in the way, as the Honorable John Lewis put it, whom I  got to know well. Yes, get in the way. You may get in the way, and you  may…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Caucus,  62 members strong, we have never been stronger. We represent the dreams  of our ancestors, and those dreams are in danger by this  administration's hateful policies that hurt Black people nationwide.\n\nOur hard-fought progress is threatened by the racist agenda pushed  forward by this administration, but we will not back down. In the words  of the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…rule with language to abrogate their  constitutional authority to rein him in. I watched them flip the votes  on the floor as they gave away our constitutional authority to hurt  American workers.\n\nLong-term unemployment is reaching heights we haven't even seen since  the beginning of the pandemic. Grocery prices are more expensive than  they have ever…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…promise to  ``break up and downsize'' and privatize portions of NOAA, including the  National Weather Service. Destroying NOAA in this way would be an  enormous blunder that would hurt our economy, hamper innovation, and  increase the risks to American lives and property.\n\nThe fact is that NOAA accounts for just one-tenth of 1 percent of the  Federal budget.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…at a return-to-office mandate after years of       telework, rapid policy changes, and frustration with how the       Trump administration is treating federal employees have hurt       morale to the point that people aren't giving their all to       the job.\n\n``When you're facing threats yourself, it kind of prevents       you from being totally there…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…safer, and more accessible State and  local projects.\n\nUnder this bill, communities of all sizes will end up with dirtier  water and be left with the cost of cleanup. This will hurt rural  communities and minority communities. It will hurt them especially  hard, as well as other communities struggling financially under the  policies of the current administration.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…the  United States, in our country, that allows the President to directly  select local judges. This is an outrageous attempt to take away power  from 700,000 residents and to hurt our independent judiciary system  here in the District.\n\nThis bill is not about safety. It is not about the Constitution. It  has nothing to do with Federal Circuit court judges.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695613/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that they are literally grabbing anyone and everyone they  set their eyes on. What is their accent? What is their color? Where are  they located? And ICE does not care who gets hurt in the process.\n\nWilmer Chavarria is a U.S. citizen, and he is the superintendent in  the Winooski School District in Vermont. He was detained and questioned  for hours by agents…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…healthcare breakthroughs, fortified  our national defense, and reinforced our leadership in the world.\n\nMake no mistake, these firings and cuts to science and innovation  will hurt every single American. They will make us less safe, less  healthy, and less prosperous.\n\nI have the honor of representing in northern Virginia one of the most  scientifically…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…districts and States. We have successfully fought back  against attempts to muzzle its experts, and we will continue to fight  back and win.\n\nLet me be clear: Defunding NOAA will hurt Oregonians, Americans, and  people across this country. It puts the lives of fishers and their  crews at risk. It leaves towns without early warning. It undermines  economies…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…there? No way. They have derailed  management of our public lands, and now they want to do it to prop up  coal. Oregonians see this for what it is--a gobsmacking attempt to hurt  American families just to score points with campaign folks they have  been close to.\n\nNow, the United States is barreling toward a self-inflicted energy  crisis manufactured…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…witnessed the golden age of America. We have witnessed a rotten  age.\n\nThey are crashing the economy in real time, driving us toward a  Republican recession that is going to hurt children, hurt families,  hurt seniors, hurt everyday Americans, hurt veterans, and hurt people  across the land.\n\nRepublicans haven't done anything to address the high cost…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…biggest gouge ever by the scoundrels of the fossil fuel  industry, and now we are opening the door for this to happen across all  industries.\n\nAmerican families are going to be hurt, and they are going to be hurt  hard. And it just puts revenues on the books that the Republicans can  then use to go and do what they really want to do here, which is to  make…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…license.\n\nThis bill goes far beyond even this very stringent current law by  making permanent resident green card holders deportable for a single  infraction even where no one is hurt and no property is damaged. This  will lead to some very harsh results.\n\nIn Arizona, sleeping in your car while drunk without even starting  the car can get you convicted of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…is in China, whether  we see it in Russia, or certainly in Iran.\n\nIran has chosen to not only take their horrific, genocidal, lunatic  policies to kill their own people, to hurt women, and to hurt people  who won't abide by their radical Islamic faiths, but they have done it  to other people around the world. They are the leading sponsor of  terrorism…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…unfunded, putting undue stress on our military families, and causing  further instability to the United States economy.\n\nShutdowns are never the answer. They don't work. They only hurt the  American people.\n\nToday, lawmakers in this Chamber have an opportunity to avoid  repeating past mistakes. I encourage everyone on both sides of the  aisle to do the right…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…She had lost her phone. When  they called the MPD to come take a police report, the response was: You  will have to come down to the station because unless you are actually  hurt yourself, we don't have the officers to go out and actually go to  you. You have to come to us. That is just not right. That is an example  of a completely understaffed police…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…oftentimes are small mom-and-pop operations. It is hard to think of oil  and natural gas that way, but that is the way it is in those regions.  They say this will, in fact, hurt them and this is disastrous.\n\nI suspect, Mr. Speaker, the reason that we have this dichotomy, this  difference, is that a lot of times bigger institutions, bigger  organizations,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…them to cover nothing because  they never used it.\n\nThe percentage of people who weren't using their health insurance  went up significantly. It wasn't like people were getting hurt or sick  at a similar rate. What was happening was they didn't know they were in  the system. As part of the GAO study will explain, they were getting  signed up.\n\nThe last…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Hotline under its Office of Advocacy. This hotline gives small  businesses a seat at the table to highlight the prohibitive red tape  regulations from across Federal agencies that hurt their ability to  grow and compete.\n\nMy bill takes that progress further. It codifies the hotline into law  and requires annual reports to Congress so that we know exactly which…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone. I found $3.3 trillion of savings and not a single  cosponsor in Congress.\n\nI am going to try to do this next little section here. I don't want  to be a jerk. I am going to hurt some people's feelings. The math is  important. Why the math is important is because there are solutions.  The reason I am doing this is, I think it was Monday or Tuesday, I…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…home, don't buy into the  fear-mongering that the Democrats are selling. This resolution is about  protecting American jobs and keeping an eye on costs for everyone. It  won't hurt the environment at all. It just reverses a burdensome rule  that does more harm than good.\n\nMr. Speaker, I am proud to stand with Chairman Griffith in support of  this resolution.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and walk-in coolers.\n\nTo my colleagues on the other side, these may seem like small issues  to you, but driving up the cost of appliances is a regressive approach  that will hurt low-and middle-income Americans the most. Regulating  every possible square inch of the economy in the name of your zealous  green radicalism may give the coastal elites a sense…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…assistance cliff? It is  easy. Pass the clean, bipartisan continuing resolution. Democrats  should vote for it immediately. Until then, the Schumer  shutdown is going to continue to hurt struggling families. Therefore, I  object.", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…2023, due to  complications from TB.\n\nI was proud to have Shandra's family here last year when this  legislation was first considered by the House. This family has been  forever hurt by the loss of Shandra. Her daughter, Amber, said: Nothing  can erase the heartbreak of my mother's passing, but she would be proud  that we have helped make a positive difference…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692764/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and our law  enforcement were being attacked, when they defunded the police in  Austin, Texas, as the radical city council did there, then real people  suffer. Americans get hurt, and the American Dream dies.\n\nThe suspect that I talked about with the brutal stabbing in North  Carolina was 34 years old with a history of mental illness and a long  rap…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, we are nearing 1 week since the end of  the needless, 43-day-long Democrat government shutdown. That shutdown  was a monumental waste of time that hurt a lot of people across the  country.\n\nI am grateful that the families in eastern Washington can now breathe  easier knowing their paychecks, benefits, and livelihoods are no…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…have gone too far and cast this huge net  and said you can't buy any ivory products anywhere, including Alaska  Native products from Alaska walrus harvesting.\n\nThis really has hurt my State. People coming up from States that have  banned all ivory say: I can't take that home. I can't buy it. Sorry.\n\nSo this is a simple, simple bill. You know, if a visitor…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…greatest adversary, and it seeks to harm our  country on a daily basis. It thrives in the shadows. It uses fentanyl  precursors, predatory trade practices, and cyberattacks to hurt us.\n\nChina also uses informational warfare, and it would love to influence  what American students learn in classrooms, from kindergarten through  college.\n\nThe CCP uses our…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}]