[{"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…celebrated in the city of Waterbury and throughout the State of  Connecticut.\n\nTo say that her living spirit will be missed by all who knew her is  an understatement. I pray for her husband, Gene, and the family. Joyce  will surely be missed. May Poochie rest well. She has earned it.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698559/recognizing-joyce-reid-coleman"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…on.\n\nInstead of supporting domestic manufacturing, these trade policies  are making future American manufacturing more expensive. Furthermore,  they are threatening jobs.\n\nMy husband and I started out our married life owning and operating a  small business. I know the hardest part of small businesses is growing  and sustaining those businesses when you…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…with the chaos that has  ensued, we are still hearing from people about healthcare all the time.\n\nNicci from Waseca wrote to me that the healthcare premium for her and  her husband almost tripled from $862 a month to $2,344, which, over the  course of the year, is more than her annual salary. She called the  increase ``insufferable.''\n\nNadine from Sartell,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…carrying on a  tradition and farming skill he acquired throughout his life, along with  the woman who loved and cared for him deeply.\n\nThe story of Dorothy and her family, her husband Carman, her  daughters, Linda, Patty, and Karen, is a story of love for the ages  captured with eloquence by her grandson, Sam Iacobellis.\n\nThank you all for being here today…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…games, baby showers and more, to  celebrate the survivors who he cares so deeply for. He even walked one  of the people he supported down the aisle at her wedding. In fact, my  husband and I met Jerry when we hired him to secure our wedding when  MAGA protesters threatened our very precious and sacred event.\n\nJerry has always put the people of our community…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…was a tireless advocate for the South Shore of Nassau County  on Long Island and a fearless champion in the fight against gun  violence. After the heartbreaking loss of her husband and the injuring  of her son in a horrific shooting, Carolyn could have retreated into  grief, but instead she chose action.\n\nShe ran for Congress as a mother, a nurse, and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Celebrating the Life of William ``Bill'' J. Darah, Jr.\n\nMs. KAPTUR. Mr. Speaker, I rise to celebrate the life of William  ``Bill'' J. Darah, Jr., of northwest Ohio, a husband, father,  grandfather, and Toledo businessman.\n\nBill Darah embodied the American Dream through hard work, integrity,  and devotion to family. For more than four decades, this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…provide for their children.\n\nIn my district, Massachusetts-07, my Chelsea constituent Kenia and  her three children were driving to a Mother's Day church service with  her husband, Daniel, when ICE agents in unmarked vehicles ambushed  them, broke the passenger side window, forcefully extracted Daniel from  the car, and slammed his face on the hot sidewalk…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…school board  meetings and Muskegon Heights City Council meetings.\n\nRillastine Wilkins shattered glass ceilings, becoming the first  female city  councilmember in 1974. Her husband, who went by the nickname Peaches,  accompanied her to every single council meeting to prevent the male  councilmembers from harassing or intimidating her.\n\nIn 1999, she was…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…was also a leader  in her church and her community.\n\nNo one was more familiar with Mrs. Freida's, beautiful soul than her  family. She was a loving wife of 52 years to her husband, Chief Master  Sergeant Jackie T.L. Dority. She lovingly raised her daughter, Alisha;  adopted son, Eric; and numerous foster children over the years. She was  a nurturing…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693379/mourning-the-loss-of-mrs-freida-b-dority"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…forced to live in a more restrictive       setting.\n\nSandra writes:\n\nMedicaid has allowed my son's needs to be met at home and       not in a group home. It has allowed my husband to participate       in his caregiving, not a stranger. It has allowed him to be       employed with the aid of a job coach.\n\nThese are just a few things, in addition to healthcare,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…United  States. There is no place like it on Earth, and once it is destroyed,  it will be gone forever.\n\nLike many Minnesotans, people around the country and the world, my  husband and I have paddled and camped with our kids on the Boundary  Waters every year since they were small. We share magical and life- changing memories from our adventures there…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…can afford it, but that  affordability does come at a cost. Between paying for their premiums,  their son's college tuition, and caring for her disabled sister,  Deborah's husband, a dedicated public defender, now works weekends just  to keep up.\n\nAs Deborah told me: Even work you love shouldn't require you to give  up every day of your life just to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…any coverage. At the  time, I was dealing with a myriad of health issues and would eventually  be diagnosed with multiple chronic illnesses.\n\n``Because of the ACA, when my husband and I were married, I was able  to be added to his insurance without being denied due to preexisting  conditions. Prior to the act being passed, I was denied coverage and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…of  the ACA tax credits.\n\nI met Shadene Butchart in Chicago. She has ALS. Since the ACA tax  credits have expired, her health insurance premium consumes the  entirety of her husband's Social Security check. She will not be able  to afford any health insurance to cover this incredibly distressing  disease.\n\nI rise strongly in support, and I urge my colleagues…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698805/breaking-the-gridlock-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…center includes a state-of-the-art, fully digital campus  that serves as a thriving international body.\n\nThroughout his accomplishments, Judge Ginn has remained a devoted  husband, a devoted father, and a devoted grandfather. He and his wife,  Lynn, have been married for over 40 years and have raised four  daughters, three sons-in-law, and five grandchildren,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…of Representatives. We lost a friend and a colleague.  His northern Californian constituents lost their tireless advocate in  the House.\n\nMost tragically, his family lost a husband, a father, and a  grandfather.\n\nDoug was a proud family man. He and his wife, Jill, have four  beautiful children. He just recently became a grandfather.\n\nDoug was a fourth-generation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, 9 days ago in my district, a loving  husband and father of two children, a public figure who debated  vigorously conservative values and a representative for free speech,  was assassinated by a deranged coward who felt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695808/what-i-learned-from-charlie-kirk"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…company in 1950,  operating the business out of a back room in their house. Eventually,  when the time came for them to retire, they sold the business to their  daughter and her husband, who in turn sold it to their children. Now  more than seven decades later, Andy and his siblings are the third- generation owners of Manda Machine Company. Now, if that is…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "John Carter", "party": "Republican", "sentence": "…founding member of American Legion Post  911 in Cedar Park, raising funds for the Gold Star Monument and  supporting Boys and Girls State programs. Commander Lux is a devoted  husband to his wife, Michelle, and a proud father to their two  children.\n\nI commend Commander Lux's dedication to his community and our Nation.  I join his colleagues, family, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…his       wife, Yvette Hoffman;\n\nWhereas the gunman then entered the home of Minnesota State       House Speaker Emerita Melissa Hortman and assassinated her       and her husband Mark Hortman;\n\nWhereas the gunman had documents that listed dozens of       lawmakers targeted for assassination;\n\nWhereas the law enforcement officers of Brooklyn Park and…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…who I call  my honorary mother, a remarkable Nebraskan who is celebrating her 90th  birthday this week.\n\nBeth represents the spirit of our district. After the passing of her  husband, Ken, she chose not to slow down but to keep moving forward  with a purpose. She returned to the classroom, pursued her long-held  interest in law, and earned a degree with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…forms of political violence.\n\nEarlier this month, a deranged gunman shocked the State of Minnesota  and this entire Nation by murdering Speaker Emerita Melissa Hortman and  her husband, Mark, and attempting to kill State Senator John Hoffman  and his wife, Yvette.\n\nI am absolutely devastated by this terrifying act of violence. While  I didn't know Melissa…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…quiet strength.\n\nHelen graduated from Trenton High School, in Trenton, New Jersey.  Later, she made her home and spent much of her life in Ewing, New  Jersey after marrying her husband, Ken Birkhead. Ken was a United  States Navy veteran who went on to serve as an Ewing Township Police  Officer and work in construction. As a devoted homemaker, Helen created…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694743/recognizing-helen-birkheads-100th-birthday"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Oslene came to this  country chasing a dream, not for herself, but for her future children.  She moved to Green Cove Springs in the great state of Florida, where  she met her husband, Alix.\n\nFor 35 years, she built a life, raised six incredible children, and  poured her heart into her community. Yet through it all, she nurtured  the quiet fire within--a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…deep respect for the  land and livestock, learning the ranching lifestyle through hard work  alongside her parents.\n\nIn 1985, she married her high school sweetheart and late husband,  Paul Mazak. Based in Sumter County and starting with just seven acres  and a mobile home, they built both a ranch and a family--raising two  daughters, Rebecca and Audra--while…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…at  lower income people. The developers are incentivized to make these  projects as nice as possible.\n\nI had a staffer who got married in Wisconsin. They said, ``Glenn, my  husband and I are looking for a place to live after we get married, and  the nicest places are all low-income housing.'' That doesn't seem to  make any sense, unless you look at it…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…to the Blauvelt  Volunteer Fire Company, serving as president, chief on three occasions,  and an active board member, being awarded life membership in 2019.\n\nHe was a loving husband to his wife, Lisa, for 32 years; a devoted  friend; and a man who consistently put others before himself. I extend  my deepest condolences to his family, his fellow firefighters,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…what she thought about the speech and what she  thought about Pell grants, which were, like I said, a grant conditioned  upon having low income.\n\nShe said that her and her husband got married before they had  children, but she told me none of her friends were getting married.  They got free college.\n\nI have heard that from other people. That is just…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…downhill and was hit by a tree  careening in the fast-moving water.\n\nShe served more than 17 years with the Madison County Sheriff's  Office. Major Quintero is survived by her husband, who also works in  law enforcement, and she is survived by her two children, both of whom  work for the Madison County Sheriff's Office.\n\nLate December of last year, on the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}]