[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Act is a law,  and it says that all points of order are waived during a CRA  resolution. And that is what we are debating right now, an actual CRA  resolution relating to hydrogen fuel.\n\nI oppose this particular resolution, but at least it is following the  law and Senate procedure. But what is about to happen is going to be  against the law and against…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…they can from  what is within their jurisdiction. We are investing in R&D into cleaner  locomotives. We are investing in port electrification. We are making  breakthroughs in hydrogen marine technologies like the first hydrogen  fuel cell ferry in the United States.\n\nBut despite all this progress, despite all this innovation, despite  all this investment,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…administration have moved us in  the wrong direction.\n\nIn northwest Indiana, two major energy projects that would have  increased supply and lowered costs were canceled. An $8 billion  hydrogen project at the BP refinery in Whiting supported by labor,  industry, the State, higher education partners, and the Federal  Government were halted. An $18 million alternative…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…programs that lower energy  bills for working families, create good-paying jobs in our communities,  and keep America competitive.\n\nThis bill revokes funding that supports hydrogen energy, batten,  recycling, and energy improvements in public schools, as well as  support for public-private clean energy projects.\n\nTheir bill undermines the very programs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…dumps, including in countries like ours, and diverts  production in order to get in here through the back door.\n\nShockingly, Vice President Vance himself helped cancel this hydrogen- based modern steel project in his own hometown of Middletown, Ohio.\n\nOur Ohio community knows that China produces way too much steel and  knows exactly how to wipe out elements…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…discovery so our  National Labs can keep doing the cutting-edge work that we all rely on.  It rejects Trump's proposal to gut clean energy funding; zero out  solar, wind, and hydrogen research programs; and eliminate several  independent Agencies that support economic development in the country.\n\nNow, throughout these bills, I was very happy to work with…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…administration is  also attacking renewables, a fast-growing private-sector employer in  New York State. That is not just in my district. In Representative  Stefanik's district, a hydrogen fuel cell plant was not going to be  completed by the same company that was going to build in California and  Texas.\n\nIt is not about a red State or a blue State. It is about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…and from  landfills; that we said yes to wind and solar; that we said yes to  nuclear and yes to geothermal; that we said yes to investing in  emerging technologies, like hydrogen, like carbon capture, and like the  carbon dioxide removal bill that I have with my friend Lisa Murkowski  from Alaska, which just goes to show you that you can have a bipartisan…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…One of the proudest moments in  my career was standing alongside Dr. Richard Garwin, who, as  Representative McGovern mentioned, was often pointed to as the father  of the hydrogen bomb and a strong advocate for nuclear  nonproliferation. He stood by my side, along with Energy Secretary Dr.  Ernest Moniz, as I announced my support for the Iran nuclear…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…result of the harmful and reckless  policies of this President and Republicans in Congress. They have  canceled billions of dollars in investments for our State, including  the hydrogen hub that would expand research and development of hydrogen  fuel, bolster American energy dominance, and bring nearly 10,000 jobs  to the region.\n\nThey have created chaos…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…can do carbon capture and storage.\n\nThis is a way to take current coal technologies and make them cleaner  and more useful--canceled; enhancing energy resilience--canceled;  hydrogen deployment--canceled; reducing data center load impacts-- canceled; methane reduction--canceled; other projects to do carbon  capture and storage--canceled.\n\nThe President…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…energy production means  lower prices.\n\nIt is deeply disappointing that this measure follows the  administration's lead to abandon the transformational projects like the  hydrogen hub in my district. Industry, the USW, the building trades,  other labor organizations, along with communities throughout my  district, were planning for and relying on massive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694858/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…position of moral  courage, he paid a political price.\n\nMr. Speaker, 2 months ago, Dr. Richard Garwin passed away at the age  of 97. He is best known as the author of the first hydrogen bomb. Less  widely known is that he spent decades working tirelessly in arms  control and disarmament, as well as scientific panels, conferences, and  government boards.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…order that there be competition  not reliance on dirty crude. That day should be over. That means  continuing progress on renewable energy systems like modern nuclear,  green hydrogen, fusion, biofuels, solar, hydroelectric, geothermal, and  capturing thermal waste heat. Though the President does not like wind  power, in some remote and coastal locations…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Bodman, he inherited Secretary Abraham's unrealistic  promise, and he failed to address the fundamental technical problems  emerging at the waste treatment plant--problems with hydrogen gas  build-up, pulse jet mixing, nuclear critical risk, and identified  during his tenure, but not adequately addressed--creating a legacy of,  really, technical debt that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}]