[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1948, as amended, bipartisan  legislation to assist the U.S. section of the International Boundary  and Water Commission, or IBWC, in carrying out its critical water- related missions.\n\nThis bill allows IBWC to accept contributed funds from other Federal  and State agencies, giving the Commission the authority…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692168/international-boundary-and-water-commission-authority"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. Chairman, my amendment includes the language from my  bill, H.R. 1948, allowing the International Boundary and Water  Commission, or IBWC, to accept up to $5 million per year from other  Federal agencies or outside entities, such as cities, States, and  nonprofit organizations, for wastewater treatment and flood-control…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, my bill, H.R. 1948, allows the International Boundary  and Water Commission, or IBWC, to accept up to $5 million per year from  other Federal agencies or outside entities like cities, States, and  nonprofit organizations for wastewater treatment and flood control…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692166/international-boundary-and-water-commission-authority"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Act (42 U.S.C. 19237).\n\nMr. EZELL.  1948, as amended.\n\nMr. Speaker, H.R. 1948 would allow the United States section of the  International Boundary and Water Commission, or IBWC, to receive  additional funding from other Federal and non-Federal partners to  support water and wastewater infrastructure.\n\nThe IBWC is already authorized to receive funds…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692167/international-boundary-and-water-commission-authority"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…the  amendment No. 8 offered by my colleague from California (Mr. Peters),  as it would allow the United States section of the International  Boundary and Water Commission, or IBWC as they call it, to receive  additional funding from other Federal and non-Federal partners to  support water and wastewater infrastructure.\n\nThis amendment will give the IBWC…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}]