[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Clarke).\n\nMs. CLARKE of New York. Mr. Speaker, I thank the gentleman from New  York, Mr. Adriano Espaillat, for yielding.\n\nMr. Speaker, I rise on this day in opposition to ICE, CBP, and any  others that are added to this Federal militia that is supposed to be  part of the administration of immigration in the United States of  America. I also rise in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Good and Alex Pretti. What is  endangering the American people's safety and security is an out-of- control administration that has empowered a mass paramilitary force of  ICE and CBP agents to act with impunity, without accountability,  without oversight, and without consequences.\n\nIf we truly want to talk about public safety, then we need to be  talking…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…outrageous overreach on immigration that is tearing  families apart in my district and around the country.\n\nSince taking office, Trump has declared war on our communities.  Masked ICE and CBP thugs--I call them thugs because they don't identify  themselves. In our State, police officers, law enforcement, always  identify themselves. They have detained parents…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…suffered at  the hands of their own government--everyday Americans just like all of  us coming here to tell us how they were stopped, assaulted, detained,  and brutalized by ICE and CBP agents. It was one of the most moving  experiences of my time in the U.S. Senate, not only because of the  words and the facts that they conveyed but because of their raw…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…Minneapolis, sparking widespread  protests and intensifying scrutiny of Federal tactics.\n\nLast year was the deadliest year in over 20 years, with over 56  people dying under ICE and CBP custody in detention centers. Reports of  detainees like Luis Beltran Yanez-Cruz, who died in a hospital in my  district after complaining for days of chest pain without…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…five critical funding bills that we all  overwhelmingly agree on and prevent a serious shutdown. Secondly, split  off the DHS bill so we can negotiate reforms to rein in ICE and the  CBP. It is what the vast majority of Americans want Congress to do.\n\nIt is good news that we have a deal to fund these key programs that  families count on while work continues…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699437/consolidated-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…included in these bills win apply equally to all       persons, including individuals convicted of serious violent       crimes.\n\nFederal law enforcement entities, such as ICE and CBP,       already widely employ such devices, and have entered into       procurement contracts worth over $35 million for Taser       systems in just the last few years, including…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I rise in vehement opposition to giving one  more red cent to ICE and CBP until we see accountability and reforms in  this DHS funding bill. Under Secretary Noem's and President Trump's  action, ICE and CBP have turned from law enforcement agencies…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699357/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…of the other  Americans in this Nation.\n\nThere are things that this administration can do today to restore  that sense of safety and security. For instance, they can pull ICE and  CBP agents out of their operations in Minnesota and in Maine and  deescalate the fear that American communities are facing. The  provocations are dangerous right now and the…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…with  regard to Homeland Security. We would have had the bill passed; except  we will have lost all of the Democratic priorities I have laid out.\n\nI have no illusions about ICE and CBP. We must rein in these rogue  agencies. We need to protect our communities. We need to protect the  people and the children in our communities. We must have accountability…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…independent investigations into the killings of Renee Good and Alex  Pretti, and of other abuse and misconduct by DHS agents. We must  institute changes for the conduct of ICE and CBP agents, including  restrictions on their use of force, mandating the use of judicial  warrants for searches, and an end to the use of roving patrols and  racial profiling.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…don't agree with them, and that was before Donald Trump and the  Republicans passed the one big, beautiful bill. That included a $175  billion slush fund that would turn ICE and CBP into its own personal  national police force, where he could send it wherever he wants,  whenever he wants, without any accountability.\n\nThat is dangerous. That is a threat…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…have long called for  it to be shut down.\n\nYet, we must look for ways to press our case even more forcefully.  Just yesterday, I voted against more blank-check funding for ICE and  CBP. No accountability and no reform equals no taxpayer money.\n\nI call on every Member of this body to hear the cries of communities  from coast to coast: Impeach Kristi Noem,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699661/horrific-ice-abuses"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…to be part of the DHS funding bill.\n\nWe pushed hard to force Republicans to join us at the table on this  because it is plain as day to Americans across the country that ICE and  CBP have gotten out of control. We have seen with our own eyes how  citizens and peaceful protestors and legal observers are being not just  harassed but assaulted and detained…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I thank the gentleman from  Massachusetts for yielding time.\n\nMr. Speaker, Congress must not give ICE or CBP another dollar while  they are killing Americans in our streets. We must protect our  communities by demanding real change first. This is what our  constituents elected us…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699595/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]