[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Speaker, 2025 was the deadliest year for ICE detention in two  decades with 37 total deaths.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Secretary Noem has denied me and  other Members of Congress oversight of ICE detention facilities.", "title": "Impeach Secretary Noem", "date": "2026-01-13"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "For the first time in our history, more than 70,000  people are in ICE detention.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-11"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Last week, I visited the Tacoma, Washington, ICE detention facility  to visit constituents and to conduct oversight.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Instead, she is locked up in an ICE detention center in Louisiana,  facing possible deportation to Russia.", "title": "Sounding the Alarm on A Crisis Threatening America's Future", "date": "2025-06-10"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "I saw clips of people and heard their testimony, people who were  dragged out of cars, people who were citizens but were still arrested  anyway and taken to the ICE detention center and not released for  hours, people who were denied the right to call for an attorney, people  who were denied the basic constitutional rights that my colleague from  Virginia was talking about.", "title": "Building A Beloved Community", "date": "2026-01-20"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "He has been in  ICE detention for the past month, separated from his family and  friends.", "title": "Ice is Out of Control", "date": null}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Let me say what they did to Silverio, what they did to Marimar, to  Keith, to Renee, to Alex, what they did to Illinois resident Nenko  Gantchev in an ICE detention center.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "We increase funding for the  Office of Inspector General, specifically for oversight of ICE  detention facilities.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Just last year alone, 32 people died in ICE detention, including Jean  Wilson Brutus, who had been detained at Delaney Hall in Newark, New  Jersey.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Masked agents are roaming our streets, and reports of human  rights abuses at ICE detention facilities are growing.", "title": "Providing for Consideration of H.R. Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year and Providing for Consideration of H.R. Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Aliens  determined to require detention are transferred to an ICE detention  facility pending removal or the outcome of their removal proceedings.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "That is why a lot of us, including yours truly, were  going to those ICE detention centers in my district for the last 2  weeks.", "title": "Special Interest Alien Reporting Act of 2025", "date": "2025-06-26"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "When they learned of her status, they stripped her of her green  card and threw her into ICE detention without another thought.", "title": "Pushing Back Against Ice's Authoritarian Overreach", "date": "2025-07-23"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "As Federal District Court Judge Biery said in his order, this  weekend, requiring the release of Liam Ramos from ICE detention,  ``Observing human behavior confirms that for some among us, the  perfidious lust for unbridled power and the imposition of cruelty in  its quest know no bounds and are bereft of human decency.", "title": "Department of Homeland Security", "date": "2026-02-02"}]