[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…The DISCLOSE Act also makes it harder for billionaires  and others to hide their contributions by ending the use of transfers  between organizations in order to cloak the identity of donors. It  requires organizations that spend money on political activities to  disclose the true owner.\n\nThe Freedom to Vote Act also includes my Honest Ads Act, bipartisan…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…month, most       were sent to their deaths. Luckily, my mother was warned by a       sympathetic policeman. Immediately she went into hiding. She       then obtained forged identity papers and, with the help of a       smuggler, set out to cross the border from Nazi-occupied       northern France into French-controlled southern France--so-      called…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…intersection of memory and place,  weaving together Rochester's histories with the lived experiences of  its people. His work reflects on how communities preserve memory,  identity, and family history, often drawing inspiration from our city's  legacy as the birthplace of modern photography through Kodak Park.\n\nBeyond his artistic practice, Jason manages…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…therefore, should be eliminated  is the wrong conclusion. It is an outsized, collective punishment to  her. And what did she do wrong?\n\nWe don't punish seniors when their identity is stolen. We punish the  grifters who did it, and the same things are true when it comes to  fraud. Let's hold those accountable for it--strictly accountable.  Raising premiums…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Brown, the ``Godfather of Go-Go,'' is beloved by D.C. for his  innovative and unique sound, which gave us go-go music. Go-go is the  beat of D.C., giving D.C. its own musical identity and reminding the  Nation that D.C. has always been the hometown of talented artists.  Chuck Brown was a strong supporter of D.C. statehood, including playing  a concert on…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692742/introduction-of-a-bill-to-designate-the-facility-of-the-united-states-postal-service-located-at-3401-12th-street-northeast-in-washington-district-of-columbia-as-the-chuck-brown-post-office"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…military families. In our State, service isn't abstract. It is  personal. We see every single day what honor, discipline, and sacrifice  looks like regardless of someone's gender identity.\n\nThese individuals met the same rigorous standards as their peers, the  same physical exams, screenings, and background checks; and in many  cases, under intense scrutiny,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that       millions of deceased people were receiving benefits. Then       came new       mandates designed to address alleged fraud: Direct-deposit       transactions and identity authentication, operations that       affect almost everyone receiving benefits, will no longer be       able to be done by phone. Customers with computers will go       through…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I certainly support H.R. 5345, the Improving Social Security's  Service to Victims of Identity Theft Act, and of course, this passed  the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and Nina O'Brien for competing and making Vermont proud.\n\nThe Winter Games are a reminder of why our winter sports and outdoor  recreation communities are so vital to the identity and economy of our  State. Vermont's ski areas, trails, and training programs are not only  excellent athletic institutions, but they are also the reason  generations of young…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700207/recognizing-vermont-olympians-and-medal-winners"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…says that if they are guilty of  such reckless misconduct, they can be sued for it and held civilly  liable for the damages.\n\nImagine losing control of your own likeness and identity. Imagine  that happening to you when you are in high school. Imagine how  powerless victims feel when they cannot remove illicit conduct, cannot  prevent it from being reproduced…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…clear words about how we are on the  brink, if not through the door, of a constitutional crisis, of an  economic, of a political, of a moral crisis, and a crisis of the very  identity of this country.\n\nIt is often said that when America has a cold, Black America has  pneumonia. Let me tell you something. We are all up in urgent care and  in the community…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…extreme criteria. Married women or others whose name doesn't  match their birth certificate would be required to present a passport  with their current name to prove their identity and citizenship. In  states like Minnesota with same-day registration, all new registrants,  and those updating their registration as the result of a move or a name  change,…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…discomfort they cause to those who wish to ignore the brutal realities  of race in America.\n\nThese bans are not merely an affront to academic freedom; they are an  assault on Black identity and an attempt to stifle the critical  conversations necessary for a truly inclusive society.\n\nMoreover, the policies that aim to ban discussions of race and racism  in the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…been the personal target of anti-Semitism over the  past year, and sadly, one-third of Jewish college students felt  uncomfortable or unsafe on campus due to their Jewish identity.\n\nWhile we must take steps to protect Jewish students on college  campuses, we cannot allow anti-Semitism to be used as a vehicle to take  away the rights of others. Make…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…DINGELL. Mr. Speaker, I rise today in strong support of S. 2878.\n\nThe Great Lakes aren't just a part of Michigan and the heartland's  landscape. They are part of our economy, our identity, and our  heritage. They are more than 20 percent of the world's freshwater and  must be protected.\n\nThey provide drinking water to millions. They are home to a thriving…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…to expose an individual to       public contempt or obloquy, or will represent a clearly       unwarranted invasion of the privacy of an individual;\n\n(d) will disclose the identity of any informer or law       enforcement agent or will disclose any information relating       to the investigation or prosecution of a criminal offense       that is required…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…standard for the world  because they were very hard to cheat in. Essential components of this  process were 30-day registration, in-person election day voting, and  proof of identity.\n\nIn recent years, in many States, the woke left has torn down these  safeguards. Mail-in ballots where there is no chain of custody,  counting ballots weeks after election…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…State, local governments within the jurisdiction       of the eligible entity, adopt and use best practices and       methodologies to enhance cybersecurity, particularly identity       and access management solutions such as multi-factor       authentication, which may include--\n\n``(I) the practices set forth in a cybersecurity framework       developed…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…path forward to deliver upon our commitments to  the American people.\n\nOver the next hour, I will bet you dollars to doughnuts, Mr. Speaker,  that you will hear all manner of identity groups that Democrats will  claim the budget resolution will hurt. You will hear them say that  Republicans are abandoning the middle class and cutting benefits. None  of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with the requirements or decisions       of such organization, and insofar as possible, in accordance       with an agreement that prevents public disclosure of the       identity of any person that submits such information;\n\n``(6) if the Secretary has obtained written authorization       from the person providing such information, and disclosure…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…under markers that       do not represent their religion or heritage. JVW recognizes       that most of these errors are unintentional; however, these       mistakes hide the identity and legacy of those who made the       ultimate sacrifice for our country. American-Jewish       servicemembers served with honor and bravery, playing a       crucial role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…resolution. To be clear, this resolution unlocks the path forward to  deliver on our promises to the American people.\n\nOver the next hour, Members are going to hear all of the identity  groups  the Democrats want my colleagues to believe this bill hurts. Members  will hear them say that Republicans are abandoning the middle class and  cutting benefits. None…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…lottery ticket and it was worth, let's just say, $200  million, maybe even $50 million, and you went to go turn in your  ticket, but somebody else without a valid ID stole your identity and  took your money, you would probably argue that we should have a valid  voter ID.\n\nI only wish that Americans would value their right to vote, as simple  as it is, and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…(H.R. 5345) to amend title VII of the Social Security Act  to provide for a single point of contact at the Social Security  Administration for individuals who are victims of identity theft, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5345\n\nBe it enacted by the Senate and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…....................                                   Security's                                   Service to                                   Victims of                                   Identity Theft                                   Act, as amended. H.R. 5346......................  Fair and            None..............  Increase by at     Would increase…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…want is  the premium dollar, and we want the taxpayer to pay for it.\n\nThe notion that someone can enroll in a taxpayer-subsidized health  insurance policy with a nonexistent identity should be enough to stop  us dead in our tracks and say: We need to change it. We need to fix  this. But the fraud does not stop there.\n\nGAO also found more than 29,000 instances…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Angelica Maria Francesco in Alabama in 2024, an  illegal alien charged by Federal authorities with nine criminal counts  in connection with her fraudulent assumption of the identity of a U.S.  citizen, including voter fraud.\n\nWe have Alford Nelson, as known as Alford Samuels, in Florida in  2024. Alford Nelson was known as Alford Samuels, among several…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…fraud and       scam attempts.\n\n``(3) Promoting the VSAFE Fraud Hotline and VSAFE.gov       website of the Department (and any successor resources) and       identifying other identity theft resources available to       veterans, their families, caregivers, and survivors,       including with respect to actions made by the Secretary to       protect the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…would likely be their idea in the first place.\n\nFinally, I want to emphasize the power of symbolism. Symbols serve as  a representation of our values, priorities, and our identity.\n\nWhen a company completes a grueling training hike and sees that flag  flying over their garrison, it symbolizes home, and I promise you that  last mile may feel like a sprint…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…tag. This information included very personal health  information, whether the individual was blind, disabled, pregnant,  whether they used prescription drugs, their gender identity, whether  they are a victim of domestic abuse, how often they sought care at  inpatient or outpatient facilities.\n\nA spokesperson for Covered California even admitted they…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]