[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…access to an  employee-only restroom when such an establishment does not have a  public restroom. Individuals would be required to present a Department  of Labor-issued identification card certifying that they have an  eligible medical condition.\n\nIndividuals who have certain medical conditions need immediate access  to a restroom. When public restrooms…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690857/introduction-of-the-restroom-access-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the law with regard to       firearms. The Supreme Court recently ruled in VanDerStok that       ATF's regulation entitled ``Definition of `Frame or Receiver'       and Identification of Firearms'' was properly conceived and       implemented--that ``the GCA embraces, and thus permits ATF to       regulate, some weapon parts kits and unfinished frames…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of the  Federal Government.\n\nBut in so little time, so much has changed. In this America, we see  masked agents hiding their faces from the world and even hiding their  identification, terrorizing communities across the Nation, smashing car  windows and dragging mothers and fathers from their vehicles in front  of their kids--in front of their kids--often…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…toxic fumes.\n\nICE detained one of my constituents, Victor Cruz, because he has the  same name as someone with a criminal record. My constituent showed the  ICE agents his identification. It didn't matter. He doesn't have a  criminal record, nor was there a warrant for his arrest. It didn't  matter. He has a valid work permit, a job, and a pending visa…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…these individuals. They then  handcuffed these individuals and forced them into vehicles and drove  them away. All of this was done before they had even asked them for  identification.\n\nThe men thought they were being kidnapped. Some of them had their  feet, hands, and wrists shackled, and another man even had a gun  pointed at him.\n\nThe court who was…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…in Minneapolis and communities all  across our country. That is why Senate Democrats are calling for  commonsense reforms--reforms like ensuring DHS officers wear clear  identification so people know who they are dealing with in law  enforcement and can hold them accountable; requiring DHS personnel to  wear body cameras so we have proper recordings of…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…operations; these are  targeted, lethal military strikes using weapons designed for warfare,  not interdiction or law enforcement.\n\nThe administration has offered no positive identification for those  killed, nor any information linking the boat crews to cartels. In fact,  they have not proven that these vessels were engaged in drug  trafficking, nor even…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Santana is 32 years old. He is a DACA recipient. He is deaf.  And he has been working at a carwash 6 days a week for the last 5  years.\n\nImmigration officials confiscated his identification. They  confiscated his cell phone. They proceeded to handcuff him, put his  hands behind his back in handcuffs, leaving him no way of  communicating. You need to be able…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and uncover wrongdoing.\n\nBut we will also propose and demand reform. There need to be real  changes at DHS, and those kinds of changes have to include body cameras  and identification on every officer, masks off at all times, rigorous  use-of-force training and policy, independent investigations into acts  of violence and ongoing monitoring of the agency's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…stand strong for the  following commonsense measures. First, Federal immigration agents need  to remove their masks, turn on their body cameras, and wear visible,  clear identification. I have met with law enforcement officials--people  who have given their lives to it, career people--and asked them: Why do  you need to be masked? Why do you need to have…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…responsibility of the U.S. to learn all the unanswered  questions leading up to, during and after the fatal shot that killed  Ms. Abu Akleh. Additionally, this bill requires an identification of  any United States defense materials or services that were implicated in  the death of Ms. Abu Akleh. No U.S. weapons or military services by the  U.S. should be used…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the Trump administration  is attempting to mandate that every State change how it operates its  elections. Its starkest proposal is to throw out State rules about  voter identification requirements and require what is effectively a  national ID--while ignoring current law that already makes it a serious  crime for a noncitizen to vote.\n\nThey have introduced…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…because they  got married. They would be unable to register to vote.\n\nHere is what we do know. President Trump's executive order doesn't  want any alternative forms of identification, no alternative State  processes, no additional avenues for voters. Why would we expect the  EAC to disregard the President's clear desire to limit documentary  proof of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…cameras capturing archival footage. Proper uniforms must be worn  displaying agency affiliation so that the public knows they are  interacting with federal officers. Clear identification with a unique  ID number must be displayed so that illegal behavior of an individual  officer can be prosecuted in a court of law, as with any other public  servant.\n\nMy…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…than Federal law enforcement agents.\n\nIf a person runs away from these masked vigilantes, they will beat  and chase that person down. Mr. Speaker, if you ask to see their  identification or their warrant, they will assault you and arrest you.  If a person films them, they will pull a gun on that individual.\n\nThese tactics are grossly illegal and not tactics…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…in the       educational resources and modules established under       subsection (a).\n\n``(B) Duties.--The duties of the Advisory Working Group       shall include the identification and recommendation of       relevant information to the Administrator for inclusion in       the educational resources and modules established under       subsection (a).…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…populations.\n\nIn the 118th Congress, the Subcommittee on Crime and Federal  Government Surveillance held two hearings focused on human trafficking,  child protection, and the identification of victims. Through those  important hearings, my legislation, the REPORT Act, which strengthened  requirements for online service providers to report crimes involving…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…to address the claim that the SAVE  Act will somehow negatively affect married women or others who might  have changed their name because their legal documentation or  identification may reflect two different names. This legislation  clearly contemplates exactly this situation and, indeed, directly  addresses it. Page 14, line 19 directs the States…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…required by this section shall include the actions required       to carry out the requirements listed in paragraphs (1)       through (11) of subsection (b), an identification of the       office of the Administration responsible for implementation,       and the timelines for completion of each action.\n\n(d) Briefing Required.--Not later than…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Department to--\n\n``(A) provide internal and external reporting;\n\n``(B) enable advanced data analytics; and\n\n``(C) facilitate proactive and robust fraud and scam trend       identification.\n\n``(5) Developing comprehensive training plans for       Department employees fielding fraud and scam inquiries and       reports.\n\n``(6) Coordinating with the Inspector…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…terrible carve-outs that provide gaping  loopholes for cunning adversaries. The amendment allows gifts and  contracts to be rendered anonymous, with no foreign source  identification, and also exempts all clinical trials. These loopholes  will make it easier for foreign sources to conceal their relationships,  rendering disclosures all but useless.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the most consequential pieces of legislation concerning election  integrity in our country's history. S. 1383, the SAVE America Act, will  require voters to present photo identification to vote in Federal  elections and to provide proof of U.S. citizenship when registering to  vote.\n\nPublic opinion overwhelmingly supports this legislation, and it is  our…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Foreign Relations of the Senate with a       classified briefing containing--\n\n(A) additional detail on the applicants for a license under       the pilot program;\n\n(B) identification of the firms granted a license;\n\n(C) information on the operation of the pilot program,       including how long each license lasted and the personnel       needed to manage…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…However, what we see from my colleagues on the left is a whole host  of policies that actually weaken election integrity. We have held  debates as it relates to photo identification, again, another provision  that should be in Washington, D.C., law.\n\nPhoto identification is almost the touchstone of what election  integrity is. It is making sure people…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…confidence  that their voice carries equal weight and that our elections are  protected from abuse. Yet, in recent years, alarming loopholes that  allow voting without proper identification, lengthy time to vote before  elections, or time to register when you show up to vote have weakened  the confidence in elections in States like mine, the Commonwealth of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Sinkhole Mapping Act of       2025''.       SEC. 2. SINKHOLE HAZARD IDENTIFICATION.\n\n(a) In General.--Subject to the availability of       appropriations made in advance for such purpose, the Director       of the United States Geological Survey shall…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Export Control Reform       Act of 2018 (50 U.S.C. 4811).\n\n(b) Matters To Be Included.--The strategy required under       subsection (a) shall include the following:\n\n(1) An identification of items required for supporting the       construction, maintenance, or operation of an undersea cable       project.\n\n(2) An identification of United States and multilateral…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…regarding Tren de Aragua (in this section referred       to as the ``threat assessment'').\n\n(2) Elements.--The threat assessment shall include the       following:\n\n(A) An identification of current and potential criminal       threats posed by members of Tren de Aragua and affiliates       seeking to--\n\n(i) unlawfully enter the United States through the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…equipment;       Common Munitions Built-in-Test Reprogramming Equipment       (CMBRE); ADU-891 adapter group test sets; KGV-135A encryption       devices; Computer Program Identification Numbers (CPINs);       spares and repair parts, consumables and accessories, and       repair and return support; weapons system support and       software; classified…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690571/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…(GPS) and nineteen (19) Multifunctional       Information Distribution System Joint Tactical Radio Systems       (MIDS JTRS). Also included were AN/APX-126 Advanced       Identification Friend or Foe (IFF); ARC-210 Radios; KIV-78       Cryptographic Appliques; other secure communications,       navigation, and encryption devices; Joint Mission Planning…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689947/arms-sales-notification"}]