[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Brown, the ``Godfather of Go-Go,'' is beloved by D.C. for his  innovative and unique sound, which gave us go-go music. Go-go is the  beat of D.C., giving D.C. its own musical identity and reminding the  Nation that D.C. has always been the hometown of talented artists.  Chuck Brown was a strong supporter of D.C. statehood, including playing  a concert on…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692742/introduction-of-a-bill-to-designate-the-facility-of-the-united-states-postal-service-located-at-3401-12th-street-northeast-in-washington-district-of-columbia-as-the-chuck-brown-post-office"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…have been serving in our military.  There was no problem until Donald Trump decided to fire thousands of  qualified, capable servicemembers simply because of their gender  identity.\n\nThese servicemembers were proudly serving arm in arm with their  peers: deploying, training, leading, and sacrificing. They met the same  standards, passed the same tests,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…military families. In our State, service isn't abstract. It is  personal. We see every single day what honor, discipline, and sacrifice  looks like regardless of someone's gender identity.\n\nThese individuals met the same rigorous standards as their peers, the  same physical exams, screenings, and background checks; and in many  cases, under intense scrutiny,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…agents  going up and down the streets looking for people who were raking  leaves, checking on each one of them, in terms of their background and  their citizenship and their identity.\n\nThey swept up almost everybody who was out in the yard. At this time  of year, everybody is out in the yard. That sort of thing really struck  a chord in the city of Evanston.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Faithful''--is more than just a phrase; it is a lifelong commitment. As  we know, there are no former marines, and there are no ex-marines. It  is a lifelong commitment and identity. ``Semper Fidelis'' speaks to the  bond between marines, to the cause they serve, and to the Nation that  they protect. That bond by no means ends with Active Duty. It continues…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…month, most       were sent to their deaths. Luckily, my mother was warned by a       sympathetic policeman. Immediately she went into hiding. She       then obtained forged identity papers and, with the help of a       smuggler, set out to cross the border from Nazi-occupied       northern France into French-controlled southern France--so-      called…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…individuals. I recognize  that some LGBTQ+ individuals do not want gender designations on  licenses at all, while others do want gender designation so as to  express their identity. I believe this bill strikes the middle ground,  while showing Congress' support for LGBTQ+ individuals.\n\nI urge my colleagues to support this bill.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691711/introduction-of-the-real-id-gender-requirement-reform-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…clear words about how we are on the  brink, if not through the door, of a constitutional crisis, of an  economic, of a political, of a moral crisis, and a crisis of the very  identity of this country.\n\nIt is often said that when America has a cold, Black America has  pneumonia. Let me tell you something. We are all up in urgent care and  in the community…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…extreme criteria. Married women or others whose name doesn't  match their birth certificate would be required to present a passport  with their current name to prove their identity and citizenship. In  states like Minnesota with same-day registration, all new registrants,  and those updating their registration as the result of a move or a name  change,…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…intersection of memory and place,  weaving together Rochester's histories with the lived experiences of  its people. His work reflects on how communities preserve memory,  identity, and family history, often drawing inspiration from our city's  legacy as the birthplace of modern photography through Kodak Park.\n\nBeyond his artistic practice, Jason manages…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…therefore, should be eliminated  is the wrong conclusion. It is an outsized, collective punishment to  her. And what did she do wrong?\n\nWe don't punish seniors when their identity is stolen. We punish the  grifters who did it, and the same things are true when it comes to  fraud. Let's hold those accountable for it--strictly accountable.  Raising premiums…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…DINGELL. Mr. Speaker, I rise today in strong support of S. 2878.\n\nThe Great Lakes aren't just a part of Michigan and the heartland's  landscape. They are part of our economy, our identity, and our  heritage. They are more than 20 percent of the world's freshwater and  must be protected.\n\nThey provide drinking water to millions. They are home to a thriving…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "I certainly support H.R. 5345, the Improving Social Security's  Service to Victims of Identity Theft Act, and of course, this passed  the Ways and Means Committee with overwhelming bipartisan support.\n\nI think having a single person to deal with at the Social Security…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…latest release of the Epstein files is  this: The DOJ cares more about protecting Donald Trump than it cares  about protecting Epstein's victims.\n\nThese new releases expose the identity of nearly 100 victims in over  1,000 instances. This is not mere sloppiness. This is wanton negligence  that puts the safety of these victims at risk. It is one thing for…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699465/epstein-files"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…discomfort they cause to those who wish to ignore the brutal realities  of race in America.\n\nThese bans are not merely an affront to academic freedom; they are an  assault on Black identity and an attempt to stifle the critical  conversations necessary for a truly inclusive society.\n\nMoreover, the policies that aim to ban discussions of race and racism  in the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…State, local governments within the jurisdiction       of the eligible entity, adopt and use best practices and       methodologies to enhance cybersecurity, particularly identity       and access management solutions such as multi-factor       authentication, which may include--\n\n``(I) the practices set forth in a cybersecurity framework       developed…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with the requirements or decisions       of such organization, and insofar as possible, in accordance       with an agreement that prevents public disclosure of the       identity of any person that submits such information;\n\n``(6) if the Secretary has obtained written authorization       from the person providing such information, and disclosure…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Speaker, I rise today to recognize and commend the  Lakes Pilots Association, on their completion of their new docks and  seawall project to preserve the maritime heritage and identity of Port  Huron as a Great Lakes port city.\n\nFor over six decades, the Lakes Pilots Association has provided  expert pilotage services to foreign-flagged vessels operating…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…under markers that       do not represent their religion or heritage. JVW recognizes       that most of these errors are unintentional; however, these       mistakes hide the identity and legacy of those who made the       ultimate sacrifice for our country. American-Jewish       servicemembers served with honor and bravery, playing a       crucial role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…chairman, Jason  Smith, not only for his strong leadership but for his support on this  important legislation.\n\nMr. Speaker, every year, more and more Americans are having their  identity stolen. It is a sad fact. However, actors are becoming more  sophisticated. They are using new technology to gain access to  sensitive information. Just last year, there were…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…standard for the world  because they were very hard to cheat in. Essential components of this  process were 30-day registration, in-person election day voting, and  proof of identity.\n\nIn recent years, in many States, the woke left has torn down these  safeguards. Mail-in ballots where there is no chain of custody,  counting ballots weeks after election…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…place to  live, to work, to raise a family, and to retire. The Cap-to-Cap program  has been a very big part of allowing that to continue, of giving our  region a cohesive identity, and I look forward to the 54th annual trip  next year.             Honoring 2025 Graduating Class of Leadership Rocklin\n\nMr. KILEY of California. Mr. Speaker, I rise today…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…otherwise to expose an individual to       public contempt or obloquy, or will represent a clearly       unwarranted invasion of privacy of an individual;\n\n(4) will disclose the identity of any informer or law       enforcement agent or will disclose any information relating       to the investigation or prosecution of a criminal offense       that is required…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…would likely be their idea in the first place.\n\nFinally, I want to emphasize the power of symbolism. Symbols serve as  a representation of our values, priorities, and our identity.\n\nWhen a company completes a grueling training hike and sees that flag  flying over their garrison, it symbolizes home, and I promise you that  last mile may feel like a sprint…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…......................                                   Security's                                   Service to                                   Victims of                                   Identity Theft                                   Act, as amended. H.R. 5346......................  Fair and           None.............  Increase by at     Would increase…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…fraud and       scam attempts.\n\n``(3) Promoting the VSAFE Fraud Hotline and VSAFE.gov       website of the Department (and any successor resources) and       identifying other identity theft resources available to       veterans, their families, caregivers, and survivors,       including with respect to actions made by the Secretary to       protect the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…mentally ill and should not be serving  in the United States military.\n\nThis amendment says clearly the purpose of our military is to defend  the United States, not validate identity politics. It makes sure  TRICARE serves the mission of protecting health, not undermining it.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…tag. This information included very personal health  information, whether the individual was blind, disabled, pregnant,  whether they used prescription drugs, their gender identity, whether  they are a victim of domestic abuse, how often they sought care at  inpatient or outpatient facilities.\n\nA spokesperson for Covered California even admitted they…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…prevalence, costs,       commercial availability, and usage by adversaries in the       United States of cell site simulators (often known as       international mobile subscriber identity catchers) and other       mobile service surveillance and interception technologies.\n\n(c) Consultation.--In preparing the report required by       subsection (a), the Assistant…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…than once every 6       months for proper function and maintained in proper working       order; and\n\n(3) use a system that electronically records the date,       time, and identity of each individual who accesses a cadet       room using an electronic access token, code, card, or other       electronic means, which shall be maintained in accordance…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]