[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…would just be able to go get it.\n\nThe bill exempts these weapons from the requirement that they have a  serial number and that they be traceable so that law enforcement can  identify their owners if they are used in violent crimes.\n\nIt would also exempt them from the Undetectable Firearms Act, which  requires that firearms be detectable by metal detectors…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…security and law enforcement       agencies--\n\n(1) for assistance in the consideration of an application       for permanent resident status on a conditional basis;\n\n(2) to identify or prevent fraudulent claims;\n\n(3) for national security purposes; or\n\n(4) for the investigation or prosecution of any felony not       related to immigration status.\n\n(d)…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Trump's baseless attacks  on Los Angeles and our elected leaders, including Governor Newsom and  Mayor Bass.\n\nThis administration's mass ICE raids by masked agents who will not  identify themselves have trampled on our rights and left our community  shaken but not defeated.\n\nThe President manufactured a crisis in Los Angeles and then blamed  our constituents…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693142/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…their communities, including       street vendors and other informal enterprises. Instead of       supporting these efforts, the legislation would make it       harder to identify and engage such businesses, ultimately       hindering local economic development and effective       regulation.\n\nTogether, these bills are part of a broader effort to…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Secretary  of the Interior to expedite and approve any mine that the  administration deems a priority, and it tells the Department of the  Interior and the Forest Service to identify any public lands that  should be a priority for mining, without any public input or Tribal  consultation.\n\nIn the eyes of this administration mineral dominance means mining…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Nation's community  supervision professionals, who are dedicated public servants and  perform many vital roles in their work with justice-involved adults and  juveniles. They identify opportunities and services to help justice- involved individuals contribute to society, while holding them  accountable for their actions. They remain mindful of their role…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693630/recognizing-the-nations-community-supervision-professionals"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…let him sink into  anonymity, but he has done his damage.\n\nOver at the Department of Justice--and I have got to correct myself.  I was saying that his employee, who I can identify now as Tarak  Makecha, was responsible for slashing more than $500 million in public  safety, local law enforcement, and victim assistance organizations  across the country.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…have before us. The 280 other  individuals who are in CECOT prison, the government has kept those  names secret. The press and others have had to do a lot of sleuthing to  identify individuals who have been sent down there. For all we know,  there could be citizens among those folks. We don't know because they  have never been able to talk to a judge.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…services. Women serve and lead in every  domain of our military. We cannot let Secretary Hegseth sideline them.  Making WITs permanent ensures each branch can continue to identify the  barriers and remove those  barriers to women's recruitment, retention, health, and safety.\n\nI do all this and support this bill, despite my extreme lack of  confidence…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…with the conservation objectives of each sanctuary. If we  strip that away, as this bill would do, we have created a regulatory  sacrifice zone.\n\nHouse Republicans can't even identify which licenses and permits  would qualify in this bill in lieu of the special use permit process  that would ordinarily apply.\n\nMr. Speaker, how can we look the American people…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…him for  his leadership on this issue.\n\nWe need this so we can better understand and improve how we track and  understand care for patients like Dakota and so we can better identify  where resources and support are most needed.\n\nMr. Speaker, this month and every month, we must stand with those  living with sickle cell disease and fight for a future where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695786/sickle-cell-awareness-month"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…challenges facing their communities and the  world with measurable, sustainable, and far-reaching results. To earn  the Girl Scout Gold Award, high school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that  produces lasting change. Over…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…advancement and  empowerment of women and girls. Each year, national representatives of  Member States gather for a two-week session to evaluate progress on  gender equality, identify challenges, set global standards, and  formulate concrete policies to promote gender equality and the  advancement of women worldwide. As NGO Consultative members, GSUSA and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688693/recognizing-girl-scouts-of-san-jacinto-county-texas-at-the-united-nations-69th-commission-on-the-status-of-women"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…officials acted quickly, identified the  problem, and put safety precautions in place to protect the public.\n\nWith effective sinkhole mapping, we can do even more. We can identify  at-risk areas before disaster strikes and take preventive action, like  ground stabilization, to protect lives and reduce the cost of damage.\n\nThis bill is a commonsense,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693481/sinkhole-mapping-act-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…apart in my district and around the country.\n\nSince taking office, Trump has declared war on our communities.  Masked ICE and CBP thugs--I call them thugs because they don't identify  themselves. In our State, police officers, law enforcement, always  identify themselves. They have detained parents on their way to work.  They have kidnapped U.S. citizens.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Speaker, and neither should  American energy.\n\nThe REFINER Act takes a serious look at that situation, directs the  National Petroleum Council to review our refining capacity, identify  where we are vulnerable, and highlight opportunities for us to expand.  In other words, it gives us the facts we need to strengthen a critical  part of our energy supply…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to travel long distances to  distant cemeteries to visit their deceased relatives.\n\nTo address this need, Pinedale and Alpine have worked with their  respective counties to identify additional land to expand their  cemeteries.\n\nThis bill provides a straightforward, commonsense solution by  transferring U.S. Forest Service land adjacent to the cemeteries…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…think we are all aware that there are circumstances, like when  someone is undercover or when they are doing a stakeout, in which it  doesn't make sense for the official to identify himself as an officer.\n\nOf course, that is neither here nor there because in these very  targeted operations, we have seen that these folks are very clearly  identified. To…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…organization with which       each such individual is affiliated.\n\n(C) A description of the following:\n\n(i) The capability of the Department of Homeland Security       to identify, track, and monitor such individuals.\n\n(ii) Any associated challenges with such capability.\n\n(D) A description of any action of the Department with       respect to the following:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697015/syria-terrorism-threat-assessment-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…learning programs. She is a strong  role model for the youth in our community. As a long-time 4-H volunteer  and leader of the Ropin' the Wind 4-H club, she has sought to identify  needs in the community, set goals, work in partnership with the 4-H  Agent and County Extension office, and advance educational programs for  youth. In 1995, with a mission…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…includes growth in my home State of North  Carolina. My legislation would require the Department of Homeland  Security to conduct a comprehensive border threat assessment to  identify the criminal threats posed by TdA members, the threats that  are posed to our communities, and how exactly they are so successful in  growing in our communities.\n\nWith this…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…root causes of failures, and categorizing types of       vulnerabilities detected;\n\n(2) begin conducting quarterly analytical reviews of covert       testing data to identify trends, recurring deficiencies, and       opportunities for operational improvement across all covered       facilities;\n\n(3) direct the security contractor who is providing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Data Analytics Act of       2015 (FRDAA) required the Office of Management and Budget       (OMB) to establish guidelines for federal agencies to create       controls to identify and assess fraud risks to design and       implement antifraud control activities. The act further       required OMB to incorporate the leading practices from the       Fraud…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Data Analytics Act of       2015 (FRDAA) required the Office of Management and Budget       (OMB) to establish guidelines for federal agencies to create       controls to identify and assess fraud risks to design and       implement antifraud control activities. The act further       required OMB to incorporate the leading practices from the       Fraud…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Xinjiang. For numerous years, this program has collected DNA       samples and other data from Uyghurs, facilitating Chinese       surveillance and making it easier to identify targets for       organ harvesting in Xinjiang.\n\nIn June 2021, 12 United Nations Special Procedures mandate       holders raised the issue of forced organ harvesting with…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…local government to attract foreign investment from       responsible private-sector entities based in trusted       countries.\n\n(11) Initiatives by other countries to identify best       practices for increasing global competitiveness in attracting       foreign direct investment from responsible private-sector       entities based in trusted countries.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…global position in the artificial  intelligence race.\n\nThis amendment strengthens our ability to safeguard America's  advancements in artificial intelligence by ensuring we identify,  monitor, and address vulnerabilities that foreign adversaries could  exploit to the detriment of our national interests. It reinforces our  commitment to securing the technologies…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…been documented instances of the Chinese manipulating and spying on  these networks, with internet traffic being rerouted through China.\n\nMr. Speaker, it is important that we identify what the Chinese  Communist Party needs to deploy undersea cables so that we can ensure  only America and its allies lead in the development and maintenance of  this technology.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…carrying out       such responsibilities;\n\n(D) describe the level and sources of Federal and State       funding received by each Mid-Atlantic River Basin Commission;\n\n(E) identify duties and responsibilities of each Mid-      Atlantic River Basin Commission that may be duplicative of,       or overlap with, other Federal authorities; and\n\n(F) review…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…House of Representatives a briefing on the progress of the       Secretary toward finalizing such agreement.\n\n(b) Study.--The study required under subsection (a) shall--\n\n(1) identify exposures associated with military occupations       of covered individuals, including relating to chemicals,       compounds, agents, and other phenomena;\n\n(2) review the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}]