[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…American workers. If this Congress fails to act, the Federal  Government will default in 2032, and people would see their Social  Security payments cut.\n\nMeanwhile, this bill also ignores the Trump regime's effort, which I  discussed, about the development of a digital file on every American  and the invasion of our privacy. It is good that this legislation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…confirmation. As a  result, no one in this Chamber knows when our committee will be able to  receive this testimony.\n\nThat said, and while I support this bill, this debate ignores the  real and urgent challenges facing HUD and our housing market, and how  the President and his administration are actively taking steps to  undermine efforts to address…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…jack up Canada tariffs by another 10 percent because  one of their provinces--just one--took out the Reagan ad.\n\nWho would make a deal with a person who acts like this, who ignores a  deal that was made just a few years ago and who constantly threatens to  annex their country?\n\nThat is what Donald Trump has done with Canada.\n\nThese tariffs are doing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…make ends meet, the truck drivers, people who work at Walmart, nurses,  HVAC technicians are going to lose 4 percent.\n\nThis bill benefits those who are already doing well and ignores those  who are working hard and struggling the most. It is the exact opposite  of what we should be doing.\n\nEven Donald Trump challenged the Congress to say: Raise taxes a…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…come?\n\nRepublicans have long sung from the altar of fiscal responsibility,  yet the plan they put in front of us today is a fiscal sacrilege. It  depends on fantasy math and ignores that their deficit-busting tax  breaks will add at least $4.6 trillion to our Nation's credit card and  even more interest that our families must pay.\n\nThis interest has real…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…supply. While recycling alone will not meet all of our  projected demand, it can significantly reduce pressure on primary  extraction if we invest now. This bill completely ignores the role of  recycling to strengthen our supply chains.\n\nAnother way to strengthen these supply chains is through enhanced  transparency. Last Congress, I introduced the bipartisan…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…from the American people to fund these tax cuts.\n\nWhat does it mean when four people lose their coverage? It means a  mom with diabetes may have to skip her insulin or a dad ignores chest  pains because he can't afford the ER visit. It means your child missing  their asthma treatments and struggling to breathe in class. These are  real lives on the line.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…continues: ``We rely on the caribou, not only spiritually and  culturally, but for our survival and subsistence. This action from D.C.  is an insult to the Gwich'in people and ignores those realities.''\n\nSovereign Inupiat for a Living Arctic also oppose this proposal. They  said:\n\nMany Alaska Native communities are already facing negative       health impacts…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…suit or combat gear.\n\nIf it is such a hellscape, pull back the cameras and release the  drone footage so we can see what is happening across the entire city.\n\nThis resolution ignores the fact that the violence didn't start in a  vacuum. It was sparked by the Trump administration's provocative,  aggressive immigration raids across the State.\n\nICE agents…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…increase long-term risks to public safety and community       wellbeing. The D.C. Cash Bail Reform Act will harm D.C.       residents and will not make D.C. safer because it ignores the       evidence and data on pretrial detention and thirty years of       local input and governance.\n\nThe Common Sense Law Enforcement and Accountability in D.C. Now Act…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…crossroads of democracy and  autocracy. The moment of decision is near. We will have to decide  whether we will have a country that abides by a Constitution that is  meaningful or ignores a Constitution such that it becomes meaningless.\n\nI choose to stand on the grounds laid by the Founders and Framers of  the Constitution. I stand today to announce that at…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692849/we-are-at-the-crossroads-of-democracy-and-autocracy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the CRA, which is why       Public Land Orders such as this have never been submitted to       Congress.\n\nThis CRA resolution is an entirely unprecedented maneuver       that ignores the foundation of our public lands management       system and threatens not only the future of the Boundary       Waters, but how all federal public lands are managed going…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…be       ``designed and intended and may not be readily converted to       accept and discharge . . . projectile[s] at a velocity       exceeding 500 feet per second,'' it ignores the fact that       such devices, as with all firearms, do not by themselves       determine the velocity of the projectiles they fire, but it       is the ammunition which…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…fight  with or depend on foreign sources for materials, critical minerals, or  key military components. Furthermore, by cutting all funding for  Ukraine, this bill dangerously ignores history at our own peril.\n\nAt our founding, Patrick Henry heroically proclaimed: ``Give me  liberty or give me death.'' He knew liberty's cost and our new Nation's  responsibility…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…is no reason for  any of us to show up any longer. Why do you work so hard, why do you  care so much about getting to this place if you don't care when the  President just ignores the laws that we pass?\n\nIt is very hard to find consensus here, especially on an issue as  important and as politically sensitive as gun violence. So when we do  find that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…in the Nation. Our energy producers operate under the  highest environmental standards in the world.\n\nBut the Biden administration's North Dakota resource management plan  ignores that record of responsible energy development. Instead, the  North Dakota resource management plan seeks to curtail coal, oil, and  gas production by locking away taxpayer-owned…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…subsistence is an       important and critical practice for all Alaskans, including       Alaska Native peoples and their communities. However, despite       this focus, the BLM ignores the needs of our Alaska Native       peoples during this rulemaking process. BLM published this       proposed rule during a critical subsistence period for the       communities…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…in all litigation concerning this matter.\n\nUnfortunately, the DOJ's recent brief in a lawsuit involving NFA  registration defends the draconian NFA firearm registration and ignores  congressional intent.\n\nFirst and foremost, the legal argument to defend and keep the NFA  registration simply isn't there, plain and simple. When the One Big  Beautiful Bill…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…letting ranchers, families, small businesses, and entrepreneurs  benefit from thoughtful and responsive government as opposed to  government that drowns out their voices and ignores their needs.\n\nMr. Speaker, I urge my colleagues to support these measures, which  offer pragmatic solutions to real challenges in Utah, throughout the  West, and throughout…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…responsible energy production.\n\nNorth Dakota is proof that we can grow the economy, power the  country, and protect the environment at the same time.\n\nThis bureaucratic rule ignores these successful efforts. It removes  the incentive to innovate and locks facilities into restrictive  regulations, even when they are trying to reduce emissions and operate…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…United  States of America.\n\nIt is a statement that I would hope all of our elected leaders in the  United States up and down our system of government could support.\n\nSocialism ignores the side of a man and woman that is the spirit. It  dulls the human capacity for self-initiative, entrepreneurship, and  risk-taking. For those who have concerns about the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…life-altering surgeries on  vulnerable children.\n\nThis is not healthcare funding. This is not healthcare. It is  promoting an ideology that harms children, sidelines parents, ignores  common sense, and contradicts President Trump's executive order to  restore biological truth and prevent the mutilation of our Nation's  children. Plain and simple: Americans'…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "French Hill", "party": "Republican", "sentence": "…purposes.\n\nEven more troubling is the way the CFPB oversimplifies the costs of  providing overdraft protection.\n\nThe rule only considers the cost of operating a call center and  ignores the many other expenses involved such as ratifying and dealing  with consumer disputes, mailing and postage for overdraft notices,  third-party collection expenses, technology…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…lawsuit  resulted in a listing based on flawed assumptions and bad science.\n\nFirst, by solely focusing on the bay-delta rather than the longfin  smelt's entire range, the service ignores the fact that the species has  been found in dozens of locations, including in and around every  tributary of the San Francisco Bay. Meaning the longfin smelt is not at  risk…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…investment. They  ultimately lead to higher consumer prices and costs. Not only is this a  tremendous burden on both producers and consumers but this rule also  completely ignores the significant progress that the United States  private sector has made over the past decade or more.\n\nU.S. emissions have decreased by 18 percent between 2005 and 2022,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…ROD undermines responsible resource       development required by law, disregards ANCSA, the Alaska       National Interest Lands Conservation Act of 1980 (ANILCA),       and ignores the voices of the only people who live on the       Coastal Plain.      Background: The History of Federal Direction on the Coastal Plain\n\nThe Coastal Plain has long been…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…away at the register because this rule forced their bank to stop  offering overdraft services. This government-created market established  by the CFPB's overdraft lending rule ignores competition of banks and  how they provide their services and pushes banks to restrict or exit  this service.\n\nMr. STUTZMAN. Mr. Speaker, the former CFPB Director Chopra was…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689852/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…premium costs and  out-of-pocket costs for middle-income Americans.\n\nBy the way, the Democrats' current plan will only affect 7 percent of  the people on ObamaCare. Their plan ignores 93 percent of Americans who  will also see costs go up. We need to help all Americans by fixing our  healthcare system, not just paper over the failures of ObamaCare to  help…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…in the face of escalating threats, can  only sit idly by until Congress can hold hearings and schedule votes is  not just naive; it is reckless. This War Powers Resolution ignores the  reality of modern warfare, and it would constrain the Commander in  Chief at the precise moment when decisiveness is most critical. It  elevates process over commonsense…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…communities most affected. Our leadership has consistently       raised concerns about this process and its outcomes, yet       those concerns were ignored.\n\nThe 2022 ROD ignores congressional intent under ANCSA, the       Alaska National Interest Lands Conservation Act of 1980       (ANILCA), the National Petroleum Reserve Production Act of…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]