[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…what  separates democracy from despotism.\n\nPresident Trump has spent his whole career evading the rule of law.  He has refused to comply with congressional subpoenas. He has ignored  court orders. He has pardoned coconspirators and dangled pardons in  brazen attempts at witness tampering. He has attacked judges who rule  against him as ``biased'' or ``partisan.''…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…freedom. You deserve a joyful life  free from fear and a childhood filled with love, but this White House  and everyone complicit in their wholesale child abuse and neglect has  ignored your cries. Your story, brilliance, and voice belong  everywhere, so let me read directly from a letter you wrote.\n\nYou pleaded: I miss my school and my friends. I feel bad…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…million enslaved men and women, indeed, all the women who  resided in the Thirteen Colonies, including in his beloved Monticello.\n\nThe Delegates to the Continental Congress ignored Abigail Adams' plea  to ``remember the ladies and be [kinder] to them than your ancestors.''\n\nVirginia is the birthplace of James Madison, who was the architect of  the Virginia…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…told him at that  time that, if he did not have international observers at his election  to verify that it was an honest election, the world would not believe  the results. He ignored my advice, which was no surprise. He went ahead  with the election and had a disputed result. He claimed victory, which  others said didn't happen, and he did it again a few…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Afghanistan policy.\n\nUnfortunately, there is not a consensus about what the Trump  administration is doing on Afghanistan because they won't tell us. The  State Department has ignored multiple bipartisan requests from this  committee, dating back to February, for more information about the  deals it is making with the Taliban and the Haqqani Network. Despite…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…the Trump administration, we have witnessed a disturbing  pattern: a blatant disregard for the constitutional role of Congress  and its vital duty of oversight. Subpoenas are ignored. Testimony is  blocked. Oversight is treated not as a safeguard and not as a  constitutional role or duty of democracy but as an inconvenience of  power, an inconvenience…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692931/holding-power-accountable"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…vulnerable. Like       all of my colleagues, I have always supported reforming       government and making sure our tax dollars are spent wisely.       But this administration has ignored U.S. laws enacted by       Congress--cutting foreign assistance programs and USAID staff       that are essential for our national security.'' Ranking       Member Senator…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…protections.\n\nThese deportations were not based on convictions or due process. They  are based on ancestry and suspicions--tattoos misidentified,  affiliations assumed, rights ignored.\n\nThe Supreme Court affirmed, by a 7-2 majority, these people deserve  due process under our Constitution.\n\nFor me and for Representative Takano, this strikes painfully close…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690504/trump-immigration-policies"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…megaprisons  in the hemisphere. It is a prison that American taxpayers are helping  to support in a foreign country.\n\nLet me be clear. Mr. Garcia had rights. The government ignored them.  That is not how justice works.\n\nIt is not just Mr. Garcia. We now have learned of children who are  U.S. citizens who were deported by this Trump government and  administration.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…their due process, and even amidst the reports that  the U.S. was spending more than $40 million of taxpayer money holding  migrants in Guantanamo, in that case, I was just ignored. I didn't  expect much more.\n\nRepublicans in Congress have repeatedly given up their power. I don't  know why. They got elected by the people to represent the people, but…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…forced to fight fire with  fire and play catchup to undo Republicans' damage and restore balanced  representation. And the ones who suffer are the voters. Their voices  are ignored and often silenced by frightened partisan politicians.\n\nBut it isn't just the voters who are undermined; it is our States as  well. Under the Constitution, it is the States…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…move  further toward a war that would destabilize the entire region.\n\nThe American people don't want us to start a war within Venezuela,  and their voices should be heard, not ignored by this President.\n\nThere is a final reason why I rise in support of this resolution  because letting Donald Trump ignore the law abroad makes him think he  has a free pass…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…concerned about the world  we are leaving our children.\n\nI came to Congress after years of treating the consequences of  inaction. I could no longer stand by while politicians ignored the root  cause--the pollution poisoning the air we breathe. The truth is, Madam  Speaker, our air is making us sick, and we have the power and  responsibility to do something…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…since I was sworn in to  serve Oregon's Fifth Congressional District. Since then, we have seen  the programs we rely on cut, costs rise, and the needs of the American  people ignored.\n\nThat is why I always encourage Oregonians to call my office and make  their voices heard. I have heard from over 50,000 Oregonians, taken  over 120 constituent meetings,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693419/speaking-out-for-oregonians"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…I can tell you this: We have repeatedly  asked for financial information, for meetings, for transparency about  what is happening inside the center. Our requests have been ignored.\n\nThat should alarm every Member of this body because this is not just  about a building. It is about whether Congress is going to allow a  President to seize control of a…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…District and in rural  communities across America, they are the lifeline and fabric of our  communities, but time and time again, they are squeezed out by  overregulation and ignored by the bureaucracy. They are pushed aside in  favor of corporations with high-paid consultants and armies of  lobbyists.\n\nThat is wrong, and by passing H.R. 789, we take a…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…administered through piecemeal offerings of land  tracts which exclude areas known to have proven potential for  significant hydrocarbon reserves, but in doing so, the 2024 ROD ignored  explicit instructions put forth by Congress in the TCJA. Congress  clearly stated the Secretary ``shall establish and administer a  competitive oil and gas program for the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the Venezuelan people, and never surrender to terrorist regimes  that threaten our security. Too many Americans have already paid with  their lives because this threat was ignored.\n\nFor the sake of our national security, our communities, and the men  and women in uniform who stand the line every day, I urge a ``no'' vote  on this resolution. I thank…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…groups and to work with allies to pressure China to close these camps.\n\nIt also urges U.S. leadership at the United Nations to ensure China's  human rights abuses are not ignored or silenced.\n\nAmerica must lead with moral clarity. We must stand for human rights  and against genocide.\n\nMr. BAUMGARTNER. Mr. Speaker, I urge my colleagues to join me in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…free today, and they are hoping for more and more freedom each  and every day.\n\nPresident Trump has brought hope to our homeland by protecting this  homeland that has been ignored for so long. He has brought hope to so  many others around the globe, the people of Venezuela, people across  the Middle East, people across Europe, people in place after…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Governor Gianforte specifically requested that the  BLM Director withdraw that proposed amendment during the BLM's official  ``Governor's consistency review,'' and Biden's BLM ignored him. When  the Governor submitted an official appeal to Biden's BLM Director, our  Governor was rebuffed.\n\nThis lack of respect for Montana's local and statewide elected…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…steward the  environment all at once. That is the American Way, and that is  certainly the North Dakota way.\n\nThe Biden administration failed to recognize that and completely  ignored all of my State's concerns with the plan. If we want to talk  about intellectual dishonesty, that is the definition of it. So is so  much of the Democrat's energy policy that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…here is the truth: USAI and other security efforts have helped  us, measurably, address shortcomings in strategy, capabilities, and  production capacity that would have gone ignored until it was too late.\n\nIt is an inconvenient reality for isolationists and restrainers, but  for a tiny percent--a tiny percent--of our defense budget, we helped a  smaller…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…that whatever the objective, whatever the strategy,  America is well-served when its Presidents secure enduring bipartisan  support for their foreign policies. President Obama ignored Congress in  pursuing a reckless and bad nuclear deal with Iran. Unsurprisingly,  that deal did not endure.\n\nSuccessfully returning Venezuela to its role of stable, prosperous,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…disregards the voices of the very communities most affected. Our  leadership has consistently raised concerns about this process and its  outcome, yet those concerns were ignored.                                                 October 3, 2025.       Re Support for S.J. Res. 80 and H.J. Res. 124--Congressional           Review Act Disapproval of the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, I rise in support of the resolution to  overturn the CFPB's overdraft rule. This is a classic midnight maneuver  from the previous administration that ignored market realities.\n\nLet's be clear: It is competition, not heavy-handed regulation that  drives down costs. According to the CFPB's own data from 2020 to 2023,  overdraft fees…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689841/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…leasing and development in the NPR-A and to  take into account the long history of safe and responsible oil and gas  development on the North Slope. All these Alaskan voices were ignored.\n\nImportantly, my joint resolution is supported by the North Slope  Regional Trilateral, which is made up of the elected leaders of the  North Slope Borough, the Inupiat Community…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Rose", "party": "Republican", "sentence": "…deserve to know how  such a monumental fraud was allowed to fester in the shadows for so  long. My amendment requires a report on how this fraud was missed, what  red flags were ignored, and what fixes are needed to prevent this from  ever happening again.\n\nThe House passed my amendment last Congress. Unfortunately, it was  not included in the final bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Oversight Committee, through 13 subpoenas, that  has released 65,000 pages of files in just 10 months.\n\nMeanwhile, my colleagues on the other side of the aisle have largely  ignored this issue. It was Democrats who redacted an email to mislead  the American people about the truth of a witness that exonerated  President Trump. It was a Democrat, Representative…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Republicans warned repeatedly that bringing people without proper  clearance from a war-torn country was a major national security risk.  The negligent Biden administration ignored the warning.\n\nIn 2021, 13 American heroes were killed in the botched withdrawal  from Kabul, Afghanistan. One of them was Wyoming's own Rylee McCollum.  He embodied the best…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}]