[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Consumer Financial Protection Bureau from supervising payment apps  offered by Big Tech firms like Apple and Google.\n\nBefore I explain why this resolution is bad, let us not ignore that  President Trump and co-president Musk are tearing down key government  agencies and programs as we speak, like the CFPB and Social Security.\n\nLast week, the President…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Venezuela,  and their voices should be heard, not ignored by this President.\n\nThere is a final reason why I rise in support of this resolution  because letting Donald Trump ignore the law abroad makes him think he  has a free pass to do it right here at home.\n\nDonald Trump thinks if he can do this in the Caribbean, he can do it  on the streets of Chicago.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…what he is, ruling by executive order.\n\nThis country was not designed by the Framers of the Constitution to  be ruled by executive order such that the President would just ignore  those orders, let things go all the way to the Supreme Court knowing  that he has lawyers with unlimited resources, and those who would  challenge him are limited in resources.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…relationship to its ability to effectively meet the needs of       local small businesses. With that in mind, we strongly       encourage members of the House of Representatives to ignore       distractions like H.R. 2931 and focus on policies that would       truly benefit America's entrepreneurs.\n\nIn addition to ongoing efforts to shutter regional offices,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…responsibility and sworn oath to uphold it, and our Founders didn't  create two other branches of government--a legislature and a  judiciary--merely for a wayward Executive to ignore them.\n\nOur Founders wanted the legislative and judicial branches to be  checks on the Presidency, but this President seems to think that the  clear rules set out in the Constitution…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…demanding action from the  Trump administration.\n\nI know the threat of nuclear weapons can often seem so large and  abstract, so unimaginable that it becomes easier just to ignore it all,  but to say nothing is not an option, especially for someone like me.\n\nMany of my family, my distant family, were in Hiroshima on the day  the atom bomb fell. That…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…nearly two-thirds since its peak in 2007. Instead of  celebrating the newer sources of cleaner and cheaper energy,  Republicans are frantically trying to turn back the clock and ignore  Americans' pleas for real and meaningful help in the process.\n\nMr. Speaker, I urge opposition to this bill and to this massive waste  of time. It is completely meaningless.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…buddies.\n\nThese three Congressional Review Act, or CRA, resolutions treat  America's public lands like they are just lines on a balance sheet.  They silence  public opinion, ignore the fires and storms that are made worse by  climate change to make fossil fuel extraction the number one priority  going forward for how we manage our public lands. Wildfire…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…but it has been 9 months, and we are still  waiting.\n\nWe are about to debate and vote on a budget. What is the purpose of  passing a budget if the administration will just ignore it?\n\nI have spoken on this floor about the humanitarian necessity to  restore this program, the national security necessity to restore this  program, but it is a constitutional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695817/lifesaving-food-aid"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…that prevent safe       return. The program is designed to be responsive to facts on       the ground, not to operate on arbitrary timelines, quotas,       and motives that ignore documented country conditions. The       Haitian community has been granted TPS because Haiti has       faced continuous, documented instability that meets the       statutory…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Harry Truman. He reminded the  American people of a shared tradition:\n\n``Never to be indifferent toward despair. . . . never to turn away  from helplessness. . . . never to ignore or spurn those who suffer  untended in a land that is bursting with abundance.''\n\nIndeed, Medicaid saves lives and is a pillar of health, security, and  justice for tens of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…the amount of constituents I have heard from, for  example, that their dad is in this facility and haven't heard from them  for weeks. No one with eyes and a conscience can ignore what this  really is. It is an internment camp. It is a place full of people who  look like me, Latinos, Haitian men, subjugated to inhumane conditions  under the guise of…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…comparing the       budgets of EPA under the previous administration with those       proposed and approved by the Congress under my       administration. But they deliberately ignore that the major       Federal environmental laws are designed to be carried out by       the States in partnership with EPA.\n\nBy the time the clean air, clean water, and other…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…of grave concern for my  neighbors in Louisville, in Minneapolis, across the country, and for my  colleagues here in Washington who somehow continue to excuse, dismiss,  and ignore the atrocities that ICE exhibits each day.\n\nMr. Speaker, do not look away. Watch as people in the freest country  on Earth get dragged from their cars down the street by masked…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699124/ice-atrocities"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President has already threatened to veto this  bill.\n\nSenate Republicans who know how bad tariffs are for their States  should join us to nullify Donald Trump's trade war and ignore his veto  threat, and, if necessary, we should override the President's veto.  These tariffs are so bad and are already pushing America into  recession.\n\n``Recession'' is an…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…executive's military exercise to capture the leader of Venezuela  represents one of the most blatant usurpations of congressional  authority we have seen in modern times. If we ignore it, then we are  not merely acquiescing to executive overreach, we are rendering  impotent our branch of government.\n\nThomas Paine said in 1776: ``A long habit of not thinking…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699373/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…as property and homeownership.\n\nOne of the contributing factors to these regulatory costs is the  agenda informed energy codes that States like Colorado are mandating.  They ignore science, and they even push aside stakeholders, the  builders, the people who actually build the homes and make this  American Dream. They push them aside in the creation process.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699810/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…the internet was in its early days long before the  average American spent nearly half the month online and nearly one in  six sales occurred online. Congress can no longer ignore the fact that  the average American spends nearly 60,000 percent more time online than  during the year of the law's passage.\n\nTo be clear, this law lets the large companies…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Chair Weber for yielding.\n\nMr. Speaker, America's electric grid is facing a reliability crisis,  one created by heavyhanded Federal rulemakings that prioritize politics  and ignore the realities of power generation and the needs of American  families. That is why I rise today in support of my bill, the Reliable  Power Act.\n\nUnder the Biden administration,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the delta between renewable energy  research and fossil energy has really widened for the research that we  are doing.\n\nI am advocating with this amendment that we shouldn't ignore our  fossil fuel efficiency and carbon mitigation research.\n\nMy amendment increases the fossil energy account by $6,875,000, or 1  percent, with an offset from the departmental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…unambiguously, that any and every adult who illegally enters our  country shall be detained. Those are the exact words of the law:  ``shall be detained.'' The Democrats simply ignore it.\n\nThey have a right to challenge their detention through a writ of  habeas corpus. If they are charged with a crime, they have a right to a  trial by jury, but at no time…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…about what this resolution is and what it is  not. It is not a debate about tariffs. We can talk about those, but  that is not really what it is. This is Democrats trying to ignore that  there is a fentanyl crisis. Again, they just ignored it. They just  literally said it doesn't exist.\n\nI will read again directly from the bill: `` . . . the national…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…inadmissible.                   Mobilizing Against Sanctuary Cities Act\n\nRevokes federal funding from state and local jurisdictions       that fail to honor ICE detainers or ignore communications       from ICE.\n\nWe must put Americans first by ensuring the safety of our       citizens and the security of our Nation. In Congress, I will       continue…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…side of the aisle, whether  they are in this Chamber or in the other Chamber or in State houses  across this country, my colleagues on the other side of the aisle want  to ignore what has happened to these five Americans.\n\nBy the way, they are simply the faces of hundreds of thousands of  Americans who have lost their lives violently through narcotics,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…cartels have tens of  thousands of members who wake up every day and see it as their sole  mission to flood the United States with lethal drugs. My Democrat  colleagues want to ignore that.\n\nSinaloa and Jalisco alone have 45,000 members combined. The Gulf  Cartel has 50,000 members. MS-13 has another 30,000. They are coming  across the Gulf constantly. Mr.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…simple. Only American citizens should be voting in American  elections. I can't believe we are even having to say that.\n\nRight now, our system has real gaps, and the longer we ignore them,  the more confidence we lose. Some of the left would rather keep those  loopholes wide open than ensure the integrity of our elections.\n\nWe have already seen what happens…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…a choice to make.\n\nThey thought it was cute to defund the police. That didn't work out  for  cities like Portland, Seattle, and St. Louis.\n\nThen they thought it was cute to ignore our border. They allowed  millions to storm America. Many were sex traffickers, drug runners,  child predators, murderers, and thugs. Now thugs are rioting and  burning Los…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…country that if they do  not have direct, actual control over the worker, the Federal Government  is not going to pretend they do just to satisfy a political agenda.\n\nWe cannot ignore the retirement security of our constituents. H.R.  2988 is a commonsense safeguard. When an American worker hands over  their hard-earned paycheck to a fiduciary, they expect…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Immigration Compliance Act, which simply ensures that D.C.  follows Federal immigration law. That is because no city, especially  not our Capital, should get a free pass to ignore the laws of the land.\n\nIn 2019, D.C. Mayor Bowser approved the Sanctuary Values Amendment  Act of 2019, which, according to the Mayor's Office, ``limits the  District's cooperation…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and the minority, I first want to apologize to  everyone. I have one of my crappy lung infections, so at some point, I  am going to start coughing and doing an inhaler. Just ignore me.  Somehow, I thought that would be funnier.\n\nMr. Chairman and my good friend, Mr. Beyer, I think this is somewhat  of a unique opportunity. Those of us from the Joint Economic…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]