[{"senator": "Kim Schrier", "party": "Democrat", "sentence": "…old. She was a  widow for 42 of those years and helped care for five of her  grandchildren.\n\nKathleen's mom lived through the deprivations of the Great Depression  and World War II and was never one to complain. She lived simply.\n\nIn the last decades of her life, she had a number of serious, complex  medical conditions that presented real challenges for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…currently seeking to join the IMF, and I believe we should  support this effort.\n\nThe IMF was formed in 1944 to encourage economic cooperation and  stability after World War II. Today, the IMF offers technical  assistance related to sustainable economic growth and an international  reserve to provide liquidity, among other services it provides to its…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…could have been called his  national insecurity strategy.\n\nTo say it is bad is a misstatement, understatement. It is disastrous.  During Europe's largest land war since World War II, the strategy saves  its harshest criticisms for our allies rather than Russia, with war  criminal Putin, who started the war.\n\nThe document elevates strongman leadership models…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697955/national-insecurity-strategy"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…value, saying: Without  the military help of the Black freedmen, the war could not have been  won.\n\nIn what textbook do we find that? I would say very few, if any.\n\nWorld War II saw the service of many African Americans who never got  their just due in or out of the military.\n\nMy father had two brothers. Both of them, William and Charlie, served  in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans, but also their families.\n\nThis pension benefit is not, nor was it ever, a handout. It was an  earned benefit that Mr. Peltz secured through his service in World War  II. I will continue to fight until every beneficiary gets the benefits  that they earned, no matter how long that takes. We must continue to  expand veterans' benefits for all those…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, the core of NATO is Article 5:  An attack on one is an attack on all.\n\nSince the end of World War II, the U.S. and our allies have honored  and operated on this mutual trust. President Truman called it a  neighborly act.\n\nThere is no article for if a NATO member attacks another…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…not just something we remember. It is something that  teaches. When we strip away the truth, we strip away all the warnings  that go along with it.\n\nIn fact, during World War II, Fort Bliss in Texas was used as a  detention center for Japanese Americans. Today, you don't see a sign.  You see another active detention center.\n\nThis administration is detaining…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699717/rewriting-history"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…would lead inextricably to the greatest war in  history.\n\nHopefully, this administration's rush to appease Vladimir Putin will  not lead to the carnage like that of World War II. But it well may cost  Ukraine its sovereignty and independence while also undermining the  international order--the very same order that America and her allies  created from…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Islamist-led rebel offensive last year has       reportedly been followed by an uptick in contacts with       Haftar, who met Putin in May at Russia's 80th anniversary       World War II Victory Day parade.\n\nIt's not just Moscow or even adversaries of Washington that       the Government of National Unity suspects of seeking a       lasting piece of Libya. Sahad…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…excluded or deported from the United  States.'\n\n``Similarly, the Alien Enemies Act of 1798 permits summary  deportations during times of war and was last invoked during World War  II. These provisions now have novelly been used during peacetime as  grounds to send Department of Homeland Security agents to the homes of  individuals with varied alien status,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…not the might of our arms or size of our  aircraft carriers; it is the strength of the alliances we have around  the world.\n\nThe web of partnerships we built after World War II, NATO, our  Pacific alliances, our hemispheric relationships, they are force  multipliers. They help us keep the peace. They are the reason that a  nation of 340 million people…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…coming in to buy up the  apartments and colluding to drive up the rents so it is even more  unaffordable to keep a roof over your head.\n\nIt wasn't always this way.\n\nFrom World War II to the late 1970s, we actually rigorously enforced  our antitrust laws to ensure that mom-and-pop businesses had a chance  to compete against these megacompanies. Consumers had…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…was the founding chair of the Council on Women's Leadership at the  Meridian International Center, fostering dialogue and leadership  development for women in support of Track II diplomacy. She has always  been fascinated by the power of fashion. She says diplomats defend U.S.  interests not in uniforms, but in suits, blouses, ties and, in her  case,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…was born in Honolulu, HI, on September 11,  1924. Senator Akaka graduated from the Kamehameha School for Boys in  1942. Upon completing high school at the height of World War II, he  served in the U.S. Army Corps of Engineers from 1943 to 1945 and the  U.S. Army from 1945 to 1947, with deployments to Saipan and Tinian.  Following his military service,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…the officers remain, as does the attack  on our democracy.\n\nWhen we talk about democracy, it is easy for it to feel merely like  an abstract principle. But my dad, a World War II veteran, stressed to  me, even as a kid, that freedom and democracy made a real difference in  people's lives. Democracy is, in short, the best way to solve problems  without…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…``appropriate congressional committees''       means--\n\n(i) the Committee on Foreign Affairs and the Committee on       Armed Services of the House of Representatives; and\n\n(ii) the Committee on Foreign Relations and the Committee       on Armed Services of the Senate; and\n\n(B) the term ``FMS-only list'' means the list maintained by       the Secretary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…entity, that--\n\n(i) the Chair has made a public determination that such       entity is owned by, controlled by, or subject to the       influence of a foreign adversary; or\n\n(ii) the Chair otherwise determines that such entity poses       a threat to the national security of the United States.\n\n(B) Criteria for determination.--In making a determination…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Increase.--Each dollar amount       described in subsection (b) shall be increased by the same       percentage as the percentage by which benefit amounts payable       under title II of the Social Security Act (42 U.S.C. 401 et       seq.) are increased effective December 1, 2025, as a result       of a determination under section 215(i) of such Act (42…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696763/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…America.\n\nMr. Bart Mitcham was born on December 24, 1945, in Ada, Oklahoma, to  John and Virginia Mitcham. Bart's parents both served in the United  States Navy during World War II, with his father serving as a naval  aviator on the USS Hornet during some of the most critical moments in  the Pacific theater.\n\nBart knew from an early age that he wanted to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…etched in history is Private  First  Class Foster Sayers, a 20-year-old infantryman from my hometown of  Howard, Pennsylvania, who answered the call to serve during World War  II.\n\nOn November 12, 1944, while fighting near Thionville, France, Private  Sayers singlehandedly charged enemy positions, drawing fire away from  his unit and allowing his fellow…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Hitler's provocative behavior, saying: He is just saying these  things.\n\nWell, we know that didn't work out too well. Last month was the 80th  anniversary of the end of World War II, the Nazi regime. One of the  centerpieces of the Nazi regime was to kill the Jewish people. They put  the Jewish people in concentration camps, gas chambers, and they tried…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the Administrator:\n\n``(i) Individuals with demonstrated expertise in artificial       intelligence, including--\n\n``(I) not less than one individual from the private sector;\n\n``(II) not less than one individual from academia;\n\n``(III) not less than one individual from an organization       with demonstrated expertise in ensuring artificial       intelligence…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…themselves: Promises made, promises kept.\n\nHonoring the Life of Lieutenant Colonel Boyd ``Buzz'' Wagner\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor World  War II ace pilot and Johnstown native, Lieutenant Colonel Boyd ``Buzz''  Wagner.\n\nBuzz completed his flight training in 1938 before he was assigned to  the Philippines. When Japanese…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "John Rose", "party": "Republican", "sentence": "…been for the Opry. But the longtime show isn't  exclusive to Tennessee's story. No, it's part of American culture.\n\nThe Opry was around before the Great Depression and World War II. It  has seen a lot, endured a lot, and served as a beacon of hope decade  after decade.\n\nThe program's venue has moved within Nashville a few times, but it is  primarily known…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…we have to  protect ourselves against hypersonic missiles. I think Israel is doing  a good job at that.\n\nWe have to prepare for the next war, not prepare to refight World War  II.\n\nI think it is important for our press corps to publicize people who  talk about the new type of munitions and the new type of armaments we  are going to need in a new war.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the current year, which shall identify--\n\n``(A) with respect to each such civil action--\n\n``(i) the defendant lead agency, where applicable, and each       plaintiff; and\n\n``(ii) the court in which the civil action was brought and       any court to which a decision on the civil action was       appealed;\n\n``(B) the number of such civil actions, disaggregated…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…DEVELOPMENT PROGRAM FUNDS MAY BE USED TO                     REPLACE CHINESE PORT CRANE HARDWARE OR                     SOFTWARE.\n\nSection 54301(a)(3)(A)(ii)(III) of title 46, United States       Code, is amended--\n\n(1) by striking ``including projects to improve port       resilience;'' and inserting ``including--''; and\n\n(2) by…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692200/maritime-supply-chain-security-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Hawthorne of Sun City Center who served in the       U.S. Navy during the Iraq War.\n\nRoberta Jordan of Riverview who served in the U.S. Army       outside of war time.\n\nRobert Lucas, II of Sun City Center who served in the U.S.       Army outside of war time.\n\nDanny Melton of Riverview who served in the U.S. Marine       Corps outside of war time.\n\nMaryAnn Rowe…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Transmittal No. 24-0M       Report of Enhancement or Upgrade of Sensitivity of Technology           or Capability (Sec. 36(b)(5)(C), AECA)\n\n(i) Purchaser: Republic of Turkiye.\n\n(ii) Sec. 36(b)(1), AECA Transmittal No.: 13-56; Date: May       12, 2014; Implementing Agency: Navy.\n\nFunding Source: National Funds.\n\n(iii) Description: On May 12, 2014, Congress…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687983/arms-sales-notifications"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…me addressed, the United States has  a massive debt problem. So does a lot of the rest of the world.\n\nThe last time the planet had this much debt was at the end of World  War II. The main difference is at the end of World War II, we knew we  had to spend less money, and we did. Our debt-to-GDP ratio, the amount  of money we owe versus the size of our…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}]