[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…anymore. How is anyone supposed to follow the legal  steps if even those are now a risk?\n\nRepublicans claim over and over again in committees that this is only  about illegal immigration. It is not. If that were the case, then they  would be just as outraged as I am that people are being snatched  outside of their court hearings.\n\nIt is an attack on…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. Speaker, before November, Americans wondered whether our best  days were behind us. Democrats fueled inflation. They opened our  borders, funded illegal immigration with your tax dollars, and  increased IRS audits on the middle class, all while leaving the working  class behind.\n\nPresident Trump promised to make America great again,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…detainer,  ignored for 2 years. States have refused to work with ICE for 25,000  people that have a detainer at the Federal level.\n\nSanctuary city law is a magnet for future illegal immigration.  Sanctuary city policies are full of fraud like in Minneapolis. They  bring out the worst in the system, not the best, and it breaks down law  and order.\n\nWe have been…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…commending Congresswoman Bice for partnering with me  on this important issue.\n\nAs to the bill, Mr. Speaker, no matter the type or category, all  crime is made worse by illegal immigration. Theft, assault, murder,  drug trafficking, human trafficking, violent crime, and property crime,  you name it, Mr. Speaker, illegal immigration makes it worse.\n\nWhat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…yielding  and for holding this hearing.\n\nMr. Speaker, these are the kind of conversations the American public  needs to hear. They need to understand the impact that illegal  immigration is having on our country and how it undercuts the rule of  law and really undercuts those people who truly want to play by the  rules and enter the United States in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…southern borders  secure again. Now it is our job here in Congress to ensure Federal law  enforcement and prosecutors have the tools that they need to deter  further illegal immigration.\n\nMadam Speaker, I look forward to supporting this strong, commonsense  piece of legislation on the House floor this week as we continue to  work to make our Nation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…community. In May, they turned over 13 illegal immigrants to ICE  custody.\n\nWe understand the real consequences of sanctuary policies. Colorado  has become a haven for illegal immigration. In one tragic case that we  all now know about this week, an illegal immigrant who overstayed his  visa launched Molotov cocktails at innocent Boulder residents in…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…office for a matter of weeks, but he  has already built a considerable record of success. Chief among his  successes, of course, is the work he has been doing to confront illegal  immigration and restore order to our southern border.\n\nOver the weekend, it emerged that there were just 8,450 encounters,  approximately, at our southern border for the entire…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…integrity.\n\nMr. KNOTT. Mr. Speaker, I thank the Congressman from North Carolina  (Mr. Moore).\n\nCongressman Haridopolos and I have had many conversations about the  cost of illegal immigration on programs that are designed to help and  support vulnerable Americans, especially Medicaid.\n\nCongressman Haridopolos has extensive experience in the Medicaid  space,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…happened in Wake County,  North Carolina, in 2022, where a sheriff's deputy was ambushed and  killed by an illegal immigrant. I am not trying to open up the debate  on illegal immigration. Fortunately, this body has taken action, along  with our President, to secure the border and to stop gang members from  coming into this country.\n\nYet, someone who…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…he was arrested. He has since fled  to the United States, to a country in which you can still tell jokes  about transgenderism so far. You can still tell jokes about illegal  immigration and not go to jail.\n\nNow, we were supposed to care about this, and we do care about it  because it affects our platforms. Insofar as the European governments  put restrictions…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Moines, Iowa, school district superintendent at the time of his arrest.  After his arrest, it was found that Roberts was a registered voter in  Maryland despite his illegal immigration status and long criminal  record. It was a criminal record filled with narcotics trafficking,  driving vehicles he shouldn't have been driving, unauthorized  possession…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Tennesseans I represent to express appreciation to President Trump and  his administration on their bold action over the last 100 days.\n\nAfter 4 years of unprecedented illegal immigration under President  Biden, our borders are finally under control. After 4 years of deficit  spending, we are grateful to have a Chief Executive who is willing to  cut waste,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "John Thune", "party": "Republican", "sentence": "…action to deter  our enemies and protect our Nation, and that is exactly what he has  been doing, both here at home and abroad.\n\nNeedless to say, 4 years of recordbreaking illegal immigration at our  southern border, under President Biden, left a gaping hole in our  national security. The chaos that raged at our southern border was an  invitation to terrorists…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689044/border-security"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Democrats.\n\nPresident Trump won in 2016 on a few issues, but the electrical cord  that began when he came down the escalator, that continues to this day,  is taking on illegal immigration and the forgotten men and women of  this country whose jobs were initially displaced when the failed  policies of the politicians of this town sent their jobs overseas--the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Laken Riley or whether it was the women who were raped, the  women and men who were killed, those who were beaten, or those who were  hurt who were in law enforcement.\n\nIllegal immigration is not a good thing. Yes, there are a few illegal  immigrants who came to this country who are illegal but just trying to  make their way but doing it the wrong way,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}]