[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…of the ICE agents' reasonable suspicion? The court  reviewed it and found that the government said: It was based on their  past experiences that have demonstrated that illegal aliens utilize and  seek to work at certain places, like getting their car washed or  waiting for the bus.\n\nNothing about these men suggested that they were in the country  illegally…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…yesterday leave  no doubts. A Department of Homeland Security spokesperson declared for  the first time--now, I want to make sure I get this right, so I am  going to quote:\n\nIllegal aliens who claim to be recipients of DACA are not       automatically protected from deportations.\n\nShe went on to say that DACA recipients should now self-deport from  the United…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the District of Columbia  safe and beautiful by directly supporting the directive for enhanced  coordination between the Federal Government and law enforcement  regarding illegal aliens.\n\nMr. Speaker, I encourage each of my colleagues to support this  critical legislation sponsored by Mr. Higgins.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…insult to women.\n\nMr. Speaker, let me remind you why we are here. We are here because  this previous administration, the Biden administration, imported 10 to  15 million illegal aliens who have come here and we have evidence that  they are participating in our elections.\n\nThe next thing you will say is: Did they get Social Security numbers?  Mr. Speaker,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…to the Constitution.\n\nSecretary Rubio also made that same statement on ``Meet the Press''  as well, saying everybody goes through due process--everyone has a  process.\n\nIllegal aliens do not have rights like American citizens. No one is  denying that. That is a fact. But there is a process they are being  taken through. The law is being followed. I watched…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, I rise in opposition to Democrats  trying to give voting rights to illegal aliens.\n\nMr. Speaker, once again, Democrats are taking the 20 percent side on  another 80-20 issue. The American people do not want illegal aliens  voting. They shouldn't be here…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…that weak borders have had on our wonderful country. Of  course, there are pressures on housing, healthcare, and education  wherever there are millions and millions of illegal aliens allowed to  come into the country and then placed throughout our country.\n\nOf equal, if not greater, concern to me is the rampant growth and the  effects of transnational…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…against  tax relief for tips, against tax relief for senior citizens. They went  on record against protecting Medicaid by advocating for the enrollment  of 1.4 million illegal aliens. They went on record against increasing  the quality of life funds for our Nation's military families.\n\nWe have a rule before us to protect H.R. 1's process in the Senate…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…countries are  being returned to the country of their origin.\n\nUnder Biden, our emergency departments and local hospitals became the  preferred free healthcare provider for illegal aliens, driving  healthcare costs through the roof while the American taxpayers footed  the bill.\n\nWe didn't need legislation to put America first. We needed a new  President.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…the Democrats' hypocrisy even further, in funding  negotiations, Chuck Schumer and House Minority Leader Hakeem Jeffries  are demanding that ICE agents show IDs to arrest illegal aliens. They  support photo ID to enforce immigration laws but oppose photo ID to  ensure our elections are secure. This is incredible hypocrisy.\n\nIn Proverbs 11:9, God says:…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the human trafficking, the sex trafficking, the American people  suffered the consequences.\n\nJust this month, earlier this month, authorities charged eight  Venezuelan illegal aliens in Middle, TN, for trafficking women across  our border for the purpose of sexual exploitation. That was eight  Venezuelan illegal aliens. After entering our country illegally,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…successful first 100 days in office.\n\nUnder President' Trumps leadership, he has successfully closed the  southern border. For the past 4 years, our country has been invaded by  illegal aliens, many of whom are on the terrorist watch list, members  of the Taliban, members of the Chinese Communist Party, not to mention  MS-13, gangbangers, human traffickers, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…They did nothing to stop the invasion at the  border. They had words, but that is all it was.\n\nThey want the American people to know that it is their money to spend  on illegal aliens' free college tuition, putting it on the backs of the  everyday working man.\n\nThis is the first step in a long journey of what we are voting on  today. From the very first…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that, as  much as my colleagues on the other side of the aisle want to bring up  the DMV, the American people know that the DMV is very good at giving  driver's licenses to illegal aliens because we know it to be true. We  know that there are people who have been indicted for voting illegally.  We know that there are voter rolls with massive numbers of people…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…frustrated with the Senate numbers, but in DOGE we trust. I  think we can achieve a trillion dollars of savings as a result of its  work. The mass repatriation of millions of illegal aliens should save  another $150 billion. Restoring the work requirement for able-bodied  welfare recipients will save hundreds of billions of dollars more  without touching a…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Salvadoran alien convicted of sexual  assault on a child.\n\nThey have arrested an illegal alien from Mexico convicted of selling  cocaine and methamphetamine and multiple illegal aliens from Laos  convicted of rape, assault, kidnapping, and sodomy of children under  the age of 13 and domestic violence.\n\nThey have arrested convicted murderers from Mexico,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…administration  allowed illegal immigrants to stay in the country even after committing  horrible crimes.\n\nThis piece of legislation would give the courts the ability to deport  illegal aliens from America and bar them from reentry if they are  convicted of a DUI or a DUI-related charge.\n\nThis issue hits home for me. In my district, a 15-year-old girl and  her…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}]