[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…military to  illegally seize voting machines. He is not shy about this, folks. He  thinks he has the Department of Homeland Security now more willing to  carry out such illegal actions this time around. So, yes, the threat is  real.\n\nOr consider his former White House adviser who has called on the  President to deploy ICE to intimidate U.S. citizens…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…unlawful and unconstitutional things, not because of judicial  overreach. This bill a scheme to give more power to the President,  making it easier for him to carry out his illegal actions without  consequence.\n\nI urge my colleagues to reject this bill.", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and substance abuse issues is not a priority.\n\nUnfortunately, Republican majorities of both the House and the Senate  silently sit by and watch all of the destruction and illegal actions.  House Republicans have not conducted any oversight of this  administration.\n\nLet us not forget also, Mr. Chair, that last month, House Republicans  passed the biggest…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…handing U.S.  global leadership over to the dictators on a silver platter, leaving us  alone in the world.\n\nThis bill attempts to rubberstamp the Trump administration's illegal  actions, blocking funding already approved by Congress, firing career  public servants, and hollowing out entire agencies.\n\nLet's be honest. These are not going to lower the costs…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…millions of people. To Musk and his DOGE agents, the law  be damned. Congress be damned. The American people be damned. The world  be damned.\n\nThe precedent being set by these illegal actions is a lasting threat  to the American people, to our global leadership, our national  security, our reputation around the world, and to the checks and  balances that are…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…in many ways, it also falls  short in some crucial areas. Above all, it falls short in its lack of  meaningful policy to rein in the Trump administration's reckless and  illegal actions.\n\nOut of fealty to their dear leader, Republicans have refused at every  turn to perform meaningful oversight of this administration, to push  back on Trump's worst impulses,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…to hamstring the courts so that Trump can't  be stopped.\n\nWe need our courts to continue to serve as a bulwark of democracy  against the Trump administration's flood of illegal actions. That is  why I rise today in opposition to this bill.\n\nMr. Speaker, I include in the Record an April 2, 2025, letter  addressed to Pam Bondi from 500 law firms and lawyers…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…programs that ensure children without  financial means can go to and succeed in college without incurring more  debt than they could ever pay off.\n\nThe Trump administration's illegal actions to dismantle the  Department of Education will ensure that these gaps remain. The  administration claims that it is just returning control of public  education back to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…democracy following today's  election of Lee Jae-myung.\n\nLike us, the people of South Korea have witnessed the mortal danger  to democracy posed by lies, by corruption, and by illegal actions  directed by those at the very top.\n\nThe Korean people responded with courage and defended their democracy  through peaceful civil disobedience, through lawful impeachment,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691847/south-korea-election"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the CDC and the FDA.\n\nThese workers now have had their voices silenced and have no  whistleblower protection if they report about working conditions or  safety or even illegal actions taken by their agency. They have lost  their voice to demand fair treatment or due process, and they have lost  the protection for their job.\n\nThis is coming from an administration…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697868/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…citizens, they  are going to be further crushed. That is whom we partner with.\n\nAnd he knows he doesn't have this trade authority. Small businesses  have had enough of Trump's illegal actions and have successfully  challenged the tariff authority twice already. He lost in the district  court. He lost in the circuit court. And next week, this case is going…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…antidemocratic agenda.\n\nDespite being in the minority, House Democrats are working tirelessly  to push back against Trump's hostile government takeover by litigating  his illegal actions, introducing legislation to curb his powers, and  mobilizing the public against his destructive agenda.\n\nI have joined thousands of Georgians and millions of Americans…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…real-world  impact, and I really want to beseech my Republican colleagues to help  us end the madness. Find your spines to stand up to the chaos and  confusion that all of these illegal actions are having on our folks  back home. I mean, right now laying people off, public servants who  provide essential services, the illegal pause in funding--thank  goodness…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…harmful Executive actions, the Trump  regime has sown chaos, corruption, and cruelty from day one. It is no  wonder that there are now over 300 lawsuits to stop Trump's illegal  actions.\n\nIt is clear Trump doesn't give a rip about our government or the  millions of Americans who rely on the services it provides. That  includes the U.S. Department of Education,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, I rise today to speak about Elon Musk and the  Department of Government Efficiency, or DOGE, and the deadly and  devastating consequences of their illegal actions, which will  reverberate long after they are gone. The theme of today's Special  Order hour is that the Musk is gone, but the stench remains.\n\nElon Musk supposedly has…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…injunction.\n\nThere were plenty of opportunities to disagree, but I hope that my  colleagues, once again, as the speaker has so well stated, will stop  claiming that these are illegal actions when we simply agree or  disagree with the actions of the President and in many cases the Court  finds the President is well within his rights in faithfully executing…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…disregarding your basic electorate on  questions like who gets to be a part of our shared society.''\n\nThis bill provides for sanctions against Georgian Dream thugs for  their illegal actions, and it also provides for stronger bilateral ties  after confirmation of Georgia's return to adherence to its  constitution.\n\nMadam Speaker, I urge support for this legislation…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]