[{"senator": "Al Green", "party": "Democrat", "sentence": "…think he  will. Even he understands that he was making a serious mistake.\n\nHere is the problem with that mistake: He has hurt the brand, the  American brand. He has hurt the image of the country. He has put the  country in a position such that people may no longer think that this is  the safest place for their investment dollars. They may not want to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…developmental delays all his life. His  condition requires special care and attention. He didn't choose to be  disabled or to have additional needs, but he is made in God's image,  and he deserves every opportunity to reach his full potential.\n\nBecause of programs established by IDEA, children like RJ can access  the same educational assistance and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…issues are more  consequential than the career or advancement of any single member of  the Department of Defense team. This Secretary seems more concerned  with his own public image than the safety of our servicemembers because  he has violated basic security protocols.\n\nWe are talking here about an official who will be responsible for  securing our national…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…terms of numbers, although I could argue that there are large  numbers, but there are many in terms of being smaller now who would  like to enlarge their persona, enlarge their image, enlarge their  reach, enlarge their power, many Trumps who want to be another Donald  Trump. They are out there, and we need to do something to let people  know that when…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…sent to assess the damage to see what we needed to  do to help were fired while they were in Myanmar trying to figure out  what we can do to help that situation.\n\nSo China's image is being bolstered at our expense.\n\nAcross Africa and Latin America, Chinese Ambassadors are giving  interviews focused on the unreliability of the United States as a  partner.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Federal judge found that the shadowy trade  association was the alter ego of the real coal council, with no clear  lines of separation between the Federal entity and its mirror image.\n\nOfficial Coal Council events were funded by the trade association. At  a meeting of the government's Coal Council, a speaker called upon  members to become dues-paying members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…$2.50 coin.\n\nWe are already witnessing how Secretary Bessent has exploited  loopholes and ignored existing laws, resulting in the Treasury minting  a $1 coin bearing Trump's image. The Treasury's decision to put Donald  Trump's face, a living President, on our currency is illegal and  reminiscent of a monarchy, which 250 years ago our country firmly…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…``Hey man, you all right?'' and he sort of waves me off. But,  immediately, I realized my tone wasn't right. This is a man with equal  dignity, God's creation made in God's image, and I said--my words  weren't respectful enough.\n\nSo I lowered my tone, and I said: Excuse me, sir. I am sorry to  bother you, but do you need anything?\n\nHe turns around and…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…region and beyond;\n\nWhereas, the Centennial Celebration, joined by       International President Elsie Cooke-Holmes and Mistress of       Ceremonies, actress, comedian, NAACP Image Award Winner, your       Soror, Kym Whitley, highlights the legacy and continued       excellence of this dynamic organization;\n\nNow, therefore be it resolved, that I, Congresswoman…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…they wanted. It is that corrupt promise that explains  Trump's behavior, not that he is representing the United States of  America.\n\nI thought this cartoon made a pretty good image of what is going on  in the Trump White House.\n\nAnd we know that he doesn't represent America because we can do  things like test public opinion and polls. And I have a recent…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…democracy.\n\nVermonters are outraged by what is happening. Dozens have already  lost their jobs. They want the United States to be a leader for good in  the world. They care about the image of the United States as the  world's oldest democracy. They are smart enough to know that abandoning  friends and allies is how you lose friends and allies.\n\nThe destruction…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…banners of the  President of the United States surrounding the U.S. Capitol. But next  to the banner of Donald Trump on the Department of Labor building is a  banner depicting the image of Teddy Roosevelt. I guess it is an attempt  by the President to draw an equivalency between himself and Teddy  Roosevelt. That is a pretty--that is a stretch.\n\nBut Teddy…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…his Nation, an individual who was taken from  us in the summer of his years.\n\nHis daughter, Caroline, back in 2017 gave us these buttons, pins,  that I proudly wear. It is an image of President John Fitzgerald  Kennedy.\n\nPresident Kennedy epitomized placing service above self. He was a  national hero and a leader who had the grace, the dignity, the wit,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697104/saluting-the-life-of-john-fitzgerald-kennedy"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Christianity in secret through a network of  underground churches and online classes in Iran. Last December, she set  out for the United States in search of a new life. In a haunting image,  she was photographed from inside her detention room in Panama with the  words ``help us'' written on the window in her red lipstick.\n\nArtemis is 1 of 10 Iranian Christians,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…or care for  seniors, what is going to happen to grandma, grandfathers, those that  are affected by it? It is the largest funder of opioid addiction  treatment.\n\nRemember the image of Elon Musk--the richest man in the world-- laughing gleefully as he danced around a stage with a chain saw in his  hand? The richest man in the world was laughing out loud…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Greene for bringing this bill up for debate  here on the floor. I am a proud original cosponsor of this legislation.\n\nWe have heard a couple of people say that we are made in the image  and likeness in God. For all of our clever scientific methods and self- rationalization out there, that is an absolute truth.\n\nWhat this legislation is trying to do, and what…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…capital region--Tangipahoa Parish, going  up to Monroe, LA--it was almost a statewide event.\n\nNow, if we built resiliency, this doesn't happen. If you look at  this, can you image the Federal response?\n\nThey were so honored then-Presidential candidate Donald Trump came  down and spent time in Livingston Parish after this flood to call  attention to it…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "French Hill", "party": "Republican", "sentence": "…minted and       issued under this subsection shall, during the 2-year period       beginning on the date the Secretary issues any coin under       this subsection, bear the image of allegorical liberty       wielding the Declaration of Independence featured on the gold       $2.50 Sesquicentennial Coin issued in 1926.\n\n``(B) Reverse.--The reverse design…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…celebrated our Nation's 150th anniversary by authorizing  the United States Mint to commemorate the 150th anniversary of  America's independence.\n\nBeside me right here is an image of the historical design that was  used back in 1926. This bill puts strict design parameters around the  new $2.50 coin  to continue that tradition. The only changes that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…H. Res. 916\n\nResolved, That upon adoption of this resolution it shall be       in order to consider in the House the bill (H.R. 4312) to       protect the name, image, and likeness rights of student       athletes and to promote fair competition with respect to       intercollegiate athletics, and for other purposes. All points       of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Washington to drag  you into an unnecessary war of choice. Washington has spent decades,  trillions of dollars, and thousands of lives trying to remake other  countries in our image. The American people are sick and tired of their  elected representatives in Congress standing idly by saying: Nothing to  see here; the President can do whatever he wants,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…how certain conduct is defined and  prosecuted.\n\nIn that case, the Court interpreted existing statutory language in a  way that limited accountability, even though a child's image was used  in sexually exploitative conduct.\n\nMr. Speaker, that outcome underscores an important reality. A child  is harmed whenever their image is intentionally placed into…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…conviction as a sex offender up to  the time of his arrest and then death in 2019;\n\nWhereas Delegate Plaskett's relationship with Epstein stands in stark  contrast to the public image she has curated for herself as a defender  of justice and accountability while secretly collaborating with an  individual whose crimes against vulnerable women and children…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…tin-pot  dictators, authoritarians, and strongmen around the world who will  watch this video and be encouraged and think this is the way to silence  their critics.\n\nI can't image a Member of this Chamber who knows Alex Padilla, who  has had the blessing of sitting with him in moments when he is asked  questions or engaged in discourse, who thinks of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…charge of Iran, and they have  three goals: to purify Islam--about 80 percent of Islam is Sunni; Saudi  Arabia is the center of that part of the religion--to purify Islam in  the image of the Ayatollah, to destroy the Jewish State, to drive us  out of the Mideast because we are infidels.\n\nThis is not a democracy. It is a theocracy. If you have got any time…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…hospitality industry and encouraged steamboats to  bring visitors to Sebago. What were once seasonal homes and inns  evolved into year-round abodes that contribute to Sebago's image as a  well-known resort area in southwestern Maine.\n\nSebago is home to many examples of charming New England architecture  on the National Register of Places. One of the most…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…service initiative focuses on the importance of  fueling your body and recognizing when you need rest. It is her mission  to share her story so that those struggling with body image issues know  they aren't alone. She hopes to promote sustainable habits and a  positive self-image for the next generation.\n\nOlivia represented our Buckeye State in the Miss…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…era with       its new opportunity for creative human unity within enriching       diversity, upholding universal human dignity and equality via       restoring God's violated image, ``I hope it will appeal to       non-Jewish readers as well, especially to Christians,       partners in the struggle to overcome millennia of hostility       and delegitimization.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…harmful behaviors.\n\nResearch reveals a list of psychological effects stemming from modern  pornography on the developing brain include anxiety, addiction, low  self-esteem, body-image disorders, an increase in problematic sexual  activity in younger ages, and increased desire among minors to engage  in risky sexual behaviors.\n\nThere are 16 States that have…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688197/blocking-and-filtering-software-is-ineffective"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…to correct. No child is born in their wrong body. There are  only two sexes. They are male, and they are female. There are no  others.\n\nEvery child is created in the Lord's image, and we cannot remain  silent while demonic forces are here today on the floor, the left, here  to groom children and defend it.\n\nChildren are innocent. For too long, Democrats…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698349/protect-childrens-innocence-act"}]