[{"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…Muller who was  in custody on his other similar crimes, and he asked Muller if he would  want to talk about the crimes against Aaron and Denise. Madam Speaker,  if you can imagine this, Muller responded, and he admitted what he did  do to Denise.\n\nFurther investigation by the group and getting the FBI involved led  authorities to the Lake Tahoe cabin…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689139/recognizing-seaside-police-department-chief-nick-borges"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…ethic,  commitment to the health of our coast and coastal economy, and  collaboration across industries have made our state a better place in  innumerable ways. I could not imagine a more deserving recipient of  this honor.\n\nI commend Pat for his unparalleled career of service and congratulate  him on this award.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…different components of the resource management plan. They are  fortunate that the Secretary of the Interior happens to be a former  Republican Governor of North Dakota, and I imagine if they call him  that he will pursue a reopening of this resource management plan.  However, taking this step, foreclosing the ability of those Alaska  natives who are Vietnam-era…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…floor and extol the virtues of the  legislation that Republicans have pursued on commercial refrigerators.  I wonder why. It is probably not an accident.\n\nMr. Speaker, I can't imagine that there are a lot of Republican  Members of Congress who wanted to sign up to come do floor debate today  on commercial refrigerators. In light of the biggest mishap on…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…These decisions belong to parents, their children, and  their healthcare providers, not politicians.\n\nEvery parent wants what is best for their children. As a parent, I  cannot imagine how I would feel if a doctor told me that Republicans in  Congress banned lifesaving, evidence-based care that would help my  child.\n\nMedical care for transgender youth is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…happen to me. That cancer diagnosis  is not going to happen to me. That rare disease that affects the  child--it is not going to happen to me.\n\nBut when it does and they can't imagine how they will make ends meet,  they find in the Cherry Hill Clinic doctors and medical professionals  willing to step up. And they have been doing extraordinary things. It…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…to  the occasion to take the UConn women's basketball program into further  heights with its 12th national title. All records are made to be  broken, but it is hard to even imagine any other school's team that  could come close to 12 national titles.\n\nThey were led by Paige Bueckers who is going to be one of the greats  in the history of college basketball.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…how they were worried they were going to  have to close because of Medicaid cuts, the gentleman who represents  that area said that Democrats are just spreading fear.\n\nWell, imagine my surprise--actually not surprised--when last week  Augusta Medical Group, which covers parts of southwest Virginia,  announced they were closing three primary care centers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…actually repudiate and denounce anti-Semitism when it actually appears.  When it came out that he did know about it, they were forced to  withdraw the nomination.\n\nMr. Speaker, imagine everyone's surprise when Donald Trump decided to  then make him the United States pardon attorney overseeing a large  office of people considering pardon applications from…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…for the  elderly and the Nation's preeminent antipoverty program for children.  This is something that Congress and the administration need to focus  on.\n\nMy colleagues can imagine how many Americans, whether they are here  today or listening at home, reacted when they heard over the weekend  that Elon Musk, the wealthiest man in the world, the billionaire,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…have seen, and I want Americans to think about how they would feel if  these very things were going on in their own towns, in their own  States, in their own communities.\n\nImagine being pulled over and asked for your papers as you pull into  the parking lot at Target. Imagine Federal agents waiting at the top of  off-ramps from the highway where you…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…with dictators and against our allies. I  never thought I would see the day when our President would be a puppet  for a dictator.\n\nTo my Republican colleagues: Did you ever imagine that you would be  in a party that stands on the side of dictators or on the side of a  country who has killed journalists, with an authoritarian accused of  war crimes, and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687904/putins-merciless-war"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…legislation  is critical, because this legislation says that if they are guilty of  such reckless misconduct, they can be sued for it and held civilly  liable for the damages.\n\nImagine losing control of your own likeness and identity. Imagine  that happening to you when you are in high school. Imagine how  powerless victims feel when they cannot remove illicit…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…drops by 30 years.\n\nNow, some have tired of hearing these sobering statistics, but I will  enumerate them time and again until they change. If you are tired of  hearing them, imagine how tired people are of living them.\n\nThese health disparities persist despite the fact that we in  Massachusetts are home to some of the finest hospitals and brightest  minds…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Speaker, I appreciate the leadership from the  gentleman from Rhode Island (Mr. Magaziner) and the gentleman from  Texas (Mr. Roy) for bringing us together tonight.\n\nMr. Speaker, imagine that, Democrats and Republicans in this Chamber,  in this town, wanting to do something about corruption. That is a good  thing. I hope the American people are paying attention.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…advance new technologies at the FAA, and train and  support air traffic controllers. We cannot--we should not--miss the  moment to act and ensure lasting change.\n\nI cannot imagine the pain each of the families of the victims has  experienced every day since January 29. This week, their loss must be  felt especially hard as they face the anniversary…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…Street'', $6 million for net-zero cities in  Mexico, and $1 million for voter ID in Haiti, not here in the United  States.\n\nWe are only scratching the surface with this package. Imagine being  able to redirect those dollars to veterans' care or specialty crop  programs in a State like mine.\n\nThis package also rescinds funds for NPR and PBS. For decades, public…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692520/rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Don't they have kids? Don't they  even care about their own retirements? It is the absolute vacuousness  of immortality.\n\nI grabbed this from The Wall Street Journal. I can't imagine anyone  here has had protesters and people showing up in their office about  Medicaid, which is supposed to be our safety net for indigents and the  poor. I have some old…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…Trump family, and I know  President Trump really well. I have seen Eric Trump underneath my  vehicle changing the tire on my vehicle so far back in the woods that  you can't imagine how far away we were. They are good people, and they  are a good family, and God knows what he has achieved is off the  charts. It is so good; it is unbelievable.\n\nToday what…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Public Schools, and the Jefferson Award. There is no  question that Bobby's commitment to agriculture was everlasting, and  his legacy will continue to live on. It is hard to imagine Florida  agriculture without Bobby. He embodies exactly what agricultural  advocacy works to represent.\n\nThroughout his life, Bobby worked tirelessly to grow, advance, and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…officer has a flashlight, and  had I not been there, that police officer would have been there by  themselves, and essentially they were there by themselves. I  wasn't armed. Imagine doing that for a living day in and day out.  Imagine pulling a car over on the side of the road and not knowing if  it is just a lady or a man who had a little bit of a lead…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…up with the demand.\n\nThe Chinese, on the other hand, are building new coal-fired plants.  Every 2  days, they are building a new coal-fired plant, which is even harder to  imagine. They are trying to beat us in this race on AI, and they are  not going to let energy be the deciding factor on that.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…spied on could possibly result in destruction  of evidence, intimidation of potential witnesses, serious jeopardy to  the investigation. I am reading that from the gag order. Imagine that.\n\nWe also know that Jack Smith's corrupt team of prosecutors consulted  with the Biden DOJ Public Integrity Section about the subpoenas. They  were informed--get this:…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…recognizing the place they  were stepping wasn't the side of a road but rather a ditch, and they  went down, got swept away in this flood. I can go through each house  and imagine a story that could have been prevented if there had been  resiliency built into this community before this flood.\n\nThe purpose of the BRIC grants is to build that resiliency…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…you don't even need to look at all the bars. It gets kind of  complex. I just want to be real simple. This orange line on this  chart--people in the gallery can't see it, but imagine an orange line  on an X-Y graph.\n\nThat orange line says that under the House bill on a dynamic basis-- what does that mean?\n\nIt means, that accounting for economic growth,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…that makes sense. If you want to find out how to make  ICE more professional, count me in.\n\nBut your proposal is to require a judicial warrant to deport  somebody. Can you imagine how many judges you would need if you got 15  million illegal people here, to go get a warrant from a judge? This is  not a criminal proceeding. This is an administrative…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…saltwater.\n\nWe have all seen the horrible fires that occur when saltwater and  batteries mix. They are horrific, runaway fires. In the Joe Biden  Department of Defense, I can only imagine a scenario where a natural  disaster causes critical installations, just like in my district, to be  stuck with a large fleet of vehicles both burning and inoperable.  Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…Texas was talking about--the air traffic controllers and that  situation. Five hundred safety issues were reported recently in our  skies.\n\nSearch your conscience. Can you imagine--I mean, honestly, think  about it. Imagine what the one Democrat staffer said: We are going to  cling to this until planes fall out of the sky.\n\nThink about how you would…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…$100,000. Remember,  there are 20 million people on ObamaCare today receiving government  subsidies. When you take a look at that level of fraud happening across  the board, imagine how much taxpayer money is being wasted or stolen.\n\nThe losses to the taxpayers is staggering. And that, I would say to  the minority leader who came here and talked about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Security.\n\nThere is $135 million in contributions to the World Health  Organization, which we all saw during COVID was the mouthpiece for the  Chinese Communist Party. I would imagine if we stop this $135 million  funding, the CCP may pick it up because they were regurgitating their  talking points during COVID.\n\nAt some point, Mr. Speaker, the question…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}]