[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…have not tested, and they don't  really know how well they will work. We do because we have some of the  most, I have to say, beautifully designed weapons that I could ever  imagine that could have existed.\n\nMr. Speaker, as we conclude this Special Order hour, it is important  to restate a fundamental reality that nuclear weapons remain one of the  greatest…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…in Washington we don't have enough nursing homes. In  fact, people who should be in nursing homes are now filling hospital  beds because there is nowhere else to go. Just  imagine if more nursing homes close what that will do to hospitals,  what that will do to those patients.\n\nThen think about this: I am in the sandwich generation. If I had a  parent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Ms. ANSARI. Mr. Speaker, I want you to imagine for a moment that a  person is going to the grocery store, grabbing coffee, or picking their  child up from school.\n\nInstead of running errands or waiting for the school bell…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…basketball at UT in person for the very first time.\n\nFrancisca often stays up past midnight to watch Miriam's games on TV  because of the 6-hour time difference. We can just imagine the embrace  in the stands, the tears, the joy, and the gratitude.\n\nMiriam's performance showed talent, discipline, and resilience, but  the real victory was love made visible.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699647/family-sacrifice-and-the-rocket-spirit"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Budget  and Policy, basically, as this chart shows, found that the Affordable  Care Act reduced uncompensated care costs by more than $6 billion in  expansion states.\n\nJust imagine--reduce the cost by $6 billion by just covering people  and not having this tragedy of uncompensated care. Literally, I have  had hospitals tell me that one person can cost…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…how they were worried they were going to  have to close because of Medicaid cuts, the gentleman who represents  that area said that Democrats are just spreading fear.\n\nWell, imagine my surprise--actually not surprised--when last week  Augusta Medical Group, which covers parts of southwest Virginia,  announced they were closing three primary care centers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…passed one of  the most unpopular bills in the history of the country--one of the most  unpopular bills in the history of the country. Now that it is law, we  don't have to imagine anymore what might happen; we know for sure what  is going to happen to tens of millions of people all across the  country.\n\nI want to focus on five things that are going…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…have seen, and I want Americans to think about how they would feel if  these very things were going on in their own towns, in their own  States, in their own communities.\n\nImagine being pulled over and asked for your papers as you pull into  the parking lot at Target. Imagine Federal agents waiting at the top of  off-ramps from the highway where you…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…America.\n\nWe are ceding our competitiveness to China, weakening our scientific  expertise as the envy in the world, and unfortunately, Americans are  paying the price.\n\nSo imagine my surprise by my Republican colleagues and their  reaction. What has their reaction been? Silence. Crickets. It is the  ``Silence of the Lambs.''\n\nIt only took two or three…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…this skill  set.\n\nThis is what we want to say to the young people we have observing the  floor right now. I don't know the full curriculum that they are in and  whatnot. I imagine there is an interest in government. STEM is also of  note. When we were doing STEM education in the lab I was in, we had a  great researcher. This man had a great engineering…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…districts where individuals have  not seen an increase, especially during these inflationary times.\n\nFor a party that used to pride itself on entrepreneurialism and  capitalism, imagine this is the safety net for capitalism and  entrepreneurialism. Where is the money spent in Illinois' 12th  Congressional District? It is put right back in the local economy…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…businesses that are within  range of ocean storms swamping ashore above the 3 feet of sea level  rise, but manageable with respect to considerable amounts of real  estate.\n\nNow, imagine that tomorrow we learn that we have permanently  destabilized the Greenland ice sheet or the aptly named ``doomsday  glaciers'' in West Antarctica. Suddenly, the expected…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…ethic,  commitment to the health of our coast and coastal economy, and  collaboration across industries have made our state a better place in  innumerable ways. I could not imagine a more deserving recipient of  this honor.\n\nI commend Pat for his unparalleled career of service and congratulate  him on this award.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…colleagues, Representative Hayes, found $170 billion with a b--$170  billion to give to the Department of Homeland Security to carry out an  inhumane mass deportation agenda.\n\nImagine if we had $170 billion to carry out a mass education agenda.  That would be wonderful for our country and for our economy. I tell  you: Right now, we are seeing this war on…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…name, the American people ought to be made aware of it, and you ought  to be vitally concerned about what kind of habit this monster could  create.\n\nI couldn't believe it. Imagine, Mr. Speaker, for more than 50 years,  they have been providing this kind of education, teaching kids how to  read, write, and to inquire, but it was all code. This was part…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Banking  Committee.\n\nI am an old man. So I like watching ``Forensic Files.'' I don't know  if young people watch it, but I have been watching it for like 20 or 30  years. I can imagine this being the opening of a ``Forensic File.''\n\nNormally, it is about a perpetrator, and something bad happened. The  prosecutor is going after them because they have the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…Street'', $6 million for net-zero cities in  Mexico, and $1 million for voter ID in Haiti, not here in the United  States.\n\nWe are only scratching the surface with this package. Imagine being  able to redirect those dollars to veterans' care or specialty crop  programs in a State like mine.\n\nThis package also rescinds funds for NPR and PBS. For decades, public…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692520/rescissions-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…really want to study the issue, there is a water  balloon effect here. Medicaid really doesn't reimburse doctors for  their care. It causes private healthcare costs to go up. Imagine the  ire that so many people have.\n\nMr. Speaker, if you talk to a family of four and talk to the parents,  they are going to say, for a family of four, they pay like $1,500…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…do is let's just fix Medicare  Advantage and put it back to how it is supposed to work.\n\nI know we have armies of lobbyists in our hallways here trying to  stop us. Can you imagine why? If there is a couple of hundred billion  dollars in play, they are going to absolutely knife us to stop us from  doing the reforms.\n\nAre we tough enough to do what is…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…humanity to live by? I say the Bible. The  entire arc of the Bible is a story of love and a need for humanity's  redemption. The Bible has wisdom in ways you might not ever imagine.  Humanity will seek to find a book. They will seek to find a code to  live by, and I think it is incumbent upon atheists to tell us what that  should be.''\n\nCharlie Kirk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…Texas was talking about--the air traffic controllers and that  situation. Five hundred safety issues were reported recently in our  skies.\n\nSearch your conscience. Can you imagine--I mean, honestly, think  about it. Imagine what the one Democrat staffer said: We are going to  cling to this until planes fall out of the sky.\n\nThink about how you would…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…up with the demand.\n\nThe Chinese, on the other hand, are building new coal-fired plants.  Every 2  days, they are building a new coal-fired plant, which is even harder to  imagine. They are trying to beat us in this race on AI, and they are  not going to let energy be the deciding factor on that.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Public Schools, and the Jefferson Award. There is no  question that Bobby's commitment to agriculture was everlasting, and  his legacy will continue to live on. It is hard to imagine Florida  agriculture without Bobby. He embodies exactly what agricultural  advocacy works to represent.\n\nThroughout his life, Bobby worked tirelessly to grow, advance, and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…individuals and for their families. Maybe you  won't see flooding as extreme as losing a home. I sure hope you don't.  But I am not just talking about the worst case scenario.\n\nLet's imagine going back to this picture. The family didn't get their  home completely flooded. The family got 4 inches of water in their  living room. Their carpets are destroyed. If their…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…President do what has been necessary  for decades: To make sure the largest sponsor of terrorism in the world  does not have the power to kill us all.\n\nMake no mistake, just imagine if they had a nuclear weapon on 9/11.  Imagine if they had a nuclear weapon on October 7.\n\nWhen our enemies tell us they want to kill us, we should believe  them. When they…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…diligently to try to get the first  tranche of appropriations bills across the floor so we can avoid  staring another government shutdown in the face on January 30.\n\nCan you imagine how much actual work we could get done if we didn't  exhaust ourselves in the fights over shutdowns and lurching from one  deadline to the next? Well, maybe that is something…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…percent fatality rate. While it is not especially  transmissible, we know based upon our experience with COVID that in the  Wuhan lab, they conduct gain-of-function research.\n\nImagine if they produced a strain of Ebola with its 50 percent  fatality rate but at a higher level of transmissibility. I could not  think of a more jarring threat to public health…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…$100,000. Remember,  there are 20 million people on ObamaCare today receiving government  subsidies. When you take a look at that level of fraud happening across  the board, imagine how much taxpayer money is being wasted or stolen.\n\nThe losses to the taxpayers is staggering. And that, I would say to  the minority leader who came here and talked about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…we can easily see people who suffer from what I label  as Trump derangement syndrome. These are people who are alarmed that  Donald Trump would have access to information. Imagine if Donald Trump  could control this money. A lot of people in our country would be  scared to death. On the other hand, we can imagine maybe somebody from  the political left…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…spied on could possibly result in destruction  of evidence, intimidation of potential witnesses, serious jeopardy to  the investigation. I am reading that from the gag order. Imagine that.\n\nWe also know that Jack Smith's corrupt team of prosecutors consulted  with the Biden DOJ Public Integrity Section about the subpoenas. They  were informed--get this:…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}]