[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…care and for  clinics and hospitals already struggling to meet the needs of their  community.\n\nAs a Minnesotan, I am heartbroken for my State. Minnesotans have  suffered immeasurable loss following the tragedies of recent months.\n\nThe Trump administration's reckless actions and deliberate inaction  from Republicans in Congress jeopardize the operation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…He became an educator, beloved, a mentor and champion  for the desegregation of the United States military.\n\nThe impact of Harold Brown and his fellow Tuskegee Airmen is  immeasurable in this country. The Red Tails, as they were known, flew  more than--get ready for this--15,000 sorties between 1943 and 1945,  earning a reputation as some of the most…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…has  done nothing that would warrant Hamas to take babies as hostages. Then,  for those babies to be returned in caskets, it is heartbreaking.\n\nThose parents had to suffer immeasurable heartache as a result of  what happened to their children. Those babies were young babies,  infants.\n\nHamas is not--is not--an organization that seeks peace. If you are…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…research institutions across the country, in  red States and blue. These grants support the jobs of more than 300,000  researchers at institutions in all 50 States and provide immeasurable  benefits to our local communities, especially local community  economies.\n\nI am proud that the area that I represent, the San Francisco Bay Area  in northern California,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…our  neighbors, communities, and loved ones.\n\nA 2024 CDC study showed that routine vaccines have prevented over 508  million cases of illness in children. The impact is immeasurable. That  is hundreds of millions of children who are saved from having to suffer  through a miserable illness. On top of that, their family, friends,  neighbors, classmates,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…deeply rooted in  her heritage.\n\nIt is a privilege to recognize Daisy Rivera-Algarin during Hispanic  American Heritage Month. Her dedication to public service has made an  immeasurable impact on our community and will continue to inspire  future generations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695836/recognizing-daisy-rivera-algarin"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…aggressor. I stand here on the floor to say that our President will not  rewrite the past.\n\nPutin has mercilessly continued this war for over 3 years now; a war  that has led to immeasurable suffering for Ukraine and a shocking death  toll of both Ukrainians and Russians. The region is awash in blood  because of him.\n\nNow the United States stands with Russia…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687904/putins-merciless-war"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…impacts all of       us, citizens and noncitizens alike. This issue is about       whether we will honor our commitments, protect vulnerable       families, and recognize the immeasurable contributions of our       Haitian neighbors. The path forward is clear: we must       preserve and protect TPS for Haitians.\n\nThank you for your consideration of this testimony.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Joint Chiefs of Staff, the most senior enlisted  position in the entire U.S. Armed Forces.\n\nOver the course of nearly four decades, Sergeant Major Black's work  has had an immeasurable impact on our Joint Forces servicemembers and  the civilian employees of the Department of Defense. His dedication to  the mission, to the men and women and then families…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…completely volunteer-based, and performed a range of reliable services  from routine transport to emergency response. With exemplary civic  dedication, members have fostered an immeasurable dependability that  stands out as a pillar to the Deal community and beyond. I commend the  Deal First Aid Squad for their commitment to support residents during  times…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…career and have always  admired his insightful and strategic approach to complex legislative  matters. His numerous contributions to the University and our community  are immeasurable. He has built an incredible legacy that will  strengthen and inspire future generations.\n\nAs he embarks on the next chapter, I extend my deepest gratitude for  his decades…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, Minnesotans are grieving the loss of two  precious lives and enduring immeasurable community suffering due to the  ill-advised policies of the Trump administration and the failed  leadership of DHS under Kristi Noem.\n\nTheir systemic refusal to prioritize…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…She will be forever missed by her children Nakisa  Asefnia and Bardia Asefnia, her siblings Sofey Saidi and Taher Saidi,  and her many friends and colleagues. She left an immeasurable mark on  our community, and her legacy will live on for generations to come.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…of Special Education Programs, and undermine  IDEA, a landmark law that fundamentally changed how we educate children  with disabilities.\n\nSince 1975, IDEA has provided immeasurable support to children with  disabilities, particularly for those in their earliest and most  formative years. IDEA part C, a Federal program closely intertwined the  Medicaid,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Homeland Security--effectively partnered with the criminal cartels  to traffic human beings and drugs into the heart of our country.\n\nThe impact that we had to bear was immeasurable. It delivered  generational trauma into our country. That was a policy decision and a  series of expansion of that policy over the course of 4 years that led  to millions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…engineering has been widely respected. Yet, despite his professional  success, his true legacy is his dedication to serving his community.\n\nJim's contributions to Cass City are immeasurable. As a mentor in the  Boy Scouts, he has guided generations of young men toward the rank of  Eagle Scout, instilling in them values of discipline, responsibility,  and service.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…appointments and  scans.\n\nWe cry for the things we love, and love always comes with pain. With  a love as profound and deep as what Molly had, we know the McGoverns'  pain will be immeasurable.\n\nTo Lisa, Jim, and their son, Patrick, please know that your  colleagues on this House floor on both sides of the aisle are in pain  with you. Our tears are flowing with…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…at the Small  Business Administration, we have seen incredible strides toward  streamlining services, eliminating waste, and ensuring that every  taxpayer dollar delivers immeasurable results.\n\nBeyond tackling bloat, inefficiencies, and burdensome regulations,  the administration has partnered with us to deliver real results for  the American people.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…``Service Above Self'', is more than a guiding  principle--it's a commitment the Bellevue-Papillion Rotary Club has  lived every day for 50 years. Its members have made immeasurable  contributions to the community and have set an example of civic  responsibility and service.\n\nI commend the Bellevue-Papillion Rotary Club for its remarkable  legacy and…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692687/recognizing-the-50th-anniversary-of-the-bellevue-papillion-rotary-club"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…corners of the political universe, the raw  grief, and the remarkable eulogies bear testament to a life of  generational importance, a life cruelly limited in years but  immeasurable in impact.\n\nI offer my own heartfelt prayers along with hundreds of millions of  others in this country and around the world. As we pray for Charlie and  his loved ones,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and can-do spirit, hundreds of runaway, homeless, and foster  youth have found safety, stability, and hope during their most  difficult times. Victoria Barley's impact is immeasurable. Her heart,  her leadership, and her unwavering support have made her a true hero to  YFA and to every young life touched by the RAP House.\n\nIt is clear Victoria Barley…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…differences and divisions and treat each other as equals is deeply  inspiring and is what we should all strive for. Ecumenical Patriarch  Bartholomew's impact on our world is immeasurable, boundless, and  magnified all the more through the countless people he has inspired.\n\nIt is a great honor to add my voice to the many, including the Greek  Orthodox Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}]