[{"senator": "Pete Aguilar", "party": "Democrat", "sentence": "Speaker, by direction of the Democratic Caucus, I  offer a privileged resolution and ask for its immediate consideration."}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "Speaker, by direction of the Democratic Caucus, I  offer a privilege resolution and ask for its immediate consideration."}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "217 and the Senate proceed to its immediate consideration;  that the resolution be agreed to, the preamble be agreed to, and that  the motions to reconsider be considered made and laid upon the table  with no intervening action or debate."}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "3229 and that the Senate proceed to its immediate consideration;  that the Rosen substitute amendment, which is at the desk, be  considered and agreed to; that the bill, as amended, be considered read  and passed; and that the motion to reconsider be considered made and  laid upon the table."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, by direction of the Democratic Caucus, I  offer a privileged resolution and ask for its immediate consideration."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "1834 as passed by the House on January 8, 2026, that the Senate proceed  to its immediate consideration; that the bill be considered read three  times and passed; and that the motion to reconsider be considered made  and laid upon the table."}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "124 and the Senate proceed to its immediate consideration."}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "Speaker, by direction of the Democratic Caucus, I  offer a privileged resolution and ask for its immediate consideration."}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "Speaker, on behalf of the Texas delegation, I offer  a privileged resolution and ask for its immediate consideration."}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "959 and the Senate  proceed to its immediate consideration; that the bill be considered  read a third time and passed and the motion to reconsider be considered  made and laid upon the table."}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "129  and the Senate proceed to its immediate consideration."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "1837 and the Senate proceed to its  immediate consideration."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "1069) to prohibit the availability of Federal education  funds for elementary and secondary schools that receive direct or  indirect support from the Government of the People's Republic of China,  and ask for its immediate consideration in the House."}, {"senator": "Tom Cole", "party": "Republican", "sentence": "6938) making consolidated appropriations for the fiscal  year ending September 30, 2026, and for other purposes, and ask for its  immediate consideration in the House."}, {"senator": "John Thune", "party": "Republican", "sentence": "1491 and  the Senate proceed to its immediate consideration."}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "Speaker, by direction of the Committee on Rules, I  call up House Resolution 161 and ask for its immediate consideration."}, {"senator": "John Thune", "party": "Republican", "sentence": "998 and the  Senate proceed to its immediate consideration."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "3015) to reestablish the National Coal Council in the  Department of Energy to provide advice and recommendations to the  Secretary of Energy on matters related to coal and the coal industry,  and for other purposes, and ask for its immediate consideration in the  House."}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Income and  Franchise Tax Conformity and Revision Temporary Amendment Act of 2025,  and ask for its immediate consideration."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "75) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Office of Energy Efficiency and Renewable Energy,  Department of Energy relating to ``Energy Conservation Program: Energy  Conservation Standards for Commercial Refrigerators, Freezers, and  Refrigerator-Freezers'', and ask for its immediate consideration in the  House."}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Speaker, by direction of the Committee on Rules,  I call up House Resolution 177 and ask for its immediate consideration."}, {"senator": "John Thune", "party": "Republican", "sentence": "1333  and the Senate proceed to its immediate consideration."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "519 and the Senate proceed to its immediate consideration."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "3109) to require the Secretary of Energy to direct the  National Petroleum Council to issue a report with respect to  petrochemical refineries in the United States, and for other purposes,  and ask for its immediate consideration in the House."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "524 and the Senate proceed to its immediate consideration."}]