[{"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…Trump's poll numbers. In fact, his sinking poll numbers are even  being reflected in the issue that many consider to be his strong suit  with the American people, which is immigration.\n\nAmericans are now realizing that Donald Trump's anti-immigrant  policies are targeting everyone in our country, including U.S.  citizens.\n\nWhen Donald Trump eliminates…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…made up about 23 percent of  total U.S. agricultural imports, while Canada supplied some 20 percent.  Many top U.S. growers have moved to Mexico because limits on legal  immigration have made it hard to find workers in the U.S. Mexico now  supplies 90 percent of avocados sold in the U.S. Is Mr. Trump now an  avocado nationalist?\n\n``Then, there is the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…guardrails, without transportation, and without  respect for human dignity.\n\nI want to be clear. Security does not require cruelty. Enforcement  does not require lawlessness, and immigration policy should never  require us to abandon our values.\n\nYes, we need border security and an orderly immigration system, but  we can secure our borders and uphold due process…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…violent criminal records. Folks are being detained and disappeared for  nothing more than political speech.\n\nMr. Speaker, what this visit reaffirmed for me is that any  immigration policy rooted in hate and fueled by chaos doesn't make our  immigration system more efficient or safe; it overwhelms the system. We  don't fix a broken system by breaking…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…the Small Business Committee yesterday. SBA's  responses, if any, have been dismissive.\n\nI stand firmly against using the SBA as a tool to penalize cities  based on their immigration policies. I hope my colleagues will stand  with me.\n\nI urge Members to vote ``no'' on the Save SBA from Sanctuary Cities  Act of 2025 to protect the SBA's mission and vibrant…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…communities much  more dangerous.\n\nHere is a statement issued by the mayor of Santa Ana, which has been  the epicenter of ICE raids in Orange County. She said: ``The Federal  immigration raids . . . in Santa Ana have created a climate of fear,  anxiety, and instability across our community.\n\n``The aggressive tactics used by Federal agents have shattered…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…happen.\n\nThe rest of this is just debate. The rest of this about how ICE  operates, about how the Department of Homeland Security operates, about  what you want to do about immigration, whether you want immigration  reform, the rest of it is just debate.\n\nThe real question is, do you believe in these civil liberties of  Americans or not? And when police…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Finally, we oppose H.R. 2056, which attempts to negate       provisions in local District law governing how MPD and other       District agencies participate in federal immigration       enforcement efforts. This law has been on the books for 13       years and makes it clear that District officials must       cooperate with any court order directing…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…future. Then, last week here in America,  very sadly, she attempted to take her own life with a fentanyl overdose  because she feared being arrested by Trump administration immigration  officials.\n\nShe could not imagine going back to the hell from which she had come.  Here with no help to understand the law that she came here by, that she  could work in…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…this bill are gone. It abandons and condemns  those most at risk to real, unmitigated danger to give tax breaks to  Big Oil.\n\nThis Republican bill gives billions more to Immigration and Customs  Enforcement (ICE) when their unidentified, masked agents are abusing  their power with dangerous sweeps that violate due process and create  human and economic…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…conduct more arrests without any warrants at  all.\n\nDHS law enforcement officers must be clearly identifiable and  prohibited from hiding behind masks. Racial profiling in immigration  enforcement must stop. Sensitive locations like schools, daycares,  hospitals, and churches must be protected.\n\nWe must rein in the sweeping surveillance system DHS is…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699595/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…innocent American citizen, an intensive care nurse who was  brutally murdered by Federal agents. This wasn't an isolated incident.  The administration has shot 13 people during immigration enforcement  operations since September.\n\nI am going to say that again, 13 people have been shot by the  Department of Homeland Security. Four of those shootings were fatal.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Association of Massachusetts      (`` VAM''), UndocuBlack Network (``UBN'')--and four       individual TPS holders. Today, LCR urges Congress to act to       preserve humane immigration protections like TPS. Without       those protections, the consequences will be severe, forcing       families into crisis, undermining local economies, and       pushing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Giffords served  this body and the people of Arizona's Eighth District with great  distinction, dedication, and determination. Her policy interests were  diverse, spanning from immigration reform, economic opportunity, and  promoting solar and clean energy.\n\nAfter experiencing firsthand, in the most horrific fashion possible,  the horror of a mass shooting,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to honor the career of David  McCormack as he retires after 34 years of service to the U.S.  Citizenship and Immigration Services agency. Over the course of his  tenure, David has been a tremendous public servant in his role as a  district congressional lead.\n\nDavid has hosted numerous congressional…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…State employees from this country  if they were here illegally.\n\nWe have two examples in Wisconsin alone in which elected officials  aren't on the page of addressing the immigration laws.\n\nI think it is important that we all be articulate enough to explain  to people back home why these immigration laws are necessary and be  articulate enough to explain…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…their deaths, but their deaths are not a  weapon; they are a fact, a bitter and unshakable reality, a stubborn  reminder of the gruesome trail of American victims that mass  immigration has left in its wake, and they are not alone.\n\nFor every Laken Riley, there are thousands of Americans whose names  have never been spoken, whose stories have never been…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, in early November, the U.S. Citizenship  and Immigration Service announced improvements to their voter  verification system. Now, States can use a program named the Systematic  Alien Verification for Entitlements to verify that…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Advantage was designed  to do. It was designed to actually provide a package of delivery to  make you healthier.\n\nI am going to show a little bit of data on a talent-based immigration  system. Over the previous weeks, I have come here before and shown that  we have a demographic crisis. We have a shortage of young people.\n\nThink about this bit of math.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…job.\n\nOne of the other things that our Democrat colleagues want is to end  administrative warrants. A little history: Administrative warrants were  originally passed in the Immigration and Naturalization Act of 1952, so  they have been around for nearly 75 years. Getting away from that would  bring our law enforcement operations with regard to illegal…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I attended a hearing today in the  Judiciary Committee. There was some confusion in the committee about  what we should be doing to enforce our immigration laws and who is at  fault for the mess we have in Minneapolis.\n\nThere are some people who are apparently under the impression we  should only enforce our immigration laws…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698706/fixing-the-immigration-crisis"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…fulfill President Trump's pledge to make  our cities and streets safe again through provisions that bolster our  Nation's border security and law enforcement efforts.\n\nOver at Immigration and Customs Enforcement, or ICE, the Big  Beautiful Bill will provide additional funding to hire, retain, and  train personnel who will carry out the President's immigration…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…that way  and help out. But we are literally living in some dystopia where they  say that somehow it is different because it is ICE. It is different  because we can say ICE; Immigration and Customs Enforcement.\n\nIt is no different. These officers are no different than your local  township police; the State police; Alcohol, Tobacco & Firearms; the  U.S.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Sheriff's Department, California Highway Patrol, Orange  County Sheriff's Department, and other local, State, and Federal law  enforcement agencies, including the United States Immigration and  Customs Enforcement for keeping our communities safe in the face of  danger.\n\nMr. Speaker, let's make sure that we are dealing with the facts as  they actually occurred.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…that and said that he didn't have that right, that somehow everyone  else can get rid of probationary employees, including the last  administration that summarily dismissed immigration judges on the last  days of the probationary period, and did so without seeing a nationwide  injunction.\n\nThere were plenty of opportunities to disagree, but I hope that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Subcommittee on Housing and Insurance have really made a difference.\n\nMr. HARIDOPOLOS. Mr. Speaker, as we address these issues that you saw  from the poster board, illegal immigration has a true cost, whether it  be increasing demand, let alone the vital services that are strained  under that increased number of people in a very short period of time.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…where these sorts  of dollars in savings--and this is going  to tie in, Mr. Speaker, to talking about what Moody's did last week,  talking about how this and our talent-based immigration bill, those two  bills together, probably score at $2 trillion of savings, and they  would be good for the economy. They would be good for healthcare. They  would be good…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Mr. Speaker, I thank the chairman for yielding me time.\n\nMr. Speaker, I rise today in strong support of H.R. 2931. We have  allowed sanctuary cities to openly defy Federal immigration law for far  too long. There must be real consequences for it.\n\nI thank the gentleman from Minnesota (Mr. Finstad) for introducing  this important piece of legislation.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, pursuant to House Resolution 682, I call up  the bill (H.R. 3486) to amend the Immigration and Nationality Act to  increase penalties for individuals who illegally enter and reenter the  United States after being removed, and for other purposes, and ask for  its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…President Biden and Vice President  Harris dismantled nearly every meaningful safeguard at the southern  border. Their administration presided over a record surge in illegal  immigration, over 700,000 illegal aliens were apprehended at the border  from October through December of 2023 alone. That was more than any  full year during the Obama Presidency when…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}]