[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…tent but stood  at the doorway, hearing those chants: ``Freedom, freedom''; ``libertad,  libertad.'' People were yelling.\n\nThis isn't security. It is cruelty. It is not immigration policy. It  is dehumanizing people.\n\nTrump said this was about keeping people safe. He said it was about  going after criminals, but we all know it was one big lie. Hundreds…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…children is just 4 years old and was  receiving treatment for cancer. Yes, cancer.\n\nHow does deporting a sick child keep our community safe? It does not.  This isn't immigration policy, but this is cruelty, plain and simple.  The idea that the U.S. Government can deport children who are U.S.  citizens or send immigrants to dangerous foreign prisons…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…politically challenging, abandoning long-term TPS       holders to indefInite legal limbo, or forcing them into       undocumented status, is neither humane nor rational       immigration policy.\n\nInvest in U.S. Citizenship and Immigration Services'       capacity, access, and fairness. Congress should fund and       mandate meaningful improvements at USCIS to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to go through all the  details except to say that Danielle Sassoon refused to make the  argument in favor of dismissing those charges in exchange for  concessions on immigration policy. She said it was ``an improper offer  of immigration enforcement assistance in exchange for a dismissal.''\n\nThe lead prosecutor on the Adams case resigned rather than…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Iraq, but in Los Angeles. I guess  this is what you would expect from somebody who has described our brave  war dead as suckers and losers.\n\nWe were promised that the immigration policy would deport the most  violent criminals. That is something I support. That is something  everyone here supports. Instead, it has deported a 4-year-old American  citizen…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692336/troops-in-los-angeles"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…repurposing the billions of  dollars that are being used to menace our communities.\n\nSecurity does not require brutality. Enforcement does not require  lawlessness, and our immigration policy should reflect our values, not  force us to abandon them. We can secure our borders without terrorizing  our neighbors, and I will not support funding that enables cruelty.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…traumatized right now in this country, who  are being thrown into what is called the ``Baby Jail,'' outside of San  Antonio; for the lives that are fundamentally changed by an immigration  policy that is out of control; to have concern for the American  citizens who have been killed simply exercising their First Amendment  rights; to care about the 4 million…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…States to protect my life.\n\nGod bless America.                                __________\n\nMy name is Rebecca Zama, and I serve as Legal Services       Coordinator and Immigration Policy Analyst with SOIA. As a       proud first-generation Haitian-American, an immigration       attorney, and the Legal Service Coordinator and Immigration       Policy Analyst…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…without transportation, and without  respect for human dignity.\n\nI want to be clear. Security does not require cruelty. Enforcement  does not require lawlessness, and immigration policy should never  require us to abandon our values.\n\nYes, we need border security and an orderly immigration system, but  we can secure our borders and uphold due process…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…violent criminal records. Folks are being detained and disappeared for  nothing more than political speech.\n\nMr. Speaker, what this visit reaffirmed for me is that any  immigration policy rooted in hate and fueled by chaos doesn't make our  immigration system more efficient or safe; it overwhelms the system. We  don't fix a broken system by breaking people.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…that the gentleman's legislation here, which is basically  just jacking up a whole series of criminal penalties, doesn't get us  out of the economic problems and the immigration policy problems that  we are in. It is a distraction. It will be ineffectual, and so it is  not going to work to deal with the real crises that we are facing.\n\nMr. RASKIN. Madam…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…been. They are being held in  detention centers with unspeakable, inhumane conditions with no due  process, no access to attorneys, and no path forward.\n\nThis is not immigration policy. This is cruelty for the sake of  cruelty and political theater with real-life consequences.  Indiscriminate arrests do not make anyone safer. Masked agents with  assault…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697454/fighting-dhs-immigration-raids"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…agreement about  a secure border. There is now bipartisan agreement about deporting  criminals.\n\nIsn't it time for us to have the discussion about legal ways to have  an immigration policy that is safe and secure and benefits the American  people, as immigration has benefited us from the onset of our history?", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…she was confirmed--she didn't  seem to understand basic concepts, like habeas corpus.\n\nNow, she is not the only one who is the mastermind of the President's  border and immigration policy. If you want to understand the through  line between Trump's first administration, where he literally put  children in cages and purposely separated them from their parents…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…terrorizing--to  function as an occupying force in our communities.\n\nReal accountability starts with abolishing ICE, impeaching Kristi  Noem, and rethinking how we enforce immigration policy in this country.  We cannot stop there. We must demand that those who are responsible for  terrorizing our communities are investigated thoroughly, not by the  agencies…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}]