[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…communities dubbed  ``mill towns'' that became the epicenters of invention and innovation,  that inspired all sort of product delivery and responses to the needs  of this world, and impacted favorably not only the quality of life in  our United States but in nations around the world.\n\nThat whole history, that powerful statement of what can be created  when we…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…States.  It is not just urban areas, but rural areas and suburban areas from the  North, the South, the East, and the West of the country.\n\nAmericans will be dramatically impacted by these cuts. This is not a  Republican cut or a Democratic cut. It will impact people across the  aisle. Republican Members have many constituents who are on Medicaid  and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…also benefit our communities like  improved sensing/monitoring of water pollution, and advanced water/ wastewater treatment technologies to facilitate reuse of pollution- impacted water resources.\n\nThus, collaboration between DoD and civilian researchers on water  contamination and resilience issues has the potential for many  benefits, including positive…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694170/department-of-defense-appropriations-act-2026"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…strength in their pursuit to bring to justice  whoever committed this horrific act.\n\nFor the extended Brown University, Providence and Rhode Island  communities, and everyone impacted around the country, we continue to  stand together and to heal and work together toward the safety we all  deserve.\n\nI ask all of my colleagues to join me in a moment of silence.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698196/moment-of-silence-in-honor-of-victims-of-brown-university-mass-shooting"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…lost  their lives that day, the brave Marylanders who dove into the frigid  water during the rescue operation, the strong Marylanders whose  businesses and livelihoods were impacted by the collapse, the  Marylanders who depend on our port for resources, the Marylanders who  count on our infrastructure to stand tall.\n\nWhen it is completed, we will serve…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…have  to balance all of it in these RMPs.\n\nIt is also based on robust input from communities, stakeholders, the  public, and government-to-government consultation with the impacted  Tribes, as well.\n\nThe Republican majority has proven time and again that they don't  want any of that public process. They simply want to hand things over  to Big Oil and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Madam President, I rise this evening once again to  highlight the stories of Wisconsinites who would be impacted by cuts to  Medicaid that my Republican colleagues are proposing.\n\nEarlier this evening, I talked about children, babies, our most  vulnerable. Now I would like to talk about…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…funded programs that provide critical  opioid-related services, including federally qualified health centers,  which serve a high proportion of patients disproportionately impacted  by the opioid crisis.\n\nThe Department of Health and Human Services also eliminated the  workforce training programs, including the Integrated Substance Use  Disorder Training…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…preparedness, water use efficiency, and public education. From working  with local Scout groups to supporting investments in our future water  supply reliability, MWDOC has truly impacted every life in Orange  County.\n\nMr. Speaker, I congratulate MWDOC on its 75th anniversary.                          recognizing le dinh luong\n\nMr. CORREA. Mr. Speaker, today,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…dismissed once they lose the work permits that have been tied       to TPS status. This hurts all of us--our patients, our       hospital system, and, of course, our impacted colleagues and       their families.\n\nIn addition to the impact on the healthcare labor force,       there are many additional health impacts that are expected to       come…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…JOHNSON of Georgia. Mr. Speaker, I thank the gentlewoman for her  passion, for her courage, and for her tenacity in representing the  interests of those who have been adversely impacted by crime and who  need the justice system to hold accountable those who would violate our  laws. She stands for justice for all. I appreciate her comments.\n\nIt is not just…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Republicans would  strip this essential healthcare from women across the country. Why? To  give tax breaks to their billionaire bros.\n\nWomen need to know how they will be impacted wherever they live.\n\nEarlier today, we heard Representative Valadao acknowledge that his  voters depend on Medicaid and are upset. Indeed, 507,000 of his  constituents receive…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…colleagues  believe that a certain nominee is a priority, come clean with the  American people. Give us the information we need. What contracts have  been canceled? Who is impacted by that action? What research has been  stopped? Who has been fired, and who will be fired? What is the plan?  Address the unprecedented levels of obstructionism from this…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…McCLELLAN. Mr. Speaker, it is with great honor that I rise today  to anchor this Congressional Black Caucus Special Order hour.\n\nSometimes the voices of people and businesses impacted by  congressional action or inaction get lost in the back-and-forth of the  floor and the media.\n\nFor months, Members of the Congressional Black Caucus have focused on  amplifying…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…their work  does not align with the President's agenda. Illinois is home to several  R1 institutions whose work revolves around studying underrepresented  populations that are impacted by these decisions. I helped expand these  federal education laws and research funding, and I will fight to  protect them.\n\nThe Trump-Musk administration and Congressional…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…recognition by U.S. News  as a top 15 Midwest baccalaureate institution.\n\nPresident Collins' visionary leadership and unwavering commitment to  Catholic higher education has impacted thousands of students who  attended and graduated from Loras College.\n\nI congratulate Jim, his lovely wife, Lisa, and their children and  grandchildren on this remarkable…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…employees with greater  flexibility to design healthcare coverage options that expand access to  treatments for chronic diseases.\n\nThe chronic disease epidemic has, unfortunately, impacted nearly  every family in America and represents a significant share of our  healthcare spending. In fact, 90 percent of the $4.1 trillion this  country spends each year on…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Speaker, I strongly oppose this resolution,  which limits the United States' ability to fight narcoterrorist  traffickers in our own hemisphere, where we are most directly impacted.\n\nI just heard from the distinguished gentlewoman that these are  fishermen, that these are fishermen in these boats. Really? I guess we  are supposed to not believe our own…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698239/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Heaven, you get to  see other people's lives, the impact you had on their lives, and how it  unfolded.\n\nOn the other hand, Mr. Speaker, we know the people who have very much  impacted our own lives, such as Sergeant Billy O'Leary, who was,  indeed, a giant of a man in northeast Florida.\n\nMr. Speaker, I rise today to celebrate the life of Sergeant Billy…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…science and       technology, military, government, business, culinary       traditions, and other fields;\n\nWhereas there are many Jewish American inventors that have       impacted the everyday lives of Americans for the better;\n\nWhereas Irving Naxon invented and patented the slow cooker,       taking inspiration from Jewish cooking traditions in Europe;…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692643/recognizing-travis-brown"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…budworm that threatens landscapes everywhere,  from Florida to Maine, to Washington, to Alaska.\n\nWhether it is green crab, Asian carp, or budworms, the reality is we  are impacted in different ways. So being able to direct resources to  push back on these invasive species is important.\n\nWe also upheld our commitment to Native peoples. We have provided…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in Pharmaceutical Compounding\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Jim  Smith, a distinguished leader whose dedication and vision have  profoundly impacted both the Professional Compounding Centers of  America, PCCA, and the healthcare industry.\n\nHis educational background, including a bachelor of science in  chemistry and biology…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692601/recognizing-sean-mckillen"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…to wildfires  fueled by federal land mismanagement. In fact, in 2024 alone, a  staggering one million acres of the Gem State went up in flames.\n\nRural counties in Idaho are impacted even more so by extensive  federal ownership, as they are unable to tax large portions of land in  their jurisdiction.\n\nWith this funding reauthorization, rural communities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697656/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…it represents  a bridge to connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…humans       deserve.'' The admirable Orthodox rabbi who found his way       back to faith and his own particular belief structure       following a most challenging crisis impacted by the       shattering Holocaust, was enabled to reach beyond the       confines of his own faith's traditions and give credit where       it's due.\n\nHis own Jewish people…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…entrepreneur, nurse, educator, and a former Sudanese refugee  who survived political torture and violence, Dr. Elsheikh came to  Pennsylvania in 2001, where she rebuilt her life and impacted thousands  through programs that serve children with autism, train and employ  caregivers, and create educational media. She also mentors women and  youth throughout Pennsylvania…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…president of Ardsley Park Neighborhood Association, among countless  other accomplishments.\n\nDick will be missed. May his memory live on in the smiles of those he  profoundly impacted.                 Recognition of Arrowhead Pointe Golf Course\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize  Arrowhead Pointe Golf Course, a well-kept, picturesque…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}]