[{"senator": "Joaquin Castro", "party": "Democrat", "sentence": "Congress should disband ICE,  should impeach Kristi Noem, and this Congress should help restore the  Constitution of the United States of America to the people of our  Nation.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Al Green", "party": "Democrat", "sentence": "939,  impeaching Donald John Trump, President of the United States, for high  crimes and misdemeanors.", "title": "Liberty and Justice for All", "date": "2025-12-12"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "That is why I thought, well, when they  stormed the Capitol  and Donald Trump incited a violent insurrection against us, we would,  in bipartisan unison, denounce it and vote to impeach and convict.", "title": "Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-15"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "I challenge my friend from North Carolina to find me one Democratic  official who incited violent insurrection or incited mob violence on  that day because I will tell you, this Chamber voted to impeach that  President who incited mob violence against us in a sweeping bipartisan  vote, Democrats and Republicans, together.", "title": "Improving Law Enforcement Officer Safety and Wellness Through Data Act", "date": "2025-05-15"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Speaker, impeachment is the most consequential tool  Congress to has protect our Nation from a president or other public  official who has betrayed their oath, abused their power, and committed  high crimes and misdemeanors against the American people.", "title": "Concerns with H. Res. 939", "date": "2025-12-12"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "His allies and  advisers are attacking judges publicly and calling to impeach those who  disagree with him.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "That is why I voted against funding lawless, out-of-control agents  who are terrorizing our communities and why I continue to call on us to  impeach Secretary Noem and to hold the Trump administration accountable  for the chaos and the violence that they have unleashed and to  restructure a Department that is no longer holding the trust of the  American people and that needs serious reform.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The Congress of the United States of America has the authority to  rein in a President who commits impeachable offenses.", "title": "No Mandate to Cut Medicaid", "date": "2025-11-20"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The question is: Why am I moving to bring impeachment  again against the President of the United States of America?", "title": "President Trump is A Threat to Our Republic", "date": "2025-12-04"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "We also must immediately start the proceedings to impeach Noem.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Al Green", "party": "Democrat", "sentence": "I would also remind people that as we move forward, I have indicated  that the filing of Articles of Impeachment is imminent.", "title": "Protecting the American Dream", "date": "2025-04-10"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "353 to impeach Donald J.", "title": "The Truth Still Matters", "date": "2025-05-13"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "In addition, many of our colleagues across the aisle have introduced  at least seven bills to impeach Federal judges who have ruled against  the Trump agenda.", "title": "Protecting the Legal Community", "date": "2025-04-01"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Yes, I stand for impeachment of Ms.", "title": "Mourning the Lost Lives in Minnesota", "date": "2026-02-03"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Congress and the Department of Justice threaten to impeach       sitting judges that rule against the government.", "title": "Recognizing ``Assault on American Diplomacy''", "date": "2025-05-20"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "The other  process would be impeachment.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "The other thing I would like to say, before I go to my remarks, is  that I want to associate myself with your quote from our colleague  Senator Cornyn that you don't impeach judges just because of a  decision, because we would be impeaching judges all the time.", "title": "-9999", "date": "2025-03-25"}]