[{"senator": "Al Green", "party": "Democrat", "sentence": "…sleeve, but I do know that we will prevent you from having a third  term, and the best way to do it is to not have you finish this term.  The best way to do this is to have you impeached and convicted and  removed from office. It can be done. I am telling you, it can be done.\n\nThe law says it can be done. We but only have to have the will to do  it. The way…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…constituents.\n\nMr. Speaker, I don't think it is the position of the very  distinguished gentleman that, if we find Jeffrey Epstein on the phone  with Donald Trump, he should be impeached for it, or is that his  position? Is his position that anytime Jeffrey Epstein got somebody on  the phone--and he got a lot of people on the phone--that person is  suddenly…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…prevent it by stealing  votes and by stealing congressional seats. That is what is happening in  Texas.\n\nThey really don't want this impeachment again. He is already a twice- impeached President and 34 times a felon.  They don't want this. Yet, we are still in the countdown to  impeachment. This is one of the remedies that we have. It is probably  the only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…this afternoon, Elon Musk tweets: ``Yes.''\n\nThis was in response to some other person, who I don't know, who  treated: ``President vs Elon. Who wins?''\n\n``Trump should be impeached. . . . `'\n\nWe have all been through really hard breakups. I don't know if anyone  remembers. Mr. Speaker, 140 days ago or so, it was a lovefest. They  were here in the Capitol.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…power who, if left in office, will continue  to promote the incitement of violence, engender invidious hate,  undermine our democracy, and dissolve our Republic, that he is  impeached for high crimes and misdemeanors, and that the following  articles of impeachment be exhibited to the United States Senate:\n\nArticles of impeachment exhibited by the House…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…v. Madison, judicial review,  time-honored. He dishonors it because he dishonors the decisions of the  court. He believes that judges who would rule against him should be  impeached. He does not respect the fact that there is a separation of  powers. He believes that he is the power; but he is not.\n\nHe must be brought before this House. He must be brought…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…harmful precedent.  It undermines the ability of Congress to make a serious and well- documented case for impeachment against this or any future president.\n\nPresident Trump was impeached twice during his first term, and I  voted to impeach him both times. We conducted a formal inquiry during  the first impeachment, where we subpoenaed witnesses and held public…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…when the President has decided that there is  no separation of powers, that he can determine when a judge is right or  wrong and if that judge is wrong, that judge should be  impeached? Where do we stand when the Senate holds a hearing to discuss  the impeachment of judges who differ with the President of the United  States of America? It has been done.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Resolution: Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolved, That Donald John Trump, President of the United States, is  impeached for high crimes and misdemeanors and that the following  Articles of Impeachment be exhibited to the Senate:\n\nArticle of Impeachment exhibited by the House of Representatives…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…best to cover up what happened when two  American citizens, who were unarmed, lost their lives at the hands of  the constabulary. You have blood on your hands. You should be  impeached.\n\nYou also should go to jail because you tried to cover it up. There is  a law that deals with this kind of behavior. When you know that a  felony has been committed--you…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are going to proceed notwithstanding the  court's failure to implement the orders that you think should be  implemented.\n\nThis President has decided that judges should be impeached if they  decline to follow his mandates. He has said ugly things about the  judiciary and has gone so far as to say that some judges don't deserve  to be on the bench and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…these persons had the courage to say to Donald John Trump:  Things are changing in this country. You are likely to face a vote of  218 more persons who would vote to have you impeached.\n\nI rise to thank them for their courage, but I also rise with my cane  in hand to thank two people. I want to thank John Bonifaz. John  Bonifaz. John Bonifaz. Constitutional…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…all of whom fought to put that violence down when riots  broke out, something Donald Trump never did when the riots broke out  that he incited against us.\n\nRemember, he was impeached by this body for inciting a violent  insurrection against us. Not only did he not do anything to defend us,  but he was the one who caused the whole chain of events that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…level of behavior if it were conducted,  committed, and engaged in by one Barack Hussein Obama when he was  President, if he behaved in this fashion, then he would have been  impeached. He would have been impeached. I will go to my grave with  this belief. We wouldn't allow these mass layoffs. We wouldn't allow  these cuts to veterans, and we wouldn't allow…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…order that he does not agree with but contends is  inappropriate for various and sundry reasons, when I see that President  say that the judge that issued that order should be impeached, you are  now moving into authoritarianism.\n\nWhen that President then sits with others in his Cabinet and they are  caught on national TV indicating why they can defy the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}]