[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…States die every day in drunk  driving crashes, and more than 12,000 people a year suffer these  preventable deaths.\n\nUsing the appropriations process to delay or in any way impede the  development of technology to prevent drunk driving is inappropriate and  reckless.\n\nWhat we have before us today is a bipartisan, conferenced bill. It is  already a compromise…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…reduce Medicaid funding or implement further eligibility       restrictions. We strongly urge you and your colleagues to       reject any reforms that have the potential to impede access       to essential care for millions of Americans who rely on       Medicaid, including our Nation's most vulnerable populations.\n\nMr. BOOKER. I would yield specifically…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…taking away critical  tools of success and our fundamental freedoms will not go unanswered.\n\nOn the shoulders of our Founders, we will continue to push back  against efforts to impede our progress, erase our history, and cut off  our access to capital and better opportunities in our communities.\n\nThis month and every month, we will continue to make clear…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…without meaningful  measures to lower the cost of higher education, the bill will close the  doors of opportunity for many low-income students. These harmful  policies will also impede access to graduate education and, by  extension, exacerbate workforce shortages in professional fields such  as teaching, behavioral health, and social work. Instead of investing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…replenishment, and U.S.  priorities in the Indo-Pacific.\n\nUltimately, a yearlong CR would force too much uncertainty and stress  on our servicemembers and their families, and it would impede our  ability to react to national security threats.\n\nEven some of my Republican colleagues agree with me on this point.  One Republican colleague has said: ``A continuing resolution,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…and agency rules. They are lying  in court about incidents where civilians have been put in danger.\n\nThe government alleges that Marimar Martinez used her car to assault  and impede Federal law enforcement, but then, Federal prosecutors filed  a motion to dismiss their own case.\n\nWhy?\n\nIt is because while she didn't assault the agents, they did shoot her…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…explains that the       ``obligations of the Richardson Waiver impose[d] costs on       [HHS] and the public, [we]re contrary to the efficient       operation of [HHS], and impede[d] [HHS's] flexibility to       adapt quickly to legal and policy mandates.''      Congressional Review Act (CRA)\n\nCRA, enacted in 1996 to strengthen congressional oversight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…from  doing our constitutional duty and certifying the legitimate results of  the 2020 Presidential election.\n\nEven during this unrelenting campaign to weaken our laws and impede  justice, Members of this body have stood up for our Constitution. The  exceptional work of the bipartisan January 6th Committee, ably chaired  by Representative Bennie Thompson…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…cybersecurity, counternarcotic security, and a few others.\n\nThe expiration of DHS' other transaction authority essentially will  mean inefficiency and waste, things that will impede the Department's  ability to develop solutions to keep our homeland safe.\n\nIt is past time, Mr. Speaker, to advance this legislation and bring  back DHS' ability to develop…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688702/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…can receive the benefits they deserve, it  is important that the SBA is properly funded and staffed. I am  concerned that the cut in the SBA's workforce by 43 percent will impede  the SBA's ability to recover the improper and illegally obtained  payments.\n\nMr. Speaker, having said that, I urge all of my colleagues to support  this very important legislation.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…ask that we  work with our Senate colleagues and the administration to ensure that  it is ultimately implemented in a way that is both workable and does  not inadvertently impede critical State Department operations and  programming.\n\nThis bill is especially necessary because the Trump administration's  actions have gutted U.S. leadership on these issues.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690653/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…individual       does perceive, the work environment as hostile, intimidating       or abusive.\n\n``(i) Response to Incidents.--Nothing in this section shall       be construed to impede the ability of the responsible entity       of the vessel to take immediate personnel action in response       to an incident described in subsection (a)(1) to preserve the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…jurisdictions  that may be suitable for hardrock mineral exploration, development, and  production.\n\nFinally, this legislation targets legal and regulatory bottlenecks  that impede domestic mining by directing the Department of the Interior  to revise or repeal rules and regulations that hinder mining projects.\n\nRolling back burdensome regulations is…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…exalt force over  reason. It is an abandonment of the American experiment of self- government.\n\nBy the way, this is especially true when the very purpose of the  violence is to impede the policies of a duly elected President from  being carried out. It is to say that a violent agitator should be able  to overthrow through force the will of a democratic majority…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…have been an impediment to unleashing more  manufactured housing stock for Americans. This bill provides a solution  to that, eliminating ridiculous regulations that really impede  manufactured housing.\n\nMr. Speaker, as chairman of the Subcommittee on Financial  Institutions, I will spend my time here tonight highlighting the  section of the bill that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…fact shall be sworn.\n\n7. If, during public or executive sessions, a witness,       witness counsel, or any spectator conducts themselves in such       a manner as to prevent, impede, disrupt, obstruct, or       interfere with the orderly administration of such hearing,       the Chair or presiding Member of the Subcommittee present       during such hearing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…nondiscretionary and much more limited than the  action DOI took in the 2024 ROD. To the extent DOI, or any other  Agency, imposes permit terms or operational requirements that impede  the economic feasibility of the program, they undermine the primary  purpose of the TCJA: to establish a competitive program that will  actually generate the billion dollars…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…your phone--that is supported by George Soros--to track Immigration and  Customs Enforcement, law enforcement officers, the law enforcement  police, and track them down and impede their work to keep everybody  else in the community safe.\n\nDo you know what that is, Representative Roy? I have the definition  right here. That is sedition is what that is.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…information about when or where someone will be released.''\n\nThis is ludicrous. In other words, D.C. will make it harder for ICE  to detain dangerous criminals and otherwise impede their ability to do  their jobs.\n\nMr. Speaker, you can't make this stuff up. While my colleagues  continue to double down on their America-last policies, House  Republicans…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…fraud, and abuse in our bloated Federal Government to deporting  the millions of illegal alien invaders, we need to make progress.\n\nRight now, a single district court judge can impede this progress on  a whim, essentially holding the America First agenda hostage  indefinitely. This must end.\n\nMr. Speaker, I strongly urge my colleagues to join me in voting…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…(A) Definition of obstructs.--In this paragraph, the term       ``obstructs'' means taking actions that are known, or       reasonably should be known, to prevent, hinder, or impede an       inspection.\n\n(B) Penalties.--The Secretary may suspend or terminate an       approval of an FMOC if the FMOC obstructs or prevents the       Secretary from carrying…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}]