[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, this week, I introduced articles to  impeach Secretary Pete Hegseth for murder and conspiracy to murder and  reckless and unlawful mishandling of classified information.\n\nFrom issuing orders to kill everybody onboard…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698056/impeaching-secretary-pete-hegseth"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…President Donald Trump.\n\nThe Chief Justice of the Supreme Court reminded the President that in  this country we have a history of appealing decisions of the courts. We  don't impeach judges because we don't agree with their decisions. We  appeal these decisions. He doesn't respect separation of powers. He  owns the House of Representatives. He owns the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…not  force us to abandon them. We can secure our borders without terrorizing  our neighbors, and I will not support funding that enables cruelty.\n\nCongress must act now to impeach Kristi Noem and rein in ICE.\n\nMr. Speaker, unfortunately, under the Republican rule, we don't have  regular order anymore. We should be debating appropriations bills one…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…we talk about checks and balances, let's not  forget how the Trump administration is arresting judges. His allies and  advisers are attacking judges publicly and calling to impeach those who  disagree with him.\n\nAnd, of course, Trump is blatantly ignoring the courts. And worse  than that, the White House is in open defiance of the Supreme Court.\n\nThe…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to make a serious and well- documented case for impeachment against this or any future president.\n\nPresident Trump was impeached twice during his first term, and I  voted to impeach him both times. We conducted a formal inquiry during  the first impeachment, where we subpoenaed witnesses and held public  hearings to demonstrate that the President had…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…by preventing  Members of Congress already from conducting oversight in their  facilities. Shame on them.\n\nThis is not an agency, Mr. Speaker, that can be reformed. You can  impeach the Secretary, and she needs to be impeached, but this is an  agency that was created to do what it is doing now. It is built on  violence and racism.\n\nICE must be abolished.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699666/horrific-ice-abuses"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…ultimate exercise of congressional oversight, and it  requires a simple majority vote in the House of Representatives and a  two-thirds majority vote in the Senate in order to impeach and convict.\n\nI am prepared to take any necessary action to stop Trump's reckless  assault on the Federal Government and our democracy. While I believe  many of Donald Trump's…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…because they have the power.\n\nWe have but one power that we can use without the consent of the  other side. That one power is impeachment. We have one power: the power  to impeach.\n\nWe are in a countdown. We are in a countdown because, whether the  President likes it or not, whether I like it or not, the people of the  country want to see him impeached.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…notorious for having said: Lock her up,  talking about a Democrat. Here is your chance to repeat your chant:  Lock her up. Lock her up.\n\nLock up Ms. Noem for what she has done. Impeach Ms. Noem is what we  should do. Aside from impeaching her, she gets her marching orders from  this dastard; he has to be impeached too. We cannot allow this to go  unnoticed…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…end DHS detention and monitoring, disrupt immigration enforcement,  and return taxpayer dollars back to the communities.\n\nWe also must immediately start the proceedings to impeach Noem. I  said it before, and I will say it again. She will either quit, she will  get fired, or we will impeach her.\n\nHere is the thing: Our tax dollars should be used to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…right when the establishment in this country refuses to  acknowledge what is taking place.\n\nThank God for people associated with free speech for people. Thank  God for the impeach and removal coalition, people who are willing to be  a part of the avant-garde, who are willing to take the proper stand  when they see democracy at risk, when they see the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…line now, we risk losing the rule of law entirely. If we  don't act today, we are complicit in letting democracy erode on our  watch.\n\nThat is why I introduced H. Res. 353 to impeach Donald J. Trump,  outlining seven Articles of Impeachment because when a President  violates the Constitution, Congress must act.\n\nMy seven Articles in H. Res. 353 are as…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…against his executive orders and the harms and effects they may  have on America.\n\nIn addition, many of our colleagues across the aisle have introduced  at least seven bills to impeach Federal judges who have ruled against  the Trump agenda.\n\nThey attempt to cripple our judicial branch of government which  guaranties a delicate balance in our democracy and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…so that a person will  know who arrested them. However, he doesn't care. It doesn't matter to  him that we have a branch of the government called the judiciary. He  wants to impeach the judges when they differ with him. We have got a  Member of Congress who has filed Articles of Impeachment against a  judge because they don't agree with their opinion.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…detained. It is shameful and an embarrassment to our country. That is  why we must act. It is why I will vote ``no'' and not give a single  other penny to DHS. It is why we must impeach Kristi Noem. It is time  to act. We will not be complicit.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699491/children-are-not-political-pawns"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…process available to you, and that is to cut off funding. The other  process would be impeachment. If you think he is doing something  unlawful under international law, you can impeach him. Those are your  two options.\n\nSo I will be voting against this idea, and I will be voting against  this idea in a new form in perpetuity because I think it creates a…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]