[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…could look at  this and say who is right.\n\nThey didn't do that. There was no regular order. There was no  hearing. We had no benefit of a hearing on this resolution and the  implications of revoking these standards.\n\nMr. Speaker, this resolution isn't some well-reasoned proposal that  has been properly vetted. It is a way to kill floor time. It is a way…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…kilometers on only a  5-minute charge.\n\nNow, not everyone loves electric vehicles--my car has a traditional  internal combustion engine--but think of the national security  implications of falling behind in batteries and advanced manufacturing.  We see in Ukraine that the future battlefield is electrified.\n\nWe need to be pressing forward, not just in electric…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…of different reasons, but  okay; come back to Congress, and let's do it. They didn't do that. They  just changed it because the law doesn't matter to them, and that has  implications. It causes problems. We are supposed to do our oversight  for a reason.\n\nSome of those problems are borne out in a variety of different ways.  We have the National Guard…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…lead to a disorderly repricing of assets, which could       in turn have cascading effects on portfolios and balance       sheets and therefore systemic--  Systemic--       implications for financial stability.\n\nLike the Financial Stability Board said.\n\nSo I pointed out that this risk was looming, and we need to pay  attention to it. This isn't about polar…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Democratic House, a Democratic Senate, and a  Democratic President.\n\nOf course, we had a country in the early days of 2021 that was still  reeling from the effects and the implications of a pandemic that wasn't  yet over. In fact, people, if we recall correctly, Mr. Speaker, were  just beginning to take that vaccine. We were just beginning to push for…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…on advanced chip sales to build data centers in  Saudi Arabia and the UAE. He is auctioning off our chips to the highest  bidder without a care for the national security implications. Without  strong guardrails in place, this puts American IP and technology at  risk.\n\nH.R. 2683 provides BIS with the authority to control remote access to  critical American…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…Michigan  Family Protection Act, which provides legal support and protection for  families who have children through surrogacy. Her advocacy shed light  on the real-world implications of our outdated legal system and the  need for reform as we continue to fight for reproductive freedom across  our Nation.\n\nOn behalf of Michigan's Third Congressional District,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691857/recognizing-tammy-myers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…aware of the Fifth Circuit's decision in       Petteway v. Galveston County, 111 F.4th 596 (5th Cir. 2024)       (en banc). My office successfully briefed that case's       implications for Texas congressional districts earlier this       year. See First Amended Motion for Partial Judgment, LULAC v.       Abbott, No. 3:21-cv-00259 (W.D. Tex. Feb. 15, 2025),…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…yield?\n\nMr. WYDEN. Would the Senator be willing to continue this discussion  in the days ahead? Because I think this has been extraordinary. It has  begun to lay out the implications of what this is really all about in  terms of authoritarianism. It is important for our State. It is an  important debate for the country.\n\nWould the Senator be willing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…defense or Medicare. Interest will rise  from $881 billion in Fiscal Year (FY) 2024 to $1 trillion by FY 2026.\n\nFailing to address our mounting debt and deficits has severe  implications. It crowds out other critical spending in both defense and  non-defense areas; reduces fiscal flexibility especially in times of  crisis; contributes to inflationary pressures;…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…incredible supporting data  to prove it. He is putting America's national security at risk to  enrich himself.\n\nJust as concerning as the very gift are the national security  implications that surround it. The deeply chilling part of this bribe  and national security betrayal from the President is just how blatant  and erroneous he is doing it, almost daring…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690971/qatar"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Republican colleagues are afraid to hold Donald Trump accountable.  The majority is afraid to investigate the serious national security,  public integrity, and foreign policy implications of the President  accepting an emolument from a foreign government and flying around in a  Qatari jumbo jet, taking it  with him as a door prize when he leaves office in…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…law enforcement in lieu of traditional firearms, they do not       reference law enforcement at all, and are unnecessary,       reckless, and would have far broader implications for public       safety. These bills would create a loophole for firearm       access by prohibited individuals by effectively creating a       new legal market for untraceable…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…behalf of the hospitals, nurses, doctors and those who       care for and serve the needs of 72 million patients that rely       on Medicaid, we urge you to consider the implications of       hinging the budget reconciliation bill's fate on removing       health care access for millions of our nation's patients.       These are hardworking families,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…reductions  are in real areas of opportunity, which we are walking away from under  Trump. This is a fundamental blow to how America supports medical  research and has real implications for the progress we made.\n\nInstead of ushering in the next wave of medical breakthroughs, which  could save you or your loved one from suffering, this administration  has…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…the author reflects on how  society grapples with competing claims of truth and encourages readers  to return to foundational and verifiable sources--a theme with deep  implications for both our civic culture and the way we approach  legislation.\n\nI believe this thoughtful reflection is a meaningful reminder of the  importance of clarity, honesty, and…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…because we are going to make large policy decisions here  in the House, in the Senate, and with the President over the course of  the coming weeks that are going to have huge implications for all of  those small businesses on our Main Streets and all of those individuals  who work in them and rely on them for their livelihoods.\n\nWe talk a lot about the tax…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…economic analysis fails to consider the       impact of local communities losing these benefits. The       economic analysis also wholly fails to consider the social       implications of eliminating or dramatically restricting       future development in the NPR-A that would remove jobs and a       substantial portion of the tax base. Responsible development…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…been to where this industry happens, knows for certain that this is a  good bill because they understand not just the economics of it, but  they understand the long-term implications of this industry. If Members  vote against it, they are telling me and the American people one thing:  They haven't studied this industry.\n\nGas exports strengthen our economy.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…grips       with the Holocaust's enormous impact on their identity and       very lives, with the Shoah's long shadow as constant       backdrop. In addition, the genocide's implications touch on       the universal human condition and its absurd dimension. As       much as human memory is an honored, even reveled, component       in the Jewish lexicon laden…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…providing critical  infrastructure and law enforcement data to the Chinese Government.\n\nToday, the lowest price technically acceptable does not account for  national security implications, so my bill would simply require an  evaluation of potential national security concerns associated with the  LPTA FAR standard.\n\nInstead of just looking at the initial price…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…engagement with--\n\n``(A) Native Hawaiian organizations; and\n\n``(B) Tribal organizations;\n\n``(3) advise the Commandant on all policies of the Coast       Guard that have Tribal implications in accordance with       applicable law and policy, including Executive Orders;\n\n``(4) work to ensure that the policies of the Federal       Government regarding consultation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…925(a)(1), but only for       ordering weapons for their direct individual use, and not for       their department.\n\nThis present policy has many civil and criminal       implications for tribal police departments, especially given       that this nuance is not widely explained to FFLs or the       public. Additionally, the exclusion of Native American…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…markets.\n\nThis legislation reasserts the role of Congress in setting national  policy for emerging financial technologies. It ensures that decisions  with far-reaching economic implications are not made through regulatory  overreach but through transparent and deliberative processes.\n\nH.R. 3633 is not only sound regulatory policy but also essential  economic…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Congress       intended when it settled aboriginal land claims in Alaska.       The management decisions made in the 2024 Central Yukon RMP       also will have long-term implications for communications,       electric transmission, and other infrastructure activities in       the region, adding further obstacles to what already are       extraordinary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…administration, for the two principal involved Agencies within  the U.S. Department of the Interior, known as BOEM and BSEE, to provide  their feedback or offer testimony on the implications of this  legislation.\n\nNow, look, the Senate's committee process exists, and it exists for a  reason. It exists for exactly these sets of reasons. While it might  have slightly…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…stay steady because we are finding we don't have  as many workers looking for jobs. It is really worth taking a look at  that, as we are starting to see the demographic implications of how  many of our brothers and sisters are choosing to take retirement at age  62, when for years we have been looking at there are, like, 7 million  prime-age males missing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…cutting-edge innovation could eliminate barriers to health care, reduce  delays in treatment, and save lives in areas long overlooked by  traditional infrastructure.\n\nThe implications extended far beyond Southwest Virginia. This mission  laid the groundwork for nationwide drone delivery applications and  inspired regulatory advancements by the FAA. It…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…criteria that       would enable market participants to determine the firms       captured by the rule. It is essential that businesses and       consumers understand the implications of this proposal to       enable them to provide comprehensive feedback on its impact.\n\nFurther, it is important to clearly delineate the extent of       the rulemaking's…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…forever be a turning point in history.\n\nAs we reflect on the events of that day and the 500 days that have  followed, it is imperative that we also recognize the broader  implications of this attack.\n\nIt was not just an assault on Israel. It was an attack on the  American vision for a safe and secure Middle East, which was led,  perpetuated, and financed…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}]