[{"senator": "Al Green", "party": "Democrat", "sentence": "…don't see it.\n\nYou see people of color, people from south of the border, people from  these 18 countries, that are being discriminated against with this  policy that he is implementing.\n\nThe American public, a good many people, not all, have bought into  the notion that if you are from a foreign country, you are likely to be  a criminal and you are likely…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…requirements so that Congress can better track the use of funds and  ensure that they are being spent as intended.\n\nJust last week, Secretary Rubio committed to faithfully implementing  this bill, and now it is on all of us to work together to make that  true. There will be a lot more work to do in the months and years ahead  to rebuild American foreign…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…DOGE buyouts or early retirements, the  slashing of our workforce has forced over 3,500 Department of Energy  staff out of office.\n\nIn fact, the key offices responsible for implementing this very bill  have lost a significant portion of their staff. The Office of  Manufacturing and Energy Supply Chains has lost about two-thirds of its  staff and was eliminated…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…with disabilities are  still waiting for their shot at a meaningful education.\n\nThe Federal Government committed to funding 40 percent of the cost to  school districts of implementing the IDEA, but Congress has never fully  funded special education. Right now, the Federal Government is only  covering 12 percent of the tab, and that is unacceptable.\n\nNow…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…quality of life for every resident.\n\nWe have worked collaboratively with this Committee on       shared priorities, including public safety, the federal       Return to Work, implementing a DC budget Fiscal Year 2025 fix       (which is still pending in the House) and revitalizing the       RFK campus; but I write now to ask you to reject 13 of the DC…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…timely reporting.\n\nSince then, I have been informed that Ms. Paola did not resign and  that Honduras's electoral authority--the National Electoral Council or  CNE--is now implementing an updated system for transmitting election  results. This is positive news, and it should reinforce public  confidence in the CNE's commitment to the integrity of the elections.…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Palestinian security force. He should be supporting  confidence-building measures in the West Bank, which empower the  Palestinian Authority contingent on the PA embracing and implementing  real reforms. He should not be enacting an annexationist vision while  the plague of settler violence runs rampant.\n\nThe alternative, Mr. Speaker, is a stark and disturbing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…colleagues to stand up for the two  representatives, or I should say for the restoration of an independent  FTC, to ensure this bill and the many others that are tasked with  implementing are fully effective and enforced without fear or favor. We  need a strong FTC.\n\nI commend Representatives Mullin and McClain for their leadership of  this issue.\n\nMr. PALLONE.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…not kid ourselves. While Republicans bring this reauthorization  bill to the floor, they stand by as the Trump administration dismantles  the very agency responsible for implementing these programs. They have  fired experts, erased offices, and rescinded over a billion dollars  already allocated to State and local response. Just 2 weeks ago, they  passed…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…labor  constraints. The PIF has encouraged the U.S. to extend duty-free  treatment under the GSP beyond preferences for Least Developed  Beneficiary Developing Countries.\n\nImplementing such a program would come at a low cost to the U.S.  while delivering a high strategic return, especially given the People's  Republic of China's (PRC) increased focus on…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…tracking system has not worked well enough  to replace the old paper-based system, as my colleague has just  described. By improving FPS data collection and analysis and  implementing the findings on these security tests, the agency will be  able to better ensure the safety and security of Federal buildings,  employees, the public, and the FPS officers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…things that we could  do.\n\nBut these mass firings in the area of medical research? This makes no  sense.\n\nThe Department of Health and Human Services is also tasked with  implementing Medicare drug price negotiation, which I fought for years  to pass into law, along with my colleague Senator Welch from Vermont,  when he was in the House, and Senator Sanders…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…reasons for the disparities and put  policies in place that address them, people's lives are saved. When we  strip those policies away, when we strip away the very workforce  implementing them, people will die.\n\nThat is why I am proud to stand here as a member of the Congressional  Black Caucus and say we will fight to protect those policies that save  our…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…in some respects but also I wanted to recognize that  she had a vision.\n\nShe came to the bipartisan delegation of Michigan and said such a  thing, and they are working on implementing new mobility.\n\nI haven't had a chance to ask her. Of course, I am not a board member  of General Motors. I have not had a chance to ask her at the one-half  decade mark…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…strong opposition to the  Republican's budget plan that would gut funding for Medicaid. In 2023,  my home State of North Carolina achieved a historic victory by finally  implementing Medicaid expansion after a decade of political gridlock.\n\nMedicaid expansion has helped new moms and their babies during a  critical phase of life. It has supported older…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690766/opposing-republican-budget-plan"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…their  thorough investigation of the crash. Their report will guide Congress  in the coming weeks in our efforts to ensure safety in the skies.\n\nIn addition to passing and implementing the ROTOR Act, Congress will  soon hold a hearing--after the NTSB releases its final report in about  2 weeks--to review the findings and recommendations. We need to  determine…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Secretary in response to a       request by the private entity; or\n\n(4) require the adoption of the best practices described in       subsection (c).\n\n(f) Consultation.--In implementing this section, the       Secretary may, as appropriate, consult with the heads of       relevant Federal agencies.\n\n(g) Termination of Program.--The Blockchain Deployment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…H.R. 3716 would decrease revenues       by less than $500,000 over the 2025-2035 period.\n\nGAO's funding is provided in annual appropriation acts. CBO       estimates that implementing the bill would cost less than       $500,000 over the 2025-2030 period; any related spending       would be subject to the availability of appropriated funds.\n\nIf federal…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…term's meaning in law. This is a case where both the law and  congressional intent are clear.\n\nThe Department of the Treasury is expected to issue rules and  regulations implementing the agreed upon phase-out of the wind and  solar credits by August 18, 2025.\n\nUntil I can be certain that such rules and regulations adhere to the  law and congressional…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694587/department-of-the-treasury-nominations"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Commodity       Futures Trading Commission, and the Department of State for       the study.\n\nUsing information about the cost of similar requirements,       CBO estimates that implementing H.R. 1549 would cost federal       agencies $1 million over the 2025-2030 period. Any spending       by those agencies would be subject to the availability of       appropriated…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…fixed-wing and rotorcraft aviation that could have prevented this  accident, it is still exactly that, an emerging technology. There are  still technological barriers to implementing ADS-B In into the 5,500  commercial aircraft that are in the skies at any given moment.''\n\nMr. Speaker, let me be extremely clear. As a pilot myself, I  unequivocally support…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…natural gas, and  that is why I am leading S.J. Res. 12, a Congressional Review Act  resolution to block this tax from taking effect.\n\nMy resolution will rescind the rule implementing the Democrats'  natural gas tax that the Biden administration finalized late last year.\n\nCongressional Democrats and President Biden mandated this new tax  under the so-called…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in  self-poisoning cases involving sodium nitrite, many of which stem from  easy online access to high-concentration products.\n\nThis bill aims to confront that threat by implementing a narrowly  focused prohibition on the sale of consumer products containing sodium  nitrite at concentrations above 10 percent.\n\nI thank Representative Trahan for her strong…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690219/youth-poisoning-protection-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…final  rule.\n\nNew standards for this equipment, which included a variety of  products, became effective just 3 years ago. Yet the Biden  administration moved ahead with implementing burdensome new standards.\n\nIn fact, these standards will require energy reductions up to 60  percent on top of the previous standards, pushing the price of this  equipment…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…speak for themselves. The Treasury  Department recently announced it recovered $31 million in fraud and  improper payments in just the first 5 months of test driving and  implementing these reforms. The legislation makes these temporary  provisions permanent and stops payments to deceased individuals moving  forward.\n\nMadam Speaker, this bill is a big…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…``Notwithstanding any other provision of law, the       requirements of section 3 of the Housing and Urban       Development Act of 1968 (12 U.S.C. 1701u), and any       implementing regulations or guidance, shall not apply to an       activity assisted under this title that involves       rehabilitation, construction, or other development of housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…manage public lands and       resources under FLPMA. More specifically, BLM prepared the       Grand Staircase RMP pursuant to Interior's land-use planning       regulations implementing FLPMA, codified at 43 C.F.R. part       1600. In developing the Grand Staircase RMP, BLM proposed       five alternatives, Alternatives A-E, for the protection of…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Technology           or Capability (Sec. 36(b)(5)(C), AECA)\n\n(i) Purchaser: Government of Israel.\n\n(ii) Sec. 36(b)(1), AECA Transmittal No.: 12-69; Date:       December 14, 2012; Implementing Agency: Air Force.\n\nFunding Source: Foreign Military Financing.\n\n(iii) Description: On December 14, 2012, Congress was       notified by congressional certification transmittal…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "French Hill", "party": "Republican", "sentence": "…jurisdictions. If so, agencies must consider       alternatives that minimize that effect.\n\nUsing information about the cost of similar provisions, CBO       estimates that implementing the bill would cost $2 million       over the 2025-2030 period. CBO expects that the SEC would       need about five employees, at an average annual cost of       $330,000…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…it is an incredibly important location for us.\n\nI went there to be able to see the implementation of the new  authorities and the things that the President is actually implementing  there that have so precipitously dropped the movement of illegal  immigration and have dramatically increased the number of interdiction  of drugs that are moving through…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]