[{"senator": "Al Green", "party": "Democrat", "sentence": "…for posterity. We do it because,  without this participatory democracy, the world itself becomes at  greater risk.\n\nMr. Speaker, the United States of America is a pretty important piece  of the puzzle of life that the entire planet Earth is a part of. We  have got to protect this participatory democracy.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…wildfires, this is an important step. I am glad to be able to  work with my colleagues across the aisle to get this done.\n\nMr. Speaker, I urge all my colleagues to support this important piece  of legislation.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…School, we have Gayane Charyan's  ``Forlorn Art Piece.'' In this piece, we see a girl sitting alone on a  swing. The shadow of herself is her only company. This is an important  piece that lets people know that loneliness and mental health affects  all of us.\n\nMr. Speaker, I also take this time to share the 988 lifeline that is  available 24 hours a…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692266/congratulating-californias-29th-districts-congressional-art-competition-winners"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in opposition to the National  Defense Authorization Act for Fiscal Year 2026 (NDAA).\n\nThe National Defense Authorization Act is an important piece of  annual legislation that governs the policies of the Department of  Defense and authorizes our common defense. It is deeply unfortunate  that Congress considers this…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…everyone.\n\nI am proud to co-lead H.R. 1642. I thank my colleagues, Chairman  Williams and Congressmen Olszewski and Bresnahan, for their leadership  in championing this important piece of legislation. I urge my  colleagues to vote ``yes.''", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691732/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…for their actions.\n\nMr. Speaker, I thank the Energy and Commerce Committee Chair Guthrie,  my dear friend Mr. Bilirakis, and Ranking Member Pallone for fighting  for this important piece of legislation.\n\nAgain, I thank Representative Moolenaar for being such a great  bipartisan partner. We owe it to Shandra, her family, and every other  patient who has…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692765/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…thank Representative Scott for his  leadership on this important issue and the bill that he referenced  supporting our workforce dealing with extreme heat. That is an  important piece of legislation.\n\nMr. Speaker, that is all of our speeches on this important topic of  the extreme heat and the Extreme Heat Caucus. I yield back the balance  of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…vulnerable are disproportionately impacted.\n\nOn a day when we are working to ensure that some of the critical  programs at the Federal level are funded in this bill which is an  important piece of this, we also have to support the structure  and the payment system that supports the people on the ground who are  doing this work.\n\nIt took us years to bring the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…support this legislation, and I thank my colleague from South  Dakota, Congressman Johnson, as well as the Democratic cosponsors of  this bill.\n\nMr. Speaker, this is an important piece of legislation that will  strengthen our Federal Maritime Commission and ensure that we have a  competitive, effective, and efficient maritime transportation system.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…continue  its pause on the disbursement of funds and new financing commitments to  the government, incentivizing the Burmese Government to give power back  to the most important piece of any thriving free country: the people.\n\nI thank Congresswoman Young Kim for co-leading this important  legislation with me. I also thank Chairman Hill and Ranking Member…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697197/no-new-burma-funds-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Speaker, having said that, I urge all of my colleagues to support  this very important legislation. I thank my colleague, Representative  Downing, for allowing me to lead this important piece of legislation  with him.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Chairwoman Wagner for including my bill in this larger capital markets  package. I also want to thank Reps. Huizenga, Bynum, and Garbarino for  joining me as co-leads on this important piece of legislation.\n\nThe bipartisan Access to Small Business Investor Capital Act makes a  narrow technical correction to a federal securities rule that has had  major unintended…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…to land, to celebrate, to commemorate their  history, and to promise to preserve the land, water, and ecosystem for  seven generations forward.\n\nThis legislation is an important piece of that puzzle, transferring  approximately 1,082 acres of Federal land into trust for the Lower  Elwha Klallam Tribe. These are lands once tied to the Federal  hydroelectric…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697608/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…across the continent and the United States. I can think of no  better way for America to continue to expand its trade relationships  with Africa than reauthorizing this very important piece of  legislation.\n\nMadam Speaker, I again ask my colleagues to vote in favor of this  reauthorization and extend a warm and hearty thank you to Chairman  Smith for making…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Congress to attack another Nation preemptively, preventively, absent an  imminent threat, then that provision of the Constitution is dead  letter. Period. Stop. And the most important piece of this document,  according to our most revered Founding Father, is no longer  operational.\n\nAnd if we lurch into a world in which any Executive can send us to  war without…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…openly defy Federal immigration law for far  too long. There must be real consequences for it.\n\nI thank the gentleman from Minnesota (Mr. Finstad) for introducing  this important piece of legislation. I am also grateful to Chairman  Williams of the Committee on Small Business for working with me to  ensure that my community, El Paso County and Colorado…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Mr. Speaker, I thank the chairman for this important  piece of legislation. I thank the ranking member for her passion and  her concern for small businesses in America.\n\nMr. Speaker, I rise today in strong support of H.R. 2931,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, today, we are bringing a very  important piece of legislation to the floor, the Maintaining American  Superiority by Improving Export Control Transparency Act, a key piece  of legislation to ensure our country stays…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…section 7(a).''.\n\nMr. Speaker, I rise today in support of H.R. 1804, the 7(a) Loan  Agent Oversight Act, introduced by Representatives Meuser and McIver.\n\nH.R. 1804 is an important piece of legislation that brings an  additional layer of transparency in the fight against fraud in the  Small Business Administration's flagship 7(a) loan program.\n\nThis bill…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…protecting our economy, safeguarding national security, and  ensuring American ports remain under American control.\n\nMr. Speaker, I urge my colleagues to support this very important  piece of legislation.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…business by ensuring the system works for them,  not against them.\n\nMr. Speaker, I thank Ranking Member Velazquez, my fellow New Yorker,  for partnering with me on this important piece of legislation. It is  time we stop allowing fraudsters to steal opportunities meant for  legitimate women entrepreneurs. I urge all of my colleagues to support  the WOSB…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…I know how important it is to defend our veterans so  vigorously. I thank the chairman for that leadership. I thank the  ranking member as well for his support of this important piece of  legislation.\n\nLet me just begin.\n\nToday, the House of Representatives has the opportunity to further  recognize and honor one of the bravest and most highly decorated…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…myself the balance of  my time.\n\nMadam Speaker, first, I say thank you to Ms. Sewell, and Mr. Neal for  their help in order to get this across the finish line. This is an  important piece of legislation that I know my staff, Josh Snead and  Hilary Pinegar, have worked tirelessly on for a long time to make sure  that this program does not die. I thank both…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…gather input directly  from the people most harmed by overregulation to allow Congress to take  meaningful action.\n\nMr. Speaker, I urge all of my colleagues to support this important  piece of legislation and stand with America's small businesses.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Mr. SCHMIDT. Mr. Speaker, I thank the gentleman from California for  bringing us this important piece of legislation.\n\nI haven't been here very long in this body, but I have learned  something, and it is amplified today. That is that this town has a  remarkable ability…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…enactment of this Act.\n\nMr. CLINE.  3424.\n\nMr. Speaker, I rise in support of S. 3424, the Bankruptcy  Administration Improvement Act of 2025.\n\nThe bill before us today is an important piece of legislation that  will help ensure the bankruptcy system continues to function  efficiently and without taxpayer funding.\n\nCongress designed the bankruptcy system to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…who  have cosponsored it. This legislation will have tangible, positive  impacts on our communities.\n\nMr. Speaker, I encourage my colleagues to support passage of this  important piece of legislation.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697260/investing-in-all-of-america-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…our  servicemembers do not have to choose between serving their country and  getting their children the critical care they need.\n\nMr. Speaker, I was grateful that this important piece of legislation  was included in the appropriations package for 2026.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…came to  the election of President Trump, but they wanted to deny him the team  he needed in order to actually do what the American people elected him  to do.\n\nThe most important piece of legislation we passed--actually, there  are a couple that come to mind, but one is the working family tax cuts  act. I heard the Democratic leader talk about all sorts…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…join with me in just  passing it, like we did in December, and it will go right to the  President's desk, and they will have 5 more years to really implement  this really important piece of legislation.\n\n410 and the Senate proceed to its immediate consideration; further,  that the bill be considered read a third time and passed, and that the  motion to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}]