[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…Speaker, I thank the gentlewoman from California (Mrs. Kim) for  her bipartisan leadership, her friendship, and all she does. I urge my  colleagues to vote ``yes'' on this important bill.\n\nMr. Speaker, I again urge my colleagues to support this bipartisan  legislation, which will reduce the paperwork burden on SEC staff and,  therefore, their ability to advocate…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693955/improving-access-to-small-business-information-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to stay home to take care of them or go to  the job and let really difficult things happen? This is the thing that  the leader is pointing out that, I think, is really important.\n\nMr. BOOKER. Yes, please.\n\nMr. BOOKER. I appreciate the Democratic leader's question.\n\nI think that all 100 of us in this body are getting what I have  gotten. I can't go to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…that a person can no longer  call Social Security. Republicans have done nothing to reject Project  2025 cuts and proposals to cut Social Security.\n\nSocial Security is also important, Mr. Speaker, because we are in a  cost-of-living crisis. Prices for groceries, food, and housing are  rising thanks to Trump's policies and Trump's tariffs.\n\nWhat are House…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…together in many other areas.\n\nWhile I wait to see what the gentleman has in store for us for farm  programs left behind, I, too, agree that rural development is  incredibly important, Mr. Speaker. I hope that the bipartisanship shown  through the CLARITY Act process can act as a reminder that we  accomplish more and we go further when we work together.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the  Supreme Court. No person and no man is above the law.\n\nMrs. WATSON COLEMAN. Mr. Speaker, I thank Representative Takano for  holding this Special Order. This is very important.\n\nMr. Speaker, I rise today because the Trump administration is  carrying out a campaign of reckless cruelty with zero accountability.\n\nLast week, the home of a woman from Oklahoma…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…work.\n\nMr. Speaker, I thank my cosponsors again for their support and  Chairman Tim Walberg and Ranking Member  Bobby Scott for their  assistance and support of this important bill.\n\nMr. Speaker, I urge my colleagues to vote ``yes.''", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…market value paid in the first place and then  retained by the Federal agency that may need to follow up and make sure  that these special places are protected is very important.\n\nMr. Westerman has suggested that the existing special use permit sets  a fair market value that is just so prohibitive that none of these  landings will ever happen in marine…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…as possible.\n\nMr. Speaker, this is important to the farm community, and it shows  the efforts that can be made with satellites for precision agriculture.  I think it is important.\n\nMr. Speaker, I urge my colleagues to support this bill, and I yield  back the balance of my time.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…have been supportive of the Jewish State of  Israel and of Jewish Americans.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, I will be brief. I do want to reemphasize how important  it is that Mr. Van Drew has worked collaboratively with our side of the  aisle on a bipartisan resolution that is not a ``gotcha'' resolution  but accurately addresses the serious…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, I thank my friend, our conference chair  (Mrs. McClain) for managing this time on this important bill.\n\nMr. Speaker, a lot of people come up here, and they talk about trying  to get America's fiscal house in order. They talk about the idea of  getting back to balanced Federal…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you have four or five kids, you have people making  $400,000, $500,000 qualifying, except that is a small population of  them but they still would qualify.\n\nWhy is this important?\n\nMr. Speaker, if I could have some way to burn this on to people's  psyche. What the ACA, Medicare for All--the Republican alternative had  better actuarial distribution, but…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…changes for improvement.\n\nWith the right tools and right resources, we can find a caring home  for every child in our foster care program. That is why this bill is so  important.\n\nMr. Speaker, I urge my colleagues to stand with me for foster  families, and support our children and vote for this wonderful bill.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688407/recruiting-families-using-data-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, I thank the gentleman for yielding time on  this important bill.\n\nMr. Speaker, I rise today in strong support of the SAVE America Act.  I am proud to cosponsor this bill.\n\nOur democratic process depends on free, fair, and secure elections.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…because we owe it to law enforcement to support them in any number of  ways that we can as policymakers. One of the easiest ways, in my mind,  is this bill. Data is incredibly important, Mr. Speaker. You know this  firsthand. Data is incredibly important. Understanding these attacks on  our law enforcement, how it is affected by the officer, how these  things…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…particularly for our  vital community banks. It helps promote more community banks to do what  they do best, which is lend locally and support their communities.\n\nI think it is important, Mr. Speaker, that on this House floor all of  us know that without our community banks and without vigorous lending,  homes don't get built. Our communities and regional banks…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Committee and the ranking member of our committee for all the  work that has been put in on this legislation. I also thank my  colleagues in the Senate for their work on this important bill.\n\nMr. Speaker, I urge my colleagues to vote in favor of today's veto  override to ensure my bill, H.R. 131, becomes law.\n\nIn December of last year, this commonsense, bipartisan,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…right thing. It is still possible, and I am  certain the American people would greatly appreciate seeing some  bipartisanship out of this body on a topic that is so important to so  many.\n\nMr. VAN DREW.\n\nMr. Speaker, let me just address a couple of things before we move  on. Let me say that, first of all, as we all know, it was referenced  over there something…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…remarks, and I want to highlight one line she said: American technology  and innovation has allowed us to reduce emissions more than any other  country since 2005. That is important.\n\nMr. WEBER of Texas. Mr. Speaker, this is amazing to me, quite  frankly. I served 4 years in the Texas legislature, and we were busy  with catalytic scrubbers on all the industry…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}]