[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise today to share my strong support for H.R. 1262,  the Mikaela Naylon Give Kids a Chance Act. I am proud to co-lead this  important, bipartisan legislation alongside Representatives   Michael  McCaul, Dr. Kim Schrier, and Gus Bilirakis.\n\nThis bill will accelerate pediatric cancer treatments and expand  access…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Jersey and Congresswoman Goodlander from New Hampshire, for  working with me to improve SBA's Office of Advocacy.\n\nMr. Speaker, I urge my colleagues to support this important  bipartisan bill.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687956/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…regulatory changes.  Further, it extends the requirement for an annual report on commercial  remote sensing licenses through 2030.\n\nI am very enthusiastic about this important bipartisan commercial  space legislation. It is always a good day in the Chamber when Chair  Babin is talking about commercial space legislation, and it is always a  good day when…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…confidence that Federal partners  are committed to protecting our waters and natural resources.\n\nMr. Speaker, I am proud to support my colleagues who have worked on  this important bipartisan legislation both here in the House, as well  as the Senate. I look forward to seeing it passed into law, and I  reserve the balance of my time.\n\nMr. JOHNSON of South…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…playing field and helps the United States hold these  unmanned vessel operators accountable.\n\nMr. Speaker, I am proud to support my colleagues who have worked on  this important bipartisan legislation, and I look forward to seeing it  passed into law.\n\nMr. CARBAJAL. Mr. Speaker, I support H.R. 2351, I encourage my  colleagues to do the same, and I yield…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692170/controlled-substance-onboard-vessels"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…to advocate for so many Americans, including  his own child. It takes tremendous strength and courage. I thank the  gentleman for working with me specifically on this important bipartisan  piece of legislation to ensure that this Congress and the SBA do right  by Americans with disabilities.\n\nMr. Speaker, entrepreneurship is the hallmark of the American…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…for introducing this bill, which, as  the chairman mentioned, passed in the 118th Congress. I also thank my  colleague and chairman for bringing this and many other important  bipartisan bills to the floor today.\n\nAccording to the State Department's Office to Monitor and Combat  Trafficking in Persons, the trafficking in persons for the purpose of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…thanking the gentleman from Montana (Mr. Downing),  the gentleman from New Hampshire (Mr. Pappas), and the gentleman from  Florida (Mr. Bean) for their partnership on this important, bipartisan  legislation. I also thank Chairman Williams and Ranking Member  Velazquez for their support of this bill.\n\nI urge my colleagues to vote ``yes'' on this legislation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…administration has helped finalize the bill with further input from  both Democrats and Republicans.\n\nAgain, I strongly support this bill, and I hope to do more of this  kind of important bipartisan work in the future.\n\nMs. RANDALL. Mr. Speaker, I urge support for this legislation, and I  yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…aviation safety is a  commonsense solution that we should all support.\n\nI thank Representative Wied, Representative Scholten, and  Representative Gillen for sponsoring this important bipartisan bill,  and I urge my colleagues to support it.\n\nMr. FIGURES. Mr. Speaker, I support H.R. 3423, the FROST Act, and I  urge my colleagues to do the same with this commonsense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Mr. LANDSMAN. Mr. Speaker, I thank my colleague from Ohio (Mr. Latta)  and Mr. Pallone.\n\nThis is, I think, a really important bipartisan piece of legislation.  It is a very simple and straightforward bill. It is simpler than the  name itself. H.R. 1709, the Understanding Cybersecurity of Mobile  Networks…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693424/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…well  as knitting together cooperative defense research and development  efforts between Australia, the United States, and the U.K. in Pillar  II.\n\nThis bill builds on important, bipartisan provisions agreed to in the  fiscal year '24 NDAA which set the foundation for AUKUS and provides  minor technical improvements, as well.\n\nPrincipally, it clarifies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…owners. I proudly represent New Hampshire on the Small  Business Committee here in the House of Representatives, and today, I  am very proud to be a cosponsor of this important bipartisan  legislation.\n\nMr. Speaker, I rise in support of H.R. 832, the Small Business  Advocacy Improvements Act. I am very proud to be doing this together  with Chairman Williams,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I commend Representatives Stauber and Cisneros for their  work to bring this important bipartisan legislation to the floor today.\n\nMr. Speaker, Congress and the executive branch have carefully crafted  fair and deliberate policies to ensure that small businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…achieving our original intent.\n\nLet us not overstate the impact of this bill, however. While we are  working together to advance the bill forward on incremental but  important bipartisan legislation to advance both drug discovery and  drug affordability, the Trump administration continues its devastating  attacks on public health, including in cancer…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…another day on that because  nobody is going to take that mountain from us. I am certainly not  standing down here.\n\nFor today, I would urge the Senate to recognize the important  bipartisan work that we have done with balance, with common sense, and  with fiscal restraint as really our guiding principles here. I don't  take for granted anything in this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…forefront of scientific innovation  and technological advancements.\n\nI thank my colleagues, Representatives Morrison and Thanedar, for  joining me in introducing this important bipartisan legislation.\n\nThis legislation passed the House with unanimous support last  Congress. Unfortunately, we couldn't get it over the finish line in the  Senate in time,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…States regulators have access to any and all pertinent  information regarding applicants.\n\nMr. Speaker, I thank my colleague from Ohio (Mr. Balderson) for  leading this important bipartisan effort.\n\nMr. Speaker, I urge support of this bill, and I yield back the  balance of my time.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…healthcare  heroes, and first responders who need continued support to help save  lives.\n\nI thank Congresswoman Pettersen and all the Members who have  supported this important bipartisan piece of legislation.\n\nI am hopeful that by reauthorizing programs with proven success and  increasing access to treatment, Congress can continue to address and  prevent…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…could  not be higher in this era of rapid global innovation and increasingly  complex geopolitical dynamics.\n\nI thank Chairman Babin for working with me to bring this important  bipartisan legislation to the floor quickly. I also thank my colleague  from Michigan, Congresswoman Stevens, for co-leading this bill with me.\n\nI am proud that my very first…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}]