[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…country in the history of the world.\n\nThere is a lot of work that needs to be done to make that aspiration,  the American Dream, the good life, a reality. Today, we take an  important step forward in that regard by extending the Affordable Care  Act tax credits.\n\nWhen we get this done, we can send it over to the Senate, and,  hopefully, get it out of that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…high-quality CFOs,  and there are many private and public-sector CFOs who are paid more  than the D.C. CFO.\n\nThis bill is critical to the financial operations of D.C. and is an  important step to increase home rule for D.C. I urge my colleagues to  support this bill.", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 2449, the FUTURE Networks Act.  This bipartisan legislation is an important step to protect Americans  and our communication networks from threats posed by rapidly evolving  next-generation technologies. It also ensures that the standards used  to build…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690230/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…in U.S. export control policy has taken place, congressional  consultation and oversight has not kept up.\n\nThe bill in front of us today by Representative Jackson is an  important step toward remedying this problem by calling for the  Commerce Department's Bureau of Industry and Security, BIS, to conduct  greater transparency around license application,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…way, we are not delaying the House.\n\nMr. Speaker, I urge Members to support H.R. 1190, the Expanding  Access to Capital for Rural Job Creators Act. It is a simple but  important step to directing the SEC's small business advocate to  include small, rural businesses in their reporting.\n\nAs I have noted before, the small business advocate currently reports…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…cannot allow subjective ideas of perfection to override what are  objectively steps in the right direction.\n\nThe CLARITY Act is one act that I support, and this is an important  first step. As we move forward, however, we must continue to make the  necessary investments so that everyone can participate. Those are  investments in technical training and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693778/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…American  interests can be served by connecting the U.S. and the African  Continent with undersea cable infrastructure by way of the U.S. Virgin  Islands.\n\nThis bill is an important step to enhance American communications  security and competitiveness around the world.\n\nIn recent years, Mr. Speaker, the United States and many allies have  recognized the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…will help us, Congress, address the issue at the  border and let us, as Members of Congress, better respond to the  challenges.\n\nMr. Speaker, I believe this bill is an important step in the right  direction. Receiving information from the Department of Homeland  Security on an annual basis will improve Congress' efforts to counter  illicit cross-border…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688706/subterranean-border-defense-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…greater threat to our kids in school, at church, at their  birthday parties, or at any other private or public space across this  country than gun violence.\n\nWe took a very important step with the Bipartisan Safer Communities  Act. We did really good work, not just for Democratic children but for  Republican children, as well, but we must do more to keep…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…work together to make that  true. There will be a lot more work to do in the months and years ahead  to rebuild American foreign assistance, but this week marks a very  important first step.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…the  globe. We don't know yet the full extent of the problem, and it is  certainly a practice that is difficult to detect and track.\n\nThe bill before us is a strong and important step forward. It calls  on the State Department to provide important information to Congress,  to the American public, and to the world about the global scope of  organ harvesting…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…bill would not change this  composition.\n\nD.C., like every other jurisdiction in the United States, should be  free to set its own local land-use policies. This bill is an important  step to increase home rule for D.C. I urge my colleagues to support it.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693426/introduction-of-the-district-of-columbia-board-of-zoning-adjustment-home-rule-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…This will help to reduce the number of people  who fall victim to identified fraudsters looking to extort money from  dating app users.\n\nMr. Speaker, this bill is an important first step in addressing harm  in the online dating space. However, there is a lot more to be done,  and vulnerable consumers need a strong and independent Federal Trade  Commission…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…is both redundant and offensive. GAO does not  have general authority over states and cities, and therefore it should  not have such authority over D.C.\n\nThis bill is an important step to increase home rule for D.C. I urge  my colleagues to support this bill.", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696213/introduction-of-the-government-accountability-office-district-of-columbia-home-rule-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…consist  solely of three mayoral appointees. D.C. would have the authority to  reconstitute the membership of the Commission through local  legislation.\n\nThis bill is an important step to increase D.C. home rule. I urge my  colleagues to support this bill.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…it will improve their standard of living  and make life more affordable for them.\n\nThere is still more work to be done, but I believe Republicans have  delivered an important first step toward making life more affordable  for the people we represent.\n\nRecognition of the Minority Leader", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…North Carolina (Mr. Knott) for bringing  forth this important piece of legislation.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, conducting an assessment is an obvious and important  first step in addressing any homeland security threat we face. This  bill smartly and correctly requires a homeland security border threat  assessment on Tren de Aragua followed…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…others are after us all day, every day, 365  days a year.\n\nThese vulnerability disclosure policies are critical to preventing  cyberattacks on Federal systems.\n\nThis is an important step in Federal cybersecurity, but the work of  Federal agencies is supplemented by millions of contractors working on  behalf of Federal departments and agencies. The Federal…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…shot two young schoolchildren in Minnesota. It is a  mental illness, and it needs to stop. We can stop it in our military  right now.\n\nIn last year's NDAA, we took the important step of banning TRICARE  from covering medical interventions to treat gender dysphoria, which  would result in the sterilization of children.\n\nThis is a strong statement by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Nation.\n\nThis bill is a necessary step in ensuring our Nation's Capital is an  ally, not an opponent, in the fight to end this crisis.\n\nSpecifically, H.R. 2056 represents an important step in codifying  President Trump's executive order on making the District of Columbia  safe and beautiful by directly supporting the directive for enhanced  coordination between…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…bill  speaks for itself in putting money where our mouth is.\n\nAh, but here is the rub: We can only make it happen if the  administration moves from words to action, and an important step in  that process is the national defense strategy.\n\nHistorically, the national defense strategy is what administrations  use to define threats, identify objectives, and…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…from  criminals. The VSAFE Act should strengthen the accountability, improve  prevention, and give veterans the support and protection they deserve.\n\nThis bill takes an important step toward safeguarding veterans and  strengthening trust in the VA system, and I am proud to support it.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nSomeday,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in the morning on Saturday--just a few short hours ago, it  seems like--that the Senate voted to pass a budget resolution amending  the House budget resolution, the next important step to passing  President Trump's ``America First'' agenda.\n\nThe budget will go back--and has gone back--to the House, and then it  will be time for the committees to do really…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…These delays impact our  economy, but they also constrain our efforts to achieve energy  dominance, protect our national security, and compete with China.\n\nThis bill is an important step in our work to continue reforming the  permitting process. It is time to get the government and unnecessary  barriers out of the way of hardworking Americans who want to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…playing field for taxpayers by  requiring the IRS to explain themselves and notify taxpayers that they  have 60 days to challenge this adjustment.\n\nThis legislation is an important step to simplifying tax  administration and making the IRS more accountable to taxpayers.\n\nMr. Speaker, I thank Representatives Feenstra and Schneider for their  bipartisan…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…our national security. We cannot sit idly by while our adversaries seek  to gain competitive advantage to control the next-generation economy.\n\nThis legislation takes an important step to prepare our Federal  agencies against supply chain constraints that could occur as our  Nation seeks to address timely development of electric generation and  transmission…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Committee.\n\nThis is not a long or major piece of legislation. I tend to think  that speaks well of it. I think the shorter the bill, the better.\n\nI do believe that this is an important step, but I do want to remind  my colleagues it is just a step. I would hope that we would get swift  action out of the executive branch in following this  legislation if we…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Ms. LEE of Florida. Mr. Speaker, I rise today in support of the  Safeguard American Voter Eligibility Act, or the SAVE Act.\n\nThe SAVE Act is an important step forward that will ensure elections  are more secure and accurate across the United States.\n\nThe vast majority of Americans agree that only U.S. citizens should  have the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…manufacturing constraints, do a cost-benefit  analysis of domestic production, and determine the feasibility of such  production.\n\nBy supporting this bill, we are taking an important step toward  rebuilding American manufacturing capability in strategic sectors. We  are creating a roadmap for revitalizing rural communities that have  been sidelined for far…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690289/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…which does protect our waters through drug interdiction, stops  human trafficking, and promotes maritime safety.\n\nIt also establishes a Secretary of the Coast Guard, an important step  in the right direction to ensure that the Coast Guard men and women  remain a priority for many administrations to come.\n\nThe other armed services have this position,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694193/coast-guard-authorization-act-of-2025"}]