[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…New Jersey, one-third of children--one in three  kids in my State--are enrolled in Medicaid.\n\nAs a father of a 7-year-old and a 9-year-old, I can tell you that the  most important thing is knowing that your kids are healthy.\n\nThere are a lot of things that are outside of your control as a  parent. You can do everything right, but sometimes you just need…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…is not allowed,  under the Constitution, to decide unilaterally to cancel spending that  has been authorized and appropriated by Congress. So maybe the first  and most important thing to say about what the President has done to  cancel mental health grants and anti-violence grants is that it is  illegal. He can't do it, and it is likely that a court…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…for Libya. Both Alftise and       Sahad said unifying and stabilizing the nation remained the       first order of business before such decisions could be taken.\n\n``The important thing for us at the moment is to revive       Libya as a as a country with a civil government, with       democracy, so we can have our country in a sovereign       situation,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…learned from my visits to small businesses  is really pretty inspiring because I see those Vermont small  businessowners; their employees are like family to them. The most  important thing for them is to make sure their employees are doing  well.\n\nOne of the things that is really important to our employers is that  they can provide healthcare, but with the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…majority has chosen to  prioritize debate and passage of a bill to rename the Gulf of Mexico as  the Gulf of America. That is not what my constituents think is the most  important thing Congress should tackle this week or this year, and I  bet it is not what your constituents think either.\n\nIt is easy to mock this legislation because it is so inane and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Social  Security recipients: 135,000 of them are retired; 14,900 are disabled;  9,855 are widows; 4,438 spouses; and more than 8,000 children, but that  is not the most important thing, even though all these details are  important, but the Sixth District in Illinois receives $323 million  monthly.\n\nWhere does that money go? That money goes to the recipients…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…including the best step  forward during these times of inflation. Where do people spend that  check: right back in the communities that they live in. That is the  most important thing.\n\nMadam Speaker, that is why I come to the floor today: to make sure  that we are acting on Social Security and to make sure that all  Americans understand how vital and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Even if small things go wrong, the device will  work. That is what our opponents have to know. We don't need to test.  If we decide to use them, they will work.\n\nIt is an important thing to bear in mind, because our adversaries,  many of them, have weapons that they have not tested, and they don't  really know how well they will work. We do because we…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…that family ends up in the emergency room. They need to be  decontaminated from the poison.\n\nNow, I am telling you these stories because I want you to understand  a very important thing: What is going on in Minnesota is not about  public safety. It has nothing to do with public safety. In fact, what  is going on in Minnesota is hurting public safety.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…bipartisan legislation will open the door for more investment in  BDCs, thereby unlocking more capital for small and mid-sized businesses  across the country. The most important thing that our financial  institutions and capital markets do is provide capital for businesses,  particularly small, medium-sized, and growing enterprises.\n\nBusiness Development…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…President Trump, but apparently you mistook  his references to Elon Musk as a reference to the President.\n\nMr. NEGUSE. I would just say, Mr. Speaker, that would be an important  thing to clarify in the House moving forward that references to Elon  Musk will be treated as references to the President of the United  States, which is apparently what the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…over 170,000 of  them, including 134,000 retirees, including 18,000 disabled workers,  8,000 widows, 3,000 spouses, and 9,000 children.\n\nMadam Speaker, here is the most important thing. Most Members of  Congress don't realize this. Do you know how much money comes into your  district monthly to those recipients? That is $318 million that Mr.  Trump and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…we have  to make that profound decision on--yes or no--should we go into war.\n\nSo I want to thank you, and Senator Kaine, I want to thank you,  because there is no more important thing for this Congress to do than  to reassert its responsibility--to accept our responsibility for the  powers that were delegated to the U.S. Congress, particularly about…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…American taxpayer.\n\nThis bipartisan legislation will open the door to more investment in  BDCs, thereby unlocking capital for small- and medium-sized businesses.\n\nThe most important thing that our financial institutions and the most  important thing that our capital markets can do is provide capital for  growing American enterprise, particularly small-…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…work in other places, and their job is to undermine and defeat what has  existed for 249 years, it is time for us to revoke those visas and to  send them home.\n\nThe most important thing, Mr. Speaker, is that we must not be afraid  to tell the truth.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…bill being  debated before us today.\n\nSince 2017, they have been working on a permanent solution, and that  is scheduling fentanyl as a schedule I item. It is the most important  thing that this House of Representatives will do in this Congress.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…developing new  technologies, products, and services not in boardrooms but in shared  workspaces, university labs, and community accelerators. At this stage,  the most important thing they need is capital and, often, a chance to  talk with potential investors. That is what makes events like demo days  so important.\n\nThese are informational forums where…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…championed. We agree on the need for additional training. There  is lots we can find in common as we try to work through this, and I  hope we are able to do that.\n\nThe important thing today, Mr. Speaker, is to finish the task, to  take these bills, which represent the vast majority of things where we  have found common ground and agreement in a process…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…countless Ohioans  about their priorities, touring family-owned businesses, and hearing  from local farmers, manufacturers, and defense companies about the  issues most important to them.\n\nThe thing I heard from constituents is how grateful they are that the  One Big Beautiful Bill Act will help them stay in business, keep money  in their pockets, and reinvigorate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…manufactured goods because we want those  goods to be made here in America, and it would be great to have those  manufactured in America.\n\nSome people, however, think the most important thing is to encourage  States to increase their taxes and have higher property taxes from the  local units of government and higher income taxes for the State  government. They…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691493/new-tax-cuts"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…because it was just a few weeks ago that  President Trump stood in this Chamber. He addressed the joint session  of Congress, and he said something that I think was the most important  thing he said that night. He said that we have come to find out we  didn't really need different laws. We just needed different leadership.\n\nThis debate, as my friends will…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…it is not a hollow move. That is not it  at all. We are here today to say these are important to us. If there  are discussions on what is important and what is not important, the  first thing we need to do is come together as a House and say these  issues are important to us as a House. Let's get this bill to the  Senate and put it on the President's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…University. She also loved kids and spent much of her time  babysitting and serving in Sunday school. She believed her highest  calling was to be a mom one day.\n\nBut the most important thing to know about Ella is that she was a  devout Christian. She was very involved in her church, the Cathedral  Church of the Advent in Birmingham, and was loved by everyone…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…weeks  have truly been a disservice to Americans. My friends across the aisle  should never have put leverage or politics over those people who they  represent.\n\nThe most important thing right now is that we get back to work,  making sure that the Federal Government can provide the essential  services that people depend on and that Congress can continue…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the men that are just hanging  out and doing drugs would have a purpose in life and be more likely to  be productive.\n\nI should point out, by the way, that this is a very important thing  for the men; but sometimes people say that we need the welfare system  because there are no men with decent jobs, and that is why we have to  have the government step…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…saying that anybody who has ever worked with  Jack knows that these things are very true: He is fair, he is  pragmatic, and he knows how to get the job done. The most important  thing that we know is that Jack is a true friend, and I can say that  from personal experience. We are all going to miss him, and I wish him  the best of luck as he begins his…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…he tweeted out: ``Jesus  defeated death so you can live.''\n\nEarlier this year, Charlie said: ``I want to be remembered for  courage for my faith. That would be the most important thing. The most  important thing is my faith.''\n\nI can go further.\n\nMy point of sharing these things is the importance of us standing up  and speaking truth. People say, Well,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…more research on manufacturing in this  country, is to aim our tax cuts at manufacturers.\n\nSome of them specifically aim at research and development. They feel  the most important thing in manufacturing is research and development.\n\nOthers are made to encourage savings. In the past year, we have  passed tax cuts to encourage people to put more money in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}]