[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "It is critically  important for our families.", "title": "Providing Recovery for Flood Victims", "date": null}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "I thank my colleagues for their work together on this important  resolution and urge a favorable vote on the resolution that we will  have later today.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "President, colleagues, today, on the Senate floor,  we are expecting to see some outrageous attacks on my home State of  California and important provisions of the historic Clean Air Act.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the National Highway Traffic Safety Administration Relating to ``Federal Motor Vehicle Safety Standards; Fuel System Integrity of Hydrogen Vehicles; Compressed Hydrogen Storage System Integrity; Incorporation By Reference''", "date": "2025-05-21"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Speaker, on January 22, the Trump administration  forced the National Park Service to remove panels at Independence Hall  National Park, the cradle of our liberty, telling an important chapter  in George Washington's Presidency.", "title": "Rewriting History", "date": "2026-02-04"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Speaker, this bill is an important step toward protecting  consumers from abuse, making sure that the fact that they applied for a  mortgage with one mortgage company isn't sold against their will to  every other mortgage company in the country.", "title": "Homebuyers Privacy Protection Act", "date": "2025-06-23"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "This important bill will  extend the public land withdrawals for several military installations  that operate on public lands in Alaska, California, and New Mexico.", "title": "Public Lands Military Readiness Act of 2025", "date": "2025-12-09"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "As adoption rapidly increased in China, homegrown players       came to dominate the global EV supply chain--including,       crucially, batteries, perhaps the single most important       technology underpinning EV performance.", "title": "Highlighting Advances in Chinese Electric Vehicle Technology and the Need for American Investment in Battery Technology", "date": null}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "While it is important that the Secretary has this flexibility,  current law contains no permanent requirement for the Department of  Energy to notify Congress of the use of this flexible authority to  reduce or eliminate such requirements.", "title": "Cost-Share Accountability Act of 2025", "date": "2025-03-24"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "It is very, very  important that they understand the depth and the trauma that the  proposed budget will create and the alternative that you put forward.", "title": "Democratic Proposals", "date": "2025-02-26"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Speaker, I am glad to be here on the floor today to lead this  important discussion with my Congressional Progressive Caucus  colleagues about protecting healthcare for millions of Americans.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "People depend on it to get their medications, to get important  documents, and to receive their monthly Social Security payments.", "title": "Improving Community Zip Codes", "date": "2025-07-21"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "As someone who has traveled over a dozen times to Ukraine in order to  investigate war crimes, I know how important it is that we make a stand  now, not later.", "title": "Peace Talks with Ukraine", "date": "2025-05-13"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "This bill is an important step toward ensuring that the Shingle  Springs Band of Miwok Indians has the lands they need, their lands, to  meet the current needs of their citizens and to plan for sustainable  community growth.", "title": "Shingle Springs Band of Miwok Indians Land Transfer Act of 2025", "date": "2025-12-09"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "In addition, it's important to consider the impacts that       ending TPS for Haiti will have on population health, health       care workforce, and impacted families and communities in       Massachusetts, as I have discussed above.", "title": "Witness Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Speaker, I thank Congressman Takano for bringing us  together this evening for a very important discussion.", "title": "Trump Immigration Policies", "date": "2025-04-30"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "I know people are coming down here to vote, but there are no time  restrictions, and this is extremely important.", "title": "-9999", "date": "2025-11-07"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "Speaker, it is particularly important with this  Special Order to clear the air.", "title": "Successful Operation to Arrest Nicolas Maduro", "date": "2026-01-12"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Evans), a very important member of the Energy and  Commerce Committee.", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Community members have been grateful for Nathan's work in the  classroom, as he has inspired many students  and helped them build important life skills.", "title": "Congratulating Nathan Lund on Receiving Minnesota's Agriculture in the Classroom 2025 Outstanding Teacher of the Year Award", "date": "2025-06-04"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "This legislation would codify the National Coal Council, an important  advisory committee that had aided our Federal Government for 37 years  with expertise and technical reports on all matters affecting the coal  industry and its workers.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Tom Cole", "party": "Republican", "sentence": "Through the Financial Services-General Government portion of  the bill, Financial Services and General Government Subcommittee  Chairman   David Joyce advanced important provisions that drive  economic growth, uphold consumer freedom, and support entrepreneurship  and small businesses, reinforcing the foundations of the American Dream  for people and job creators nationwide.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "It is important that we not take a step back but take a step forward,  and I will work in every way that I can with my colleagues to see that  we accomplish that before the passage of the National Defense  Authorization Act.", "title": "-9999", "date": "2025-12-11"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "The 504 program is an incredibly important tool that helps small  businesses obtain long-term, fixed-rate financing like the acquisition  of fixed assets such as land, buildings, and heavy machinery.", "title": "504 Program Risk Oversight Act", "date": "2026-01-20"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "The bill does something straightforward but important.", "title": "Providing for Consideration of H.R. Law-Enforcement Innovate to De-Escalate Act; Providing for Consideration of H.R. Undersea Cable Protection Act of Providing for Consideration of H.R. Securing America's Critical Minerals Supply Act; and for Other Purposes", "date": "2026-02-10"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Chairman, I thank the leadership of Chairman Rogers  and Ranking Member Smith on this important piece of legislation.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "It is extremely important.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "They feel  the most important thing in manufacturing is research and development.", "title": "Big, Beautiful Bill", "date": "2025-05-08"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Despite the demands of his career, he was  always present, especially for his son, Sam, making sure that he always  had his dad at every important moment.", "title": "Recognizing David Camhi", "date": "2025-04-01"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Secretary Wright is focused on it to make sure there is a  statute that we have Congress saying the supply chain is important.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "2056 represents an important step in codifying  President Trump's executive order on making the District of Columbia  safe and beautiful by directly supporting the directive for enhanced  coordination between the Federal Government and law enforcement  regarding illegal aliens.", "title": "District of Columbia Federal Immigration Compliance Act of 2025", "date": "2025-06-11"}]