[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, pursuant to section 426(a) of the  Congressional Budget and Impoundment Control Act of 1974, I make a  point of order against consideration of the rule, House Resolution 566.\n\nSection 426(a) of the Budget Act specifically states that the Rules…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…through that say USA, that shows the power of the United  States. That now will be traded for food aid from China.\n\nWe are here today considering cuts after months of unlawful  impoundment, stealing, that will conceal a Republican reconciliation  bill to make the billionaires in America even more rich and increase  the debt by $3 trillion. Mr. Speaker, you…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…corruption and self-enrichment.\n\nAnother powerful sign of a democracy in decline is the usurpation of  Congress's power of the purse, the illegal withholding of funding, the  impoundment of funding, the illegal rescission of funding, the illegal  termination of grants, and, I would say beyond that, the mass firing of  Federal employees--the lawless firing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Trump family by more than  $200 million. President Trump can simply ask Congress to pass a bill  here on Capitol Hill.\n\nAnother option is provided through a 1974 law, the Impoundment  Control Act, or ICA. Under the ICA, the President can notify Congress  when he intends to withhold or impound funds through either deferral or  rescission. The law requires…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…birth scenario or basic day-to-day medical  services, they are going to have to drive hundreds of miles, in some  instances, just to go see a doctor.\n\nWith respect to the impoundment issue, I want to raise that too  because the Trump administration has started making the argument that  even though money has been appropriated, they don't have to spend…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…are also cutting down the bipartisan structure designed for Congress to  exercise discipline over deficits and debt.\n\nThat architecture was crafted in 1974, the Budget and Impoundment  Control Act, normally referred to as the Budget Act, the 1974 Act. It  came about because two things were going on: One is that President  Nixon had impounded funds, and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Throughout his career, Gene has been a steadfast defender of  Congress' power of the purse. His work has been especially important to  the Budget Committee, including oversight of Impoundment Control Act  reviews. He also directed the first-ever audit of the consolidated  financial statements of the federal government, an annual effort that  has significantly…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…that permanent extension of the tax cuts won't cost one dime. This  would establish a dangerous new precedent here.\n\nFor 51 years, we have operated under the Budget and Impoundment  Control Act. For 51 years, we have had the Congressional Budget Office  and we have had these rules, as imperfect as they may be, that we have  to follow, that things have…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…office, Donald John  Trump unlawfully usurped Congress and its power to appropriate funds,  thereby nullifying the Appropriations Clause in the Constitution and  violating the Impoundment Control Act of 1974.\n\nSince taking office, he has signed numerous executive orders  directing agencies to withhold funds appropriated by Congress. The  President does not…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…looked to illegally usurp our Article I  powers by firing thousands of government employees, redirecting funding  that we had appropriated here in Congress, violating the Impoundment  Control Act, and trying to rewrite laws by shuttering agencies through  executive action that Congress had created.\n\nAs a reminder, Congress and only Congress, under Article…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…double. This is the most fiscally irresponsible bill ever  to come to the Senate floor and wasn't supposed to be possible after  Congress passed the 1974 Budget Control and Impoundment Act.\n\nIn 1974, addressing the deficit was such a bipartisan priority that  the Budget Act created a special filibuster-free fast-track process,  known as reconciliation,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to  complete yearly trainings on appropriations law. These trainings would  include essential legal topics including: the Purpose Statute, the  Antideficiency Act, and the Impoundment Control Act.\n\nThe trainings will also include a review of the direction provided by  Congress in the annual Appropriations Act regarding each employee's  agency so that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…in the past, OMB has refused to make the apportionments for  the accounts at issue available to the Government Accountability Office  for their required review under the Impoundment Control Act of 1974. In  its report to Congress on the June 3, 2025, special message proposing  these rescissions, the Government Accountability Office noted that for  ``previous…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…does not change the underlying law  making the Trump administration's impoundments and mass firings  illegal. This is true as a matter of law.\n\nNothing in the CR changes the Impoundment Control Act, the foundation  of Congress's appropriations authority, and the authorization laws that  require USAID and other Agencies to exist and to operate the programs…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Republican plan, you have the magic math.\n\nThis was not the vision that was laid out back 51 years ago, in 1974,  when the Senate created, along with the House, the Budget and  Impoundment Control Act.\n\nThat act had three pillars. The first pillar was that in a 10-year  period, you have to decrease the deficit with the provisions that were  in the bill. And…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…received a rescissions request  from the White House to eliminate $9 billion in unobligated spending.  Let's just say there is much more to go. This is step one.\n\nUnder the Impoundment Control Act, once a request is received,  Congress has  45 days to act. The House is now acting. These rescissions are, in  part, due to what DOGE was able to uncover and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…rescinded in       special messages transmitted to the Congress by the President       on June 3, 2025, in accordance with section 1012(a) of the       Congressional Budget and Impoundment Control Act of 1974. All       points of order against consideration of the bill are waived.       The bill shall be considered as read. All points of order       against…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…proposed to be  rescinded in special messages transmitted to the Congress by the  President on June 3, 2025, in accordance with section 1012(a) of the  Congressional Budget and Impoundment Control Act of 1974, and ask for  its immediate consideration.\n\nThe Clerk read the title of the bill.\n\nMrs. McCLAIN. Mr. Speaker, I request that all Members have 5  legislative…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…rescinded in special messages transmitted to the Congress by       the President on June 3, 2025, in accordance with section       1012(a) of the Congressional Budget and Impoundment Control       Act of 1974.\n\nMr. JACK. Mr. Speaker, for the purpose of debate only, I yield the  customary 30 minutes to the gentlewoman from Pennsylvania (Ms.  Scanlon),…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…rescinded in special messages transmitted to       the Congress by the President on June 3, 2025, in accordance       with section 1012(a) of the Congressional Budget and       Impoundment Control Act of 1974, with the Senate amendment       thereto, and to have concurred in the Senate amendment.\n\nMs. FOXX. Mr. Speaker, for the purpose of debate only, I yield…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]