[{"senator": "Al Green", "party": "Democrat", "sentence": "…When I go out to events now, I have to have someone to  escort me out to events. When I am in the airport, we have to be  escorted through the airports.\n\nDo you think this improves the situation? This does not. This only  exacerbates a situation that we already are having to deal with. We  have had to allocate more funds so that Members can have armed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…legislation  to help expand access to care for patients with rare diseases and  complex medical needs. It increases research and development into rare  pediatric diseases, improves regulatory certainty, strengthens the  medical product supply chain, and enhances patient access to lower-cost  medicines.\n\nThis bill will help in our efforts to bring new…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. Speaker, I rise today in support of H.R. 1234. This bill, as has  been indicated, modernizes Congress and improves efficiency by  eliminating the requirement that the Congressional Research Service  print hardbound versions of its Annotated Constitution.\n\nThis measure, which I am proud…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…against America's enemies.  Today, women make up nearly 18 percent of the Active-Duty force and 22  percent of our National Guard and Reserve.\n\nStudies prove that their service improves innovation and mission  outcomes, making our military stronger, smarter, and more prepared to  face the challenges of modern warfare.\n\nThe administration's artificial barriers…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…provisions, it increases oversight of the FBI's terrorist  watch listing process, requires the NSA to notify Congress of  significant changes in its collection posture, and improves our  visibility in counter-narcotics-related operations.\n\nIt requires each IC element to designate a senior official to oversee  work on biotechnology issues, an emerging…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…U.S. merchant mariners. This bill tackles long  outdated methods for processing mariner credentials by investing in and  revamping the Coast Guard's process.\n\nThis bill also improves merchant mariner credentialing tests by  ensuring the most relevant and technologically critical elements are  included. We want the best mariners in the industry, and by…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…community organizers to fill critical gaps in disaster  response and recovery by leveraging private sector resources. Moreover,  Good360's preparedness model reduces waste, improves efficiency, and  strengthens the capacity of frontline communities to withstand and  recover from future disasters.\n\nGood360's innovative use of advanced data and resource…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Nation's  investments in biomedical research through the National Institutes of  Health and the National Cancer Institute.\n\nThe research that is conducted through NIH and NCI improves health  outcomes, creates jobs, and furthers our global leadership in  biomedical research and innovation.\n\nI am proud to have been a consistent supporter of funding for these…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…officers and their  surviving families. We must pass my legislation, the Heroes Lesley  Zerebny and Gilbert Vega First Responders Survivors Support Act, which  increases and improves access to financial and educational benefits for  the families of the fallen or disabled officers.\n\nLet's honor our officers not just with words but with meaningful  actions…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691331/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…legislation takes practical steps to support the Federal  programs responsible for removing debris and protecting the safety and  resilience of our coastal communities.\n\nThe bill improves NOAA's Marine Debris Program by giving the agency  clear authority to use new and existing tools to address pollution more  effectively and allowing NOAA to work faster and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Columbia have adopted the Medicaid  expansion--\n\nhelping adults with low incomes become healthier and more       financially secure. Health coverage through expansion       improves people's access to--\n\nSomething that makes so much economic sense. It--\n\nimproves people's access to preventive and primary care,       [it also] provides care for [people…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…talking about basic needs for people. It is a food assistance  benefit of $2 per meal so people don't go hungry. By the way, that  money not only lifts people out of poverty, it improves health and it  uplifts local economies, too.\n\nHunger costs this country, and food assistance programs save us  money. People who have enough food to eat are more productive…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…academic, social, and emotional outcomes, including higher test scores,  more compassion for others, and fewer disciplinary problems. It also  keeps students interested in school, improves attendance, and increases  graduation rates.\n\nArts education benefits every student, even in preschool. A recent  study shows that students in an arts-integrated preschool…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and endangered       children, pedestrians, bicyclists, and other bystanders.\n\nThe CPJRAA reduces biased policing and strengthens       evidence-based decision-making.\n\nIt improves consent search rules, mandates anti-bias and       de-escalation training, requires review of an officer's poor       misconduct before hiring, and directs independent assessment…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…about various challenges that they have had in accessing Fed  facilities, including the discount window in 2023.\n\nThis is a commonsense bill to ensure the Federal Reserve improves its  discount window to provide emergency liquidity to banks when they need  it.\n\nI appreciate that the chairman and sponsor worked with Representative  Waters and Representative…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…assist Israel       to develop and maintain a strong and ready self-defense       capability. This proposed sale is consistent with those       objectives.\n\nThe proposed sale improves Israel's capability to meet       current and future threats, strengthen its homeland defense,       and serves as a deterrent to regional threats. Israel already       has…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…dirt back in, which isn't that far from  what is actually happening with the high-speed rail.\n\nIt is better to create jobs doing something that actually creates  value, that improves the quality of life of Californians, and that  stimulates economic activity. Then there are actually more jobs because  those are jobs associated with the economic activity…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…to comprehensively evaluate the safety of  airspaces around airports across the country so that no other airspace  has the same risk of collisions that DCA did.\n\nNo. 4, it improves aviation safety information sharing between the  FAA and the military. No longer will there be silos of safety data.\n\nThese improvements will save lives.\n\nEarlier this week,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…than prescribing overly exquisite, gold-plated systems  with burdensome requirements.\n\nThis year's bill also fully funds the President's request for  counter-drone systems, improves force protection from drones at home  and abroad, and codifies the Joint Interagency Task Force 401, which is  responsible for coordinating all Department efforts to counter…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…am especially grateful to Mr. Valadao for his collaboration in  including my bill, the Justice for America's Veterans and Survivors  Act, in this package.\n\nMy legislation improves how the Department of Veterans Affairs  collects and reports data on the causes of death among veterans with a  particular emphasis on accurately identifying when suicide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…H.R. 3617, the Securing America's Critical Minerals Supply Act,  builds on that effort. It forces the Federal Government to take a hard  look at where America is vulnerable, improves coordination across  agencies, and ensures securing critical minerals is treated as a  priority, not as an afterthought.\n\nThe bill strengthens the Department of Energy's role…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…the Chamber  speak for 25 minutes or 25 hours, they can't change the truth. Today  was about performance for some of them, but today for us is about  results--a result that improves the lives of Americans regardless of  their race, religion, color, or creed. It does not matter.\n\nI tell you what Ronald Reagan used to remind us, you can always trust  the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…school zones and on public  transportation in the State in which they are licensed. This bill  affords qualified law enforcement officers the same privilege.\n\nThis legislation improves public safety as our officers face  increasingly greater dangers, and current restrictions hinder their  ability to carry firearms and protect themselves and others.\n\nAt a…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Federal agencies purchase and use  software.\n\nThe text we are considering today is identical to the text we passed  out of the House by voice vote last Congress. This bill improves  government software purchasing without unduly limiting the procurement  options of Federal agencies.\n\nIt requires each agency to better manage its software and develop a…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…cost over $100,000 before a shovel ever hits the dirt  to build a new home, and builders often cannot build a home for less  than $250,000. This bill modernizes housing laws, improves coordination  between HUD and USDA, expands manufactured housing in rural  communities, reduces barriers for veterans, and increases access to  small-dollar mortgages.\n\nMr.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699948/housing-for-the-21st-century"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…Classified briefings will ensure that Congress receives timely and  accurate information necessary to evaluate our nationwide posture.\n\nThis bill strengthens unity and effort. It improves coordination. It  increases visibility and accountability. It ensures that the United  States can respond to foreign cyber aggression with preparation rather  than reaction.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…is the only  way to actually lower health premium costs over time.\n\nThis bill lowers premiums through pharmacy transparency and cost- sharing reductions. This legislation improves options for workers by  expanding access to associated health plans. It also ensures that small  and midsize employers can offer more tailored, affordable care, and it  codifies…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…the next generation of  aerospace leaders here in Virginia.\n\nMr. Speaker, the One Big Beautiful Bill Act restores American  strength at sea, revitalizes our industrial base, improves quality of  life for military families, and secures our future in space. I am proud  to have supported this historic legislation, and I will keep working to  make sure coastal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…5788 makes a simple fix. It requires risk  assessments for the 504 loan program, just like we already do with  other major SBA loan programs. This helps to close the gap and improves  oversight.\n\nTransparency matters. When we clearly understand how a program is  working, we can protect taxpayer dollars and make sure the program  stays strong.\n\nThis bill…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699185/504-program-risk-oversight-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…where union bosses block measures that  they don't like, forgetting that they work for the American people and  not the other way around.\n\nThe President's executive order also improves care for veterans. On  August 6, 2025, the VA announced that it is terminating most union  contracts to comply with the executive order.\n\nEmployees at the VA currently spend…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}]