[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employer tests are used to       determine who is responsible for wrongdoing when there are       multiple entities with the power to determine employment       conditions. An improperly narrow FLSA or NLRA standard would       make it harder for workers to hold the right entities       responsible for abuse. Further, a narrow NLRA joint employer       standard…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…many names  by people who would not have him release the information. Mr. Goldberg  has been scorned. He is a person who called to our attention something  that was done improperly, and yet he is being made the villain. He is  not the villain. He is the hero in this process, and he ought to be  acknowledged as such.\n\nI am going to have a flag flown…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…worst of the worst: the murderers, the  rapists, and the sexual offenders.\n\nShe is not doing that. They have decided they are going to get  anybody who is in the country improperly, and that is wrong.\n\nI will write the Trump administration and ask them to take ICE out of  Memphis. It shouldn't be part of this surge they have to help us with  our crime…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696772/take-ice-out-of-memphis"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Institute of Peace forcibly  from his office, and then the Trump administration fired every employee  and dismantled the office.\n\nA district court has ruled that he acted improperly because the  Congress created the United States Institute of Peace and the President  didn't have the authority to dismantle it.\n\nToday, I have learned that President Trump…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697480/united-states-institute-of-peace"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…volition, and made a life here. They didn't  decide to come, but they are here. They made a life.\n\nI have had to go across the border to bring people back that were  deported improperly. These people are here in this country making  America a better country by their very presence in the country. Not  everybody is going to invent something to make America…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have to appeal, after having  been told that they cannot do what they have done, after having been  told that they have to facilitate the return of someone that they have  improperly, and according to what members of this administration have  said, removed from the country by mistake, then you have to bring that  person the relief necessary for that person…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…servicemember received the  honor and respect of a proper burial.\n\nFrom World War II alone, it is estimated that 600 American-Jewish  servicemembers killed in action remain improperly buried under Latin  crosses rather than Stars of David. While some of these improper  burials were due to clerical errors, we have heard many stories of  Jewish war heroes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…conflicts of interest in using crypto to profit from the  Office of the Presidency. That is why I voted for amendments to impose  guardrails to stop elected officials from improperly profiting off  trades, and I will continue to push strongly for solutions to this  problem.\n\nHowever, we cannot let the perfect be the enemy of the good. We stand  at a critical…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…a small business  fishermen had invested in.\n\nTo this day the fiberoptic company has to enter that sanctuary  regularly in order to repair and rebury the cables that were improperly  installed. All of this would have been an even greater mess had this  bill been law at the time, had NOAA been unable to put some conditions  and some guardrails into the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…of the  things I have learned is that safety isn't our ability to project force  or the tools we have at our disposal. Those things can make us safe,  but if they are used improperly, they can make us less safe and less  secure. And that is exactly what we are seeing from this  administration. It is what Donald Trump, Stephen Miller, Tom Homan, and  Kristi…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…be great news for people like Lynne Patton, who is  returning to work for President Trump this week after finishing up a 2- month suspension from Federal service after she improperly used her  position with the Department of Housing and Urban Development for  political purposes during President Trump's first term.\n\nIt is also good news for all of the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, $168 billion was the amount the  Federal Government improperly paid last year. We paid some bills two or  three times. We paid the wrong invoices altogether. We paid invoices we  didn't know we paid because there was no tracking mechanism.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692480/accountability-and-transparency-in-government"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…nationwide. This will help ensure that Congress is acting on  accurate, real-world information.\n\nSome of my colleagues on the other side of the aisle may argue that  the hotline improperly focuses on burdensome regulations rather than  collecting positive feedback, but it is simple: The purposes of this  tool is to identify obstacles that need attention, and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…operate.\n\nMr. Speaker, I urge passage of this rule in order to bring more  transparency and oversight into our children's schools, to ensure that  our children are not being improperly influenced by foreign actors or  that foreign actors aren't using contributions to our schools to  benefit themselves.\n\nOne of our colleagues on the Education and Workforce…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…the NFA, the constitutional foundation for applying the  NFA's transfer and registration requirements to those zero-tax firearms  no longer exists. These requirements now improperly operate without any  corresponding exercise of Congress' taxing power.\n\nAs the Supreme Court upheld the NFA's provisions only as ``in aid''  of that taxing power, and since…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…title 31, United States Code, for the authorized uses of the       Do Not Pay working system to help prevent improper payments       of, and support the recovery of improperly paid, benefits or       other payments through a cooperative arrangement with such       agency, provided that the requirements of subparagraphs (A)       and (B) of paragraph…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…supports our nation's energy       security, well-paying jobs and economic benefits for local       Alaska Native communities and the state as a whole. The 2022       BLM ROD improperly limits future oil and gas lease sales and       development to occur by creating a presumption against future       permitting. This is a bad policy that does not support…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…question: Where has all of this  money gone?\n\nEven an audit during the Biden administration from President Biden's  Health and Human Services agency found that California improperly  claimed $52.7 million in Medicaid reimbursement for noncitizens, which,  of course, raises many questions about how pervasive these improper  payments might be in our Medi-Cal…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…encourage people to understate income to get bigger       subsidies.\n\nUsing Census Bureau data, Mr. Blase estimates that about       6.4 million people this year were improperly enrolled in       subsidized ObamaCare plans, costing taxpayers $27 billion. He       has also found that about 40 percent of enrollees in plans       fully subsidized by…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…deeply concerned about the lock on her front door,  and she no longer felt safe in her own home.\n\nAfter inspecting the door, Officer Hobson realized that the lock had  been improperly installed. Instead of just filing a report and moving  along, he took it upon himself to go to a local store, purchase a  proper lock, and install it himself, giving this…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…fill it out. They are given the  form, and then they fill it out. As a result, they end up showing up on  some voter rolls, and there is the potential that they may vote  improperly in one of our Federal elections.\n\nLast Congress, then-West Virginia Secretary of State Mac Warner  testified before a House Administration  Committee hearing to discuss his…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…deadly if ingested.\n\nIn fact, one spoonful of the chemical is one hundred times more  lethal than other poisons. High concentrations of some chemicals can be  harmful if used improperly, which is why they are usually highly  regulated or banned for sale to consumers.\n\nThanks to online forums like the one Kristine saw, the number of  suicide deaths using…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690217/youth-poisoning-protection-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Resource Management Plan and Final Environmental Impact       Statement released by BLM on April 19, 2024--include the       following:\n\nThe 2024 Central Yukon RMP improperly designates certain       ACECs/Research Natural Areas by including areas that do not       meet applicable requirements for designation and management       of ACECs and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Buffalo RMP).\n\nFollowing its issuance, the 2015 Buffalo RMP was challenged       in the United States District Court for the District of       Montana on the basis that BLM improperly approved the plan in       violation of the National Environmental Policy Act (NEPA).       The court found that BLM violated NEPA and ordered BLM to       complete a new…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…estate.\\15\\\n\nFollowing its issuance, the 2015 Miles City RMP was       challenged in the United States District Court for the       District of Montana on the basis that BLM improperly approved       the plan in violation of the National Environmental Policy       Act (NEPA).\\16\\ The court found that BLM violated NEPA in its       final environmental impact…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…proper language or competency testing.\n\nA Federal Motor Carrier Safety Administration audit prompted by  President Trump found that multiple States issued nondomiciled CDLs  improperly to unqualified, often foreign drivers, even in some  instances allowing them to keep licenses after their legal status  expired.\n\nIn the Florida case, the FMCSA investigation…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}]