[{"senator": "Al Green", "party": "Democrat", "sentence": "…bringing of this person back to the country, and  he has not done so as of the time these articles were filed.\n\nThis President knows that the removal without due process was an  improper action; but he did it, notwithstanding the knowledge that was  accorded him by some members of his staff, some persons in his  administration.\n\nSo I say to you, H. Res. 415…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have allowed him to normalize his behavior.\n\nI was censured. I had to stand in the well. I accepted my punishment.  I accepted it. I never criticized the notion that it was improper for  me to be removed. I did say that I didn't think the punishment was  appropriate in terms of being censured, but I never said anything that  would cause the President…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…unanimous consent request, but I am glad she did because I want the  Record to be clear. I didn't hear any objection on the floor. The  Republican chair basically ruled it as an improper unanimous consent  request, and so that is why it didn't move forward.\n\nHowever, I do know this, because I am on the Rules Committee, and I  do know the gentlewoman time and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…guns, protects kids from bullying, or protects kids maybe from  online predators; but no, this is from the foreign influence of China.\n\nThere is no credible evidence of any improper influence in K-12  schools, yet this is what the bill is about. It imposes sweeping  penalties that do nothing to enhance national security. It only harms  students. The apparent…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…have been subjected to spiteful, petty attacks. They have  been caught in the crossfire of a political witch hunt. They have had  their lives disrupted by these abrupt and improper firings.\n\nMy State has felt a significant impact from these firings. It is home  to so many Federal workers--as I have mentioned, 160,000 of them-- people who I am incredibly…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…well as the integrity of our  political system.\n\nWhen President Trump, brazenly and shamefully, flouts the  constitutional protections implemented by the Founders to avoid  improper influence, he violates one of the core principles of our  Constitution. He has never come to Congress asking for any permission  for any of these deals; that is for sure.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…launched investigations into officials  involved in prior probes against Donald John Trump, in some cases  against individuals specifically named and accused in flagrantly  improper executive orders.\n\nFurthermore, he has made direct and unambiguous public statements  threatening media outlets, current and  former officeholders, and advocacy organizations.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…operators are federally  mandated to use deicing equipment when ice and snow accumulate to  ensure that the plane can be operated safely.\n\nThis equipment is so important that improper use has been cited by  the National Transportation Safety Board, or failure to have it at all,  as a cause of multiple aviation accidents, including a very famous one  right…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…alone, it is estimated that 600 American-Jewish  servicemembers killed in action remain improperly buried under Latin  crosses rather than Stars of David. While some of these improper  burials were due to clerical errors, we have heard many stories of  Jewish war heroes not wanting to display their faith on their dog tags  while fighting against the anti-Semitic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…servants who call Maryland home. Each one  of them has made a commitment to public service. Each one of them is a  civil servant that I am proud to represent. These abrupt and improper  firings have shaken up the lives of thousands of dedicated workers who  do not deserve this treatment. And what makes this even worse is that  attacking our Federal workers…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Pete Hegseth finds it okay to resurrect the name of Ku Klux  Klansman General Bragg, Fort Bragg, but yet you take down the name of  Jackie Robinson. And you are not done with improper ideology? Then you  resurrect the names of so many others. There are six military bases  that have some of these Confederate generals on there, but then you  take down the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…might relate to an ongoing  investigation which President Trump authorized going after Bill  Clinton, Larry Summers, and others on the Democratic side which are  false and improper investigations where Ms. Bondi said there was  nothing there, will not allow for material to be disclosed.\n\nThe Senate said the House shouldn't get involved with the $500,000…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Mr. Speaker, I need to level set here.\n\nThe President cannot take money from the proceeds of seized  Venezuelan oil and control it himself via means of a highly illegal and  improper offshore slush fund. The President has no constitutional  authority to do this.\n\nHe doesn't get to create his own secret, overseas slush fund, which  is outside of our purview…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699022/where-is-the-outrage"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…executive order called the ``Restoring  Truth and Sanity to American History'' order, directing the Smithsonian  and the Secretary of the Interior to remove what they called improper  partisan ideology from exhibits and materials across the country.\n\nIt targeted mentions of slavery, Native American history, Chicano  history, AAPI history, LGBTQ+ history,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…is important that the SBA is properly funded and staffed. I am  concerned that the cut in the SBA's workforce by 43 percent will impede  the SBA's ability to recover the improper and illegally obtained  payments.\n\nMr. Speaker, having said that, I urge all of my colleagues to support  this very important legislation. I thank my colleague, Representative…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…where the star  says: ``I see dead people.'' Our Treasury Department doesn't see dead  people. They just write them checks.\n\nYear after year, gaps in our data system allow improper payments to  flow to individuals who are no longer living. It is wasteful,  avoidable, and undermines trust in government-run programs.\n\nAs founder and co-chair of the DOGE…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…in Washington, but we are cleaning  it up in this bill.\n\nUSDA has pointed out that there is about $10 billion a year in waste  just in the SNAP program because of fraud and improper payments. These  payments are not going to children that you hear about on the floor,  and not all these other people. It is going to improper payments, to  fraud, $10 billion…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…ESTES. Madam Speaker, I thank Chairman Smith for yielding time to  me on this important topic.\n\nIt is important to be here today to express my support for S. 269,  the Ending Improper Payments to Deceased People Act. It is commonsense  legislation that taxpayers should not be footing the bill for people  who are deceased.\n\nThe purpose of this legislation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…when we are increasing Medicaid spending? I mean, it is mind- boggling that we allow that narrative to set in on a program that is  broken, that has a trillion dollars of improper payments, that is rife  with abuse.\n\nWhat are we here for? I mean, that would be my question for my  Republican colleagues. Why did you run for office? Because I don't  recall…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…The Department of the Treasury started its first automated payment  verification system at the recommendation of DOGE. So far, more than  $300 million has been identified in improper payment requests.\n\nOver at the Centers for Medicare and Medicaid Services, the  government has launched a Fraud Detection Operations Center, and 1 week  ago today, CMS announced…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…cutting waste, fraud, and abuse for people who are here  legally. The Tax Cuts and Jobs Act helped people get off SNAP, which is  a good thing. A GAO report last year showed improper payments could be  costing the Federal Government more than $500 billion annually.\n\nI am not here to fight with my colleagues on the other side of the  aisle. I am here to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…never have. Yet, Gemma fabricated an  entire outlandish criminal allegation against me. It had a massive  story about a rape in 1987, which didn't happen, and accusations of  improper conduct, which did not happen. It also came forward with an  alleged victim. It was all malicious. It was all made up. It was all a  lie. Yet Gemma even generated fake links…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…needs sufficient time to assess impacts.\n\nFurther, it appears that the agency is trying to rush this       process through for its own political purposes, which is an       improper reason for fast-tracking such a major proposed rule.       It has been reported that a representative of the agency       stated during a public meeting that an extension…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…bill for these schemes.\n\nThis policy brief presents a state-by-state analysis       describing how zero-claim enrollment corroborates much of       Paragon's previous work on improper enrollment and fraud in       the ACA exchanges. We also debunk claims that young, healthy       enrollees without claims are serving to diversify the risk       pool and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…verifying eligibility. I don't know  what coalition in the House of Representatives is for that. Apparently,  it is the same one that is for over $100 billion lost annually to  improper payments.\n\nThere is a coalition here, Mr. Speaker, that wants to take tax  dollars and pay $100 billion, losing it annually to improper payments.  What we are asking the States…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690820/cleaning-up-medicaid-rolls"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…the Secretary of the Coast Guard Act of 2025.\n\nThis measure also makes important reforms following the revelations  of Operation Fouled Anchor, which was a report detailing improper  handling of sexual assaults within the service. As a sheriff and a  firsthand law enforcement officer, I have seen the harmful effects that  happens to these victims.\n\nI…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…inefficiency, the ineffectiveness, the waste, the fraud of a government  healthcare solution, that somehow that is taking away benefits.\n\nWhen you have a trillion dollars of improper payments, when you have  the State of California openly and publicly stating that they are  gaming the Medicaid system and the provider tax and the Federal match  rate to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…rates when it comes to food assistance benefits  that could cost a loss of $2.5 billion in Federal funds.\n\nBillions more are at risk of being lost or are being lost through  improper Medi-Cal determinations and through ongoing EDD fraud, which  continues at staggering levels even after the $32.6 billion lost during  the COVID years.\n\nThe audit also found…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…failed program that is  littered with waste, fraud, and abuse, like cancerous lesions.\n\nDon't take my word for it. Just look at the GAO report: Its estimates  show millions of improper enrollments, costing American taxpayers up to  $27 billion annually. One Social Security number used for 26,000 days  of coverage, and more than 58,000 deceased people receiving…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…be rewarded for how efficiently we deliver and the quality  of our services compared to so many other States that are just ripped  with fraud?\n\nYou start to see cumulative improper Medicaid. This is not Medicare.  This is Medicaid. It is supposed to be healthcare for indigents. That  is the law. Payments since 2019 are over $400 billion. If you actually…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]