[{"senator": "George Whitesides", "party": "Democrat", "sentence": "…growing threat that the people I represent know all  too well.\n\nI know from firsthand experience that the United States is home to  the smartest, most hardworking, and most impressive minds of our time  who have dedicated their lives to helping families across the country  fight deadly diseases, predict and prevent natural disasters before  they hit, and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…News Network on June 13, 2025)\n\nI remember driving with my father down Rockville Pike in       Bethesda, Maryland as a little girl. We would pass a large       campus of impressive buildings called the National Institutes       of Health. I told my dad I would work there one day. He said       no, that place was for doctors and scientists. I knew I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Brown's service to our  Nation. As a veteran--as a decorated veteran--who has earned  appreciation for his service, the kinds of qualifications he brings to  this office are impressive. But this nominee was advanced out of  committee by a 10-to-9 vote. So it is clear he does not have unanimous  support.\n\nHe said, when he was asked about whether he would…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…with on the court. He dazzled  all of the audience with his skill, determination, and unshakable  leadership. A playmaker in every sense of the word, Makhi not only put  up impressive numbers but also lifted his teammates, making everyone  around him better.\n\nElise Bender has proven that hard work and passion are unstoppable  forces. A true competitor,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689799/congratulating-all-blade-basketball-players-of-the-year"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…politicians in robes who rule in favor of the  President and wealthy special interests.\n\nFinally, I would like to note that Ms. Hermandorfer's academic  record, although impressive, and legal record, although extreme, is  short. She graduated from law school in 2015--has fewer than 10 years  of legal experience. Outside of clerkships, she has only practiced…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…football team, the Bulldogs, on becoming back-to-back  champions. Their dramatic 28-27 victory in the California Community  College Athletic Association Championship was their impressive third  title in 4 years.\n\nWhile the San Francisco Bay Area welcomes the NFL for Super Bowl LX,  I would like to also properly call attention to this remarkable  program.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today to recognize the impressive  efforts of Kyla Guerrero, a constituent of mine from Bend, Oregon. Kyla  has used her Gold Award Girl Scout project to tackle the issue of food  waste, taking leftover food…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Association.\n\nReese has been described as an aggressive and ferocious player and is  heralded as the most prolific goal scorer in the Akron area.\n\nThis season, Reese scored an impressive 44 goals and 15 assists,  leading the Hoban Knights to the State semifinals.\n\nThis is Reese's fourth year on the varsity team, and over her  impressive soccer career, she…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697073/champion-of-the-week-reese-gallagher"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…arts-integrated STEAM school  in my home State of Oregon, where two sixth-grade students explained  how they made a stop-motion animation film about cell division. Now,  that was very impressive, and they were very confident. With more  technology and artificial intelligence, students will need skills to  observe, analyze, question, and consider multiple perspectives.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…well. Since 1992, judges in D.C. have made pretrial decisions       based on a person's risk to public safety rather than their       ability to pay. The outcomes are impressive: in the last four       years, 88 percent of people released pretrial in D.C.       remained completely arrest-free, and 98 percent remained free       from arrest for violent…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and remind  us to be stewards of all people and the planet before pursuing partisan  and personal ends.\n\nI congratulate His All-Holiness on the well-deserved and highly  impressive honor of being awarded the 2025 Templeton Prize, which  recognizes spiritual and scientific advancement. The award puts him in  the company of Mother Teresa, the Dalai Lama,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…exchange between Americans and the German people.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Emiko Mukai for this impressive  accomplishment and wish Emiko all the best in this upcoming year in  Germany.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693200/recognizing-emiko-mukai"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Madam Speaker, I rise today to honor and celebrate  Leslie Rook of Monrovia, California.\n\nEarlier this year, Leslie completed a truly impressive feat of  running 50 marathons in all 50 States with an average of three  marathons each year.\n\nOver the past 14 years of this challenge, Leslie ran more than 1,300  miles…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694050/congratulating-leslie-rook"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…important tool in furthering agency missions and the Nation's  goals in science and exploration.\n\nThe Department of Energy and NASA's partnership is already  demonstrating impressive results. For example, earlier this year, NASA  and the DOE collaborated on selecting an award for continued industry  work on a space microreactor design that could provide…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…allows students to report roadway hazards for fellow  pedestrians and bicyclists on a shared map. This accomplishment is an  example of Aariv's determination, hard work, and impressive knowledge  base in the STEM field.\n\nI congratulate Aariv Arora for his success in the Congressional App  Challenge. I am certain he will continue to show the same dedication…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698764/recognizing-aariv-arora"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…their second  consecutive State title, an incredible accomplishment that reflects  their hard work, talent, and dedication.\n\nWith a squad of just 11 boys, Glenvar scored an impressive 280  points, outpacing second-place Radford High by 75 points. Of the 11  swimming events contested, the Highlanders won 5 and were runners-up in  2 others.\n\nCongratulations…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…football Division 7  title game, they carried with them the hopes of bringing a state  championship back to Michigan's Upper Peninsula for the first time  since 2015. In an impressive display of discipline and determination,  the Maroons prevailed with a commanding 34-6 win over Schoolcraft,  earning the program its fourth ever state championship while…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698002/recognizing-the-menominee-maroons-2025-division-7-michigan-state-football-champions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Meet. Owen overcame the challenges posed by  intense competition in his effort to win the title.\n\nIn pursuing the State Championship, Owen defeated his opponents with  an impressive time of 4:10.19. His hard work and dedication, both on  and off the track, in achieving this accomplishment is truly  outstanding. He has achieved an impressive season, bringing…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693332/special-recognition-of-owen-scott-for-winning-the-division-ii-state-track-and-field-title-for-the-1600-meter-run"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…dedication, creativity, and a genuine commitment to serving  others, qualities that earned her the rank of Eagle Scout. The  accomplishment, Mr. Speaker, as you know, is impressive for any Scout,  but for Miley's achievement, it also marks an historic moment for our  community--expanding what is possible for young women in northeast  Florida.\n\nAs part…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698832/congratulating-miley-meredith"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in the country  to do business, and that was certainly confirmed by my visit back home  these last couple of weeks. I had the opportunity to visit with some of  our most impressive businesses, from major manufacturing facilities to  local, family-owned small businesses.\n\nOne such visit was to Daikin Texas Technology Park in Waller County,  a suburb…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Cadets showed they came ready to compete.  Benedictine set the tone, demonstrating exceptional determination,  discipline, and heart.\n\nJoJo Johnson led the charge with an impressive 85-yard touchdown run  followed by key contributions from quarterback Kaiden Kohler and VMI  commit Landon Snyder, giving the Cadets a commanding 20-0 halftime  lead.\n\nDefensively,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697026/recognizing-benedictine-college-preparatory-school-athletics"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…that we have a President in the White  House with the guts to get it done, who has helped us build a military  with the capability to get it done. It was one of the most impressive  military operations that I think the world has ever witnessed. Those  men and women, whether they were on the ground, in the air, or  supporting that mission, deserve commendations,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…parish has served Tulsa and the Greek  Orthodox Archdiocese of America for a century. The Church continues to  be a strong and dedicated partner in the Tulsa community.\n\nThis impressive anniversary highlights the congregation's devotion to  the greater Tulsa community, as well as their unwavering faith in God  and commitment to His will. One hundred years…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…confirmed 417 civilian Presidential nominations--more  than were confirmed in the first year of President Trump's first term  or President Biden's. And while 417 would be an impressive number all  on its own, it is particularly remarkable given the historic level of  obstruction the President's nominees faced. I said ``historic,'' and I  mean historic.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…coaching staff.\n\nThe women's team claimed its second consecutive national  championship, dominating the field and finishing 46 points ahead of  their closest competitors. Their impressive victory continued just two  days later, as they claimed first place in the NJCAA Half Marathon  National Championship, a historic feat for SLCC and a significant  milestone…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…NTSB, along with their Federal partners and law enforcement  agencies, jumped into action that cold January night. Over the last  year, the NTSB carried out one of the most impressive and comprehensive  investigations that I have seen, and I thank the NTSB for their  dedicated work over the past year.\n\nThe NTSB officially concluded its investigation and…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…is also a slap in the face to the hard-working  taxpayers of this country. What is taking place in Minnesota is pure  evil, and it is straight from the pit of Hell.\n\nIt is impressive to me that a 23-year-old independent journalist did  more to serve the American people with investigative reporting than the  so-called experts in the legacy media. Where…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in their event.\n\nIn pursuing the State Championship, Evan Schiefer, Bradley Smith,  Ayden Perkins, and Owen Gahring defeated their outstanding competitors  to win with an impressive time of 7:57.32, a new school record. The  members of this very special team have shown that their sport requires  an individual effort for a team result. Their hard work…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693381/special-recognition-of-seneca-east-high-schools-boys-4-x-800-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in their event.\n\nIn pursuing the State Championship, Audrey Alig, Lana Kaiser,  Kiersten Keller, and Isabella Zahn defeated their outstanding  competitors to win with an impressive time of 3:53.94. The members of  this very special team have shown that their sport requires an  individual effort for a team result. Their hard work and dedication,  both…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693429/special-recognition-of-coldwater-high-schools-girls-4x400-meter-relay-team-for-winning-the-division-iii-state-track-and-field-title"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…increasingly  values lower carbon products. The leading companies and associations of  this industry have committed to achieving net-zero emissions by 2050  and have made impressive progress thus far, reducing their carbon  footprint by 21 percent since 2014.\n\nHowever, more progress can be made. With projected demand for cement  expected to increase…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688937/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}]