[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Republicans voted on giving ICE billions of  dollars to terrorize our communities. It is beyond shameful.\n\nICE operates with no meaningful oversight and continues to act with  impunity, even as it carries out violent operations that have cost  lives.\n\nI am sick and tired of seeing Republicans reward a rogue agency that  inflicts harm on our communities.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699381/communities-deserve-safety"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…painful, especially when my colleagues  remain silent on the starvation of children and vote to send more bombs  to the Israeli Government while they commit war crimes with impunity.\n\nToday, we are witnessing a genocide in Gaza. Many human rights  organizations, advocacy groups, NGOs, and folks on medical missions  have confirmed, the campaign to erase…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…cannot allow the criminal gangs in Haiti and those  powerful political and economic elites who have enabled and empowered  them to inflict violence and chaos on Haiti with impunity. Impunity  must stop.\n\nThe people of Haiti must believe that they have the opportunity to  chart a path to a secure, stable, and democratic future and that gangs  will not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…resentment and hatred.\n\nAnd third, Israeli settlers routinely and increasingly engage in  provocations, threats, and violence--sometime deadly violence--against  Palestinians with impunity. These attacks and gratuitous destruction  and theft of Palestinian property are often observed and tolerated by  IDF soldiers. This too fuels hatred and more violence.\n\nAbsent…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Cabinet Secretary overseeing these raids, Kristi Noem; the  architect of this campaign of fear and mass arrest and detention, the  ``racist in chief'' Stephen Miller.\n\nThis impunity that we see on our streets, this violence--it comes  from the top; gaslighting amplified by the Vice President and the  President himself.\n\nThis brazen denial of rights and…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…serves only Donald Trump and enriches those who are loyal to him.\n\nIn a system where the rule of law is replaced with raw power and  governed by grievance, greed, cruelty, and impunity, nobody is safe.\n\nThis is not just a story of a Presidential power grab because that  was envisioned by our Constitution. That is why it was written the way  it was. It was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…hearing, and the list goes on and on.\n\nI want to be clear that this is not just about immigrants. This is  bigger than that. If the government can violate the Constitution with  impunity in these cases, then it can do so anywhere to anyone.\n\nTo the Americans listening at home, I ask you: How would you feel if  masked men grabbed you in broad daylight and refused…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…their candidate loses.\n\nOn September 3, I also spoke about President Castro's failure to  achieve her pledge to establish an international commission to combat  corruption and impunity, and the lack of progress in bringing to  justice those responsible for the murder of environmentalist Juan Lopez  and others who have lost their lives defending the land…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and mosques and  synagogues, in Boy Scout troops and college sports teams, in summer  camps, anywhere the powerful and the rich believe they have the  opportunity and the impunity to exploit the young, the poor, the  powerless, and the vulnerable.\n\nWe must face the truth and find the coconspirators still at large in  one of America's most extensive…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…citizens.\n\nMore than seven decades later, we are again seeing election  interference and political repression, attacks on journalists and civil  society, war crimes committed with impunity, and a broader disregard  for basic human rights. One of the clearest examples is Russia's  invasion of Ukraine. To deny Ukrainians the freedom to choose their own  future,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…or the Constitution.\n\nAcross this country, we are witnessing a dangerous pattern: Federal  law enforcement officers--specifically, ICE agents--operating with near  total impunity. We have seen constitutional rights violated, and we  have seen communities terrorized. We have seen American citizens harmed  and, tragically, killed without meaningful accountability…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…depends on norms; on  shame, even; on the willingness of people in power to accept limits on  that power. When those restraints disappear, when corruption becomes  routine and impunity becomes expected, the Republic is in deep danger.\n\nThe health of our democracy is at risk, but so, too, is the health of  our Nation.\n\nLet me tell you about a constituent…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…my tongue. No. This President would not allow it. He would  consider this a threat. I would be facing a fine. I would be facing  going to prison, but the President is with impunity, saving what  happened yesterday, with impunity making threats against judges, making  threats against Members of Congress.\n\nMr. Speaker, for those who say, well, that is…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…such as this being utilized against people of color at an earlier time.  The President would take us back to those ugly days when you could call  Black people n-words with impunity, when you could demand that Black  people show respect that was not deserved, when the Black people were  relegated to the back of the bus. They were relegated to the balcony…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…some  point, what I have in my hand now will occur. I have in my hand an  article from Politico dated November 20, 2025. When we allow the  President to say these things with impunity, this is what we face.  November 20, 2025, 10:42 a.m. Eastern Standard time--it is styled:  ``Trump calls for Democratic lawmakers to face trial for `seditious  behavior.'''…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…statement of administrative  policy, this resolution, if we passed it, would signal to U.S. trading  partners that they can continue to discriminate against U.S. exports  with impunity and would signal that the United States is not serious  about addressing structural imbalances in the global economy and the  conditions giving rise to the threat to U.S.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690537/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…responsibilities of the President is ensuring  that those who endanger American lives are brought to face justice. He  did just that.\n\nWhen Nicolas Maduro continued to operate with impunity, President  Trump made the decision to enforce United States law and protect our  national security interests.\n\nNicolas Maduro was not a legitimate leader. He was an indicted…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…States.\n\nAlthough the gentleman from New York is from a fairly populous State,  he is not from a State without a large rural border, one that you can  simply walk across with impunity normally, which has been used to  smuggle drugs successfully.\n\nThe point I make here today--and I thank the chairman for the time-- is: Every life matters. If the President…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, I rise in opposition to the  epidemic of waste, fraud, and abuse that is ripping off taxpayers with  impunity.\n\nToo often, Congress forgets that every dollar of government money  collected comes from an American who worked hard for it. That is why  waste, fraud, and abuse are not…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}]