[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…from the Sixth District of the great State of Louisiana for  yielding.\n\nI would like to read for you, Mr. Speaker, a speech that the  Honorable George W. Bush gave at the inauguration of the African  American history museum. I was proud to be in attendance there, and I  must say I was not a big fan of the Presidency of Mr. George Bush, but  now, looking…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…experiences available in D.C. From joining me at the White House bill  signing ceremony for my Respect for Marriage Act, to escorting Former  President Obama during the 2024 Inauguration, Matt was always willing  to seize the opportunity.\n\nA proud University Albany alum and Long Islander, Matt brought the  New York spirit to our office. Given his love for…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…for the wealthiest amongst us who have done the best over  the last 20 years, for billionaires that seem so close to the President  that they sat right on the dais at his inauguration and sit in his  Cabinet meetings at the White House.\n\nDid you speak up when he gutted public education, slashed funds for  pediatric cancer research, fired thousands of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…longer a hypothetical. Selling out American interests  began the first days and hours of this administration in President  Trump's second term. How did he celebrate his inauguration? Well, he  launched a cryptocurrency scheme, a meme coin. The only purpose of it  was to enrich the President. Unsurprisingly, by design, foreign  governments, unscrupulous…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Mr. Abrego Garcia.\n\nThe President was asked recently whether he had an obligation to  uphold the Constitution, which he swore an oath to in the witness of  all of us on Inauguration Day. He was asked if he had to uphold the  Constitution. Just within the last week, he said he did not know. We  know the answer to that question, but the President does…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…what it is: a thank-you gift to Elon Musk and  other Big Tech billionaires who came to Trump's rescue during the 2024  election. We all saw them front and center at Trump's inauguration. You  saw those billionaires accompanying him. Why are all the billionaires  getting together? They are getting together because they don't want to  pay more taxes. They…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, 100 days ago, Donald Trump proclaimed  ``the golden age of America begins now.'' But in 100 days, since  Inauguration Day, ``King'' Donald has shown us that he sits on a throne  of fool's gold--one built on empty votes, unfulfilled promises, and lie  after lie after lie.\n\nIn just over 3…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…that are working in the energy industry no matter  what part of the industry they are working in.\n\nAnd the fact that Donald Trump--even when oil is at $73 a barrel at  his inauguration and we are producing more than we have ever produced  in the history of mankind for the United States--thinks we are in an  energy emergency or he claims that we are surprises…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…campaign trail, Trump ramped up his crypto involvement. In  September 2024, he and his family launched World Liberty Financial, a  crypto trading platform. Days before the Inauguration, Trump launched  his memecoin which he later used to offer access to the White House to  the highest bidder, foreign or domestic.\n\nHis family's crypto empire hasn't stopped…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…trillion.\n\nFor what?\n\nWell, Mr. Speaker, sometimes the simplest explanation is closest to  the truth. We all saw the gaggle of billionaires sitting behind Donald  Trump on Inauguration Day earlier this year. The driving force behind  this entire legislative effort has been to grant handouts to those same  billionaires and special interests all at the expense…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693236/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…far cry  from President Trump's promise of cutting electricity costs in half in  his first year. Residential natural gas prices are up 20 percent since  the President's inauguration. When families struggle to pay their  utility bills, they often fall into debt.\n\nSince December 2023, household utility debt has risen over 30  percent, climbing to a whopping…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…helped. They have been in charge for a  year. They have helped Big Oil. They have helped Big Banks. They have  helped Big Tech.\n\nLook who was in the front row at Trump's inauguration: billionaires.  That is all he cares about. Look at their promises to go after ``the  worst of the worst'' when it comes to immigration, another broken  promise. Stephen…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…King, Jr., whose  national holiday was yesterday and who would have been 97 years old on  January 15.\n\nMr. Speaker, 1 year ago today was Martin Luther King Day. It was also  Inauguration Day. As I sat in the rotunda watching the President take  the oath of office, I couldn't help but ponder the final question that  Dr. King pondered in the last year of his…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Mr. LICCARDO. Mr. Speaker, let's make corruption criminal again.\n\nThree days before his inauguration, President-elect Trump launched  the Trump meme coin. Trump's partners and some investors based in China  pumped up the price, making hundreds of millions of dollars with…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688301/making-corruption-criminal-again"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…doing that? By treating public office like a personal business  opportunity.\n\nCrypto investments make up $2.9 billion of the Trump family's net  worth. Just days after the inauguration, Trump announced a Trump meme  coin used to funnel money into his and his family's pockets. Now, the  Trump family crypto mining scheme is going public as their payouts…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…means extending  the 2017 Tax Cuts and Jobs Act and preventing American families from  seeing a 22 percent tax hike next year.\n\nAs the President stated last night and in his inauguration address,  the golden age of America is just beginning. I have never been more  thankful to have a President who isn't afraid to keep his promises to  the American people…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Pollutants: Rubber Tire Manufacturing.''\n\nMy resolution will repeal this suspect rule that the Biden  administration pushed out after the election but before President  Trump's inauguration.\n\nThis rule was flawed to begin with. It was published on November 29,  2024, after the election of Mr. Trump but before his administration  could take office.\n\nFurther,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…term union contracts designed to tie President Trump's hands for a  second term.\n\nH.R. 2550 preserves those deals signed after President Trump was  reelected but before Inauguration Day. That undermines the will of the  voters and the authority of the Commander in Chief. It is legislative  sabotage, and we shouldn't give in to that.\n\nThe Civil Service…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…and no more  invasions of privacy, humiliation, and harm for our Nation's incredible  female athletes.\n\nTo be certain, President Trump has delivered on the mandate. On  Inauguration Day, the President issued an Executive order that affirms  the Federal Government's position that there are only two sexes, male  and female.\n\nThis is a position grounded…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…program within the Coastal Plain, the  DOI received zero bids and never truly held a competitive oil and gas  lease sale. As I said at the time, January 20, 2025, and the  inauguration of President Trump could not come soon enough.\n\nPermit terms can undermine the program's economic feasibility in  indirect ways, such as limiting the location of future…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  inauguration of the Sixth President of the University of Mobile, Dr.  Charles Smith, who was unanimously elected to be inaugurated on May 1st  and has taken charge of leading the university.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691962/recognizing-dr-charles-smith"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…energy efficiency requirements on commercial  refrigerators and freezers that were imposed by the Biden-Harris  administration at the 11th hour just before President Trump's  inauguration.\n\nThe Biden-Harris administration, as we all know, in many of these  agenda-driven regulations pushed out of Agencies, was a disaster for  American families, businesses,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…interns.\n\nDuring her tenure, Nicole executed many top-tier engagements,  including meetings for foreign heads of state, national travel, and  managing the 2025 Presidential Inauguration events for approximately  five hundred Iowans who came to visit the Nation's capital.\n\nFurther, Nicole proved pivotal in helping the team work with  stakeholders across…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…alien  who snuck across the border under Biden.\n\nWe have Jocelyn Nungaray, a woman whose mother I have gotten to know,  a woman whose mother I invited to join us at the inauguration of  President Trump a year ago because of her courage for standing up and  calling out the lawlessness of the people who have been released on the  streets of this country…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…the fifth president of the Yeshiva University, he has redefined  the role of faith-based universities in the United States. He gave the  benediction at President Trump's inauguration.\n\nYeshiva University, for more than a century, has been contributing to  the common good and advancing the goals of faith with purpose. It is  one of the flagship universities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…as my Staff Assistant in the summer of 2024,  where she gave phenomenal tours, treated my constituents with kindness,  and navigated the unpredictable 2025 Presidential Inauguration with  grace. After I became Chairman of the House Committee on Energy and  Commerce, I knew I wanted Emily's optimism and readiness to serve on my  new team. She transitioned…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "James Risch", "party": "Republican", "sentence": "…President to terminate the use       of United States Armed Forces for hostilities against any       organization designated on or after February 20, 2025--\n\nHis date of inauguration--       as a foreign terrorist organization or specially designated       global terrorist, any states in which those entities operate,       or any non-state organization…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}]