[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…The HALT Fentanyl Act also imposes  harmful mandatory minimum sentences. Decades of research shows that  mandatory minimum laws that focus solely on supply reduction and  incarceration are not effective in slowing the flow of illicit drugs  into our country or the rates of overdoses in our communities. In fact,  the current fentanyl epidemic has been…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692633/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…history is complicated. Our  country's history is at times uncomfortable to confront. That does not  make it divisive or offensive to preserve and to learn from.\n\nJapanese incarceration during World War II stands as one of those  uncomfortable chapters that Trump and his administration are attempting  to erase. More than 125,000 Japanese Americans, including…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, the bill would subject doctors, nurses, other medical  providers, and even parents to up to 10 years' incarceration in Federal  prison and up to $250,000 in criminal fines for providing gender- affirming healthcare like hormone therapy to minors.\n\nThey want to criminalize more than a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…safety net is preserved. Limiting access to Medicaid       threatens to undermine gains in reducing overdose mortality       rates and could lead to increasing rates of incarceration and       hospitalization.\n\nMy colleague from Delaware knows this. The biggest mental health  institutions in America--the biggest ones--pick your State, from  Illinois…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Vermont values of respect and  acceptance. They have made a point to be inclusive in their hiring,  giving second chances to Vermonters who are exiting homelessness or  incarceration. A sign hanging outside, surrounded by community notices  and posters, proudly reads ``Hate Does Not Grow In the Rocky Soil of  Norwich, Vermont.''\n\nWhen faced with staffing…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…crime'' strategies that have already devastated Black and       Brown communities nationwide while failing to make anyone       safer.\n\nFurther criminalization and incarceration are not the       answer to complex societal challenges rooted in poverty,       inequality, and disinvestment. True public safety comes not       from harsh punishment,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…disorder that might lead them to  reoffend. In 2021, Rhode Island created the Deferred Sentencing Program  to offer a creative treatment and supervision program in place of  incarceration to effectively address offender behavior, rehabilitation,  and the safety of the community. Through both of these programs,  probation officers and staff work with stakeholders…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…amounts of reporting of  a gift of any value from foreign countries and will cast a chilling  effect disproportionately on the Asian-American academic community.\n\nFrom the incarceration of Japanese Americans in World War II to the  racial profiling of Chinese-American scientists under Trump's failed  first term China Initiative, countless Asian Americans…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…establish mandatory minimum sentences for a number of       offenses, and remove the exception for minors. Calendar No.       279.\n\nOPPOSE H.R. 5242/S. 2815, to repeal D.C.'s Incarceration       Reduction Amendment Act of 2016 and the Second Chance       Amendment Act of 2022, introduced by Rep. Kustoff and Sen.       Cornyn. An amendment was added to this…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…bill would       reverse more than 30 years of successful, data-driven       pretrial policy reforms in D.C. and replace it with a wealth       based system that fuels mass incarceration, racial       disparities, and benefits the 2 billion dollar bail industry.\n\nD.C.'s pre-trial system is grounded in individual       assessment, not based on wealth. The…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…workers forced to step back from  care work after a loved one's detention and deportation.\n\nTrump's assault on our communities is not possible without the U.S.  immigration incarceration system. Since Donald Trump took office,  people in detention have skyrocketed to unprecedented levels with over  66,000 people incarcerated in immigration facilities. ICE…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…patients who rely on them for substance abuse treatment  will be left out in the cold. We literally will see an increase in  overdose deaths, law enforcement run-ins, and incarceration rates.  Where do you think these people go when they don't have behavioral  health treatment for fentanyl?\n\nAll this costs taxpayers more, actually, a lot more, a lot more…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…abolition of slavery contained a clause in the 13th Amendment that  still allows slavery to exist as a ``punishment for crime.'' That  loophole to this day has fueled mass incarceration, economic  exploitation, and generational harm, especially for Black Americans.\n\nThat is why I support the abolition amendment, which would strike  this shameful exception…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…unlawful entry and reentry.\n\nMr. Speaker, this makes no sense on multiple levels. If the  administration is seeking to deport ``the worst of the worst,'' why put  them into incarceration facilities? Perhaps this is just another ploy  to give private, for-profit prison companies more money so that they  can build more facilities, make more profit, and, ultimately,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…administration and Noem, the  Secretary of Homeland Security, have abused the power of the Department  of Homeland Security to pursue a campaign of persecution, of mass  incarceration, and of deportation.\n\nDay after day, they have disregarded the authority of Congress, the  laws of the land, and the constitutional rights of residents, the  courts, due…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…community  rallied to raise nearly $175,000 for life-changing programs.\n\nWith weekly classes, some lasting half a year, and special outreach  to men reentering society after incarceration or dealing with drug  addiction, Spokane Fatherhood Initiative is helping dads restore  relationships with their children and strengthen the fabric of our  region.\n\nI express…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…PRESERVATION AND RELEASE OF RECORDS.\n\n(a) The Attorney General shall retain, preserve, and       compile any records or evidence related to any investigation,       prosecution, or incarceration of Jeffrey Epstein.\n\n(b) Not later than 30 days after the date of the enactment       of this Act, the Attorney General shall release and publish       any records or evidence…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693546/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Fleet out not necessarily having the money to get them back. Franklin  Delano Roosevelt pushed the bounds of the Constitution for what he  thought was right, including the incarceration of threats to our  democracy under this very act, and the Court affirmed that.\n\nPresidents have seen reasons to do it. This President has seen an  onslaught, more than…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…this family has gone through since that time.\n\nThere is no reason at all that this should have happened. There is no  reason for the American taxpayer to have to fund the incarceration of  this person or any other programs to help him get back on the streets  of Georgia.\n\nThough my example is the worst outcome possible, illegal aliens  should not be able…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…However, victims of these crimes are sometimes prosecuted for their  actions taken while under the control of their traffickers. This can  lead to the arrest, conviction, and incarceration of actual trafficking  victims themselves without proper consideration of their criminal  culpability.\n\nWe know that criminal convictions, and even nonviolent ones, can…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…immune to  the belief that you can put criminals on the street and not undermine  the American Dream.\n\nThe so-called progressive prosecutor movement advocates for less  incarceration and less policing: decarceration, procriminal policies  that undermine public safety.\n\nOn January 22, 2025, San Antonio Police Department officers responded  to calls at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…and asking our fellow  man, Mr. Speaker, to hear this message: enforce existing laws,  prosecute violent criminals, incarcerate those who are convicted, and  maintain that incarceration until they are reformed or their sentence  is complete.\n\nWe say this not just for ourselves, but for the murdered, for the  lost, for the forgotten, for the unseen victims…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…1925. The act created our Nation's  Federal probation system and, for the first time, authorized Federal  judges to impose a sentence of probation as an alternative to  incarceration. Alternatives to incarceration like probation facilitate  the fair administration of justice, enhance public safety, and  positively impact the lives of individuals who…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688481/probation-act-of-1925"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…issues and need treatment.\n\nThat was a big part of the initiative, is that people who have repeat  arrests for abusing drugs can be offered treatment as an alternative to  incarceration.\n\nThe Governor is refusing to fund the treatment programs that are  needed.  He is all too willing to continue to let people wither away on our  streets and die from overdoses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]