[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…brakes. It phases out solar, wind, battery storage,  and electric vehicle tax credits by 2028. According to the Energy  Information Administration, this bill will gut the very incentives that  are powering 93 percent of new capacity growth. This fossil fuel wish  list will end more than 800,000 clean energy jobs by 2040, which will  wipe out domestic manufacturing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…protections against predatory loans. Nineteen States  and the District of Columbia have enacted 36 percent APR caps or banned  payday loans. Lenders in these States have incentives to offer more  affordable loans that borrowers have an ability to repay. The same  incentives should apply across the Nation.\n\nI thank the 176 consumer advocacy groups, faith-based…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…missile launches; detargeting so that any accidental launch  of a nuclear-armed missile lands in the ocean; removing all nuclear  weapons from high-alert status; reducing incentives to respond quickly  to a possible nuclear attack; reducing the number of deployed nuclear  weapons; and renouncing first use of nuclear weapons and restricting or  eliminating…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…would keep prices down and keep good jobs  up. It had policies and ideas in it like technological neutrality that  created an opportunity for good science to reign and create incentives  for development.\n\nDonald Trump came into office huffing and puffing because he didn't  like that. He didn't like that kind of energy dominance based on  consumer choice…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…mid-level data analyst in       the anti-fraud office, hurried to cut costs when he took over       in mid-February, canceling research contracts, offering       early-retirement incentives and buyouts across the agency,       and consolidating programs and regional offices. Entire       offices, including those handling civil rights and       modernization,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…more  affordable and quality housing. It also provides enhancement of our  coasties' quality of life, such as family leave policies, career  flexibility, tuition assistance incentives, and behavioral healthcare.\n\nEqually important, this bill capitalizes on the extensive work that  former Commandant, Admiral Fagan, did to make institutional changes to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…for people across our country.  Americans are facing the high cost of energy, and it is becoming  unaffordable, but it is not their fault.\n\nAt the same time, many Federal incentives to help lower energy costs  and to create the new energy systems for the future have been rolled  back by the current administration. Actually, I am somewhat surprised  that…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…protections against predatory loans. Nineteen States  and the District of Columbia have enacted 36 percent APR caps or banned  payday loans. Lenders in these States have incentives to offer more  affordable loans that borrowers have an ability to repay. The same  incentives should apply across the Nation.\n\nI thank the 176 consumer advocacy groups, faith-based…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Housing Task  Force, I helped develop a housing action plan with more than 20  recommendations to increase housing supply, reform zoning and  permitting, strengthen Federal incentives, grow the construction  workforce, and improve transparency.\n\nMr. Speaker, housing is the foundation of opportunity. Homeownership  is the primary way in which families build…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…bill. If you add what they are doing by  enforcing uneconomical plants to stay online so consumers pay the cost,  with the big, ugly bill, you are taking away clean energy incentives,  cheaper and cheaper energy, and you are asking consumers to pay the  cost of what utilities are. Everyone is grappling with these arbitrary  Trump tariffs.\n\nThis is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…took office earlier this year, Republicans  have been obsessed with crusading against wind and solar whenever they  can. They passed the big, ugly bill, which slashed tax incentives for  clean energy and made electricity more expensive for everyone. They  have tried to kill every wind or solar project on Federal lands and in  Federal waters, driving…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…should be objective, so should the  funding decisions about it.\n\nMr. Speaker, I urge my colleagues to reject this rescission package.                      IRA Clean Energy Incentives Defense\n\nMs. BONAMICI. Mr. Speaker, in their big, ugly bill, Republicans are  once again trying to rip away clean energy tax credits, one of the most  effective job-creating…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Los Angeles  basin forced cleanup of oil refineries, manufacturing plants, and  consumer products such as paints and solvents. Other local and state  programs offered incentives for replacing old trucks and buses.''\n\nThe result: Some of the most problematic pollutants--smog-      forming nitrogen dioxide and fine particles created by       diesel-engine…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…energy with their so-called Big  Beautiful Bill. So while utility bills go up, people who want to go to  cheaper forms of sustainable energy, such as solar, are told the tax  incentives are no longer there, which is just the opposite of what we  should be doing. Then they went further, eliminating incentives for  wind and solar projects, meaning fewer jobs…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…to lower the costs of childcare by  expanding the number of childcare facilities across the country. We are  pushing for record new investments in affordable housing and incentives  for first-time home buyers.\n\nThat is what the American people are asking for, and that is what  House Democrats are fighting for.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689192/addressing-constituents-most-important-issues"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…around scoring  with sicker. Yay, everyone wins.\n\nWhat would happen with that several hundred billion dollars over a  decade? That is not a cut. It is actually lining up incentives.  Instead, it is just easier to run around and scream stories that they  are going to cut things.\n\nLet's pay people, so I have hospitals and other groups paying people  to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…year in the       budget of the President submitted pursuant to section 1105(a)       of title 31, United States Code, for that fiscal year.\n\n(c) Limitations on Provision of Incentives for Critical       Skills to Senior Executive Service Employees of Department of       Veterans Affairs.--Section 706(d) of title 38, United States       Code, is amended…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…for subsidized  coverage worth more than $10,000 per month--and these people didn't  exist.\n\nOf the 24 fake identities, 1 of them was not allowed to be enrolled.  All the incentives for the insurance companies are: Let's issue the  policy. We don't care if this is a real person or not. What we want is  the premium dollar, and we want the taxpayer to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…American manufacturing and energy leaders that no matter what you do,  you will always operate under the strictest regulatory standard  available. We should instead provide incentives for industries to lower  their emissions and keep alive the option of returning to an area  source once emissions are reduced.\n\nOver the last 20 years, no other country has…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…way, if you come here illegally, I think you ought to have  jail time. As a former prosecutor as the attorney general of Missouri,  I can tell you that people responded to incentives. They knew when we  had a partnership with Federal prosecutors in St. Louis that, if they  were being busted for a Federal crime, they were going to jail. If it  were a State…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…these enrollees are not just       healthy enrollees with no need for care. They are part of a       larger story about how Biden COVID credits are driving       perverse incentives. Insurers and middlemen are responding to       these incentives, and unscrupulous brokers are enrolling       anyone they can. Evidence shows millions of Americans fell…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Since World War II, the annual average has been  a little over 3 percent.\n\nWe picked a conservative number, but we know we will outperform it  with good energy policies, work incentives, deregulation, America First  trade, and locking in low taxes from TCJA.\n\nThat 2.6 annual average, that conservative growth assumption, will  yield $2.5 trillion over the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…benefits to       Mozambique's economy while strengthening graphite security       for the United States.\n\nAlthough the 30D provision was recently eliminated, future       tax incentives of this kind could be powerful tools to       attract mineral investment in AGOA-eligible countries, with       the extracted resources routed to the United States or allied…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…number, that is the individual  Marketplace. That is the ObamaCare exchanges. This is the employer  market--half the cost. Again, taxpayers are paying the premiums. The  incentives are all there to continue to run up the cost.\n\nThis is nothing more than a failed program, partly because it is a  failed structure with no incentives to reduce costs; where…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…6 months. Almost all of these programs are what are  referred to as ``mandatory spending,'' so we can change these programs  and do what we can to get rid of the perverse incentives.\n\nI think some of the burden of these folks will have to be put on  private organizations because it is a problem no doubt if people are  able to get these programs without…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this.\n\nFirst off, in August, Republicans are going to go out and tell the  morality of people's taxes not going up next year. What we did in the  reconciliation budget: incentives to invest in America, to build new  plants of equipment, for working people to have some things to actually  draw them back into the labor force, no tax on tips, no tax on…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…of Washington. These include, but are  not limited to, the opening of the Five Points Community Center, a new  Washington City Hall and police station, implementation of incentives  to attract business investments in Washington, improvement of local  streets and major roads, and an upgrade of the city's sewer system to  accommodate the growth of the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689608/commending-mayor-gary-manier-for-24-years-of-service-to-central-illinois"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…reliable exclusivity framework, these  treatments simply would not exist. Congress intended orphan exclusivity  to serve as ``a marketplace-oriented solution that provide incentives  for private enterprise to develop orphan drugs.'' FDA established  regulations that aimed to protect this critical economic incentive  while also encouraging continued innovation…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can be.  We can actually do remarkable growth, but we have to do very difficult  policies to make it work.\n\nAre we going to do talent-based immigration? Are we going to do  incentives to automate, to modernize, to use technology, or to even use  AI? My fear is we want to take credit for very high growth numbers, as  in GDP grows this, but we are not willing…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Today, it  is over 10 percent. And in my home State of Iowa, it is over 60  percent. Wind development has been an unquestionable success.\n\nMy view has always been that tax incentives intended to spur  fledgling industries shouldn't last longer than necessary. That is why  in 2015 I worked with both the wind and solar industries to phase out  their credits…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}]