[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…for a project that clearly was ultimately going  to be covered by FEMA, the town clerk was getting questions about, what  is the size of the gravel stones in that roadbed 12 inches down? That  makes no sense. And what happens, of course, is it creates an immense  amount of frustration.\n\nA community that goes through a major weather event, in the shock…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…high school football together, and  indeed he was a remarkable gentleman then, both on and off the field.  One of the things we discovered is that--Donny was about 6 feet 2  inches. He was a wide receiver. He would be running down the field,  looking at the goal line with nothing in front of him, catch the ball,  and then he would trip over me. I was…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…But I am not just talking about the worst case scenario.\n\nLet's imagine going back to this picture. The family didn't get their  home completely flooded. The family got 4 inches of water in their  living room. Their carpets are destroyed. If their floor is anything  but concrete, it is destroyed. If you have furniture in there that is  cloth, it is…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…challenges posed by intense  competition in his effort to win the title.\n\nIn pursuing the State Championship, Nathan defeated his opponents  with an impressive jump of 6 feet 9 inches. His hard work and  dedication, both on and off the field, in achieving this accomplishment  is truly outstanding. He has achieved an impressive season, bringing  pride to…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…in strong support of H.R. 261 sponsored by  Congressman Buddy Carter of Georgia.\n\nUndersea cables play a crucial role in the global economy. These  cables are roughly 1 to 2 inches in diameter. Yet they crisscross the  globe and carry approximately 95 percent of global internet traffic,  facilitating trillions of dollars in global financial transactions.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…4.1.8 Handcuffs, Flex Cuffs, or items that can be used as       restraints;\n\n4.1.9 Impact Weapons (batons, blackjack, clubs, maces,       slungshot, etc.);\n\n4.1.10 Knives, 2.5 inches or more, to include sharp tools,       pointed objects or implements such as a switch blade, dagger,       dirk, sword, etc.;\n\n4.1.11 Realistic replicas of explosives, firearms,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…can move safely and reliably in Oak Grove, Missouri.\n\nThese are reasonable Member-directed investments in America, our true  Article I authority.\n\nMr. Speaker, we are just inches away from the finish line. Let's not  slow this down. Let's get over the finish line. Let's deliver now for  what the American people sent us here to do: Donald J. Trump's…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…soldering to the back of the medal. The medal is crafted       from Silver Ag925 with 24k Gold Vermeil, with a weight of       approximately 63 grams. It has a diameter of 2.25 inches. The       Vermeil plating has a thickness of 2.5 microns. The medal       combines national symbols with heraldic elements to represent       the sacrifice of the fallen deputies.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Lakes, but if you had a 26-inch fish,  that is a huge brown trout. I was fortunate enough to be out in Wyoming  looking for rainbow trout, and if you found one that was 15 inches, you  would be flabbergasted. I am proud that Arkansas held the record for  the brown trout for about 25 years.\n\nThis Sustainable Rivers Program is an important program through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…most devastating disasters in our Nation's history.\n\nThis historic storm led to catastrophic loss of life and property to  our neighbors in the west. In just 18 hours, over 30 inches of rain  came down in some areas, which surged downhill into rivers and valleys,  causing close to $80 billion in damage and resulting in over 100  deaths. Entire towns and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…challenges posed by intense competition  in her effort to win the title.\n\nIn pursuing the State Championship, Rania defeated her opponents with  an impressive throw of 153 feet 4 inches. Her hard work and dedication,  both on and off the field, in achieving this accomplishment is truly  outstanding. She has achieved an impressive season, bringing pride to…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693391/special-recognition-of-rania-brown-for-winning-the-division-i-state-track-and-field-title-for-the-discus-throw"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…paper; and\n\n(ii) shall not be made of any organic or inorganic material       that poses a high risk of degrading.\n\n(3) Size.--The Time Capsule shall be not more than 50       inches wide, 32 inches deep, and 48 inches high.\n\n(4) Consultation.--In carrying out this subsection, the       offices described in paragraph (1) may consult with the       Architect…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Reese Patricia Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces and measuring  21 inches long to loving parents Taylor and Kristin Flukey Fritsch, who  serves as a valuable member of my team on the Subcommittee on Health  for the House Committee on Energy and Commerce.…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "French Hill", "party": "Republican", "sentence": "…general.--The Secretary may mint and issue--\n\n``(A) not more than 100,000 $2.50 numismatic coins, each of       which shall weigh 4.1795 grams, have a diameter of 0.425       inches, and contain not less than 90 percent gold\n\n``(B) not more than 300,000 $2.50 numismatic coins, each of       which shall weigh 26.73 grams, have a diameter of 1.5 inches,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…packaging.--The outer packaging of combined       products shall be exempt from the symbol and label notice       requirements of subsection (a).\n\n(B) Packages less than 3 by 3 inches.--In the case of a       covered product in packaging smaller than 3 inches by 3       inches (such as an individually packaged wipe in tear-top       packaging) and sold as…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…during which Ephrata junior Sophia Rivera excelled in shot put and  discus. On the first day, Rivera captured the state title in girls'  shot put with a distance of 43 feet, 3 inches. Her domination continued  into girls' discus the following day, where a throw of 143 feet, 3  inches nabbed the gold medal.\n\nSophia Rivera's two state titles crown a spectacular…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691701/congratulating-sophia-rivera-girls-shot-put-and-discus-state-champion"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…intense  competition in his effort to win the title.\n\nIn pursuing the State Championship, Hunter defeated his opponents  with an impressive personal record throw of 63 feet 1.25 inches. His  hard work and dedication, both on and off the field, in achieving this  accomplishment is truly outstanding. He has achieved an impressive  season, bringing pride to…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693384/special-recognition-of-hunter-spangler-for-winning-the-division-iii-state-track-and-field-title-for-shot-put"}]