[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…and Representatives Clyburn and Hoyer for hosting  this Special Order hour.\n\nMr. Speaker, five years ago, our Nation watched in horror as the  President of the United States incited a violent attack on this Capitol  to overturn an election that he lost.\n\nAt least 140 officers were viciously assaulted and injured, beaten  with flagpoles and fire extinguishers,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Vice President Cheney made these comments was  because, as the President of the United States of America--these are my  words and not Vice President Cheney's--the President incited the  insurrection. There are people using other terminology. I believe it  was an insurrection. It was an insurrection that took place after the  election wherein he was defeated.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…leaders of the Republican  Party described them at the time, who tried to destroy it.\n\nThat is the decision, to cast his lot with the Proud Boys and other  extremists that he incited on that day.\n\nMany of the officers who served on January 6 feel betrayed by the  officials whose lives they saved that day. Take former U.S. Capitol  Police Sergeant Aquilino…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…can be removed from office.\n\nHe talks of having another term. Well, Mr. President, you are not  going to have another term. That is not going to happen. I know that  you have incited persons to come to the Capitol, the citadel of  democracy, and engage in an insurrection. I don't know what you have up  your sleeve, but I do know that we will prevent you…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…people who participated in the government would come to identify with  their branch of government. That is why I thought, well, when they  stormed the Capitol  and Donald Trump incited a violent insurrection against us, we would,  in bipartisan unison, denounce it and vote to impeach and convict.\n\nTen Republicans did join all the Democrats in doing that.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…(2), (3), (6)(E),       (6)(G), (8), (10)(A), (10)(C), or (10)(D) of section 212(a)       of the Immigration and Nationality Act (8 U.S.C. 1182(a));\n\n(ii) has not ordered, incited, assisted, or otherwise       participated in the persecution of any person on account of       race, religion, nationality, membership in a particular       social group,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the  January 6 attack was ``the insurrection that never was'' and was  encouraged by ``deep state'' agitators as a pretext to persecute Trump  supporters.\n\nWell, we know who incited the January 6 insurrection. It is on tape.  It can be seen. In a speech outside the White House on January 6,  Donald J. Trump claimed to a crowd of thousands of Trump supporters…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…County, the chief of  police in L.A., all of whom fought to put that violence down when riots  broke out, something Donald Trump never did when the riots broke out  that he incited against us.\n\nRemember, he was impeached by this body for inciting a violent  insurrection against us. Not only did he not do anything to defend us,  but he was the one who…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, 5 years ago, Donald Trump incited a  vicious MAGA mob to storm the U.S. Capitol with one goal: to overturn  the results of the 2020 Presidential election.\n\nFortunately, Trump and his gang of violent extremists…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…place, under  whatever guise, under any ideological auspice at all. I denounce mob  violence.\n\nI challenge my friend from North Carolina to find me one Democratic  official who incited violent insurrection or incited mob violence on  that day because I will tell you, this Chamber voted to impeach that  President who incited mob violence against us in a sweeping…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…harvesting has been committed for years on a massive scale with  Falun Gong practitioners as the main source.\n\nThe report states that the CCP and its leaders have actively incited  the persecution, imprisonment, murder, torture, and humiliation of  these individuals solely to eradicate their beliefs. This is not just a  violation of human rights; it…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Ukraine but as a war between Russia and the West.\n\nIn this same speech, he says the West is primarily at fault for the  conflict in the world today and that it was the West that incited a  Ukrainian coup in 2014 and further unrest in Eastern Ukraine in 2022,  which necessitated Russian military action to liberate the people of  Crimea and Eastern Ukraine.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]