[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican side of the aisle, this report obviously does absolutely  nothing to address the prices of power and electricity that continues  to go up.\n\nMr. Speaker, I include in the Record a document from the Joint  Economic Committee, as well as a link to the document located at:  https://www.jec.senate.gov/public/_cache/files/22e24fd6-4db7-44c6-93a9-…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Authority volunteers, who play an integral role in the agency's  success.\n\nIt is my honor to congratulate all the recipients of the Elly Doyle  Park Service Awards and to include in the Record the names of the  following individuals:\n\nElly Doyle Special Recognition: Cynthia Glakas, Paul Gross,       Brian Keith, and Christina Tyler Wenks.\n\nElly Doyle Park…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, the House of Representatives debated  the Common-Sense Law Enforcement and Accountability Now in DC Act of  2025 (H.R. 5107). I include in the Record a letter opposing this bill  led by the DC Justice Lab.      Letter of opposition      RE H.R. 5107 and any related attempts to repeal or weaken the           District…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…tax cuts  primarily to the wealthy, but, meanwhile, it cut healthcare, Medicaid,  SNAP benefits, and ran up trillions of dollars in additional debt.\n\nMr. Speaker, I include in the Record a letter from over 50  organizations representing civil rights, labor organizations, youth  advocates, women's rights, reproductive rights, and others.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Luncheon serves as an  opportunity to recognize our youth and members of the community for  their contributions to the chapter and the community over the past  year.\n\nI include in the Record the following OKK awards recipients:\n\nTrailblazer Award: Lieutenant General (Retired) R. Scott       Dingle, U.S. Army\n\nTrailblazer Award: The Honorable Robert R. Rigsby,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…then we are likely to  lose a third or more of these 150 Members of Congress.\n\nLet's talk about Texas for just a moment. In Texas, we have evidence  and, Mr. Speaker, I include in the Record this letter from the  Department of Justice.                                         U.S. Department of Justice,                                           Civil Rights…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "Mr. LARSON of Connecticut. Mr. Speaker, it is my honor to include in  the Record the Eulogy of Dorothy Christiana, delivered at her funeral  by her grandson, Sam Iacobellis. Her granddaughter Nina Bloom provided  the prayers of her passing and was…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I include in the Record the  following Proclamation commending the Mu Mu Lamda Chapter of Alpha Phi  Alpha Fraternity, Inc. on its 50th Anniversary.\n\nWhereas, Alpha Phi Alpha Fraternity, Inc.,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I include in the Record the  following:   opening remarks from civil rights forum on trump's attacks on students,                           workers, and families\n\nWe have seen this Administration…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise to recognize and include in the  Record, three prominent community members in the Nepali American  community who have contributed to cultivating arts, culture, and  business around the country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Congressional Field Hearing in my district on Haitian TPS Termination.  Senator Markey and Representative Moulton also participated along with  community stakeholders. I include in the Record my opening remarks:\n\nThank you to Jubilee--we are so appreciative of their       partnership in providing this space for us today. I want to       also thank tech.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…do not like how the Members of Congress vote on  local D.C. matters, residents cannot vote them out of office. That is  the antithesis of democracy.\n\nMr. Speaker, I include in the Record letters opposing this bill from  the D.C. Mayor, the entire D.C. Council, and the D.C. Attorney General,  all of whom were elected by D.C. residents.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…for this resolution, and it  is a whopper. The CBO estimates that this resolution would cost  American taxpayers $7.2 billion over the next 10 years.\n\nMr. Speaker, I include in the Record an email from CBO regarding  this.\n\nH.J. Res. 35 would disapprove a final rule published by the       Environmental Protection Agency in November 2024 that       implemented…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Association of Genocide Scholars, hundreds of the world's leading  experts on genocide, has determined that the Israeli Government is  committing genocide.\n\nMr. Speaker, I include in the Record a link to the International  Association of Genocide Scholars Resolution on Gaza. https:// genocidescholars.org/wp-content/uploads/2025/08/IAGS-Resolution-on- Gaza-FINAL.pdf.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…mark  80 years since the Trinity test, we must confront the urgent need to  reverse course before miscalculation or escalation leads to  irreversible catastrophe. I include in the Record the following  article, 80 Years After Trinity, the Dangers of Nuclear War Have Never  Been Higher by Norman Solomon:\n\nThe dangers of nuclear war have never been higher,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…group of 9  organizations--there are now 10; another has joined--that support and  called for passage of this bill. These are great human rights  organizations, and I include in the Record a May 4, 2025, letter from  them.                                                       May 4, 2025.      Re Vote in favor of the Stop Forced Organ Harvesting Act of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…life by putting hardworking families  first, ensuring that they keep their hard-earned money in their pockets  for their necessary uses.\n\nMr. WALBERG. Mr. Speaker, I include in the Record a list of  significant pro-family, pro-life medical community members, family  research members, and students in support of the Pregnant Students'  Rights Act.  Organizations…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(Mrs. Wagner)  will empower our small businesses to focus on growth, hiring, and  innovation, rather than unnecessary red tape.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate on this bill.    H.R. 3382, SMALL ENTITY UPDATE ACT, AS REPORTED BY THE HOUSE COMMITTEE                   ON FINANCIAL SERVICES ON JUNE 3, 2025 ------------------------------------------------------------------------…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Michigan's environment than the  people of Michigan. This amendment gives them that authority back, and  so I would ask her to reconsider her opposition.\n\nMr. Chair, I include in the Record two letters: One from the Florida  Department of Environmental Protection in support of the Bean amendment  and, also, a letter from the National Association of Home…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the proper Federal oversight. Let's create a competitive digital  ecosystem. I support this bill, and I urge my colleagues to.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate for this bill.\n\nESTIMATED BUDGETARY EFFECTS OF H.R. 3633, THE CLARITY ACT OF 2025, AS POSTED ON THE WEBSITE OF THE HOUSE COMMITTEE ON RULES ON JULY…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "Mrs. MILLER of Illinois. Mr. Speaker, I include in the Record the  declaration below on behalf of Moms for America.\n\nAs the mothers, chief architects of the homes of America,       and molders of the future of our nation, we declare…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…program, established in 1979, is a great way to motivate young  people to develop the building blocks of good citizenship.\n\nI congratulate each of the awards' winners.\n\nI include in the Record a list of this year's Congressional Award  Gold Medalists from around the country, including three recipients from  the great state of Wisconsin.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…attacked Hezbollah  positions in Lebanon. Fighter jets targeted military sites in the  eastern Bekaa Valley, which the Iran-backed militia used for training  purposes.''\n\nI include in the Record this Yahoo News report.\n\nIsraeli Military Attacks Hezbollah Sites in Eastern Lebanon                               July 15, 2025\n\nThe Israeli military on Tuesday said…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Mr. EDWARDS. Mr. Speaker, I include in the Record the following  newsletter to give an update to my constituents on the reconciliation  bill and restoring law and order.\n\nDear Friend,\n\nAs a member of the House Budget…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…legislation. They include labor unions like the  North America's Building Trades Unions and the Laborers' International  Union of North America, LIUNA.\n\nMr. Speaker, I include in the Record a statement in support from  Albert Gore, executive director of Zero Emission Transportation  Association, representing the views of the domestic electric vehicle…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…for my colleagues that my office sought and received  technical assistance on this amendment from the Office of the Secretary  of Defense Comptroller.\n\nMr. Chairman, I include in the Record a press release from the  Department of Justice describing this fraud in greater detail.   [From US Attorney's Office, Western District of Texas, July 23, 2024]   Former…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Article I. This bill says that you can't issue a CBDC  without that specific explicit authority and direction from the  Congress.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the  Congressional Budget Office estimate for this bill.\n\nH.R. 1919, ANTI-CBDC SURVEILLANCE STATE ACT, AS REPORTED BY THE HOUSE              COMMITTEE ON FINANCIAL…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…fallen short of living up to the promises that were  made when Alaska became a State. We talked about Native Americans and  their input in the process.\n\nMr. Speaker, I include in the Record this letter from Doyon Limited.                                                 Doyon, Limited,                                       Fairbanks, AK, July 21, 2025.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…sacrifice while serving their communities.\n\nMr. Speaker, I urge my colleagues to support the bill, and I reserve  the balance of my time.\n\nMr. JORDAN. Mr. Speaker, I include in the Record an estimate from the  Congressional Budget Office for this bill.\n\nH.R. 3497, MEDAL OF SACRIFICE ACT OF 2025, AS ORDERED REPORTED BY THE           HOUSE COMMITTEE ON…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, I want to point out that the CRAs do have Tribal  consultation. If there wasn't Tribal consultation, it was during the  development of the RMP.\n\nMr. Speaker, I include in the Record a letter from the Navajo  Transitional Energy Company in support of the CRA repealing the Miles  City RMP amendment.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]