[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans as bargaining  chips for billionaire tax breaks.\n\nMedicaid provides health insurance for 1 out of every 4 people in my  State of Illinois--3.4 million people, including 1.5 million children.  Medicaid pays to deliver half of all the babies in my State--half of  them. Two-thirds of the seniors in nursing homes depend on Medicaid. If  Medicaid is…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Republicans also seek to cut $230  billion in nutritional programs like SNAP and food stamps. That is  right. Food stamps are being cut that currently aid 10 million Latinos,  including 5 million kids. These nutritional programs are essential to  their health and growth. So we are here pushing back on the cuts to  food stamps.\n\nIn my district, Mr. Speaker, there…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Baines Johnson signed the Social Security  Amendments of 1965, establishing Medicare and Medicaid--cornerstones of  American healthcare. These programs provide millions, including 1.5  million people in Connecticut, with access to comprehensive and  affordable healthcare.\n\nNothing is more important than our health. As the saying goes, if you  don't have your…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…From their factory in North Kingstown, they produced over  88 million pounds of Plumpy'Nut each year.\n\nThis work saved more than 25 million lives across 65 countries,  including 5 million lives last year.\n\nEdesia and another organization, MANA, based in Georgia, have been  doing lifesaving work, but this work has been largely halted because  the Trump…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…anniversary of the martyrdom of Guru Tegh Bahadur, the  revered Ninth Guru of Sikhism--the world's fifth-largest religion, with  nearly 30 million followers worldwide, including one million here in  the United States.\n\nA champion of religious freedom for all, Guru Tegh Bahadur  courageously confronted the Mughal Emperor Aurangzeb's campaign of  religious…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…our seniors when they are in assisted living with their long-term  care, and people's parents and grandparents--as well as coverage under  the Affordable Care Act, including over 2 million Minnesotans. In fact,  Medicaid actually provides healthcare for 20 percent of my rural  residents in my State. You will see similar numbers all across the  country.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…effects of these  attacks firsthand. Over $715 million in National Science Foundation  grants have been terminated in New York's 20th Congressional District  alone, including a $1 million award to the University at Albany's  Project SAGES.\n\nProject SAGES was created to confront one of the deepest, most  persistent inequities in science, and that is the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…State will feel the impact of this $1.1 billion rescission. In  fact, 70 percent of these cuts will directly impact local public media  stations, $770 million, including more than $4 million to my State  alone.\n\nIn rural states like Maine, local stations and networks like Maine  Public are often the most accessible and sometimes the only source of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692523/rescissions-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…that fosters a  robust and welcoming commercial corridor.\n\nMr. Renz's tenure is marked by numerous accomplishments. He  spearheaded major urban improvement projects, including a $2.4 million  streetscape enhancement for Myrtle Avenue and played a pivotal role in  helping secure a $55 million upgrade of the Myrtle-Wyckoff transit hub,  enhancing accessibility…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…``If I don't get this, I am going to vote no''; now  we have a law. We have public law, Federal law.\n\nThe first thing that is going to happen is 17 million Americans,  including 9 million people on Medicaid, will lose healthcare coverage  in about 18 months' time. To keep their coverage, people will have to  complete hours and hours of paperwork just…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…paid for by working people, including millions of our veterans. The  Republican rip-off cuts at least $880 billion from Medicaid, the  program that 80 million Americans, including 9 million veterans, rely  on for health insurance coverage.\n\nThis extreme budget also cuts $230 billion from SNAP. Every year,  SNAP helps almost 43 million Americans, including…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to use current law and current authority to secure the  border and stop the flow. He is currently using current law, current  authority, to remove illegal aliens, including the 1.5 million people  here under an order of removal.\n\nI want to remind everybody of that. We just blow past that little  detail. There are 1.5 million people running around this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Pilots Association has fostered public understanding and  appreciation of Great Lakes shipping and its importance to our region's  heritage.\n\nTheir recent investments--including $1 million in new docks and a  seawall--as well as $3.5 million in new pilot boats, demonstrate a  strong commitment to strengthening infrastructure, enhancing  operational capacity,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…Washington status quo in November, demanding an end to unelected  bureaucrats misusing taxpayer resources.\n\nPresident Trump's rescissions package cuts $9.4 billion, including $3  million for Iraqi ``Sesame Street'', $6 million for net-zero cities in  Mexico, and $1 million for voter ID in Haiti, not here in the United  States.\n\nWe are only scratching…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692520/rescissions-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, today, I rise to recognize Black April and 50  years since the Fall of Saigon.\n\nOver 8.7 million Americans served during the Vietnam war, including  2.7 million who put boots on the ground.\n\nWe will always remember the 58,281 U.S. servicemembers who gave  everything for freedom, and we rally with our Gold Star families and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690417/recognizing-black-april"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…accounts, giving them a financial  stake in our country's future.\n\nWe bring back American jobs and our manufacturing base by protecting  or creating more than 7 million jobs, including 1 million new small  business jobs each year.\n\nWe rein in Washington by delivering the largest cut in mandatory  spending in U.S. history.\n\nThe One Big Beautiful Bill Act is for…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…support this bill to codify the  DOGE cuts.\n\nThe American people know waste, fraud, and abuse when they see it.  They want us to eliminate Democrats' radical agenda, including $5.1  million for global LGBTQ movements, $3 million for circumcisions in  Zambia, and $833,000 for transgender surgeries in Nepal.\n\nThis package also ensures tax dollars aren't…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…going to be modest with the support that this act enjoys from  colleagues on both sides of the aisle.\n\nI am someone who has built a business from the ground up, including  several million square feet of space. It is a reality that to construct  space is one thing; the carry cost of maintaining it is quite another.\n\nThere is general recognition increasingly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695380/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…illuminated the billions of dollars being drained on pointless projects  that do nothing to help the American people.\n\nFor example, DOGE has exposed million-dollar contracts, including $3  million to support ``Sesame Street'' in Iraq and $6 million for net- zero cities in Mexico. Funding for USAID programs is also frequently  going to NGOs that work to promote…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}]