[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…situated to address police reform       policies in their own community and deserve to determine       these policies without congressional interference. The CPJRAA       includes commonsense reforms to increase police       accountability and government transparency, and it directly       responds to the calls from District communities for       additional…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to the executive to levy these taxes on middle-class Americans who  can't afford it?\n\nI will say why Republicans are still showing up. As Mr. McGovern  said, this rule also includes the next step in a budget plan that would  cut taxes for billionaires at the same time that it cuts healthcare for  working people. The math doesn't lie. This budget plan…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…the ranks of detective, sergeant, lieutenant, and  eventually earned the top job as chief, where he served for over 3  years.\n\nChief Colucci was a mentor to many. His legacy includes training a  good chunk of the current force, including the new chief, Marc Myers.\n\nI had a chance to work directly with Chief Colucci last year in an  effort to upgrade a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…been partners       for designing a State Health and Human Services system that       meets the needs of our great State.\n\nJust to emphasize what you already know, Medicaid includes       services and care for the seniors and those with       disabilities, not just healthcare for the poor. Additionally,       nearly 50 percent of all Medicaid enrollees…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…receipt,  which is behind me. He kept it in there because it was a sacred right.\n\nI swore to uphold, protect, and defend the Constitution of the United  States, all of it. That includes the 24th Amendment, which banned poll  taxes.\n\nYet, the SAVE America Act is a modern-day poll tax because every ID  that you would have to use to register and to vote, with…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699947/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…State of Michigan ranked as top- tier universities. They are what we call R1 research universities. We  also have R2 universities. They all rank in that top nine.\n\nThis also includes Oakland University, which is located in my  district and where my parents met, and it is part of my origin story.  They have a very robust engineering department that relies…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…State.\n\nThis designation unlocked a flood of new rehabilitation and expansion  projects that have transformed the Great Falls into a hub for tourism  and recreation.\n\nThis includes the expansion of the park's boundaries to encompass the  historic Hinchliffe Stadium. The Great Falls is the crown jewel of our  great city. After Niagara Falls, by volume,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691127/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…as the  total-package approach.\n\nThis refers to the fact that the United States, via FMS sales,  provides not only the military hardware itself, but a total package  that includes training, repairs, and maintenance support, as well as  capacity building for that nation's military.\n\nOur adversaries, quite simply, do not and often cannot provide both…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694810/made-in-america-defense-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…saw his face on propaganda videos released by  El Salvador.\n\nOver 200 migrants were sent to El Salvador's notorious, high-security  prison known as CECOT. By the way, that includes eight women whom the  Trump administration mistakenly flew to the all-male prison, only to  have to fly them back. But hundreds of men have been sent to prison  with no trial…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the  administration has been trying to get away with.\n\nAs a result, we are losing talented and highly skilled workers at  rates we can't afford. For Naval Base Kitsap, which includes Submarine  Base Bangor and the Puget Sound Naval Shipyard and Intermediate  Maintenance Facility, that is a national security issue.\n\nI am a proud former union member and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697989/protect-americas-workforce-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…programs as part of their reconciliation bill.\n\nLast month, House Republicans jammed through their multitrillion- dollar tax scam by a one-vote margin. As a reminder, this bill includes  the largest ever cut to food assistance and will strip healthcare from  16 million Americans, all while adding $3.3 trillion to the debt.\n\nMr. Speaker, some Republicans didn't…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…funding through the Department of  Education is to open doors of opportunity to higher education for  students who choose to attend college but can't afford the cost. This  includes Pell grants, Federal work-study, and low-interest loans to  those who qualify.\n\nI would not be where I am today without the Federal aid I got to  first attend community college,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Federal funding.\n\nThat is why it is important that we recognize the role that NSF- funded basic research plays in the discoveries driving the next  generation of science.\n\nThis includes funding for AI, for cybersecurity, for supercomputers,  fusion energy, space, ocean exploration, black holes, semiconductors,  and, last but not least, the internet.\n\nIn addition…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…afford to have a safe roof over their heads.\n\nMedicaid also supports more than 43,000 elderly or disabled adults  who receive long-term care at home in our community. That includes  people like Tammy in Monona, WI, whose father Bud battled dementia at  the end of his life. Medicaid allowed Tammy's dad to stay in his home  for the last 5 years of his…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…World Liberty Financial announced the firm will be making a  $2 billion business deal with a fund backed by Abu Dhabi, using the  Trump firm's stablecoins. This deal also includes Binance, the world's  largest crypto exchange.\n\nRecently, Binance's founder has been seeking a pardon from the Trump  administration after he pleaded guilty to money laundering…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "French Hill", "party": "Republican", "sentence": "…rugged terrain, and the most  treasured views in the Ouachita region are in Flatside Wilderness. For  those visitors that Congressman Westerman referenced, the area also  includes the challenging and very popular Ouachita National Recreation  Trail, which bisects Flatside Wilderness.\n\nBack in 1984, under the leadership of former Arkansas Senator Dale…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Huizenga's leadership, investors can now  access important disclosure forms electronically for the first time  instead of only on paper through the mail.\n\nThe INVEST Act also includes my bill, H.R. 3645, the ACCESS Act,  which passed the Financial Services Committee earlier this year 51-0.  Right now, if a small business uses crowdfunding--which is raising…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697823/increasing-investor-opportunities-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…opted out of in the D.C. Income and Franchise Tax Conformity and  Revision Temporary Amendment Act of 2025. Seven of them are targeted at  tax breaks for individuals. This includes service workers relying on  tips as part of their wages, workers relying on overtime, senior  citizens relying on Social Security, and even residents just trying to  write…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…all of the outdoor program committees such as camping,  target sports and climbing. Jay is responsible for reestablishing the  resident camp program for the council which includes driving out to  camp on Christmas Day with his family to prepare for winter camp. Jay  is a steadfast proponent for getting youth outdoors. He was part of the  council COVID…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…funds are not available to schools that collaborate  with, receive funding from, or otherwise engage in agreements with the  Government of the People's Republic of China. This includes  partnerships with Confucius classrooms, language programs funded by the  CCP, and instructional materials or personnel tied to the Chinese  Government.\n\nAmerican education…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…operations and expansion of its services at no  cost to participating families.\n\nProviding the excellent service the CDC is known for takes a team of  talented people. This team includes the CDC's senior leadership, board  of directors, foundation board, and dedicated employees. The Child  Development Center's Senior Leadership team includes: Alisha Rone,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…the Air Force in March 2000 as a security  forces member and has been serving for 25 years.\n\nDuring his time in the Air Force, he developed an impressive  background, which includes experience at varying levels in the Security  Forces. He has participated in operations in Africa, Europe, the Middle  East, South Asia, and the Pacific region. He is now…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…thing of those who  benefit from that generosity.\n\nOur bill requires able-bodied adults without kids too young for  school to work or volunteer at least 20 hours a week. This includes  volunteering at a food pantry, a local church, or giving back to their  community.\n\nIt is disheartening that so many of my Democratic colleagues would  prefer to lie about…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "John Thune", "party": "Republican", "sentence": "…that help State-inspected plants operate across State lines, which  provides producers with more options for their products and supports  smaller processors.\n\nThe bill also includes funding for the Agricultural Marketing Service  to help facilitate greater access to international markets for American  agriculture products. And the updated market data…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…residential neighborhoods with bombs. Every statement Mr. Putin makes  should be viewed through that lens.\n\nPresident Trump is right. Too many people are dying, and that  includes the Russian people who are also suffering.\n\nThe Russian people do not deserve to live under a vicious, larcenous,  trillionaire president-for-life like Vladimir Putin. So…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…to go down to El Salvador and defend. I think that  she was very factual in everything she said, especially her criticism.\n\nMr. Speaker, President Trump's electoral mandate includes his promise  to the American people that Republicans would resolve the criminal  illegal alien crisis across our Nation.\n\nThis bill is a necessary step in ensuring our Nation's…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…quick at the worst of the  worst from 2025 generally, not just yesterday.\n\nIn Louisiana, we have a sexual predator, an illegal alien from  Honduras, whose criminal history includes active warrants for 394  counts of pornography involving juveniles and two counts of sexual  abuse of an animal.\n\nIn Kansas, a violent criminal illegal alien from Mexico was…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…of America Act of                                   2025, as amended. H.R. 2159......................  Count the Crimes    Increase by Less    None.............  Includes                                   to Cut Act, as      Than $500K.                            insignificant costs                                   amended.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…describes the impacts of the activities carried out       using the amounts provided under this section on improving       the production and supply of affordable housing;\n\n(2) includes a list of any pattern books the eligible       entity has established using amounts provided under this       section, including a description of the designs such pattern…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…this bill refocuses the  Cybersecurity and Infrastructure Agency, or CISA, on its core  cybersecurity mission and rightsizes the agency to preserve critical  functions. This includes funding to counter threats from adversarial  nations and ensure critical infrastructure systems are protected from  these threats.\n\nMr. Speaker, this Homeland Security bill…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}]