[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…creemees,  pizza, and wine tastings, all to benefit local nonprofits.\n\nThe store prides itself on the Vermont values of respect and  acceptance. They have made a point to be inclusive in their hiring,  giving second chances to Vermonters who are exiting homelessness or  incarceration. A sign hanging outside, surrounded by community notices  and posters,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…to every role she  undertakes.\n\nRose is known for her unwavering commitment to uplifting her  constituents, addressing systemic disparities, and building a stronger,  more inclusive Rochester. She embodies the very essence of public  service, leading with empathy and an unshakable belief in the power of  community.\n\nLong before she held public office,…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…majority of Americans.\n\nMr. Speaker, with respect to the Miles City Resource Management Plan  update, it is just important contextually to say that it was a very  extensive and inclusive public comment period. BLM provided a 90-day  public comment period, two public meetings, a 30-day public comment  period, and a 60-day review period for the Governor. BLM…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…opportunity. Over the  past decade, Milford has become a model for what small town  revitalization should look like, driven by public-private collaboration  and a clear focus on inclusive growth.\n\nMilford's motto: Art Town, River Town, Home Town, is more than a  slogan. It is a reflection of a community that is rooted in creativity  and care for one another.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…and longstanding commitment to  community transformation. Together, they have grown The Oceanside  Sanctuary into a thriving, historic congregation that serves as a hub  for inclusive, justice-centered ministry in North County San Diego.\n\nTheir work extends far beyond the church walls through ecumenical and  interfaith collaboration, nonprofit leadership,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699856/recognizing-reverend-jason-coker-and-reverend-jenell-coker-as-my-december-2025-co-constituents-of-the-month"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…protests to  townhalls across our Nation. Our communities are organizing, Mr.  Speaker, not only to fight back against these harmful policies but to  build a better and more inclusive future.\n\nNow is not the time to give in to cynicism. We must stay engaged and  speak truth to power and come together in solidarity to fight for a  country that our communities…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690549/dte-rate-increase"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…will not have the healthcare they need and the       programs to attend.\n\nMaggie:\n\nMy 28-year-old son Will has Down's syndrome. He currently       lives a full and active, inclusive life.\n\nHis life is full. His life is active.\n\nHe is in the community where he is cherished.\n\nHe lives in the community. He is cherished.\n\nHe has wonderful support staff and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…children, some of whom have pursued environmental  research. Her impact goes beyond the classroom and the lab, shaping a  future for science that is more innovative and more inclusive and  representative of the communities it serves.\n\nDr. Brown's professional experience highlights her exceptional  expertise. She worked as an Environmental Protection Specialist…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694732/recognizing-the-exceptional-environmental-research-of-dr-shamira-brown"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…on federal advertising  contracts with SDBs and businesses owned by women and minorities is  essential to bridging the gap between what current statistics show and  a more inclusive advertising landscape. This bill would help achieve  this goal while also promoting transparency and encouraging federal  agencies to strive to reach minorities, who often…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…perspectives, they  didn't become less competitive. They gained access to broader markets  and built the strongest economy in the world.\n\nWhen our universities created more inclusive learning environments,  they didn't sacrifice excellence. Instead, they became global leaders  in research and education.\n\nThe world is always watching us to see what we…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…that is  Leviticus 19:33-34.\n\nIn a time of rising nationalism, expansion of imperialism, and fear,  may the example of Sister Cabrini guide us back to fierce,  compassionate, inclusive love.\n\nMay her memory inspire us to build a nation where everyone feels a  deep sense of belonging, where every person's humanity is honored, and  where we truly love our…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…full and complete healthcare plan.''  Nothing happened.\n\nJuly 2020, the President said: ``Well, we are going to be doing a  healthcare plan. We are going to be doing a very inclusive healthcare  plan. I will be signing it sometime very soon. It might be--it might be  Sunday, but it is going to be very soon.'' Nothing happened.\n\nAugust 3, 2020, the President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…signal that LGBTQI+ people  belong. Displaying Pride flags is a way for servicemembers and DOD  civilian employees to show that they are committed to creating and  affirming an inclusive environment for LGBTQI+ people or a way to  celebrate their own identity. It does not indicate to exclude anybody  else for what they may believe in.\n\nAt a time when the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…don't like this plan. The Trump administration is  doing just that already: pursuing updates to the land management plans  that we have been debating here using the standard, inclusive  mechanisms that allow for public input.\n\nInterior Secretary Burgum withdrew conservation protections for the  NPR-A in July. Just last week, the Interior Department finalized…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…began in 1975 as a grassroots response to the lack of community- based housing for people with disabilities has grown into one of the  region's most respected providers of inclusive services. In its  earliest days, CRi, then Arlington Community Residences, challenged  outdated models of institutionalization by creating homes where  individuals could…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696045/9999"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…civic  leaders. In 2016, he made history as the first African American elected  Chairman of the City of Opelika Board of Zoning Adjustments, breaking  barriers and fostering inclusive representation for the citizens of  Opelika.\n\nOn February 17, 1970, Mr. Payne was drafted into the United States  Army at the age of 19, serving with valor in the Vietnam…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…their needs are  represented and addressed with compassion and integrity. Her  collaborative spirit and willingness to work alongside general  education colleagues fosters an inclusive and equitable learning  environment.\n\nMrs. Prakash's creativity, professionalism, and genuine devotion to  her students make her a role model for other educators. It is a…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…tireless work ethic, meticulous attention to detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in fostering an inclusive and welcoming environment  for all members, especially in her contributions to the Chamber's 60th  Anniversary Celebration.\n\nOutside of the Chamber, Susan is an Assistant…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of her career to educating the  students in her community.\n\nBeginning her career as a fifth grade teacher in 2000, Dr. Sandfort  later earned her doctorate with a focus on inclusive education for  students with autism. Her research has shaped teaching practices both  in her classroom and across the district. Dr. Sandfort has spent the  last 10 years…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Transparency In Charges for       Key Events Ticketing Act'' or the ``TICKET Act''.       SEC. 2. ALL INCLUSIVE TICKET PRICE DISCLOSURE.\n\nBeginning 180 days after the date of the enactment of this       Act, it shall be unlawful for a ticket issuer, secondary       market ticket issuer,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Georgia to continue working on addressing       the reform plan outlined by the European Commission to resume       Georgia's recently granted candidate status through an       inclusive and transparent consultation process that involves       opposition parties and civil society organizations, which the       people of Georgia have freely elected to pursue;…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize an  extraordinary constituent from my district, Elizabeth Kennerley. As a  rare disease patient, advocate, and unwavering supporter of inclusive  healthcare, Liz has devoted her life to making a meaningful impact on  her community and those affected by rare diseases. She continues to  inspire those around her, with…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688709/recognizing-elizabeth-kennerleys-tireless-rare-disease-advocacy"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…community through  recreational, educational, cultural, and social programs rooted in  Jewish values. For 80 years, the JCC has fulfilled this mission by  offering a wide array of inclusive services and programs open to people  of all faiths and backgrounds. From preschool classrooms to Camp  Centerland, from heated pools to the renowned Jewish Repertory Theatre,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…I have  remaining.\n\nMr. MILLS. Mr. Chair, the only thing that was just said by our  colleague across the road that I can actually agree with is  inclusivity. What is more inclusive than the American flag, the flag we  all honor as American patriots? The one thing that we know about the  Pride flag is that it represents only one portion of those who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…in three Arizona school districts,  providing specially designed instruction in her classroom while also  supporting students' needs in general education.\n\nShe emphasizes inclusive, strengths-based instruction tailored to a  variety of learning styles. Before this honor, Tiffani was named the  school's Teacher of the Year and has also been a finalist…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in education whose  dedication makes a profound impact on their schools and their  communities.\n\nMarlon's hard work and commitment to maintaining a clean, welcoming,  and inclusive environment have helped create a space where students and  staff can thrive.\n\nThis achievement reflects the collective teamwork at Mary Lee Clark  Elementary where everyone…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…decades. Kimberly also works with preservice teachers and as a  mentor for new classroom teachers. She holds a BS in Special Education  (College of Saint Rose) and a MS in Inclusive Education (Nazareth  College). Kimberly is certified in Elementary Education, Exceptional  Student Education (K-12), and is endorsed in Gifted, ESOL, Reading, and  Autism…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699161/recognizing-ms-kimberly-day-scanlon-okaloosa-county-schools-2027-teacher-of-the-year"}]