[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…capacity in their countries that might be needed to  avert supply chain disruptions. Finally, the bill requires ongoing  reporting to inform Congress and the public, including a national  strategy and review on critical supply chain resiliency and U.S.  manufacturing.\n\nMs. CANTWELL. Thank you, Senator Wyden, I agree with you and will  work with you and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…regulations that protected America's health the oil companies had  complained about. Even after the administration opened millions of  acres in the sensitive lands, including the National Petroleum Reserve  in Alaska, and millions of offshore acres, even when coastal residents  are screaming they don't want these oil rigs off their coast.\n\nSo it isn't…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…recognize that it hasn't just been Democrats that  have been driving this.\n\nAs President, former California Senator Richard Nixon signed into law  landmark legislation, including the National Environmental Policy Act,  the Clean Air Act of 1970, the Endangered Species Act, and the creation  of the EPA.\n\nYes, folks watching at home, Republicans did that.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…pay for  the space that we occupy here on this earth.'' Judy paid her rent and  paid it well, dedicating her time and resources to numerous community  organizations, including the National Infantry Museum, the Muscogee  Educational Excellence Foundation, Open Door Community Center, St. Luke  Church Administrative Board, Girls in the Game, Chattahoochee…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Month, I would be remiss if I  did not address the elephant in the room. No, it is not my Republican  colleagues. It is the attack on diversity, equity, and inclusion.  Including a National Women's History Museum on The National Mall in  Washington would ensure that we are including everyone--women, those  with disabilities, and women of color--into our…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…national levels,  including serving as Department President of Ohio in 2015; and\n\nWhereas, Madam President has held numerous distinguished national  positions, including National Historian, National Hospital Chair,  National Honors and Awards Chair, and Vice President at all levels, as  well as two terms as National Sergeant of Arms--roles in which she…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Metropolitan Washington Airports Authority, and the  Commonwealth of Virginia.\n\nI would also like to recognize the Federal agencies working on the  recovery and investigation, including the National Transportation  Safety Board, the FBI, the Federal Aviation Administration, the Coast  Guard, the Army, and all the others who contributed.\n\nI thank those from local…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…finding out that  they are applying for a mortgage and then harassing them with a host of  texts and calls, et cetera.\n\nH.R. 2808 is supported by a wide range of groups, including the  National Consumer Law Center, the National Association of Home  Builders, the Independent Community Bankers of America, and America's  Credit Unions. The Senate recently passed…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…holds and rescinded funds after  disbursement. Donald John Trump has utilized DOGE to unlawfully block  or impound appropriated funds to dozens of Federal agencies, including  the National Institutes of Health, the Federal Aviation Administration,  and the Department of Veterans Affairs. By impounding congressionally  appropriated funds, Donald John…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…affect its coastal waters. D.C. urgently needs the protection of the  CZMA because of serious flood risks that affect federal assets,  residents and businesses in D.C., including the National Mall and  federal buildings in the Federal Triangle area.\n\nThe CZMA provides planning and technical services to assist states in  protecting, restoring and developing…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…have heard alarming reports that the  Trump administration wants to make good on its Project 2025 promise to  ``break up and downsize'' and privatize portions of NOAA, including the  National Weather Service. Destroying NOAA in this way would be an  enormous blunder that would hurt our economy, hamper innovation, and  increase the risks to American lives…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the House,  Congressmen Larson and Graves, didn't approve of this being in the  bill. So how is it that this is now in the bill that we all have to  respond today, including the National Transportation Safety Board,  basically saying this language should not be there.\n\nIt is so important, that the families that have had to come together  to support…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce a bill that would require  members of the Armed Forces, including the National Guard, deployed in  the District of Columbia in response to an order of the President  relating to crime or civil disturbance in D.C. to participate in a  program substantially…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694758/introduction-of-a-bill-to-require-members-of-the-armed-forces-performing-active-service-in-the-district-of-columbia-in-response-to-an-order-of-the-president-which-relates-to-crime-or-civil-disturbance-in-the-district-of-columbia-to-participate-in-a-program-substantially-similar-to-the-body-worn-camera-program-of-the-metropolitan-police-department-of-the-district-of-columbia"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…senior officials such as the directors  of centers focused on mental health and substance use treatment. They  have eliminated entire offices authorized by this statute, including  the National Mental Health and Substance Use Policy Lab and the Center  for Behavioral Health Statistics and Quality, which has been opposed by  dozens of leading mental health…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…``sector'' means a collection of       assets, systems, networks, entities, or organizations that       provide or enable a common function for national security       (including national defense and continuity of Government),       national economic security, national public health or safety,       or any combination thereof.\n\n(11) Sector risk management…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…plan for the future of the CVF and avoid  another crisis like this.\n\nTo the dozens and dozens and dozens of supporting organizations that  stood with me in this fight, including the National Children's  Alliance, the National District Attorneys Association, RAINN, Covenant  House, the National Network to End Domestic Violence, the National  Network to End…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…removal and other urgent needs.\n\nI want to also recognize the extraordinary contributions of volunteer  organizations--we certainly feel better when we see them pull up-- including national groups like the Salvation Army, the American Red  Cross, Samaritan's Purse, and Christ In Action, as well as countless  local organizations whose help has been invaluable…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…great Member with a great team, and Michael proved that every single  day in my office.\n\nMichael played an essential role in creating and advancing key  legislation, including the National Veterans Advocate Act of 2025. This  bill would help ensure our servicemembers have the support and  resources they need when they return home.\n\nAfter a veteran in…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…after the date of       the enactment of this Act, the Secretary of Veterans Affairs       shall implement policies, processes, and technological       capabilities, including in the National Work Queue (or       successor system), to ensure that, in the case of any covered       situation, a claims processors is made aware of, and assigned       to address,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695487/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…1968, one of the most significant and challenging periods  in United States military history. His bravery and dedication were  recognized with numerous commendations, including the National Defense  Service Medal, Good Conduct Medal, Vietnam Service Medal with 5 Bronze  Service Stars and one Silver Star, Vietnam Campaign Medal, Vietnam  Cross of Gallantry,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…provide more accurate or timely snowpack       measurement data commensurate with operational water       management needs.'';\n\n(B) in paragraph (2) by inserting ``, including the       National Oceanic and Atmospheric Administration and the       Natural Resources Conservation Service,'' after ``other       Federal agencies''; and\n\n(C) by striking paragraph…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…infantryman, where he demonstrated discipline, leadership, and duty  to serving our nation. After his Army service, Andy built and managed  several successful businesses, including a national natural products  distribution company and one of the top-performing UPS franchise in  North Texas. He was also elected to the Celina City Council in 2015,  where his…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690707/recognizing-congressional-patriot-award-recipient-andy-hopkins"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…interests in lands within the Apex Site or rights-of-way       issued pursuant to this Act shall be conditioned upon       compliance with applicable Federal land laws, including the       National Environmental Policy Act of 1969 and the Federal       Land Policy and Management Act of 1976.''.\n\nMr. WESTERMAN.  618, the bill now under  consideration.\n\nMr. Speaker,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…while strengthening our national  security.\n\nPart of the strategy is to ensure that the most effective tools to  achieve this objective are strong and ready to deliver, including the  National Endowment for Democracy. Now, remember, NED was a brilliant  initiative from President Ronald Reagan to fight communism and enemies  abroad, and it succeeded, strengthening…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Chief Trimbo has also made connecting with the community a priority.  Throughout the year, the Carver Fire Department hosts and participates  in numerous community events including National Night Out, Touch a  Truck, an Open House, and a Trunk or Treat event.\n\nThroughout his career at the Carver Fire Department, Chief Trimbo has  served with a community-first…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…as a condition to route these projects through a  national marine sanctuary.\n\nUndersea cables are and will continue to be subject to numerous  environmental statutes including the National Environmental Policy Act,  the Endangered Species Act, the Marine Mammal Protection Act, the  Magnuson-Stevens Fishery Conservation and Management Act, the National…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…of S. 356 to reauthorize  the Secure Rural Schools program.\n\nMr. Speaker, with such a large percentage of Wyoming's resources  historically locked up in Federal lands, including national forests,  communities across my State have long weathered challenges associated  with reduced flexibility and a decreased tax base.\n\nWhile a percentage of revenue from…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…international rules;\n\n(3) immediately implement ``know-your-customer'' procedures       for chemical shipments; and\n\n(4) direct all relevant departments and agencies, including       the National Narcotics Control Commission, the Ministry of       Public Security, the General Administration of Customs, and       the National Medical Products Administration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…we say that all options are  completely off the table. In fact, all of our free-trade agreements  provide exceptions for when parties can remove economic benefits,  including on national security grounds.\n\nI don't recall anyone suggesting that the Biden administration could  not impose sanctions on Nicaragua last year because it was a CAFTA  party.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}]