[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…rent.\n\nThis is about health, but I want to tell you, for all those doing the  math at home, you cannot have a thriving economic engine without good  healthcare. The two are incompatible. Widespread sickness, illness, and  disease and people can't get their health issues covered, it takes away  from our economic strength.\n\nIn fact, just cutting Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…responses to questions posed to him at his  confirmation hearing, as well as to written questions, reveal a lack of  familiarity with basic constitutional rights that is incompatible with  the position for which he has been nominated.\n\nThe NSA's surveillance authorities are vast and, if anything,  underappreciated by the American people. The Agency plays…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…command the States' officers, or those of their political       subdivisions, to administer or enforce a federal regulatory       program . . . such commands are fundamentally incompatible       with our constitutional system of dual sovereignty.\n\nThat sure doesn't sound like anyone is defying any Federal law to me.  And nobody is accusing Justice Scalia as…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…my confidence, impelled me  to abandon the idea.\n\nI rejoice that the state of your concerns, external as well as  internal, no longer renders the pursuit of inclination incompatible  with the sentiment of duty or propriety and am persuaded, whatever  partiality may be retained for my services, that in the present  circumstances of our country you will…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…humanitarian assistance. This is a  humanitarian crisis.\n\nCongress and the Trump administration must take action to put an end  to the violence. Killing those seeking food is incompatible with the  pursuit of peace.\n\nThe choice by Israeli leadership to engage in military actions at aid  sites endangers all innocent Palestinians and Israelis who deserve to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694015/humanitarian-crisis-in-gaza"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…indicates ``everything here smacks of a bargain: dismissal  of the indictment in exchange for immigration policy concessions.'' He  called Mr. Bove's position ``fundamentally incompatible with the basic  promise of equal justice under law''--a quid pro quo deal. But Mr. Bove  said it was fine.\n\nEven more disgracefully, he said a court cannot review, at all,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…right god.\n\nBut it is not just the President--not just President Trump. On the  floor of this body, a Senator called Islam a ``poisonous religion''  that ``is fundamentally incompatible with our Western values.'' In  recent weeks, a Member of the House posted on his official Twitter  page:\n\nHow to Deal with Mainstream Muslims: I don't know how you…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…government,  and threatened the integrity of the democratic system. He thereby  betrayed his trust as President, abused the powers of the Presidency,  acted in a manner grossly incompatible with self-governance and the  rule of law, and has committed the high crimes and misdemeanors of  obstruction of justice and effecting a wide-ranging scheme to destroy…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "French Hill", "party": "Republican", "sentence": "…my confidence, impelled me  to abandon the idea.\n\n``I rejoice that the state of your concerns, external as well as  internal, no longer renders the pursuit of inclination incompatible  with the sentiment of duty or propriety, and am persuaded whatever  partiality may be retained for my services, that in the present  circumstances of our country, you will…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Nation's national security posture and  apparatus, and further cement true, unyielding, American leadership on  the international stage.\n\nAt the very same time, we are slashing incompatible mandates and  provisions that were cooked up during the Biden administration that  would have weakened America's trajectory to greatness.\n\nWith fiscal restraint and an eye…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…robbing women of opportunities,  invading their privacy, and jeopardizing their safety in athletic  competitions. Allowing biological men to participate in women's sports  is incompatible with the values of our servicemembers, our service  academies, and basic notions of fairness and good, old-fashioned common  sense.\n\nI urge all Members to support this amendment,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…gives way to coercion.\n\nIn Texas, my constituents are increasingly alarmed by the  consequences of mass migration and the importation of ideologies that  are fundamentally incompatible with our Western civilization.\n\nThe purpose of this caucus is clear: to ensure that Sharia never  gains a foothold in America--not now, and not ever.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699120/sharia-free-america-caucus"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…assemble peacefully and practice their faith without fear of violence.  Acts of anti-Semitism, whether expressed through threats, vandalism, or  violence, are fundamentally incompatible with the values of this  Nation.\n\nToday, remember those who we have lost and stood with the Jewish  community. There is no place for hate or violence in the United States…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}]