[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…during this law enforcement week would actually produce any measurable  gains in public safety.\n\nWe spent the week voting for bills that will do nothing really but  increase the number of weapons on our streets, our buses, our trains,  our subways, parks, restaurants, and in our schools. That is a strange  way to improve public safety or aid law enforcement…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…outcome would be serious and immediate.\n\nThe United States would lose treaty-mandated insight into Russia's  deployed nuclear forces. Both countries would be free to increase the  number of deployed warheads on existing missiles. Strategic planning  would increasingly be driven by worst-case assumptions rather than  verified facts. At the same time,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…windfall. Nationwide, families would pay an extra $6 billion.\n\nRepublicans are going to make it easier for corporate polluters to  poison our water and air. We will see an increase in the number of  wildfires and floods that devastate communities, and that will lead to  continued skyrocketing insurance premiums and property damage.\n\nFarmers and ranchers are…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…premium support for low- and middle-income people buying  health insurance. So that causes premiums to go up.\n\nThe second thing that causes premiums to go up is when you increase  the number of people with no insurance, they go to the emergency room,  and they are not able to pay. So providers provide treatment, but then  they have to charge that off to…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…interests.\n\nThe current version of the BLUE Pacific Act expands U.S. diplomatic  and development presence in the Pacific Islands by recommending that  the administration increase the number of staff working on Pacific  Islands issues and in the region, authorizing the Secretaries of State  and Commerce to hire locally employed staff in the region, establishing…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…patients,       communities and the entire health care system.\n\nLisa Lacasse, president of the American Cancer Society Cancer Action  Network:\n\nACS CAN opposes cuts that will increase the number of       uninsured nationwide by severing the lifeline that Medicaid       provides for cancer patients and those at risk for cancer. It       is imperative for cancer…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…marine has  shrunk to an unacceptable level. My bill is an actionable step that we  can take right now to improve the maritime industry, grow the U.S.  mariner pool, and increase the number of U.S.-flagged ships.\n\nFrom a national security perspective, cargo preference remains an  effective shipping strategy in maintaining our Nation's presence and  economic…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…it.\n\nBut they don't need to listen to me. Here is what the experts have  found. A study published in the Annals of Internal Medicine found that  Republican cuts would increase the number of people skipping medical  care because of cost from nearly 129,000 people to nearly 839,000  people a year.\n\nA study from Yale and Penn found that Federal cuts from…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…This  morning, we want to give you a chance.\n\nSpeaker Johnson could end this crisis and bring the bill up. Instead,  they are wasting time on this dusty bill that will increase the number  of uninsured Americans, and that is a fact. People don't need  healthcare that costs more and covers less. To stave off this crisis,  this bipartisan discharge petition…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698400/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…direct to  phase II authority for all Agencies, as well as better data collection,  better training, and specifically designated commercialization  officers. I want to increase the number of new entrants by  reauthorizing and codifying new programs that aim to reach underserved  populations. And, like all of my colleagues, I want to make sure that  our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…responsibility and priority to the program, to not just train  people but to essentially become an arms dealer, putting more weapons  on the streets of this country. It will increase the number of military  firearms that will be put into circulation by the Civilian Marksmanship  Program. It will increase the types of firearms that can be put into  circulation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…ability of any such organization or office to provide       services required by such office.\n\n``(3) Nothing in this subsection shall be construed to       authorize an increase in the number of full-time employees       otherwise authorized for the Department.\n\n``(f) Privacy.--Nothing in this section shall be construed       to authorize the Chief Veterans…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…chemical abortion drug because the  Biden administration was focused on having more abortions in America.  They weren't just pro-choice; they were pro-abortion, trying to  increase the number of abortions in America, but to do that, they did  not take into account the health and life of the mom because they were  so eager to increase the number of abortions.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Tennessee in 2024. That is  1 year, 514 reports. That was more than twice the number of reports of  adult sex trafficking.\n\nThe report also notes that there has been an increase in the number  of unaccompanied minors who were trafficked into our country and  exploited. This should come as no surprise. Under Biden, hundreds of  thousands of unaccompanied…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…PROGRAM.\n\nSection 846A of the Public Health Service Act (42 U.S.C.       297n-1) is amended--\n\n(1) by amending subsection (a) to read as follows:\n\n``(a) In General.--To increase the number of qualified       nursing faculty, the Secretary may--\n\n``(1) enter into an agreement with any accredited school of       nursing for the establishment and operation…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…American can actually build a home and realize  the American Dream.\n\nMr. CRAWFORD. Mr. Chair, I have heard this mentioned more than once  today, and that is that we need to increase the number of personnel to  process, manage, and administer the regulatory burdens that Americans  are facing. Let me say that again. The Democrats say we need to  increase personnel…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…of sheep and goat meat imported       into the United States as a result of the implementation of       the rule referred to in subsection (a);\n\n(ii) the estimated increase in the number of live sheep and       goats imported into the United States as a result of the       rule;\n\n(iii) the estimated demand for sheep and goat meat in the       United…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Administrator and research universities and       institutions, shall establish a national-level incubator       program (in this section referred to as the `program') to       increase the number of strategies, technologies, and measures       available to prevent, mitigate, and control harmful algal       blooms.\n\n``(b) Framework.--The program shall establish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…tears, hopes, and dreams. That doesn't happen.\n\nWe actually need trucks to get our lifesaving drug medications to the  pharmacies at lower costs. Mr. Speaker, if you increase the number of  trucks required because you increase the payload capacity, you are  going to actually do more harm than good.\n\nLet's talk about infrastructure. Apparently, my colleagues…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…necessary, to       improve understanding of potential fraud and scam risks to       veterans.\n\n``(c) Full-Time Employees.--Nothing in this section       authorizes an increase in the number of full-time employees       otherwise authorized for the Department.\n\n``(d) Rule of Construction.--Nothing in this section shall       be construed to limit the authority…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}]