[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…partnership in  negotiating the bill. It was one of the toughest negotiations and most  important negotiations I have ever been involved in.\n\nAnd I also want to thank the incredible staff here in the Senate who  worked tirelessly to get this done. On the Democratic side, that is  Alex Carnes, Sarita Vanka, Kali Farahmand, and Drew Platt, and on the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…going to be absolutely exploding. In  fact, about $1.5 trillion worth of private sector investment was put  into that broadband expansion in just a 5-year period. It was  incredible. It transformed our Nation.\n\nA 14-year-old girl today thinks that she has an entitlement to a 65- inch screen in her living room and a little digital device on her lap  at…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "Ms. BUDZINSKI. Mr. Speaker, I rise today to recognize the wonderful  class of interns who served in my office during the fall 2025 semester.  Their incredible dedication to public service and commitment to  learning has been truly inspirational, and the contributions they have  made to Illinois' 13th Congressional District have…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…billionaires; this moment that  should be dominating our attention and our focus; this imminent bill  that is being debated and discussed here in the Senate right now that  has such incredible consequences, putting $2.4 trillion more of debt in  our country and raising the energy costs on the average American by  hundreds of dollars; this bill that would raise…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…three  marathons each year.\n\nOver the past 14 years of this challenge, Leslie ran more than 1,300  miles during these marathons alone, but thousands more to train for  this incredible accomplishment.\n\nLeslie balanced her love of running with her already busy life as an  occupational therapist, wife, and mother of two. I am truly amazed by  Leslie's dedication,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694050/congratulating-leslie-rook"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…traveled toward the Earth. It arrived in 1987 when the  astronomers saw the flash of light and we saw the burst of neutrinos in  our underground detector, so we learned an incredible thing about these  stellar explosions.\n\nIt is this sort of thing that brings you, me, and other young people  into science. I thank Ranking Member Castro, as well as Representative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…championship in robotics.                           Recognizing Bharat Patel\n\nMr. CORREA. Mr. Speaker, I rise today to recognize my very good  friend, Mr. Bharat Patel, for his incredible career and contributions  to our community.\n\nIn 1976, the Patel family purchased the original Peter Pan Motor  Lodge in Anaheim, right across from Disneyland. Almost 50 years…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…my esteemed colleague and dear friend, Congresswoman  Jennifer McClellan, a Democrat from Virginia's Fourth District, for her  outstanding leadership and for leading this incredible hour.\n\nMr. Speaker, I rise tonight during National Gun Violence Awareness  Month not just with sorrow but with a sense of urgency. I rise tonight  during the National Gun…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…special.\n\nWhat brings a smile to my face is that this legacy lives on       dynamically as ever with her granddaughter, Nina. Nina and       her husband Orion are raising three incredible young women:       Annie, Adalin, and Noelle. Three brilliant, kind, and loving       sisters who look after one another and lift each other up.       The symmetry is undeniable.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…lifesaving work, and no one does it  better than our researchers.\n\nIn my home State of Washington, we have a lot of incredibly smart  people who have been making a lot of incredible breakthroughs for  patients, and we have a lot of passionate advocates who have been  fighting to support their work. I have lost track of how many times I  have visited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Mr. President, finally, let's say good-bye to German Vazquez--a very  special good-bye to one of the Senate's unsung heroes, German Vazquez,  who will retire soon, after 28 incredible years of service.\n\nThe public may not know German, but every single Senator knows him.  You see his face, and you smile. You  can always find him near the Chamber, working…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…our farmers, and our families.                                   Tariffs\n\nMr. President, I want to address another topic, and that is the topic  of tariffs. They are doing incredible harm to our economy in Vermont.  In my view, they are doing long-term damage to our economy here in the  United States.\n\nI want to commend my colleagues Senator Paul, Senator…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…with an important amendment to this  bill. My amendment, Raise the Wage Act, would ensure all workers  receive a long-overdue raise. $7.25 an hour is minimum wage. That is  incredible. Mr. Speaker, 2009 was the last time we touched this. It is  unbelievable that 16 years have gone by and that we haven't found it  within ourselves the values we hold dear…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to recognize Mr. Bharat Patel  for his incredible career and contributions to our community.\n\nIn 1976, the Patel Family acquired the original Peter Pan Motor  Lodge, located right across the street from Disneyland, and began…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…precedent for       similar protections across the country.\n\nWe respectfully request that you uphold protections for the       Boundary Waters that ensure generations of incredible       hunting, fishing, and paddling opportunities. Our sporting       heritage and the outdoor economy of Northeast Minnesota rely       on an intact and water-rich backcountry…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…where does the actual policy come in?\n\nThose are incredibly important points to highlight that they are the  lifeblood. We have data that suggests that Utah, which has an  incredible economy, strong work ethic, low unemployment, good  volunteerism across the board, is ranked high in the economic  indicators for the country, and we are heavily tilted toward…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Championship trophy in Cobb  County for the first time.\n\nMr. Speaker, I rise today to congratulate the university leadership,  players, staff, and head coach Jerry Mack on an incredible season and a  hard-fought win. We wish them the best of luck in their upcoming bowl  game.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697964/congratulating-kennesaw-state-university-football"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Catholic 1-0, earning their second straight State title and the  fourth title in the last 10 years.\n\nThis victory caps off an amazing season for the Ravens who finished  with an incredible record of 28 wins and only 1 loss.\n\nI congratulate Coach Shannon Woolridge, the players, and everyone who  played a part in this special season. They have made their school…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691459/recognizing-empire-high-schools-softball-team"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Silver  Star.\n\nColonel Davis went on to become the first African-American brigadier  general in the United States Air Force.\n\nIt is totally appropriate that we recognize the incredible  accomplishments, with all of the opposition that they faced, that the  Tuskegee Airmen achieved in the defense of our liberty.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696983/tuskegee-airmen-moment-of-silence"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize Junior  R. ``Skip'' Baker for an incredible 70 years of service to the Genesee  Township Volunteer Fire Department.\n\nIn 1955, Skip joined the Genesee Township Volunteer Fire Department  and has been a steady presence…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690559/recognizing-junior-r-skip-baker"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, today I rise to congratulate the  Washington Cattleman's Association on their 100th anniversary, an  incredible milestone that ranchers in our State should be proud of.\n\nSince its inception in 1925, the Washington Cattleman's Association  has been instrumental in promoting the agriculture…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696671/congratulating-the-washington-cattlemans-association-on-their-100th-anniversary"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…service is a shining example of the bravery and selflessness  of our first responders, and they demonstrate this every day. It was an  honor to meet Julie and hear about her incredible dedication firsthand.\n\nI congratulate Julie and thank her for her steadfast commitment to  saving lives and protecting Iowans.                          Recognizing Georgia…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…completed his service in  1947 and later fulfilled an advertisement recruiting firefighters. For  two decades, he drove a fire engine, and he retired in November 1974.\n\nJohnny's incredible career as an aviator turned first responder is  remarkable to witness. After returning from overseas, he married in  1945. Johnny has one daughter and many more grandchildren…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…Nation's newest bomber, it is critical Edwards Air Force Base has  the tools to test these modern technologies so they can be utilized by  our warfighters.\n\nI am proud of the incredible men and women, both civilian and  military, who provide our military with the best technology to keep our  Nation safe.\n\nI urge my colleagues to support these amendments…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I rise today to recognize the incredible season  of the Coastal Carolina University baseball team. With grit, heart, and  determination, these young men made the Chanticleer Nation, the Grand  Strand, and all of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…direct reflection of how our country's  ag industry has grown. It was an honor to attend the Farm Show this  year, and I thank all of those who worked tirelessly to make this  incredible event possible.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…time  with her children and grandchildren. She is a devoted woman of faith  and attends Saint Michaels and All Angels Episcopal Church in Dallas.  Trinka has truly made an incredible impact on the world around us, and  I wish her continued success for many years to come.\n\nIt is an honor to bestow my friend Trinka with the Patriot Award for  her exceptional…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…these individuals on the sidelines in our economy.\n\nThat is just unfair, and it is a missed opportunity for American  growth and innovation, and deprives our economy of their incredible  contributions.\n\nThe ThinkDIFFERENTLY About Disability Employment Act takes a critical  step towards breaking down these barriers. This bill directs the Small  Business Administration…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…vehicle's  total thrust at liftoff.\n\nIt is not just about technology. It is about what this technology  enables. Northrop Grumman's advancements in propulsion have opened up  incredible possibilities for deep-space exploration, including human  missions to the Moon and Mars, asteroid mining, and future scientific  discoveries beyond our current cognitive…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…technologies. We are going to adopt other ways to make our  brothers and sisters healthy. We are going to telegraph to the markets  we are stable. We are America. We are the incredible investment.\n\nIf you think I am engaging in hyperbole, look at the price of gold.  If the  price of gold isn't telegraphing something to you, go back to your  basic economics…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}]