[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…We hear many  stories of veterans who have appointments scheduled hours away,  requiring them to secure transportation, which can often be difficult.  We have also heard incredibly frustrating stories of these same  appointments being canceled or rescheduled at the last minute.\n\nWhat does that mean for our veterans and their families? It can mean  rescheduling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695497/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…500,000 constituents.  Throughout his service, Chief Baker has championed the physical and  mental well-being of his team through workplace wellness programs, and  we are incredibly grateful for his hard work.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate Chief Bob Baker on his retirement.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…improper firings.\n\nMy State has felt a significant impact from these firings. It is home  to so many Federal workers--as I have mentioned, 160,000 of them-- people who I am incredibly proud to represent. I have heard the calls  from panicked workers who don't know what the future holds. I have met  with distraught workers who fear that they won't be able…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…years,  Republicans have complained about regulations and reporting  requirements being too burdensome for small businesses and lenders, but  now they are ready to impose an incredibly complicated, mandatory, and  invasive new compliance regime without offering any new resources to  support it.\n\nThis bill is about scoring political points at the expense…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. NEGUSE. Mr. Speaker, as Mr. Goldman mentioned, I represent  Boulder, Colorado, in the Congress. I live in Boulder County. My wife  and I are incredibly blessed and lucky to be raising our family in this  community.\n\nLast week, I introduced a bipartisan resolution denouncing this  heinous anti-Semitic terror attack in my…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…about the town of  Roslyn in my district. It is a small town, completely surrounded by  forest, and this forest is at high risk for catastrophic wildfire. In  fact, it was incredibly important to the residents of the town not only  to firewise their own homes but to treat the forest around the city to  protect it.\n\nI actually got to go out with nonprofits…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…and all the teachers across  Virginia's Seventh Congressional District who go above and beyond to  make sure every student feels seen, valued, and empowered. Their work  is incredibly important.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690735/constituent-of-the-week-mayor-kerry-devine"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…(Mr. Baird), my dear  friend and one of my favorite colleagues--if that is okay and germane  to say--for his collaboration on this bill. We are both midwesterners.  He is an incredibly accomplished academic, veteran, and businessman  from an important part of our Nation. I have had the sincere privilege  of collaborating on legislation with the gentleman…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…our time, covering up the horrific abuses of Jeffrey Epstein and his  network of child traffickers and sexual predators.\n\nWhy not spend our time focused on justice for the incredibly brave  survivors who have spoken out against the rich and powerful men who  abused them?\n\nWhy fight a bipartisan discharge petition from   Thomas Massie and Ro  Khanna to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…with a time of  1:28:31 at the USA Triathlon Winter National Championships earning him  a spot in the World Championships to be held in Pontevedra, Spain next  year. We are incredibly proud that he'll represent the United States at  this global event.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692077/recognizing-alex-willis"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I echo my colleague's thanks to our  colleague from Maryland for anchoring this incredibly important hour.\n\nMr. Speaker, I rise today to defend food assistance, not just in my  district, but for millions of Americans across this country.\n\nRepublicans passed a bill…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691769/151-days-without-a-vote-to-lower-costs"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…countries to reverse that history? Would the President wield  our military as tax-funded security for the expansion of American oil  giants in these markets?\n\nRemarkably, incredibly, this seems to be his plan. President Trump  has floated sending American troops to secure U.S. companies to rebuild  Venezuela's oil infrastructure. He has even said the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…F-35s,  Ospreys, and attack helicopters; the MV Ocean Trader, a floating base  designed for special operations; reaper drones, Harriet jets, and fifth  generation fighters--incredibly lethal aircraft.\n\nBut this is not all. The largest aircraft carrier ever built, the USS  Gerald R. Ford is on its way right now from the Mediterranean. This  means we will…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…country in the  world. We produce more natural gas than any other country in the world.  We are the leading exporter of liquefied natural gas, which, by the  way, has been incredibly important recently because we have allowed our  allies in Europe to get off the Russian oil that they were on and  replace that with liquefied natural gas produced by American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…air traffic controllers, the MWAA employees,  and the DCA employees who have returned to their jobs and worked  tirelessly to keep our airspace safe. I know it has to be incredibly  difficult, working in close proximity to this tragedy and seeing the  recovery efforts while completing their jobs. My heart goes out to  them, and we thank them for their…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…increase interconnectivity, to  make sure these systems interconnect so that if there is a problem  somewhere, we can bring power back in.\n\nThat is what makes our grid today so incredibly important. If there  is a breakdown in transmission somewhere, we can find other ways to  bring power to people's homes. If there is a breakdown there with  generation, we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…doing what I wanted and was, you know, making every day my  birthday, I would not be for that unless we deliberated upon that.  There are constitutional processes that are incredibly important.\n\nThe Constitution doesn't allow the President of the United States to  be the sole decider. Even the President must abide by the proper limits  of Executive power.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "Mr. TURNER of Ohio. Mr. Chairman, I thank Representative Scott for  offering this amendment.\n\nMr. Chair, it is incredibly important to secure the funding for the  Baltic Security Initiative. The Baltic Security Initiative has assisted  the states of Estonia, Latvia, and Lithuania, which are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695258/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…President Trump but also for the entire country, and those  wins are not stopping anytime soon.\n\nI congratulate Dan on his confirmation. I, along with many, many  others, are incredibly proud of him. I look forward to following his  work and hearing of the strides he will make in his new position.\n\nMay God continue to bless Dan, his wonderful wife, Cassie,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688244/recognizing-dan-driscoll"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…temporary visitors for business and pleasure. As far  as college students are concerned, we allow another over 400,000 people  into this country on student visas.\n\nIt is incredibly easy to get into this country. Rather, it is not  always easy, but millions of people come into this country legally and  are able to do so. We do not have to have sympathy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…was elected in a landslide, and the American  people expect and deserve our support in getting his agenda  accomplished.\n\nPresident Trump and his administration are working incredibly hard to  bring back the U.S. policy of peace through strength and to ensure our  military is a respected and lethal fighting force. This is not an easy  task after President…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…TANF to ensure this funding  stream remains focused on its mission, helping needy families and  children, rather than serving as a tool for ideological gatekeeping.\n\nI am incredibly proud of this bill, which protects the most  vulnerable among us and ensures that every woman facing adversity has  the options, resources, and support she deserves.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…passed the HALT Fentanyl Act. It cracks down on deadly  fentanyl trafficking. This is thanks to Senator Bill Cassidy of  Louisiana and Chuck Grassley of Iowa. They have done incredibly hard  work and important work.\n\nOn top of that, the working families tax cuts made a historic $170  billion investment in border security. It finishes the wall. It hires…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…fallow. We don't care what the reality is in the West.  All we care about is protecting the bureaucratic rule.\n\nMr. Chair, that is a doggone shame because beef production is  incredibly low right now. Beef consumption is projected to be 28.6  billion pounds this year. It is falling because of high prices.\n\nWhat are we doing? We are saying we are going to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…sentences and puts dangerous  criminals on the streets, the American people know who is actually  standing up for law enforcement.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, I find it incredibly ironic when my colleague talks  about President Trump backing law enforcement.\n\nLast night in the Rules Committee, their Republican colleague, Mr.  Knott, noted that Republicans…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…ethic, establish critical  thinking skills, and learn what it means to be a citizen of our great  country. Teachers are endowed with educating our students, which is why  I am incredibly thankful to all the educators at Carroll High School  for carrying out this mission. Their dedication to teaching Fort  Wayne's next generation of leaders is incredible,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…mismanagement. Consequently, the United  States has continued to see some of the largest and most intense  wildfires in history over the past few decades.\n\nDuring that time, these incredibly destructive wildfires have led to  significant property loss; recovery costs; and, in some cases, the loss  of human life.\n\nI visited some of the afflicted areas, including…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…scares the hell out of the political class because reporters will lie  about it. The activists on Twitter or X, whatever it is, will lie about  it, but the economics are incredibly important.\n\nIf you are going to move this country to raise its productivity so we  can raise wages so we actually can survive what is happening in the  actuary reports of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the White House. That was my bill, so I  was privileged to be there. Behind him were families holding the  pictures of their children who had died from fentanyl overdose.  Incredibly moving.\n\nI had a similar ceremony in Baton Rouge where, across Louisiana,  people came and held a picture of their child who had died. In one  case, the young man had a hard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695793/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…should  experience free from the fear of cancer.\n\nTHON exists so that, one day, no parent will ever have to hear the  words: ``Your child has cancer.''\n\nMr. Speaker, I am incredibly proud of these students at my alma mater  and, more importantly, of the brave children and families who fight  this battle every day.\n\nMr. Speaker, I congratulate everyone…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688351/recognizing-thon"}]