[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…prescription drug prices. It would stop medical research  and stop medical debt relief.\n\nOver the first 3 months of his administration, Donald Trump and  Republican allies have increased the prices of prescription drugs-- including cancer and heart medications, as well as vital antibiotics-- delayed the implementation of a Biden administration rule that barred…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…justification for Congress to legislate on local D.C. matters,  but I will discuss it.\n\nThe D.C. law, which the D.C. Council unanimously passed, established  a child tax credit, increased an existing earned income tax credit, and  decoupled D.C.'s tax code from some of the tax provisions in the so- called One Big Beautiful Bill Act.\n\nThis disapproval resolution…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…are prioritizing legislation that  props up the fossil fuel industry and blocks affordable, clean energy  that is ready to be connected to the grid.\n\nWe already know that increased LNG exports means higher energy prices  for our communities at a time when families are already facing an  affordability crisis. Due to skyrocketing demand, including from…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697095/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…down construction. And when supply can't keep up with demand,  prices go up. That is not just ideology; that is simple economics.\n\nSimilarly, Trump's self-imposed taxes have increased your costs at  the grocery store. You are paying more for the essentials you rely on  most: coffee, produce, meat, so much more. Trump and his billionaire  buddies, who probably…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…online history, past purchases, the color of  their skin, their income, where they work, or their ZIP Code to charge  them a higher price.\n\nSurveillance pricing will lead to increased costs for food and basic  goods. It will harm working families who are already struggling to make  ends meet. This is not just about discriminatory technology. It is  about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…act of war. Repeated military strikes followed on by invasion is an  act of war.\n\nAnd this engagement is not just a hostile act against Venezuela, it  will inevitably draw increased frictions with Russia and China. Now, we  shouldn't be afraid of friction with Russia and China as a principle.  They are our adversaries.\n\nBut the reason that the Constitution…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…come in and say: But healthcare is still  too expensive.\n\nThat is a fact. But imagine, if there were no help in paying the  premiums, what families would be doing with these increased costs.\n\nDo you want to know one of reasons that the health insurance is so  expensive? I have asked Blue Cross Blue Shield in Chicago, and they  tell me it is pretty simple.…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…threatened by the  administration's plan to defund key GPEI partners.\n\nJust at the time when this disease is closer than ever to being  eradicated, the risk of outbreaks is greatly increased. We must do all  in our power to protect the gains already made, and finish the job,  including appropriating the funds required.\n\nPeople from my generation remember the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the country were       battery-electric vehicles, plug-in hybrids of range-extended       vehicles, according to the China Passenger Car Association.\n\nAs adoption rapidly increased in China, homegrown players       came to dominate the global EV supply chain--including,       crucially, batteries, perhaps the single most important       technology underpinning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…inflicted by broad-based       tariffs and the associated economic uncertainty. American       families are facing thousands of dollars in higher prices as       a result of these increased taxes. Small businesses,       manufacturers, and ranchers are struggling with higher costs,       with additional economic pain likely coming in months.\n\nThe Chamber--…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…food assistance at food  banks and food pantries just to survive.\n\nThis extraordinary need, exacerbated by Trump's cruelty and his  administration's awful policies that have increased hunger made this  year's March for the Food Bank of Western Massachusetts more important  than ever.\n\nEvery November, an incredible team of antihunger advocates, concerned…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…bravely and  tirelessly work to protect our communities day in and day out. The  situations that these law enforcement officers encounter put them, as  we all know, at an increased risk of developing mental health  disorders, including PTSD, depression, and anxiety.\n\nThis Police Week, I thank the sponsors of the bill, my colleagues  across the aisle,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691322/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…administration on everything from tariffs to immigration enforcement.\n\nAccording to a recent survey from the Small Business Majority, 47  percent of small business owners say that increased Federal immigration  enforcement has had a negative impact on their business. Many small  businesses have lost revenue or had to modify their operations because  employees…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699617/small-businesses-bear-brunt-of-immigration-enforcement-abuses"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…combustion by  power  plants, contains hazardous heavy metals that if left unregulated can  pollute our land and our water.\n\nThe effects of these toxins on the human body include increased risk  of heart disease, cancer, and cardiovascular disease.\n\nCertainly protections, like monitoring ground water and lining legacy  coal ash ponds to prevent contamination,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699294/consequences-of-delaying-coal-ash-cleanup"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…respiratory illnesses. Decades  without adequate regulation of toxic emissions from these plants have  taken a serious toll on the Akron community. Studies from the 1980s  found increased risk of leukemia among rubber plant workers in Akron  and respiratory illnesses in children nearby rubber plants. Goodyear's  St. Marys, Ohio, rubber plant vented carcinogenic…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Americans: no tax on tips, no tax on  overtime, no tax on Social Security for senior citizens, no tax on auto  loan interest for certain personal car loan deductions, and even the  increased standard deduction, meaning that D.C. taxpayers who do not  itemize their tax deductions will not be able to claim the full amount  of the federally expanded standard deduction…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…White House, House, and Senate. None of them were because  Democrats recognized deep down that doubling the child tax credit,  doubling the standard deduction, encouraging increased wage growth  without the inflation that came from the American Rescue Plan, which we  saw the Democrats enact in 2021, all of that positive economic growth  is actually a…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…addition to wasting time and personnel resources, the renewal  process is estimated to cost the City at least $150,000.\n\nBetween 2010 and 2020, the population of The Dalles increased by more  than 11 percent. To address the needs of its current and future  population, the City plans to increase the Crow Creek Reservoir's  capacity from 900 to 3,000 acre-feet.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…States and across the globe including Johns  Hopkins, Cornell, Dana-Farber Cancer Institute, and the University of  Miami.\n\nVoices Against Brain Cancer also advocates for increased federal  funding for brain tumor research at the National Institutes of Health  and increased public awareness. The cure rate for most brain tumors is  significantly lower…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the management across the  National Forest System.\n\nEncouraging this ramp-up will enable the Forest Service to better  manage, support local counties and economies through increased  sustainable harvest levels, address invasive species and forest health,  and ultimately reduce the severity and instances of wildfires.\n\nDuring this Wildfire Awareness Month,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…that they can  focus on investing and hiring more workers.\n\nMr. Chair, 2 million family-owned farms need certainty that they  won't be forced to sell their farm to pay an increased death tax. They  need to know right now if they should be contacting an estate planner  for the massive tax hike that is coming.\n\nParents need certainty that their guaranteed…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…Speaker, let's look at the facts more closely. First, ObamaCare  has yet to deliver on the promises made to Americans over a decade ago.  Since the ACA was enacted, premiums have increased by roughly 80  percent. Guess what. Ninety percent of that increase has been paid for  by the taxpayers.\n\nIt is important to note that these premium tax credits are sent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Mr. Speaker, I support this bill, and I reserve the balance of my  time.\n\nMr. GOSAR.  Boebert), the lead sponsor of this bill.\n\nMr. GOSAR. Mr. Speaker, this bill provides increased financial  flexibility for the construction of the long-overdue water  infrastructure improvements in rural Colorado. I thank Ms. Boebert for  her diligent work and attention…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…and we       believe the CFPB should carefully assess the rule in this       context.\n\nFurthermore, we are concerned the CFPB neglected to fully       consider the impact of increased compliance costs. The       proposed rule states, ``the CFPB lacks detailed information       with which to predict the extent to which increased costs       would be borne…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "Mr. JACKSON of Texas. Mr. Speaker, due to increased traffic on  Independence Ave. and inclement weather, I was unable to be present for  the vote on H.R. 4922. Had I been present, I would have voted YEA on  Roll Call No. 270.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695539/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…like reducing HUD staff by 24 percent and DOT by 5  percent, helping to rightsize the Federal workforce.\n\nWhen it comes to aviation safety, a top priority, FAA funding is  increased to $22.2 billion, including $10.3 billion for air traffic  control operations, $4 billion to modernize facilities and equipment,  and additional resources to hire 2,500 new…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…its use. In the meantime, the building has been damaged by  weather and continues to decline structurally. Every year, it stays  vacant, resulting in higher repair costs and increased liability for  the Federal Government and taxpayers. Instead of watching this asset  deteriorate, we have the chance to put it to productive use for the  local community.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…zoning regulations for directing local       reforms, including mechanisms to encourage adoption;\n\n(ix) provisions to encourage transit-oriented development,       including increased permissible units per structure and       reduced minimum lot sizes near existing or planned public       transit stations;\n\n(x) potential reforms to strengthen the public…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…exports serve the public interest, contributing positive economic  benefits and strengthening energy security for the American people.\n\nEven more, recent studies confirmed that increased American LNG  exports do not significantly raise global emissions. In fact, it is  quite the opposite. Clean natural gas is a major reason why the United  States has significantly…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697085/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people who are going to want to lower other taxes. It is important  that all true Republicans weigh in and double their efforts to make  sure that we do not use any of these increased tariffs to increase the  role of government in people's lives.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700208/president-trumps-great-speech"}]