[{"senator": "Mike Levin", "party": "Democrat", "sentence": "…jobs have been put at  risk or pushed offshore. Too many families have been stretched thinner.  Too many communities are being asked to subsidize decisions that  protect the incumbent energy players instead of protecting consumers.\n\nWe can keep doing what we have been doing: restricting the cheapest  new supply, forcing ratepayers to carry the cost of…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Others  suffered for the rest of their lives, afflicted with burns, radiation,  and cancer.\n\nThe modern nuclear weapons of today are orders of magnitude more  horrifying. It is incumbent on all of us to ensure that these weapons  are never used again.\n\nNew START is a concrete step toward ensuring that future. It is one  where no person--no man, woman, or…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…benzene, and particulate matter that flood into our air and into our  children's lungs.\n\nNow, unless industry were to somehow decide to suddenly just do the  right thing, it is incumbent upon government to act. And that is what  California has done. But, of course, this discussion debate is more  than just about public health. California's emissions standards…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Camp  Pendleton, and both were far too young to be taken from their families,  friends, and fellow marines.\n\nIt is a terrible grief that these families now carry, and it is  incumbent on all of us as a Nation to remember the sacrifice of these  young men.\n\nI ask all my colleagues to join us in a moment of silence in memory  of Lance Corporal Aguilera and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…believe it's our duty to sound the alarm       about this administration's degradation of DOJ's vital work,       and its assault on the public servants who do it.\n\nIt is incumbent on all of us to fight for the Justice       Department before it's too late.\n\nDOJ's mission is to ``to uphold the rule of law, to keep       our country safe, and to protect…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…every  single day and has done that all of her life. All she has asked us to  do is to give her a fighting chance to have health insurance for her  family. Isn't it really incumbent upon us to meet that responsibility?", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…decided to run for  the U.S. House of Representatives for the first time. This was after I  lost three straight elections. My wife said this is my last chance. So  I took on an incumbent in 1982 for the U.S. House of Representatives.  He had been in that seat for 22 years. But because of the quirky law in  Illinois, the Democrats got to draw the map, so I…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…for  Medicare. What he clearly has as his major agenda item is that tax cut.\n\nI will acknowledge we can have a debate fair and square about that  tax cut. But I think it is incumbent on all of us to acknowledge that  the path to the President getting his tax cut marches right through  access to healthcare in an attack on Medicaid.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…was ``confidence and integrity'' in the United States       Department of Justice and stated that you opposed the       ``partisan weaponization'' of the Department. It is incumbent       on you to use all of the tools available to you to preserve       and protect the independence and integrity of the legal       profession, including opposing the use…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…and an  immeasurable cost in the loss of Renee, Alex, and the 40 others listed  here.\n\nI join my fellow Minnesotans in calling for Operation Metro Search to  end now. It is incumbent on every single one of us to honor their  resilience, embrace their courage, and put an end to this senseless and  preventable suffering in my community and in every community…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…holy season of Ramadan for our  Muslim brothers and sisters. Particularly during this time of  reflection and community but frankly throughout the whole year, it  should be incumbent upon all of us to call out all forms of bigotry and  discrimination against any religious community and to stand up for all  of our communities against injustice.\n\nI think…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…upon what is--in  2024, and it is already unfolding again in 2025--the future. It is wind  and solar and batteries.\n\nAnd it is unfolding in a way which, again, threatens the incumbent  energy sources. And in place of these programs, there are no solutions.  There is just more pollution that is going to be what happens as a  result of what the Republicans…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…veterans.\n\nAs a physician myself, I can tell you firsthand that thorough and  accurate data is critical to delivering the best possible care for  patients. I believe it is incumbent upon us as lawmakers to take the  same approach with policymaking, especially when it comes to crafting  legislation to help care for our veterans.\n\nThe information provided…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…humanity's  redemption. The Bible has wisdom in ways you might not ever imagine.  Humanity will seek to find a book. They will seek to find a code to  live by, and I think it is incumbent upon atheists to tell us what that  should be.''\n\nCharlie Kirk earlier this year in April: ``The mechanisms of a  religious society are good for everybody. When somebody…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…and in  some cases, that driver's license automatically registers them to vote.  This is an unacceptable vulnerability in our election integrity. For  that reason, it is now incumbent on Congress to close the loophole. We  must secure the fundamental principle that voting is a right reserved  only for American citizens.\n\nThe SAVE America Act also requires…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…a seat in this Chamber, Nate took a  leap of faith and helped build a campaign from the ground up. Together,  we delivered a victory many said was impossible, defeating an incumbent  in a district with a 2-1 Democratic enrollment advantage. That race was  the foundation for everything that has followed.\n\nIn Albany, Nate served as my chief of staff and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I remember. We are unwilling to have the honest conversation  of how we deliver, where we can revolutionize the cost, where we can  adopt technology because we are in the incumbent protection business.  We protect incumbent bureaucracies and incumbent business models.\n\nIf we don't take this seriously, do you think you can have a country  that is borrowing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to be set based on neutral criteria like keeping  communities together.\n\nDistrict lines cannot be influenced by partisan considerations or  drawn to favor or disfavor any incumbent or candidate.\n\nIn one fell swoop, Gavin Newsom is blowing up all of these  constitutional principles. His unprecedented mid-decade gerrymander  tears up the map created by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…complex. You have actually got to read a lot of long articles  to try and understand what is going on. You have got to stop being  afraid, and you have got to stop protecting incumbent business models  that are terrified of having cures, solutions, better and faster ways  to do it, and the use of technology. If we get rid of that fear and  start doing what…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…personally alarmed by the growing number of threats  and attacks on public officials across the political spectrum in recent  years. While we may have our differences, it is incumbent upon us all  to make sure that disagreement never descends into violence.\n\nNow, more than ever, we must remember that we are all Americans, and  what unites us is far more…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}]