[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hold the line against any Federal Reserve nominee from Donald  Trump so long as this dark cloud hangs over the Fed.\n\nIf Senate Republicans are truly worried about the Fed's independence,  if they are worried about what chaos at the Fed means for rising  housing costs, rising borrowing costs, rising inflation, then they  ought to conduct some oversight.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…law, the raid on January 3 violates article 2(4)  of the United Nations Charter, which prohibits the threat or use of  force against the territorial integrity or political independence of  any state. The United States is bound by treaty to follow the U.N.  Charter. The Constitution makes treaties part of the ``supreme law of  the land,'' and the President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…On the mathematics of suffering.      This is how a nation bleeds:      Not on battlefields but in group homes,      Not from enemy fire but from funding gaps,      Where independence becomes too expensive,      Where institution beds cost less      Than community care.      In the halls of power,      They call this fiscal responsibility      As if responsibility…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…I sustained a cervical spinal cord injury from a       shallow water diving accident at age 20, the only thing I was       certain of was that my future aspirations and independence       were finished. I had plenty of time to think about what I had       lost as a quadriplegic during my 45-day stay in the ICU.\n\nBut as I began my rehabilitation, I learned…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…can vote. It is a country where I can fight to make the  difference so that it can live up to these great ideals expressed in  these great documents, the Declaration of Independence, the  Constitution.\n\nI am going to fight to maintain the right to fight. That is what this  is all about. Not fighting in the sense that I am going to go out and  harm someone,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…and ensuring all of us can have our       day in court. This commitment to the Constitution and the       rule of law requires that lawyers be able to operate with       independence, without fear of retaliation for bringing       lawsuits in good faith, and without attempts to deter       recourse to the legal system.\n\nWe write to you, as the nation's…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…manufacture of these cables  matter not just for economic development but will matter in any  conflict.\n\nThe United States, with allies and partners, must maintain strategic  independence and should seek to become the primary source of this  critical infrastructure. This bill will force the Bureau of Industry  and Security to provide a study along these lines,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694820/undersea-cable-control-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…part of a team. And the VA thrives on teamwork.\n\nAs things stand, 30,000 VA employees will lose their jobs. That is  not what America should be tolerating or celebrating on Independence  Day and this time in our Nation's history.\n\nMr. BLUMENTHAL. Mr. President, I ask that the scheduled vote be  commenced immediately.", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…only for cause by the Mayor, subject to the  approval of two-thirds of the Council and a 30-day congressional review  and comment period. This bill would help maintain the independence of  the CFO by establishing a permanent floor on the CFO's pay and by  prohibiting the Council from reducing the CFO's pay during the CFO's  term.\n\nAlthough the D.C. CFO…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…release statements denying the existence of       any collusion with Russia (both refused).\n\nPresident Trump also tried to punish or purge agencies that       acted with independence. Most prominently, he dismissed Comey       after it became clear that Comey could not be pressured into       protecting the administration and was expanding its Russia…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…side of the President's cronies. They are threatening American cities  with war and violence. They are attacking civil society, journalists,  and public servants who show independence or speak freely.\n\nThey are censoring media because someone dares to question or make a  joke about the President. They are snatching people off the streets  with masked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…President's job. That is what he says he is going to do. Now, the  President does have responsibility for America's security, and so does  Congress, to assure our energy independence, but he is shortchanging  many programs across the Federal establishment that would make energy  independence in perpetuity a reality.\n\nOur energy portfolio domestically…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…connected, decide who represents us, and we can have a politics that  restores and grows trust rather than actively degrades.\n\nThis year is the 250th anniversary of the independence of our Nation.  We will be referencing that a lot in this Chamber because this is our  moment to free Americans from the influence of Big Money and to give  them back their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…it less, the  billionaires in America.\n\nThis is shameful. It is a fraud, and it is a shame.\n\nWhen President Johnson signed Medicare and Medicaid into law, he  traveled to Independence, Missouri, to be in the presence of former  President Truman who had worked on this when he was President, but it  came to fruition under President Johnson. President Johnson…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…between life and death. I am healthy today  because Medicaid stood by me. I am thriving because I have had  consistent, reliable access to the care I need.\n\nMedicaid makes independence possible. It makes survival possible. It  makes dignity possible. Any threat to Medicaid is a threat to our  lives.\n\nThe Republican budget is a threat to millions of lives.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690849/keep-your-hands-off-medicaid"}, {"senator": "French Hill", "party": "Republican", "sentence": "…covered families that participated in the pilot program,       which shall evaluate the effectiveness of the pilot program       in assisting families to achieve economic independence and       self-sufficiency, and the impact coaching and supportive       services, or the lack thereof, had on individual incomes.\n\n``(k) Waivers.--The Secretary may, upon…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…an element of the arts. In our account, we also provided  funds for America250. We recognize the importance of the 250th  anniversary of the signing of the Declaration of Independence and the  founding of our Nation. We want this to be an anniversary that really  brings us together, that celebrates the best of our Nation and reminds  us that we are just…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…positive for the people of Lebanon.\n\nWith the courageous patriots such as Ahmed Albasheer in Iraq, the  people of Iraq will free themselves from Iranian domination for  independence, achieving stability with prosperity.\n\nDictators around the world are losing in the war of dictators with  rule of gun invading democracies with rule of law. War criminal…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…counseling, legal advocacy, life skills training, job  readiness programs, and educational opportunities. This comprehensive  support system has allowed victims to heal, regain independence, and  lead successful lives beyond the trauma of trafficking. The impact  Laurie has made is visible not only in the numbers but in the  individual success stories of survivors…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "French Hill", "party": "Republican", "sentence": "…encourage all of our citizens to participate in America's 250th  birthday in this year of 2026 as we celebrate on July Fourth the  signing and publication of our Declaration of Independence from July  Fourth, 1776.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…General Motors about increasing its  production in the Fort Wayne truck plant.\n\nHe has brought gas prices to their lowest point since 2021 by  unleashing American energy independence.\n\nOutside of the economic impacts that have saved money for everyday  Americans, President Trump has kept his commitment to protect American  children and families by halting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…moment when, as our  Founders who wrote the Federalist Papers dreamed, my colleagues in the  Senate will show their loyalty to the role, to the check and balance,  to the independence of the Senate, more than they will show their  loyalty to their party and their President and demand an answer, an  apology, and a different path forward? Or is this a moment…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…outreach.\n\nOver the past 25 years, Place of Hope has served more than 150,000  children, youth, and families--offering safe homes, educational  opportunities, and pathways to independence. Their programs keep  siblings together, provide refuge for trafficking survivors, and  distribute more than two million pounds of food to families in crisis.\n\nI commend…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Mobilizing and Enhancing       Georgia's Options for Building Accountability, Resilience,       and Independence Act'' or the ``MEGOBARI Act''.       SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) Appropriate congressional committees.--The term       ``appropriate congressional committees''…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…help children through  tutoring, mentoring, and sometimes providing classroom support to  teachers. These grandparents have the ability to help young people in  need learn independence, self-confidence, and social skills.\n\nMr. Speaker, many of us have fond memories of our own grandparents,  and I am glad that for the past 60 years the foster grandparent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695216/recognizing-americorps-seniors-foster-grandparent-program"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…States.\n\nFounded in 2019, this program embodies the values of leadership,  teamwork, positivity, and integrity, helping student athletes build  confidence, discipline, and independence both on and off the court.  These athletes balance the same rigorous demands as all EWU varsity  players--classes, practices, study sessions, travel, and competition-- all…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…National Pennsylvania Day, honoring the Commonwealth's  crucial role in the founding and continuing success of our great  Nation.\n\nFrom the signing of the Declaration of Independence in Independence  Hall in Philadelphia to the Battle of Gettysburg during the Civil War,  Pennsylvania has always been at the center of American progress as we  strive to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…unleashing domestic oil, natural gas, and nuclear energy production.  H.R. 1 lowers energy costs, ensuring reliable and stable energy  sources. H.R. 1 renews not just energy independence but makes us energy  dominant once again.\n\nFinally, H.R. 1 restores fiscal sanity by cutting almost $2 trillion  in Federal spending. It rescinds billions in green new scam…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Memorial read,  ``Sebago Honors Her Men and Women Who Served in the Wars of Their  Country.'' From the valiant service of Captain Flint and his troops in  securing American's independence to the patriots of today, Sebago  honors her people's history.\n\nThe celebration of Sebago's 200th anniversary is not merely about the  passage of time. It is about human…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the new deduction, you are not going to pay any tax on Social  Security benefits.\n\nBut wait, there is more, Mr. Speaker. We have unleashed American  energy, restored our independence, and brought down costs at the pump.\n\nDo you know why we don't hear why eggs cost so much anymore, Mr.  Speaker? Because they don't. Thank you, President Trump.\n\nWe have…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}]