[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Now, DHS does not publicly release who is getting enhanced screening  or where it may be happening right now, simply because: First, merely  being singled out for enhanced screening does not necessarily mean an  individual poses a threat or has done something illegal; and, second,  doing so would let bad actors know who DHS is on the lookout for.", "title": "Special Interest Alien Reporting Act of 2025", "date": "2025-06-26"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "This added cost is money that many individuals and families simply  don't have.", "title": "Healthcare", "date": "2025-10-28"}, {"senator": "John Larson", "party": "Democrat", "sentence": "Madam Speaker, this Saturday, November 22,  will mark 62 years since we lost a President of the United States, a  person who gave so much to his Nation, an individual who was taken from  us in the summer of his years.", "title": "Saluting the Life of John Fitzgerald Kennedy", "date": "2025-11-20"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "El Salvador immediately sent back a  Nicaraguan individual, and they sent back women--yes, Trump tried to  disappear women to their all-male torture prison in El Salvador.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Six individual lives, connected to their coworkers through service,  connected to their families through love, connected to our community  through their work to make our infrastructure stronger--1 year later,  we remember their loss.", "title": "-9999", "date": "2025-03-25"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "This bill would add a new stipulation that disqualifies public  schools from receiving Federal funds under the Elementary and Secondary  Education Act if the school receives contributions, materials, or other  resources from China or an individual or entity acting directly or  indirectly on behalf of the Government of the People's Republic of  China.", "title": "Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act", "date": "2025-12-04"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "As a governing body and as a nation, our individual and  collective character is being measured and tested.", "title": "Takeover of Greenland", "date": "2026-01-22"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "When you talk about reliability, it isn't a description of an  individual generator, but rather it is an attribute that applies to the  entire grid across the country.", "title": "Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act", "date": null}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "My parents understood how important a good education is not only to  individual opportunity, but to a thriving, healthy economy, community,  and democracy.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Once somebody you have made an  agreement with breaks their end of the bargain, are you going to make a  second bargain with that same individual, knowing that they bailed on  the first deal?", "title": "Rescissions Act of 2025", "date": "2025-07-15"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Speaker, in a world where local news services-- newspapers and radio stations--are disappearing on a frightening level,  it is important to recognize and salute those organizations that are  continuing to provide information about our localities, the lives and  times of the individuals of our communities.", "title": "Recognizing Co-Op City Times", "date": "2026-01-07"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Supreme Court, in the case of one of these individuals who  it admits was deported by mistake--and there are many others similarly  situated--is defying an order of the Supreme Court.", "title": "Motion to Discharge--S. Res. 195", "date": "2025-05-15"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "I'm committed to working to ensure that every individual, regardless  of how rare their disease may be, has access to the therapies they need  to lead healthier, fuller lives.", "title": "Recognizing International Plasma Awareness Week 2025", "date": "2025-10-03"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "When you read it all, almost  every proposal the left has given us, if you add it up--so raise the  estate tax, raise investment taxes, raise corporate taxes, raise  individual income taxes, by the time you are done, you might pick up  another 0.5 of GDP in taxes for the U.S.", "title": "Math Always Wins", "date": "2025-06-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Because much of it is extending current tax policy--what  we get today--instead of what is in the law, where just individual  taxes go up--what?--$3.1 trillion over the next 10 years, and add in  the passthroughs to small businesses and those things, add in another  several hundred billion dollars.", "title": "Actual Solutions", "date": "2025-06-03"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "He completed basic training at Fort Jackson, South Carolina, followed  by Advanced Individual Training at Fort Lee, Virginia, where he trained  as an Automated Logistics Specialist (92A).", "title": "Recognizing United States Army Master Sergeant Tommy J. King As September 2025 Veteran of the Month", "date": null}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating  shelters for 5,800 individuals and 1,315 animals--an extraordinary feat  of operational precision and compassion.", "title": "Recognizing Fernando Serrano", "date": "2025-05-05"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Specifically, it amends the National Voter  Registration Act to require States to obtain proof of citizenship when  an individual registers to vote.", "title": "Safeguard American Voter Eligibility Act", "date": "2025-04-10"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "When they go there, the  individual is deceased.", "title": "Providing for Consideration of H.R. Support for Patients and Communities Reauthorization Act of Providing for Consideration of H.R. Save Sba From Sanctuary Cities Act of Providing for Consideration of H.R. American Entrepreneurs First Act of and Providing for Consideration of H.R. Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-04"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Individual district judges who don't even have authority over any of  the other 92 district courts are singlehandedly vetoing policies the  American people elected President Trump to implement.", "title": "-9999", "date": "2025-03-31"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Special recognition goes to individual champions Connor Wilkes,  Landon Cairns, and Aspen Thompson, as well as the championship relay  teams.", "title": "Congratulating Glenvar High School Boys' Swim Team", "date": "2025-04-08"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "825) to prohibit individuals convicted of  defrauding the Government from receiving any assistance from the Small  Business Administration, and for other purposes.", "title": "Assisting Small Businesses Not Fraudsters Act", "date": "2025-02-24"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "Speaker, that we are  individually trading stocks.", "title": "The First 100 Days", "date": "2025-04-30"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "The data is being used to develop a social credit  system that rewards or punishes individuals based on their spending  behavior.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "Look, any of these individual achievements would be historic  victories for a Republican Congress or any Congress, and today, we are  delivering on all of them in one big, beautiful bill.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "22) to amend       the National Voter Registration Act of 1993 to require proof       of United States citizenship to register an individual to       vote in elections for Federal office, and for other purposes.", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-01"}]