[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…getting enhanced screening  or where it may be happening right now, simply because: First, merely  being singled out for enhanced screening does not necessarily mean an  individual poses a threat or has done something illegal; and, second,  doing so would let bad actors know who DHS is on the lookout for. That  information, in other words, is law-enforcement…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…health care professional, the parents of such       student, a school nurse, relevant related services personnel,       and other relevant school personnel; and\n\n(II) an individual who is assigned by a public school to       oversee and manage the recovery of such student;\n\n(ii) providing appropriate academic accommodations aimed at       progressively…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…bluntly, these rates will not just impact people enrolled in the  ACA marketplace. If Republicans have their way, the entire healthcare  system will feel the effects, and every individual trying to receive  care, regardless of what kind of insurance they have, will be impacted.  The ripple effect is coming to you. Even if you don't have an ACA plan,  even…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…of Connecticut. Madam Speaker, this Saturday, November 22,  will mark 62 years since we lost a President of the United States, a  person who gave so much to his Nation, an individual who was taken from  us in the summer of his years.\n\nHis daughter, Caroline, back in 2017 gave us these buttons, pins,  that I proudly wear. It is an image of President John…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697104/saluting-the-life-of-john-fitzgerald-kennedy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…of people sent there wrongly.\n\nHere is the thing: El Salvador has already sent back people that  Trump tried to disappear. El Salvador immediately sent back a  Nicaraguan individual, and they sent back women--yes, Trump tried to  disappear women to their all-male torture prison in El Salvador. If  anyone wants to try and pretend this was some careful…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…He was only 26 years old.\n\nCarlos came from Mexico, seeking a better life, and was willing to  work hard for it. He was only 24 years old--taken from us far too soon.\n\nSix individual lives, connected to their coworkers through service,  connected to their families through love, connected to our community  through their work to make our infrastructure…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…schools from receiving Federal funds under the Elementary and Secondary  Education Act if the school receives contributions, materials, or other  resources from China or an individual or entity acting directly or  indirectly on behalf of the Government of the People's Republic of  China.\n\nThe bill gives no guidance on what ``acting directly or indirectly…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…they stand at times of challenge and  controversy.\n\nThis is one of the most turbulent and divided times in our Nation's  history. As a governing body and as a nation, our individual and  collective character is being measured and tested. We must not fail  that test.\n\nAmerica must show the world that we truly are a nation built not on  hostility but on…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699297/takeover-of-greenland"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…neutrality, what  you are going to do? You are going to stifle American innovation and  entrepreneurship.\n\nWhen you talk about reliability, it isn't a description of an  individual generator, but rather it is an attribute that applies to the  entire grid across the country. It is not a given that additional  dispatchable resources aid reliability themselves.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to work to ensure that children like her  have the support they need to go to and graduate college.\n\nMy parents understood how important a good education is not only to  individual opportunity, but to a thriving, healthy economy, community,  and democracy. Like my grandparents and great-grandparents before them,  they dedicated their lives to ensuring…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…it  has a huge impact going forward. Once somebody you have made an  agreement with breaks their end of the bargain, are you going to make a  second bargain with that same individual, knowing that they bailed on  the first deal? The answer is probably not.\n\nSo how will we come together and continue what we did a year ago--11  out of 12 bills passing out…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…concluded that an Internal       Revenue Service (IRS) announcement that it would verify       health insurance coverage requirements at the time taxpayers       filed their individual tax returns rather than after their       returns were accepted did not constitute a rule relating to       agency management or personnel because the announcement did…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to The American Legion post and every  other group in between.\n\nThe Co-op City Times provides weekly news, free of charge, that  covers the events and information of the individual building  organizations, local arts and performances, and the churches and houses  of worship and all of their events, and they spotlight the persons and  the personalities…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698631/recognizing-co-op-city-times"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…deported, El Salvador--this now goes back a year--has a track record of  imprisoning individuals--innocent individuals. The last thing any of us  should want is an innocent individual in prison, especially if that  innocent individual is an American.\n\nBut this is the punch line: The President has indicated that this is  not just for those who are here…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…awareness of the importance of plasma-derived  therapies this week, and work to improve access to these unique  biologic products.\n\nI'm committed to working to ensure that every individual, regardless  of how rare their disease may be, has access to the therapies they need  to lead healthier, fuller lives.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…service (as defined in section       6001 of the Middle Class Tax Relief and Job Creation Act of       2012 (47 U.S.C. 1401)).\n\n(7) Person.--The term ``person'' means an individual or       entity.\n\n(8) United states person.--The term ``United States       person'' means--\n\n(A) an individual who is a United States citizen or an       alien lawfully…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the transplantation or transfusion of a donated human organ       into the body of another human for the purpose of treating a       medical condition.\n\n(6) Qualified individual.--The term ``qualified       individual'' means an individual who, with or without a       support network, provision of auxiliary aids and services, or       reasonable…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…parties to the litigation and, in many cases, may not favor the  outcome and would not have been willing plaintiffs.\n\nThis undermines the system of government. It empowers individual,  unelected judges to dictate national policy and to thwart the  Constitution to take rights reserved to Congress and the President of  the United States.\n\nNORRA, the No…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…honor hardworking families by pursuing the bad actors with  a vengeance. Stewardship is our sacred responsibility.\n\nWe just found out about a case in my own district where an individual  was collecting her dead mother's Social Security checks for 3 years.  Her blatant fraud was finally discovered, and she was sentenced and  ordered to repay $25,000 in restitution.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…fire, he immediately sprang  into action.\n\nWithout hesitation, he secured a ladder, climbed to the window the  resident was attempting to escape from, and calmly coached the  individual to safety. His quick thinking, bravery, and selfless action  helped save a life from what would have been a tragedy.\n\nChief Hyman joined the Ramapo Police Department in 1989…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…strategy for APTC.\n\nTo perform covert testing of federal Marketplace enrollment       controls, we created 20 fictitious identities and submitted       applications for individual health care coverage in the       federal Marketplace. We submitted applications for four of       these fictitious identities in October 2024 for coverage       through…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…are Hope,  JaSea, Gabrielle, Nateo, and Kalvin, and they excelled under the  leadership of their dedicated teacher, Mr. Gosney. Their success is a  testament to both their individual talents and the support and guidance  that they received.\n\nI am immensely proud to have such bright and committed leaders  representing Utah's Third District. Their achievement…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692339/recognizing-the-capitol-hill-challenge"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise to recognize an exceptional  individual from my district, Lieutenant William Moffett of the  Buckingham Township Police Department. Today, I proudly commend him on  his well-earned retirement, following decades…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Mr. Speaker, that we are  individually trading stocks. Everybody ought to do like I do and have  my buddy, Tommy Seiler, manage my portfolio of $11,000. I do not trade  any individual stocks. It is all a mutual fund.\n\nPresident Trump said if Congress passed a bill banning stock trading  for Members of this body, he would sign it. I say let's give him that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…TITLE III--SHIPPING AND NAVIGATION                  Subtitle A--Merchant Mariner Credentials  Sec. 301. Merchant mariner credentialing. Sec. 302. Nonoperating individual.                         Subtitle B--Vessel Safety  Sec. 311. Grossly negligent operations of a vessel. Sec. 312. Performance driven examination schedule. Sec. 313. Fishing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Organisation of Islamic Cooperation and       United States Strategic Dialogue to address Uyghur rights,       working with the Organisation of Islamic Cooperation       individual member states to develop and implement joint       initiatives and programs aimed at promoting awareness of       Uyghur rights, and support Uyghur victims of detainment,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…reasons for such extension.\n\n``(D) Consolidated reports.--A Federal banking agency may       consolidate multiple reports required under this paragraph so       long as the individual reports being consolidated all meet       the timing requirements under this paragraph.\n\n``(E) Rule of construction.--Nothing in this paragraph or       reports or materials…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I rise today to honor a truly remarkable  individual, Phil Ginn, whose unwavering commitment to his community has  been an inspiration to all of us who know him.\n\nHis lifetime of service to his family, to his faith, and to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…showing the  proposals saying to take everyone over $400,000 and just raise the cap,  so every billionaire pays their full Social Security, both the  employer's side and the individual's side.\n\nI think our math says that it only took care of 38 percent of the  shortfall, helping folks to understand the scale and also the  rhetorical solutions that are so…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…They have earned, and truly deserve, the utmost  gratitude and esteem of students, parents, and community members.''\n\nIt is in that spirit that I rise today and recognize 15 individual  teachers from throughout California's Third Congressional District for  their exceptional dedication to their roles, students, schools, and  communities.\n\nWhile representing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]