[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…resolution ``calls on the president''       to take major steps toward sanity, none of which Joe Biden       chose to take and none of which Donald Trump shows any       indication of taking.\n\nLooking at the names on the nonbinding resolution, a reason       for discouragement is that only 10 percent of House Democrats       and not a single Republican…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…their profits.\n\nInstead of standing with workers, they weakened rules on overtime,  rolled back safety standards, and gutted protections for wage theft. If  you want any indication where the current President stands on the  Department of Labor and American workers, all you have to do is walk  down the street and you will see a three-story picture, not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…into the Treasury by  simply having Medicare or Medicaid--have some cuts into these two  programs, these two healthcare programs.\n\nThis can be done because there has been an indication in this House  that some $880 billion will be cut or should be cut or attempted to be  cut--I am going to fight it--from the committee that has jurisdiction  over Medicaid…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…I will talk more about the two that are following, but the same is  true: They are not helpful to Americans. They are going to increase  energy prices. They are another indication that the Trump  administration and House Republicans don't care at all about the  increased costs of energy for the American consumer.\n\nMr. PALLONE. Mr. Speaker, on that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…research powerhouse that earns hundreds of millions of dollars  of NIH grants annually has had its accounts frozen by the NIH for the  past 6 weeks.\n\nThis chart gives you an indication of what this freeze in funding  means. Take a look at the numbers for funding for competitive grants  and medical research: President Biden, first term President Trump,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…he said it.\n\nNow, the President didn't come out and say, I am not going to honor  due process, no. He has said what a reasonable and prudent person can  conclude as his indication of not going to honor due process of the  law, which is something the Constitution requires if you are going to  take life, liberty, or property from a person. A person has…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the courts have to agree.\n\nHe doesn't believe in due process of the law. He would have people be  picked up on the streets and taken off to some distant place without  any indication as to where they are, such that family members can  understand that they are at least okay.\n\nHe is a reckless, ruthless President, and what he is doing at the top  has influenced…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700176/state-of-our-union-is-fragile"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…and working people the hardest.\n\nAt Our Daily Bread, a food bank in Middletown, they are now serving  240 meals a day, up from just 200 a few months ago. This is a clear  indication of how my neighbors are being squeezed by rising prices.\n\nDelaware families are being hit from every direction--by inflation,  yes, but also by policies coming out of the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…emergency, the law requires the President to seek  Congress's approval within a 60-day window to continue action. In this  circumstance, that window closed on Monday with zero indication that  this White House will stop taking military action even without having a  clear, legal basis to continue.\n\nThey first recognized the legal parameters of the War Powers…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…talking about for long-term gains, well, honestly, in the short run,  these businesses are going--they are going under, the small businesses.  And there may be some posthumous indication of the President's theory  about these tariffs, 2 years, 3 years, 5 years from now. That won't  really do these small businesses any good.\n\nSo let the big businesses fight…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the United States of America?\n\nThe answer will be better explained when the Articles of Impeachment  are presented. However, I do believe that it is necessary to give some  indication today and possibly at a later time as to why this is so  important, why would I do such a thing.\n\nMr. Speaker, I agree with Vice President Dick Cheney. I agree with  him.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…did not speak  English but brought three children on a boat from Germany to Baltimore  and ultimately to Illinois, where I grew up and my mother spent her  life. It was an indication of the American dream, as far as I am  concerned. Her son not only got a government job but was elected to the  Senate, so good things happen.\n\nBut I think it is a story…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…children  had these surgeries, mainly between 2019 and 2023, in mainly blue  States.\n\nHere on PBMs, it says that puberty blockers have not been approved by  the FDA for the indication of gender dysphoria, and they are off-label  uses. So these are not safe uses in many cases of these transitions.\n\nMadam Speaker, I yield 2 minutes to the gentlewoman from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…streets in defense of the future and soul of  their nation. They drape themselves in the flags of the United States  and carry posters of our President, Donald Trump, as an indication of  their love and affection for freedom and democracy.\n\nTheir will is clear: They will not allow the illegal regime of  corrupt Bidzina Ivanishvili to drive their country…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…cities and towns, over the last few days.\n\nThe President went on to suggest that Putin may not actually be  trying to stop the war. I agree with President Trump. There is no  indication he is trying to stop the war. Vladimir Putin is making a  grave mistake in stringing the President of the United States and the  rest of the world along while innocent lives…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…360cc) is amended--\n\n(1) in subsection (a), in the matter following paragraph       (2), by striking ``same disease or condition'' and inserting       ``same approved use or indication within such rare disease or       condition'';\n\n(2) in subsection (b)--\n\n(A) in the matter preceding paragraph (1), by striking       ``same rare disease or condition'' and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…private-sector innovation in this Nation, is actually  Congressman  Jim Himes' white paper that he shared with me years ago. I  thought it was well-written, and it was another indication that this  was not the direction to go in.\n\nSince that time, I have visited with other central banks around the  world, in Europe and other places, that make me even more…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that  they were caught after they voted. That is the problem.\n\nThe core issue here is a very simple one. We all agree Americans  overwhelmingly believe by polls and by all indication that only  American citizens should vote in American elections. We currently have  a problem. We even have problems where noncitizens sometimes don't know  they are doing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]