[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…couldn't be happier to stand here and support this  bill along with my amazing colleagues, Representative LaLota and  Representative Morrison.\n\nMr. Speaker, I recognize the indispensable role in enhancing  collaboration between the Small Business Administration and the  Department of Energy, all in the name of improving research and  development efforts.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…interests. Shortly after,  the New England Council was founded as a nonpartisan and nonprofit  entity to facilitate this work. For 100 years now, the council has been  an indispensable partner advocating for the New England region.\n\nThe New England States--our economies, culture, and interests--have  been interconnected since before the founding of our…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…excellent in every field and endeavor than those pursued  by Rob and Michele Reiner.\n\nRob was creative, funny, and beloved. Michele, successful in her own  right, was an indispensable partner, intellectual resource, and loving  wife.\n\nPersonally, Rob and Michele were, first and foremost, very loving  parents. Rob cared deeply about people and demonstrated…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…president for government relations.  During her tenure at Cornerstones, she has guided the nonprofit through  a period of remarkable growth and strengthened its role as an  indispensable resource for our region.\n\nHer leadership has been defined by a deep commitment to social  justice, equity, and collaboration. She played an instrumental role in  expanding…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…devastating storm in our State's history. We lost over  100 lives, and countless communities were changed forever.\n\nIn the immediate aftermath of Hurricane Helene, FEMA provided  indispensable support to save lives, clear debris, and house families  who lost everything.\n\nAs hurricane season begins, it is a disgrace that Donald Trump and  his administration are…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693055/president-trumps-proposal-to-eliminate-fema"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…we take away a lifeline that millions of Americans  rely on?\n\nThis past weekend, I visited Christ the King Lutheran Church in Cary,  North Carolina, where I saw firsthand indispensable work to combat food  insecurity in our own community.\n\nRepublicans have abandoned vulnerable, hungry people to pay for tax  cuts for billionaires. It is shameful and un-American.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693584/condemning-republicans-big-ugly-law"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…pivotal role in strengthening Jewish life  and fostering a culture of generosity and community-mindedness. His  decades of service and thoughtful leadership have made him an  indispensable figure in our region.\n\nDuring Jewish American Heritage Month, it is my great privilege to  recognize Nick Robfogel. His legacy of philanthropy, wisdom, and  community-building…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691612/recognizing-nick-robfogel"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…farewell  to my floor director, the incomparable Ray Salazar.\n\nIf you have had the privilege of serving in this Chamber, you know  what a gem, what a patriot, and what an indispensable pillar of this  institution Ray is. You also know what a reliable friend and adviser he  is, and you know what a loss his departure will be for the House of  Representatives.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699262/farewell-ray-salazar"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…ability to perform the functions they were  created to perform--it doesn't exist anymore.''\n\nEmployees in the headquarters for the agencies located in the NCR  perform the indispensable work of keeping Congress informed of agency  activities. Congress cannot write laws or conduct oversight without the  critical information provided by agencies.\n\nI urge…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…on the committee. Phil  joined the committee staff in 2009 and has been the Democratic lead for  the Seapower and Projection Forces Subcommittee since 2011. He has made  indispensable contributions to the committee's work and the security of  our Nation, spearheading reforms to improve safety, readiness, and  effectiveness of naval forces; laying the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…to Miller, Fresh Air has become a tremendous  success, with two Peabody Awards under its belt and recognition as one  of TIME Magazine's top 100 podcasts ever. Miller's indispensable  relationship with Terry Gross, the show's host, has laid the foundation  for Fresh Air 's characteristic sound and production style, enabling  the program to reach its…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…access to justice nationwide.\n\nMr. Speaker, I urge my colleagues to join me in recognizing Court  Reporting and Captioning Week and in thanking these professionals for  their indispensable service to our court system and the rule of law.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…for America showing up in  the world, not just with tanks and guns but with food and lifesaving  care and economic assistance. And we do that not just because we are  the indispensable Nation and that is the right and moral thing to do-- although that would be enough--but also because projecting power in all  of its forms is smart, it is strategic, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…programs on timely  topics, and moderating public candidate debates in a nonpartisan  manner.\n\nIn my home county, we have a number of local leagues, and their  leadership is indispensable to ensuring good civic participation at  every level of government.\n\nLet me recognize: New Rochelle, Joan Alexander; Larchmont-Mamaroneck,  Louise Perez and Beth Radow;…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692778/recognizing-league-of-women-voters-leadership"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…derives from the East supplies requisite to its growth and  comfort--and what is perhaps of still greater consequence, it must of  necessity owe the secure enjoyment of indispensable outlets for its own  productions to the weight, influence, and the future maritime strength  of the Atlantic side of the Union, directed by an indissoluble  community of…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a comerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…constituent on the other end  of the phone who just needed help. That balance--the human side of  governance, paired with professional excellence--is rare. That is what  made her indispensable.\n\nIn moments of pressure, she was unflappable. In moments of  disagreement, she brought thoughtfulness. In moments of decision, she  was always guided by principle.\n\nI…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…systems that relied on       philosophical or speculative reasoning.\n\nTruth derives from the wisdom developed through the fear of       the Lord and wisdom and truth are indispensable in our       pursuit of virtue. How may we obtain these treasures of the       Holy Spirit? Of course, through prayer, reading Scripture,       attending church and fellowshipping…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…diligence and precision.\n\nWhile working in my office, Michael also earned his master's degree  in national security policy studies. He quickly established himself as  an indispensable asset. I have often said that a good Member can become  a great Member with a great team, and Michael proved that every single  day in my office.\n\nMichael played an essential…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Mr. CALVERT. Mr. Chair, I yield back the balance of my time.\n\nMr. CALVERT. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CALVERT. Mr. Chair, Jordan remains an indispensable ally in an  extremely dangerous region. Our partnership with the Kingdom of Jordan  is critical both to the regional and U.S. national security.\n\nWe must continue to ensure…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. ``To the efficacy and permanency of your Union, a  government for the whole is indispensable. No alliances, however  strict, between the parts can be an adequate substitute. They must  inevitably experience the infractions and interruptions which all  alliances…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…exceptional results for the constituents I represent.\n\nMajor Hanson entered my office with critical knowledge and experience  from his distinguished Air Force career, which was indispensable in  advancing my legislative priorities across the House Armed Services,  Intelligence, and Foreign Affairs Committees. In 2013, Evan  commissioned as a Logistics Readiness…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…women who respond to more than 22 million emergencies each year.\n\nMr. Speaker, passing the EMS Counts Act is a decisive step toward  recognizing and strengthening this indispensable part of our public  safety infrastructure. I urge my colleagues to join me in support.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693039/supporting-our-first-responders"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the jobs lost in the  downstream communities that rely on the [Powder River Basin] coal.''\n\nEnergy security is national security, and Wyoming's energy industry  remains indispensable to ensuring that America stays energy dominant.  Wyoming's Powder River Basin, with its low-sulfur coal, produces the  world's cleanest burning coal. We should be focused…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…to my hectic  schedule. We would not be here without them.\n\nI thank the families and fans who came to cheer us on for being with  us throughout it all. They were truly an indispensable part of our  remarkable season.\n\nThe team should enjoy this championship. They earned it.\n\nNow, on to nationals representing Arizona. Let's go get it.                 Congratulating…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…of American leadership in the global  fight for freedom and democracy. Ms. Boyajian's stewardship has upheld  and enhanced this legacy, positioning the institution as an  indispensable force in countering authoritarianism and fostering  democratic renewal worldwide.\n\nHer leadership and commitment will be missed greatly at Freedom  House, as her mark of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Communist Party continues to threaten, pressure, and  attempt to isolate Taiwan. These actions are unacceptable. The people  of Taiwan have earned their place as a respected and indispensable part  of the global economy.\n\nHere in the Senate, we understand the gravity of the challenge. The  world is more dangerous today than at any point since World War II, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…today with my  colleagues to lead the House of Representatives in reading President  George Washington's farewell address.\n\nHaving just celebrated the 294th birthday of our indispensable first  President, this is a fitting tribute as we celebrate the 250th year of  our Nation's creation.\n\nThe farewell address is a remarkable document. Published in the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}]