[{"senator": "Greg Casar", "party": "Democrat", "sentence": "…physical assault;\n\nWhereas, in August 2024, the Office of Congressional Conduct adopted  and transmitted to the Committee on Ethics of the House of  Representatives a report indicating that there was substantial reason  to believe that Representative Cory Mills may have omitted or  misrepresented required information in his financial disclosure  statements,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Israel achieved its goal  of destroying the military capabilities and existential threat of Hamas  months ago. Now, Prime Minister Netanyahu should be proclaiming victory  and indicating his readiness to withdraw from Gaza contingent on the  return of all the hostages, both living and dead.\n\nHe should be signaling his willingness to support an international…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Race-Based Congressional  Districts Texas-09, Texas-18, Texas-29, and Texas-33.''\n\nIt references unconstitutional race-based districts. This letter,  dated July 7, has language indicating that if the State of Texas fails  to rectify the racial gerrymandering of Texas-09, Texas-18, Texas-29,  and Texas-33, the attorney general reserves the right to seek legal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…really just yelling ``fraud'' as a cover for  the real agenda, which is to privatize Social Security.\n\nTrump's Treasury Secretary, Mr. Bessent, recently blew their cover by  indicating that the big, ugly bill about which Republicans have been so  gleeful is really a ``back door'' to privatize Social Security, a step  that will undermine the program that…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…exposed to the  public, then I don't think the Secretary of State would have come to  the same conclusion.\n\nThe Secretary of State has sacrificed his honor and his dignity by  indicating that this is not classified information. But he didn't do it  without the aid and comfort of some others.\n\nLet's just talk about the other people who were on this call--pardon…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…today, we are taking additional action to address these  and future threats. H.R. 906 would require the Federal Communications  Commission to publish a list within 4 months indicating any entities  with ties to China, Russia, North Korea, and Iran that hold wireless  and undersea cable licenses that power our country's mobile and fixed  communications…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…issued that order should be impeached, you are  now moving into authoritarianism.\n\nWhen that President then sits with others in his Cabinet and they are  caught on national TV indicating why they can defy the Federal court's  orders, after having been told that they have to appeal, after having  been told that they cannot do what they have done, after having…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Times. It is styled: Growing leftwing  violence blamed for deadly shooting.\n\nMr. Speaker, I wish to address violence. I wish to address violence,  and I wish to start by indicating that, yesterday, I published a tweet.  This tweet, Mr. Speaker, indicated, in essence, that this is the time  for all persons of good will to take a stand against violence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…the Baby Changing on Board Act.  This bill requires Amtrak to install baby changing stations in  accessible bathrooms on new passenger rail cars and include clear  signage indicating the availability of changing stations. This will  ensure that parents with young children on Amtrak trains can use  accessible, safe, and comfortable changing facilities.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692157/baby-changing-on-board-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…allowed him to pardon the people who defecated in the Congress, in the  buildings.\n\nThese were the people who marched through, looking for the Vice  President at that time, indicating that they wanted to do harm to him.  President Trump pardoned these people. It seems this was his very first  act immediately after being sworn in. This is the person who…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…protect those who don't possess the proper  knowledge or information about the risks of private unregistered  securities. Mr. Hill's bill moves us in the right direction by  indicating that certain credentials, such as someone with a master's in  business administration, an MBA, or a FINRA certification, for example,  should be deemed accredited without…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Bresnahan--what a  beauty-- James Moylan, Kimberlyn King-Hinds. They all signed this  letter.\n\nThe question that many Americans have to ask right now is that, after  signing a letter indicating your commitment, Mr. Speaker, to protecting  Medicaid and SNAP and access to affordable higher education through  Pell grants, how is it possible that, Mr. Speaker, some…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…remarkable to hear the way they address  the issues.\n\nYou have developed cohorts who have all become little bullies. They  want to emulate you and your aggressive behavior in indicating what  they are going to do to people.\n\nWhat you give you shall receive. It will come back to you.\n\nThe point is, you are removing people simply because of who they are  and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…going to be marked as a seminal moment in time, a vote that  will have an impact on the rest of time because it sent a message to a  reckless, ruthless, lawless President indicating that your time in  office as a reckless, ruthless, lawless President, your days are  numbered.\n\nNo one wants to see you harmed physically, that is not the case. But  there…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…retirees diagnosed with       esophageal cancer; and\n\n(2) how often individuals covered under the Federal       Employees Health Benefits Program with medical records       indicating such individuals are high-risk for esophageal       cancer undergo screening according to the established       guidelines.\n\nMr. Speaker, the House of Representatives has…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…interest;\n\nWhereas in August 2024, the Office of Congressional Conduct further  adopted and transmitted to the Committee on Ethics of the House of  Representatives a report indicating that there was substantial reason  to believe that Representative Cory Mills may have omitted or  misrepresented required information in his financial disclosure  statements,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…colleagues will recall, the President observed last month that  Ukraine can win--the President said Ukraine can win--and unlike some of  his advisers, the American people are indicating in clear majorities  that they think we ought to help.\n\nBy one recent poll, more than 6 in 10 Americans support--support-- sending more arms and military supplies to help…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…credits that they  previously missed out upon.\n\nAdditionally, H.R. 1491 contains another provision that would prevent  disaster victims from receiving collection notices indicating that they  owe the IRS funds despite a postponement of tax filing.\n\nWhen someone suffers from a natural disaster, the last thing on their  minds is their tax liability. They…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…manufacturers will still be subjected to pollution regulations.  The EPA can always come back with an updated hazardous air pollutant  standard if they can ever get actual data indicating specific and  significant pollution. They don't have that now.\n\nMadam Speaker, I urge all Members to join me in voting in favor of  H.J. Res. 61 because it is important for…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}]