[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…food we give our kids or the medications that we  provide, but some things that we can't control as parents include the  quality of the air they breathe outside. We can't individually control  the toxic nitrogen oxides, the carbon monoxide, the sulfur dioxide, the  benzene, and particulate matter that flood into our air and into our  children's lungs.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…approach, so the SEC  adopted the current definition, which is based around income and  wealth. Today, to be an accredited investor, the investor must have a  net worth, either individually or, with spouse, exceeding $1 million  excluding the value of their home, or they must make more than $200,000  a year or $300,000 with a spouse.\n\nThose were definitions…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL.  Res. 242, S. Res.  243, S. Res. 244, and S. Res. 245; that there be up to 2 hours for  debate on each resolution, individually; and that upon the use or  yielding back of that time, the Senate vote on adoption of the  resolutions, individually; and that if any of the resolutions are  adopted, the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…utilizes the  familiar machinery of our Federal-State Government to promote the  common welfare and the economic stability of the Nation. The act does  not offer anyone, either individually or collectively, an easy life,  nor was it ever intended so to do. None of the sums of money paid out  to individuals in assistance or in insurance will spell anything…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…were returned--not because the people  weren't in town, but because the USPS computer scanning system rejected  their addresses. The situation is clearly damaging to us individually  and as a community.''\n\nWhat this bill does is it just simply says for Scotland and a number  of other communities that have been identified by the community that  basically…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this debate.\n\nDo you know what has never happened in my career? The President of  the United States coming before a joint session of Congress and  insulting Members by name individually, shouting slurs at people.\n\nI have never seen that before. Would the gentleman agree with me that  Trump deserves a censure for calling my Senator from Massachusetts a…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…under his destructive action.\n\nIn some ways, it is a little bit like the frog in the pot. The water  begins to heat without our noticing it. The acts seem benign when taken  individually, but cumulatively, they will boil and destroy our  democracy.\n\nThe President has turned the Oval Office into an auction house. He  has put a ``for sale'' sign on the White…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…investing personal capital in early-stage companies;\n\n(B) holds regular meetings and has defined processes and       procedures for making investment decisions, either       individually or among the membership of the group as a whole;       and\n\n(C) is neither associated nor affiliated with brokers,       dealers, or investment advisers.\n\n(2) Issuer.--The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Speaker, I offer my congratulations to the following outstanding  young women:\n\nAyla Abraham, Troop 6249\n\nSophia Ayer, Troop 8017\n\nAngela Brandes, Troop 4796\n\nMia Bremner, Individually Registered Member\n\nMadeline Bruss, Troop 8329\n\nAbigail Connett, Troop 4801\n\nAnissa Griffith, Troop 4633\n\nAlexandra Higbee, Troop 4569\n\nJenna Jegl, Troop 6239\n\nRayna Jellish,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690499/recognizing-gold-award-girl-scout-recipients"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…similar amounts of support. They have passed  in the past. The local communities overwhelmingly support them. It  makes sense to offer these up together. We opt to do them individually  as often as we can.\n\nBut what they want to do is what has been done in the past, is you  cuddle together a whole bunch of bills--sometimes a dozen or more,  maybe dozens…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…paying it. By the way, if you  are not getting extra money, if you are paying for it on your own, you  are still paying those higher and higher rates. If I were that person  individually insured who was not getting the subsidy when everyone else  was but my tax dollars were going to subsidize other people, I would  feel totally taken advantage of. You are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the individual packaging contained within the outer       packaging.\n\n(B) Exemption.--The following shall be exempt from the       requirements of subparagraph (A):\n\n(i) Individually packaged covered products that are       contained within outer packaging, are not intended to       dispense individual wipes, and have no retail labeling.\n\n(ii) Outer…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…policies would require legislation to prevent this kind of  government intrusion, but here we are.\n\nThe Biden administration regulated every nozzle in every American  home individually, reducing water pressure and frustrating homeowners,  all while increasing costs for compliance. Ending this rule will  permanently save Americans billions of dollars, reduce…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Housing, and Community Development sectors, among others, made  the journey to our Nation's Capital.\n\nI had the opportunity to meet with several of these business leaders  individually. We discussed how we can work together to lower  regulations, support businesses, and keep jobs in our community. Many  of these business leaders are the reason why the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695829/2025-colorado-springs-chamber-of-commerce-dc-fly-in"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the right thing in voting to open up the  government. There are a select few people that did the wrong thing in  putting language in the bill that would make themselves individually  wealthy.\n\nAll this language does is repeals that. All this does is repeals that  one provision of the law that would enrich what is now down to one  individual Member saying…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Stock Trading Act, which would level the playing field  and help restore America's faith in Congress once again.\n\nThere is no reason in the world, Mr. Speaker, that we are  individually trading stocks. Everybody ought to do like I do and have  my buddy, Tommy Seiler, manage my portfolio of $11,000. I do not trade  any individual stocks. It is all a mutual…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…For almost five decades, Congress has passed all required  annual appropriations bills only four times. So four times in 50 years  has Congress actually gone through and individually passed the  appropriations bills. As a consequence, the looting of the American  taxpayer continues.\n\nBy promising yet another so-called clean continuing resolution,  Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…level of excellence in the classroom, earning  recognition as an Academic All-State Team--a testament to their hard  work and dedication both as wrestlers and as scholars.\n\nIndividually, the Wolves had an impressive presence at the state  tournament, with nine wrestlers qualifying, six earning a place on the  podium, one claiming a State Championship title,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688924/recognizing-the-clarkston-high-school-wrestling-teams-outstanding-season"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(A) by striking ``Clark County for the connection'' and       inserting ``Clark County, the City of North Las Vegas, and       the Apex Industrial Park Owners Association, individually or       jointly as appropriate, for the connection'';\n\n(B) by striking ``Kerr-McGee Site'' and inserting ``Kerr-      McGee Site and other lands conveyed in accordance…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…granting a license or United States market access for a  geostationary orbit satellite system or a nongeostationary orbit  satellite system, or an authorization to use an individually licensed  earth station or a blanket-licensed earth station, if the license,  grant of market access, or authorization would be held or controlled by  an entity that produces…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690259/secure-space-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Government of the United States is  appropriately funded. We do it in a way that, again, as my good friend  Mr. Hoyer said, it is not the bill any of us would have written  individually, but the point is, it is a collaborative effort of give  and take that has produced something that the vast majority of us can  and will vote for today.\n\nThis is eight bills…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…overdoses, and Ohio has been particularly hard-hit by the epidemic.\n\nPrior to the temporary rescheduling in 2018, fentanyl-related  substances could only be controlled individually, allowing cartel  chemists to easily create new uncontrolled compounds. This temporary  rescheduling proved to be effective as the number of new compounds  since then has…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692347/halt-all-lethal-trafficking-of-fentanyl-act"}]