[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…independence.\n\nIn addition to overseeing the 60-plus programs ACF administers, Ms.  Barlow has also served as ACF's liaison to the Committees on  Appropriations. She has been an indispensable resource to the  Subcommittee on Labor, Health and Human Services, and Education. Her  budgetary expertise and round-the-clock responsiveness has helped the  Subcommittee…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…president for government relations.  During her tenure at Cornerstones, she has guided the nonprofit through  a period of remarkable growth and strengthened its role as an  indispensable resource for our region.\n\nHer leadership has been defined by a deep commitment to social  justice, equity, and collaboration. She played an instrumental role in  expanding…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…every agency they have touched with their invasions, freezes, and  suspensions.\n\nFederal workers have been fired then rehired as their functions were  quickly proven to be indispensable rather than nonessential. Employees  have been bombarded with weird emails that threaten them with  termination if they don't accept a sketchy buyout or snitch on their…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…pivotal role in strengthening Jewish life  and fostering a culture of generosity and community-mindedness. His  decades of service and thoughtful leadership have made him an  indispensable figure in our region.\n\nDuring Jewish American Heritage Month, it is my great privilege to  recognize Nick Robfogel. His legacy of philanthropy, wisdom, and  community-building…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691612/recognizing-nick-robfogel"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…devastating storm in our State's history. We lost over  100 lives, and countless communities were changed forever.\n\nIn the immediate aftermath of Hurricane Helene, FEMA provided  indispensable support to save lives, clear debris, and house families  who lost everything.\n\nAs hurricane season begins, it is a disgrace that Donald Trump and  his administration are…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693055/president-trumps-proposal-to-eliminate-fema"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…strengthen the foundations of our democracy. Founded during the Second  Continental Congress, even before the Declaration of Independence was  signed, the Post Office played an indispensable role in the success of  our young democracy. Not only was the Post Office crucial in  facilitating communication between American revolutionaries, it also  strengthened…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…served as the  first woman chaplain at the National Guard Bureau in Arlington,  Virginia. Her devotion to spiritual empowerment and trauma-informed  healing has made her an indispensable leader to Delaware's Army  National Guard.\n\nI look forward to seeing the work that she will continue to do in  shaping the spiritual lives of those around her.\n\nWell done,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…excellent in every field and endeavor than those pursued  by Rob and Michele Reiner.\n\nRob was creative, funny, and beloved. Michele, successful in her own  right, was an indispensable partner, intellectual resource, and loving  wife.\n\nPersonally, Rob and Michele were, first and foremost, very loving  parents. Rob cared deeply about people and demonstrated…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…of law enforcement in nations like China and Mexico.\n\nThis is just a simple fact. Tough talk has its place, but effective  diplomacy and law enforcement cooperation are indispensable.\n\nLet me be clear. Use of military force is not a viable solution.\n\nMr. Speaker, I thank my friend, Representative Barr, for his advocacy  on this important issue. Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…on the committee. Phil  joined the committee staff in 2009 and has been the Democratic lead for  the Seapower and Projection Forces Subcommittee since 2011. He has made  indispensable contributions to the committee's work and the security of  our Nation, spearheading reforms to improve safety, readiness, and  effectiveness of naval forces; laying the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…to Miller, Fresh Air has become a tremendous  success, with two Peabody Awards under its belt and recognition as one  of TIME Magazine's top 100 podcasts ever. Miller's indispensable  relationship with Terry Gross, the show's host, has laid the foundation  for Fresh Air 's characteristic sound and production style, enabling  the program to reach its…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…Congressional  Districts, we ask our colleagues to join us in congratulating these  outstanding individuals for their extraordinary volunteerism and in  recognizing the indispensable role the Area Agency on Aging of Broward  County plays in honoring and serving our older citizens.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…for America showing up in  the world, not just with tanks and guns but with food and lifesaving  care and economic assistance. And we do that not just because we are  the indispensable Nation and that is the right and moral thing to do-- although that would be enough--but also because projecting power in all  of its forms is smart, it is strategic, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…interests. Shortly after,  the New England Council was founded as a nonpartisan and nonprofit  entity to facilitate this work. For 100 years now, the council has been  an indispensable partner advocating for the New England region.\n\nThe New England States--our economies, culture, and interests--have  been interconnected since before the founding of our…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…programs on timely  topics, and moderating public candidate debates in a nonpartisan  manner.\n\nIn my home county, we have a number of local leagues, and their  leadership is indispensable to ensuring good civic participation at  every level of government.\n\nLet me recognize: New Rochelle, Joan Alexander; Larchmont-Mamaroneck,  Louise Perez and Beth Radow;…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692778/recognizing-league-of-women-voters-leadership"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…assisting with Fire  Prevention, and supporting Company Field Days and the Harvest Moon 5K.\n\nGary's guidance, leadership, and readiness to help in any capacity  have made him an indispensable member of the Wendelville Volunteer Fire  Company.\n\nMr. Speaker, I ask that the United States House of Representatives  join me in honoring Gary Braunscheidle for his remarkable…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a comerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…systems that relied on       philosophical or speculative reasoning.\n\nTruth derives from the wisdom developed through the fear of       the Lord and wisdom and truth are indispensable in our       pursuit of virtue. How may we obtain these treasures of the       Holy Spirit? Of course, through prayer, reading Scripture,       attending church and fellowshipping…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…while fostering cooperative  relationships. Her ability to work seamlessly with congressional  offices, staff, constituents, and local boards of elections has made  her an indispensable partner in addressing the needs of the community.\n\nHer dedication has been recognized through multiple awards, including  the USPS Outstanding Supervisor Award from the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…immense pride that we  honor and thank the Lakes Pilots Association for their decades of  dedicated service, commitment to safety and environmental stewardship,  and for their indispensable role in sustaining commerce and maritime  heritage throughout the Great Lakes region.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694741/recognizing-the-lakes-pilots-association-for-over-60-years-of-service-to-the-great-lakes-maritime-community"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the jobs lost in the  downstream communities that rely on the [Powder River Basin] coal.''\n\nEnergy security is national security, and Wyoming's energy industry  remains indispensable to ensuring that America stays energy dominant.  Wyoming's Powder River Basin, with its low-sulfur coal, produces the  world's cleanest burning coal. We should be focused…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…of American leadership in the global  fight for freedom and democracy. Ms. Boyajian's stewardship has upheld  and enhanced this legacy, positioning the institution as an  indispensable force in countering authoritarianism and fostering  democratic renewal worldwide.\n\nHer leadership and commitment will be missed greatly at Freedom  House, as her mark of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Communist Party continues to threaten, pressure, and  attempt to isolate Taiwan. These actions are unacceptable. The people  of Taiwan have earned their place as a respected and indispensable part  of the global economy.\n\nHere in the Senate, we understand the gravity of the challenge. The  world is more dangerous today than at any point since World War II, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Mr. CALVERT. Mr. Chair, I yield back the balance of my time.\n\nMr. CALVERT. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CALVERT. Mr. Chair, Jordan remains an indispensable ally in an  extremely dangerous region. Our partnership with the Kingdom of Jordan  is critical both to the regional and U.S. national security.\n\nWe must continue to ensure…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…exceptional results for the constituents I represent.\n\nMajor Hanson entered my office with critical knowledge and experience  from his distinguished Air Force career, which was indispensable in  advancing my legislative priorities across the House Armed Services,  Intelligence, and Foreign Affairs Committees. In 2013, Evan  commissioned as a Logistics Readiness…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…women who respond to more than 22 million emergencies each year.\n\nMr. Speaker, passing the EMS Counts Act is a decisive step toward  recognizing and strengthening this indispensable part of our public  safety infrastructure. I urge my colleagues to join me in support.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693039/supporting-our-first-responders"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…million tons of cargo each year and is  projected to exceed 210 million tons in the near future. This waterway  supports approximately 375,000 jobs.\n\nMr. WEBER of Texas. It is indispensable to America's economy and  energy security.\n\nMr. Speaker, this appropriations package delivers real results not  just for southeast Texas but for the Nation. I urge my colleagues…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698638/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]