[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…to vital educational  services. One mom said she worries about sending her two kids with  special needs to kindergarten next year if there are cuts to IDEA, the  Individuals with Disabilities Education Act.\n\nUnlike Secretary McMahon, I actually know what IDEA stands for and  what it means for students. I have been an education advocate for  decades,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Education.\n\nToday, I would like to highlight the concerns of parents who have  children living with disabilities. They are scared, concerned, and  confused.\n\nThe Individuals with Disabilities Education Act, or IDEA, is the  Federal law that ensures children with disabilities receive a free and  appropriate public education tailored to their unique learning…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…nationally.\n\nThe promise of a free and quality education is a vital part of the  American Dream. The embodiment of that promise came in 1975 when  Congress passed the Individuals with Disabilities Education Act to  ensure that children with disabilities could receive a free, fair, and  equal education.\n\nThis landmark legislation changed the lives of millions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…job in a local small business or  launching their own startup, this bill directs the SBA and the National  Council on Disability to collaborate on ways to help individuals with  disabilities do just that.\n\nBy passing this bill, we can start clearing the structural barriers  faced by people with disabilities, while growing the economy and  helping small…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, this weekend marks the 50th anniversary of  the passage of the Individuals with Disabilities Education Act. At the  time, that was a landmark piece of legislation that made sure our  children with disabilities had what they needed to succeed in the  classroom.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697177/ensuring-access-to-education-for-our-children-with-disabilities"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…children, including children with disabilities  and their families, we are demanding that Congress fulfill its promise.\n\nNearly 50 years ago, Congress passed the Individuals with  Disabilities Education Act, IDEA, with a commitment that every child,  including students with disabilities, meet their full potential in  every classroom and to ensure also…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…full-scale attack on workers with disabilities. It is  shameful.\n\nTrump's DOL is dismantling the requirement that Federal contractors  take steps to employ qualified individuals with disabilities. At a time  when disabled Americans face historic employment gaps, this  administration wants to turn back the clock and undo the progress that  we have made over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…submitted to  Congress, no concrete plan about who would take over IEPs, special  education services, and the civil rights protections that are  guaranteed by the Individuals with Disabilities Education Act. No plan.  Just empty promises from an administration that has been dead set on  cutting public education to the kids who need it most.\n\nThe Congressional…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…little bit on the importance of bringing this to  the floor and perhaps even entering into a sort of dialogue with Mrs.  Hayes about it.\n\nI am thinking that the Individuals with Disabilities Education Act  came around 50 years ago. Long before that time, people recognized that  education was a game changer for anyone.\n\nFrederick Douglass said that knowledge…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Speaker, if I were to not pay something I owed for 50 years, the  consequences would be tremendous. That is exactly what the Federal  Government has done with the IDEA, Individuals with Disabilities  Education Act.\n\nIn 1976, just a year after I was born, Congress promised to pay for  40 percent of the cost of public education for children with  disabilities.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698943/protecting-education-for-children-with-disabilities"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Speaker, as you know, Republicans dismissed that  amendment.\n\nRepresentative Houlahan and Representative Ramirez offered an  amendment, Mr. Speaker, which exempts individuals with disabilities  from having to prove eligibility for Medicaid every 6 months. That is a  burdensome red-tape requirement designed to throw people off of  Medicaid who are eligible.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Department of Education, Secretary McMahon is now  exploring additional partnerships to move the administration of special  education programs under IDEA, the Individuals with Disabilities  Education Act, to other Federal agencies. The most likely choice for  this unconstitutional and illegal transfer? It is to the Department of  Health and Human…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Hayes for her  leadership and advocacy.\n\nMr. Speaker, I rise today to speak in defense of one of the most  important civil rights laws Congress has ever passed, the Individuals  with Disabilities Education Act and to oppose the dangerous and  unlawful efforts to dismantle the Department of Education.\n\nIDEA is not a suggestion. It is not discretionary. It…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…if the student's symptoms of concussion persist for a       substantial period of time--\n\n(I) evaluating the student in accordance with section 614       of the Individuals with Disabilities Education Act (20 U.S.C.       1414) to determine whether the student is eligible for       services under part B of such Act (20 U.S.C. 1411 et seq.);       or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…this by not       cutting Medicaid benefits!!!\n\nThe next letter is from Michell in Thornton:\n\nI am writing to urge you to protect and strengthen Medicaid       for individuals with disabilities. My daughter, who was       adopted at age 10, is now 21 but has the cognitive level of a       five-year-old. She has Fragile X Syndrome, ADHD, PTSD,       anxiety,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…announce that Charlotte is with us here today in  the gallery. I recognize you, Charlotte, and thank you for all that you  do.\n\nMr. Speaker, H.R. 1520 ensures that individuals with disabilities are  not discriminated against in organ transplant eligibility. It gives  families a mechanism for timely intervention, time that oftentimes  families just don't…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Act of 2025, introduced by Representatives  McGarvey and Stauber.\n\nMr. Speaker, this legislation requires the SBA to report to Congress  on the challenges facing individuals with disabilities and what  resources or programs the SBA provides to assist them. The report will  also include legislative recommendations to address those challenges.\n\nAmerica…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691756/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…vulnerable and not on  able-bodied adults who choose not to work.\n\nWe are fighting for commonsense policies to protect America's  children, pregnant women, mothers, individuals with disabilities, and  low-income seniors.\n\nMr. Speaker, this bill delivers on the promises the President and  congressional Republicans made to the American people, and that is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…provide for a memorandum of understanding  between the Small Business Administration and the National Council on  Disability to increase employment opportunities for individuals with  disabilities, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1634\n\nBe it…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691777/thinkdifferently-about-disability-employment-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…responsibilities of service dog teams, businesses, and the community.  Merlyn Lewis exemplifies servant leadership by empowering volunteers,  the community, and individuals with disabilities to ensure safe and  unfettered access for service animal handlers. Volunteering more than  10,000 hours, Ms. Lewis has served as President of the Board and Lead…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691758/recognizing-merlyn-lewis"}, {"senator": "John James", "party": "Republican", "sentence": "Mr. JAMES. Madam Speaker, this week, on November 29, our Nation marks  a milestone, the 50th anniversary of the Individuals with Disabilities  Education Act.\n\nIn 1975, President Gerald Ford, Michigan's only and greatest  President, signed the Education for All Handicapped Children Act into  law, making…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…requirement.\n\nWhat we were trying to do in the One Big Beautiful Bill Act is ensure  that limited resources are protected for pregnant women, children,  seniors, and individuals with disabilities. That is the truth.\n\nWith reference to the CBO, the CBO has been wrong again and again. It  is on record as being wrong by more than $1 trillion. We cannot count…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…living with  Down syndrome and other disabilities have the same access to lifesaving  care that she did.\n\nUnfortunately, there have been too many instances in which  individuals with disabilities have been denied a lifesaving organ  transplant, and this is unacceptable.\n\nCongress has the opportunity to help ensure that individuals with  disabilities are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692718/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, I rise today to recognize and celebrate the  50th anniversary of the Individuals with Disabilities Education Act, or  IDEA.\n\nWe all know a strong education can unlock a lifetime of  possibilities. Yet for students with disabilities, sometimes even going  to school…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697766/50th-anniversary-of-the-individuals-with-disabilities-education-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 50th anniversary of the Individuals with Disabilities Education  Act, IDEA, which mandated that every child with a disability in America  should have access to a high-quality public education.\n\nWhen Congress passed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…to offer community-based services. This will help preserve  Medicaid for the most vulnerable populations who rely on it: pregnant  mothers, children, seniors, and individuals with disabilities and low- income families.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694200/protecting-medicaid"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…these barriers. This bill directs the Small  Business Administration and the National Council on Disability to  collaborate in providing resources and assistance to individuals with  disabilities who want to start their own business or find meaningful  employment, and it also ensures that small businesses have the guidance  they need to hire and support…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691778/thinkdifferently-about-disability-employment-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…ensure that every child, regardless of  ability, has access to a quality education that prepares them for a  full and productive life.\n\nWhen Congress passed the Individuals with Disabilities Education Act  in 1975, it was a landmark step toward educational equity. The Federal  Government pledged to cover 40 percent of the excess costs of special  education…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…(including       procedures) of such entity if such modifications are       necessary to make an organ transplant or related services       available to qualified individuals with disabilities, unless       the entity can demonstrate that making such modifications       would fundamentally alter the nature of such policies or       practices.\n\n(d) Clarifications.--…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}]