[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…mattered. It began a year ago, on day one, when the President signed an  executive order renaming Denali, the tallest mountain in Alaska and  most sacred site to multiple indigenous communities, renamed after a  President from Ohio without any consultation to the indigenous people  of Alaska.\n\nThat same day, the President signed an executive order mandating…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…subsistence  and culture depend on the caribou herd, reside along the herd's  migratory route, making any disruption not only a threat to  biodiversity but also an assault on indigenous livelihoods and  traditions.\n\nLet me read a quote from the Executive Director of the Gwich'in  Steering Committee, Kristen Moreland. She says: ``It is unthinkable  that our…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…trash,  different decade.\n\nRepublicans are invoking historical policies intended, let's be  clear, to disenfranchise Americans, especially working people, women,  students, indigenous people, and anyone who can't afford the burden of  a new bill.\n\nThe SAVE America Act is yet another Republican attempt to intimidate  and suppress the votes of anyone who…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700017/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…survey work is completed beforehand, companies still  have to comply with laws that protect shipwrecks and mitigate impacts  to sites that were once above water and home to indigenous peoples.\n\nThe rule actually promotes efficiency, something Republicans say that  the majority cares a lot about. It prevents delays and extra costs for  good actors who report…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Black history is American history,  indigenous history is American history, Latino history is American  history, and women and LGBTQ+ history is American history.\n\nWe will not be silenced.\n\nNo illegal or unconscionable…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690193/american-history"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…stone marker is all that remains to tell their story.\n\nToday, the Trump administration is removing national park signage  that tells the truth about slavery, the genocide of indigenous  Americans, and the incarceration of Japanese Americans during World War  II.\n\nIn Nazi Germany, it started with burning books. In the USSR, they  erased people from photographs.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I rise to oppose the SAVE Act. The bottom  line is that the SAVE Act suppresses the votes of women; Black, Brown,  and indigenous people; veterans; and working-class Americans.\n\nIn advancing it, Republicans invoke those historical policies that  were intended to disenfranchise Americans. Let me remind…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…don't have a voter fraud problem in this country.  We have a voter suppression crisis. We have polling places shutting  down in Black neighborhoods. We have long lines in indigenous  communities that stretch around the corner and throughout the night. We  have purges, ID laws, and maps drawn to divide rather than to unite.\n\nMr. Speaker, we have courts…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…developed a complete and vibrant culture with their own language,  religion, values and sophisticated systems of governance, agriculture  and navigation.\n\nYet, like so many other indigenous peoples, post-contact Native  Hawaiians endured marginalization, suppression and loss of their  traditions in their own homelands. While estimates vary, it is believed  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Juliet De Jesus Alejandre\n\nMrs. RAMIREZ. Mr. Speaker, I rise to honor my constituent, Juliet De  Jesus Alejandre.\n\nJuliet is a triracial Latina who honors her African and indigenous  ancestry with roots in Ecuador and Puerto Rico. She is a healer,  organizer, poet, visionary, and she is the current executive director  of Palenque LSNA.\n\nJuliet's love…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…they considered the  enslaved people who served them every day to be three-fifths of a  person for purposes of this body, apportionment, and taxation, and they  excluded indigenous people altogether.\n\nSince 1789, the story of America has been one of each generation  trying to make true for all Americans the promise of our founding  documents. It is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…progress in bringing to  justice those responsible for the murder of environmentalist Juan Lopez  and others who have lost their lives defending the land and water that  indigenous communities depend on. There is no doubt that part of the  responsibility for the failure to establish the commission falls on the  Honduran Congress, which is dominated…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…fertilizers and pesticides, prevent soil erosion and improve  water quality. Beyond their environmental benefits, native plants are  foundational to the cultural heritage of many indigenous communities,  who have long depended on these plants for food, medicine, shelter and  spiritual practices.\n\nIn my home state of Hawaii, our kuleana (responsibility) is to…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to urge support for my Indigenous  Diplomacy and Engagement Act to ensure that our foreign affairs fully  encompass and incorporate the independent interconnectedness of our  world's indigenous peoples.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…far.\n\nMel is a great community leader, author, and musician. His  preservation efforts remind us that, as a community, we benefit from  learning about and celebrating the Indigenous population that has lived  on this land for countless generations. I admire his devotion to  preservation and am grateful we have people like Mel in our district  who are…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…relationships with the people. We have been  focused on shared economic interests, whether it be tourism, whether it  be trade, whether it be sharing best practices regarding indigenous  governance structures or in the collaboration that we are seeing going  on with arts and cultures. It is just exactly what we should be doing,  which is building these relationships--building…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…and economic       opportunities generally low.\n\nOver fifty years ago, the Federal Government directed       Alaska Native people to organize into a new structure of       indigenous representation. The Alaska Native Claims       Settlement Act of 1971 (ANCSA) was a dramatically different       and transformative approach by the Federal Government to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Area under ANCSA that have not yet been conveyed.       Doyon's land base shares approximately 3,000 miles of border       with BLM lands--potentially more than any other Indigenous       landowner in the nation. Consistent with ANCSA's intent, much       of the land that Doyon selected was selected for its economic       development potential.\n\nAs Doyon…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…concerns of the people who live here and are the most       impacted by these decisions. The process in the development       of the 2024 ROD, disregarded our local indigenous knowledge,       our rights to consultation and the Secretary for the       Department of the Interior's own orders for meaningful       consultation.\n\nThe 2020 Coastal Plain…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…gas''  from any of the most prospective leases in the Coastal Plain.\n\nIn its selection of Alternative D2, the Biden administration claimed  to be listening to the concerns of indigenous voices when this could  not be further from the truth. In practice, the Biden administration  deliberately ignored the only communities who live near and within the  boundaries…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Non-Major Defense Equipment: Non-standard components, spare       and repair parts, consumables and accessories, and repair and       return support for F-16, C-130, and Indigenous Defense       Fighter (IDF) aircraft; U.S. Government and contractor       engineering, technical, and logistics support services; and       other related elements of logistics…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696897/arms-sales-notification"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(LIUNA);       Minnesota State Building and Construction Trades Council; The       National Association of Manufacturers; International       Brotherhood of Teamsters; MichAuto; Indigenous Business       Advisors; Better in Our Back Yard; Iron Range Building       Trades; Minnesota Pipe Trades Association; LIUNA Minnesota       and North Dakota; Northern Midwest…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…on H.R. 6285,  ``Alaska's Right to Produce Act,'' where we heard from Tribal  representatives, including Inupiat leadership from the Native Village  of Kaktovik, the only indigenous Tribal community within ANWR.\n\nIn that hearing, Doreen Leavitt, Director of Natural Resources for  the Inupiat community of the Arctic Slope said:\n\nThe North Slope Inupiat…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the Committee       on Transportation and Infrastructure of the House of       Representatives with a briefing on potential collaborations       on and research and use of indigenous place-based knowledge       and research.\n\n(B) Element.--In providing the briefing under subparagraph       (A), the Commandant shall identify current and potential…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the federal  government, our perspectives are often drowned out by entities who have  no ties to our region nor have any understanding of the nuances of the  ANCSA model of indigenous representation. The choice by members of  Congress and the administration to overlook our voices is not only  frustrating, it is insulting.'' The Alaska Legislature passed…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…weren't treated  well because they were Vietnam vets. Let's face that. They weren't  treated well because there is still a lot of discrimination with regard  to Native people, indigenous people. And then they were told: Oh, by  the way, that Native allotment that you wanted? Sorry. When you were  fighting for your country, we passed a law saying you can't…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the bill to advance some of  the public safety and justice initiatives. We strengthened Tribal  colleges and universities. We addressed the scourge of missing and  murdered indigenous women and children. A focus on ensuring the safety  of our Native peoples was a priority--but, really, not just the justice  and safety, but so many of the other aspects…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…campuses, and in society, expressing itself as both  discrimination and violence targeting Jews for their identity and  seeking to deny their shared identity, including their indigenous  connection to their ancestral homeland; and\n\nWhereas, hate crimes directed against the Jewish community have  skyrocketed in recent years, inspiring the formation of a grassroots…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…tactics.\n\nSo this bill has already passed the House. This bill passed the  Senate unanimously in December, and I am really hoping that my  Democratic colleagues--respecting the indigenous Native people of my  State and their valiant Vietnam service--will join with me in just  passing it, like we did in December, and it will go right to the  President's desk,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}]