[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tariffs, higher and       higher trade barriers, and less and less competition. So,       soon, because of the prices made artificially high by tariffs       that subsidize inefficiency and poor management, people stop       buying. Then the worst happens: Markets shrink and collapse;       businesses and industries shut down; and millions of people…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Booker, skedaddle. We are going to have a  meeting.\n\nSo I am sitting there, eating peanut butter and, like, celery or  whatever, and these two men are talking about government inefficiency.  They say the place that we could be saving the most money--the former  Secretary, if I remember correctly, of the Navy and one of the great  men on national security.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Ms. SCANLON. Mr. Speaker, I rise today to speak about the White  House's pet project, the department of government inefficiency,  otherwise known as DOGI.\n\nFor the past month, our Federal workers and agencies have been  assaulted by a dilettante billionaire empowered by President Trump to  muck about…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…before they become deadly multibillion-dollar disasters. That is why we  rehired so many of the very same people that DOGE tried to fire in the  first place due to the inefficiency, the gross incompetence of Elon  Musk and the people who are working with him.\n\nThis administration is also lying about retaining employees to help  fight fires on the ground.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…projects such as border  security, cybersecurity, counternarcotic security, and a few others.\n\nThe expiration of DHS' other transaction authority essentially will  mean inefficiency and waste, things that will impede the Department's  ability to develop solutions to keep our homeland safe.\n\nIt is past time, Mr. Speaker, to advance this legislation and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688702/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…employees, the current       leadership's behavior has been appalling. This       administration's lies about the ``deep state'' and       exaggerations about government inefficiency have eroded the       respect our country once held for public servants. And       demonizing, firing, demoting, involuntarily transferring, and       directing employees…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Rights employees have been issued termination  notices. Now the Department has tried to call some of them back  because they can't handle the backlog. That is government inefficiency,  not government efficiency.\n\nMs. BONAMICI. Look at the interagency agreements, where they are  trying to outsource all of these programs to other agencies that don't  have…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…and  we supercharged our efforts to rebuild the American defense industrial  base.\n\nLet me talk about that for a moment. This legislation reforms decades  of bureaucratic inefficiency in the Pentagon's acquisition process. It  contains numerous elements of my bill, the Fostering Reform and  Government Efficiency in Defense Act, more easily known as the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the issue was raised, as is often the  case by my colleagues on the other side of the aisle, to try to scare  the American people that somehow raising questions about the  inefficiency, the ineffectiveness, the waste, the fraud of a government  healthcare solution, that somehow that is taking away benefits.\n\nWhen you have a trillion dollars of improper…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…opportunity to get at problems  that the government historically has been unable to deal with, and that  is the incredible rise and increase in government spending, the  inefficiency, the waste of taxpayer funds, and the national debt.\n\nSo getting a team like this, with very accomplished entrepreneurs and  people who have been very successful in the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…scholarships, yet, these same qualified professionals are forced to  wait months for employment contracts after graduation. All the while,  our veterans suffer.\n\nIt is government inefficiency at its worst, and our veterans seem to  always be paying the price. Veterans are sent to emergency rooms while  skilled doctors are waiting to serve patients.\n\nThat is why…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and opaque process. This lack of clarity about how foreign  partners are prioritized causes frustration and confusion among our  most important partners and allies. This inefficiency and murkiness  force our partners to consider turning to other countries to source  their capabilities.\n\nThe U.S. is currently the partner of choice for foreign arms sales,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…brothers and sisters here, we are going to have to do policy, and  policy is hard. It is complex. There are armies of lobbyists walking  around this campus here, and the inefficiency of the Federal Government  is their profit model. There are bureaucracies who despise the concept  of saying maybe you should use technology.\n\nI have a report on my desk…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Commander in Chief that decision.\n\nThe littoral combat ship program, costing over $30 billion, with each  ship priced at roughly $500 million, is a textbook example of Pentagon  inefficiency and contractor-driven bloat. Designed as a light, fast,  customizable vessel for near-shore warfare, the LCS has instead become  a symbol of our flawed procurement system.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…have to let the crops go to  waste and shoulder the losses.\n\nFor years, Food for Peace has been hampered by bureaucratic delays,  mismanagement, and abuse within USAID. The inefficiency of USAID hasn't  just wasted taxpayer dollars; it has weakened the reach and  effectiveness of some of our most vital humanitarian aid programs.\n\nThanks to its extensive…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…but that would anger the union of the government employees there.  There are these barriers where you have armies of lobbyists walking up  and down these hallways, and the inefficiency, that waste and fraud, is  their profit model.\n\nMr. Speaker, 80 percent of the spending growth--we are not supposed  to tell people this, but it is the math. You can't do…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Government\n\nMr. KILEY of California. Mr. Speaker, there is at this time a much- needed comprehensive effort under way to modernize our government, to  root out fraud, to root out inefficiency, to implement reforms that  will save the taxpayers' money, and lead to a higher quality of  government service while rightsizing the Federal Government.\n\nThis is an undertaking…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]