[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…grid, it is the most expensive unit running at any minute that sets the  price for the entire grid in that minute.\n\nSo if you can drive up demand, you drive up these huge, inefficient,  polluting, expensive, powerplants and the price goes through the roof.  That is precisely why you are seeing this huge increase in costs when  you are near a data center,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…took control--to ease burdens on families. Instead, these firings could  add enormous strain to a nation that is already in need of relief. They  are irresponsible, they are inefficient, and they are undeserved.\n\nWhat our civil servants deserve is a recognition of the work they do  every day to make us stronger. What the American people deserve is for…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…that it will  prioritize export controls, yet it has frozen 10 percent of BIS'  budget. That is not keeping America safe.\n\nBIS desperately needs to revamp its outdated and inefficient IT  system, which has not been updated in over 15 years. The number of  license applications BIS receives per year has more than doubled in  that span to over 40,000 per…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…details and jump to  more of the conclusions because during those decades differential in  the study, ``California officials set groundbreaking standards that  phased out many inefficient car and truck engines and some of the  dirtiest fuels for everything from jet skis and lawnmowers to school  buses and heavy-duty trucks. Local smog-fighters in the Los…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…tactics, and more to  keep our neighborhoods safe.\n\nCVI strategies are proven, evidence-based solutions to gun violence,  and yet the Trump administration decided they are inefficient.\n\nHouse Republicans are complicit in the Trump agenda to endanger  public safety. In the dead of night, Republicans added a provision to  their budget that would deregulate…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…technologies.\n\nIn my district and across the country, families are seeing soaring  energy costs brought on by load growth and extreme weather, including  wildfires. An aging and inefficient grid is bottlenecking the growing  demand for new and reliable power, causing prices to go up and limiting  the electrons that can reach areas that need this electricity.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…These actions will make it more difficult for local schools to get  the funding they need. Now, they will have to navigate multiple Federal  agencies instead of one. It is inefficient, unnecessary, and unpopular.\n\nPoll after poll shows that the majority of parents support the  Department of Education, and that is especially true with parents of  students…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…could  never handle that volume of cases. With dockets already bursting at the  seams, justice would be delayed. It would be so delayed that it would  be denied. It would be inefficient, cost prohibitive, and unfair.\n\nThat is what Republicans want because Federal courts keep ruling  against Trump's unlawful and unconstitutional executive actions.  Therefore,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…gas industry. The American Gas  Association and foreign manufacturers are on the side of this  Republican resolution that will terminate the standards.\n\nWhy?\n\nIt is because inefficient appliances mean that gas companies sell  more gas.\n\nNow, Mr. Speaker, if you look at where the manufacturers stand on  this, three out of four major water heater manufacturers…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…should take it now. When I apply, I will do it over the       phone. But will there still be a phone system?''                               `not acceptable'\n\nAging, inefficient phone systems have dogged Social       Security for years. A modernization contract with Verizon       begun under the first Trump administration suffered multiple…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…with a digital  version would reduce the Library of Congress' operating costs by $4  million over the next 4 years.\n\nEliminating the print requirement will also eliminate inefficient use  of CRS staff time. Requiring CRS staff to spend countless hours  formatting and paginating the print version of CONAN does not support  the work of Congress, nor does…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…servicemembers, creates a more lethal and agile force to counter our  adversaries, and secures our Nation's borders, all while saving  taxpayers over $20 billion through cutting inefficient programs and  government bureaucracy.\n\nThis is a bill that meets the moment and the need to support our  warfighters to protect our Nation. I applaud the work of the committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Financial institutions would have to underwrite each overdraft  transaction, evaluating a borrower's ability to pay a relatively small  amount. This would be both impractical and inefficient.\n\nThe alternative proposed by the Bureau, a safe harbor charge cap of  $5, would force many banks to exit this product altogether. Credit  unions would also discontinue…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the independent voice  representing the views and interests of all small businesses within the  Federal Government. This means calling attention to harmful regulations  and inefficient rules preventing small businesses from competing for  government contracts.\n\nThis legislation would clarify the functions and duties of the SBA  Office of Advocacy when…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687957/small-business-advocacy-improvements-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…modeled after DOGE.\n\nWhile some States are more fiscally responsible than others, State  governments, as I said, are not immune from spending taxpayer money on  outdated or inefficient programs. Texas is one of the most efficient.  That shouldn't surprise anyone. We have the fourth lowest State taxes  in the country, and we have been ranked one of the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…surrounding timbered  area, is located on both City-owned and federally managed Forest  Service lands.\n\nThe City operates these facilities under a special use permit, which  is inefficient and costly and limits the City's ability to  expeditiously expand and modernize this water supply.\n\nThe City of The Dalles is a growing City. It is an important City,  and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697752/dalles-watershed-development-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…It created numerous problems over the last decade.  Since its inception, these premium costs have skyrocketed. Networks  have shrunk, and the system has become bloated and inefficient.\n\nIt is important to remember that the enhanced premium tax credit  expiration at the end of the year, again, was set by Democrats. When  they are complaining that Republicans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…city every day that they should not be passing.\n\nCongress gave us the ability to stop them, and my colleagues are  complaining that we are wasting time, that it is slow and inefficient  to implement the Congressional Review Act. It is slow and inefficient,  but we passed a bill called the Midnight Rules Relief Act primarily  with Republican votes that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…every one of  these goods would have to stop at every single State line and be  transshipped from one truck to another truck. Madam Speaker, that is  ridiculous, costly, inefficient, and unnecessary.\n\nI believe this body is entirely appropriate in taking this action  today, and I strongly urge my colleagues to vote ``yes'' on this  resolution, H.J.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…to just submit these  proposals. Too often, they are met with silence, confusion, or outright  cancelation of the solicitation without any explanation. That is not  just inefficient. That is unfair.\n\nAgencies right now have broad discretion to cancel or amend  solicitations without any transparency whatsoever. A small business can  go all in on a contract…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…servicemembers, creates a more lethal and agile force to counter our  adversaries, and secures our Nation's borders, all while saving  taxpayers over $20 billion through cutting inefficient programs and  government bureaucracy. This is a compromise bill that meets the moment  and the need to support our warfighters and protect our Nation.\n\nMr. Speaker, I applaud…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…efficient.  The argument I am hearing here, and I think the people who work hard  and pay taxes are hearing, there is not a single government agency that  is at any time inefficient. Every single Federal employee is at 100  percent efficiency and doesn't need to be held accountable. They can  work from home and do whatever they want.\n\nWe support the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…weak supply chains and diminishing manufacturing by bringing  American industries back to the table.\n\nThis legislation will save billions of taxpayer dollars by reducing  inefficient and unnecessary funding for defense programs. The NDAA  builds on efforts started in the Working Families Tax Cuts Act to  stimulate our economy and to bring jobs back home.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}]