[{"senator": "Cory A. Booker", "party": "Democrat", "sentence": "I sincerely hope that when this crisis is behind us, we will all expand our moral imagination to act with greater urgency in addressing the systemic, deep-rooted, and structural inequities that underpin these racial health disparities.\""}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Like other marginalized groups, the LGBTQ community faces multiple health inequities."}, {"senator": "Kamala D. Harris", "party": "Democrat", "sentence": "This disparity in emergency funding exacerbates longstanding inequities in the funding and resources available to public defenders--disparities that make it much harder for poor defendants to receive fairness and due process."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "The situation has exacerbated already existing inequities and created unique challenges for low-income college students,\" said Rep."}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "\"The COVID-19 pandemic's unprecedented scope has devastated our country and worsened the inequities in our health care system."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "\"This white paper outlines a host of concrete proposals to address historic inequities and structural barriers that too often keep these small business owners relegated to the sidelines.\"\n\nThe proposal has been endorsed by more than a dozen economic development, civil rights, and small business advocacy organizations, including the Black Economic Alliance, National Urban League, Small Business Majority, the National Banker's Association, and the National Minority Supplier Diversity Council."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "As the primary care providers for thousands of families in Southeastern Massachusetts, it is important to ensure that they are able to continue to provide services during this pandemic.\"\n\n\"Community health centers aren't just at the frontlines protecting our communities from COVID-19, they are leading our fight to overcome systemic inequities throughout our health care system.,\" said Congressman Kennedy."}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "These cuts will only deepen such inequities and leave  them with no safety net."}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "We thanks Senators Markey, Van Hollen, Bennet, Hassan, Schumer, Cantwell and Schatz for their leadership on this issue, and AASA is proud to support the Emergency Educational Connections Act.\"\n\n \n\n\"Current long-term school closures due to the coronavirus pandemic have only heightened the urgency to address the inequities of the homework gap, experienced by 12 million students in low-income families and those living in rural areas,\" said Dr."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "While it appears that these inequities have been addressed to some degree in the second round of PPP funding, I ask that you ensure ongoing equality of access to funding is more clearly required in statute."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "The novel coronavirus (COVID-19) pandemic has left the nation facingunprecedented public health and economic crises that have exacerbated underlying inequities anddevastated those already living on the margins."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "In my State and every State, people of color have suffered more than  their share of COVID sickness and death, partly because of longstanding  health inequities that leave people of color with more preexisting  health conditions, partly because of barriers to healthcare, and partly  because Black and Brown people fill so many jobs  that are deemed essential."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "This is due to factors including a lack of trust in the medical system--in part due to historical mistreatment--as well as a lack of transportation, time, or knowledge about clinical research opportunities.\"   Recognizing these inequities, the FDA issued guidance on the collection of race and ethnicity data in clinical trials and created a Minorities in Clinical Trials Initiative."}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Punishing them because their local       governments instituted policies to draw a line between local       law enforcement responsibilities and federal immigration       enforcement will only deepen inequities and disrupt local       economies."}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Still, in 1997,  she felt a call to serve and address inequities in the world that she  had become aware of."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "The fact that we have this continued assault on students and families  and their schools, this continued attempt to continue educational  inequities in our State to continue our State and country's decline  when it comes to education, this makes it all the more imperative that  we do everything that we can here to provide choice to families and  advance educational excellence."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "\"This comes in the context of a pandemic that is already disproportionately harming communities of color, and which has both highlighted and exacerbated racial inequities in our society \"Ensuring that the worker-focused economic relief of the PPP makes it to small businesses in these communities must be an ongoing priority."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "But we know that we have more  to do and that inequities remain whether in the workforce or pay  equality."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "\"This comes in the context of a pandemic that is already disproportionately harming communities of color, and which has both highlighted and exacerbated racial inequities in our society \"Ensuring that the worker-focused economic relief of the PPP makes it to small businesses in these communities must be an ongoing priority."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "But as we continue our work to make right those inequities, it is equally important that we recognize the great accomplishments, heritage, culture, and contributions of Alaska Native, American Indian, and Native Hawaiian women,\" said Murkowski."}, {"senator": "Rob Portman", "party": "Republican", "sentence": "It is past time for us to  have a robust and inclusive national dialogue on racial inequities and  some difficult but necessary conversations about how we move forward as  a country."}]