[{"senator": "Al Green", "party": "Democrat", "sentence": "…returned in caskets, it is heartbreaking.\n\nThose parents had to suffer immeasurable heartache as a result of  what happened to their children. Those babies were young babies,  infants.\n\nHamas is not--is not--an organization that seeks peace. If you are  going to do these kinds of things, you are not seeking peace because  what you did was not just. It was…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…daughter, she also knows that there are  opportunities for her to start her education in the welcoming community  that Head Start provides.\n\nThis year alone, nearly 750,000 infants, toddlers, and preschoolers  will receive Head Start services, supporting early childhood learning,  development, and health. These centers rely on us to make sure we keep…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…for your unspeakable  loss.\n\nI know the Presiding Officer and I know my colleagues on both sides  of the aisle are horrified about this suffering and this death of  innocent infants. We all agree on this. Babies and children should not  starve to death. We are united in our opposition to such unnecessary  death and suffering, and I believe all of us do…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691093/senate-resolution-224-calling-for-the-urgent-delivery-of-humanitarian-aid-to-address-the-needs-of-civilians-in-gaza"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…baseball  in 2010; the first time Senator Duckworth brought her baby to the floor  after Senator Blunt and I worked to change the rules to allow parents  to bring brandnew infants to the floor; Senator Booker's recent 24-hour  recordbreaking floor speech; and debates on key legislation.\n\nC-SPAN brought this work directly into our constituents' living…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Representative Mary Gay Scanlon from the Commonwealth of  Pennsylvania, one of the great Members of the class of 2018, a great  class, had an amendment that would protect infants and babies, American  citizens born in this country, from the unconstitutional, un-American  Trump executive order to end birthright citizenship. Republicans voted  that down.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…reported  that the Pregnancy Risk Assessment Monitoring System had halted  operation. This PRAMS, which was developed in 1987, is designed to  identify groups of women and infants at higher risk of health problems  to monitor changes in health status, to measure the progress toward  goals, and improve the health of mothers and infants. Over the last…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…additional appropriation.\n\n20. While USDA transferred approximately $300 million in       October 2025 to support the Special Supplemental Nutrition       Program for Women, Infants, and Children (WIC), there are key       differences. For example, the magnitude of the amounts ($300       million for WIC in October 2025 versus $4 billion for SNAP)…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Supplemental Nutrition Assistance Program is delayed or even  this program called WIC. You know, there are acronyms all over our  Nation's Capital. WIC is the program for Women, Infants, and Children.\n\nHow are we going to make decisions across the country to make sure  that we are going to provide food for the most vulnerable in the  richest Nation in the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Palestinians confirmed and killed in Gaza.  https://data.techforpalestine.org/list/.\n\nMr. Speaker, look at this. I want the American people to see this.  The first 21 pages are all infants who did not live long enough to see  their first birthday.\n\nThere have been over 60,000 human lives confirmed dead so far.  Children's smiles are extinguished every single…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the direction of the  Trump administration. These contraceptives were intended for people in  poor countries with high rates of morbidity and mortality for pregnant  women, infants, and children.\n\nJust 1 day later, the spokeswoman rescinded her previous statement,  claiming that there had been a ``miscommunication'' and that the  contraceptives in question…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…unacceptable.\n\nThat is why I am proud to join the Black Maternal Health Caucus to  work toward reducing maternal mortality and building healthier  communities for Black women and their infants.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689759/devastating-maternal-healthcare-inequities"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…about how this  funding--that these are Democrats that are trying to cut resources from  FEMA or make it harder for people to get care through WIC, the program  for women, infants and children--well, look, it is just deception  because what we already know is that the reconciliation bill that was  passed--this was something that is estimated to potentially…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…millions of Americans  against the Trump administration's attacks on Social Security,  Medicare, Medicaid, and other public services, including SNAP benefits  for children, infants, and seniors.\n\nThough it is unlikely that a Republican-led House will do anything to  hold this executive accountable, we are going to continue to do  everything we can to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…instruct conferees.\n\nMr. Speaker, I rise in support of the motion to instruct conferees to  adopt the Senate funding level for Special Supplemental Nutrition  Program for Women, Infants, and Children, WIC, as part of the  conference on three fiscal year 2026 funding bills: Agriculture,  Military Construction and Veterans Affairs, and legislative branch.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…governing child  nutrition programs.\n\nWe have considered no bills that improve access to free school meals;  no bills to improve the Supplemental Nutrition Program for Women,  Infants, and Children, the WIC program; no bills to improve options for  summer food programs; no bills to improve the Child and Adult Care Food  Program, and no bills to address…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…oppose extending the same sanctions to  the Nazi's would-be, modern-day successors who just 2 years ago  slaughtered more than 1,200 innocent civilians, including children,  infants, and the elderly because they were Jewish?\n\nMr. McCLINTOCK. First of all, I am not familiar with the case, so I  can't comment on that directly. I am quite confident that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…LifeFlight Critical Care Transport Program, which  includes six ambulances, two helicopters, and fixed-wing jets equipped  for pediatric and neonatal patients, saves nearly 4,000 infants and  children annually across Florida, the Caribbean, and Central and South  America.\n\nFrom Miami to the Panhandle, from the Panhandle to Central and South  America, from…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Administration shall issue or update, as the case may be,       guidance to minimize the risk for contamination of any breast       milk, baby formula, purified deionized water for infants, and       juice (as well as ice packs, freezer packs, frozen gel packs       and other accessories required to cool breast milk, baby       formula, and juice) that is subject…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696791/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Parent  Advisory Committee, served two terms on its Governing Board, and has  devoted herself to volunteerism, philanthropic writing, and foster  parenting--particularly for infants prenatally exposed to illicit  drugs.\n\nDebra has also represented Victorville on numerous regional boards  and commissions, including the San Bernardino County Transportation…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Last year, 472 clients were  served, and more than 65,000 pounds of food was distributed. These  critical volunteers also ensure families receive essential items for  their infants and young children to include: formula, diapers, pull  ups, baby wipes and wash, as well as age specific clothing. In 2024,  more than 44,000 diapers and 9,500 items of clothing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692185/recognizing-susan-pugh"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…director of perinatal services and secretary for the Georgia Perinatal  Association, and she worked diligently in reducing morbidity and  mortality in pregnant mothers and infants.\n\nMs. Daniels' passion and dedication for her profession are truly  inspirational. This recognition speaks not only to her skill, but also  to her compassion and commitment…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…introduced the SAFE KIDS Act to prevent foreign  adversarial nations from abusing the American surrogacy industry to  obtain U.S. citizenship for their children and traffic infants abroad.  Most of the developed world has already banned international commercial  surrogacy due to the trafficking risks, and this bill is a strong step  in the right direction…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…that hardworking  Americans rely on.\n\nThis isn't a partisan issue. Keeping our government open means  protecting servicemembers, honoring veterans, supporting mothers and  infants, keeping our border secure, and helping small businesses access  the loans they need.\n\nAs we approach the government funding deadline, I support this clean,  short-term continuing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695824/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…essence, bribing a young  couple not to get married is not the way to go about doing things.\n\nPrograms like food stamps; low-income housing; earned income tax  credit; Women, Infants, and Children; Medicaid; Pell grants; and  government daycare all are generous programs. You would lose those  benefits if you had another parent in the house with an income.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Last  year, 472 clients were served, and more than 65,000 pounds of food was  distributed. These critical volunteers also ensure families receive  essential items for their infants and young children to include:  formula, diapers, pull ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to run around here and are interested in  having discussions on Medicaid--remember, Medicaid is the program that  was designed for indigent populations, for women, children, infants.  Yet, you hear almost protests from the left. Here is a $2.5 billion  fraud in Medicaid in Arizona, where they exploited Tribal members,  abused them, recruited them from…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Last  year, 472 clients were served, and more than 65,000 pounds of food was  distributed. These critical volunteers also ensure families receive  essential items for their infants and young children to include:  formula, diapers, pull ups, baby wipes and wash, as well as age  specific clothing. In 2024, more than 44,000 diapers and 9,500 items of  clothing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}]