[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…2025 Minority Health Month.\n\nThere is a long, storied history of poor health outcomes in minority  communities. African Americans have lower life expectancy, higher rates  of infant mortality, increased instances of maternal mortality, higher  rates of chronic illnesses, and more frequent cancer diagnoses. Every  American deserves to have access to quality,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…under bombs and bullets at aid sites themselves.\n\nAt the time, I held up this picture of Jinan Iskafi. She died in her  parents' arms, the victim of a military blockade on infant formula.\n\nHere joining Jinan are children suffering from famine conditions that  exist right now, this month--Amer, Maryam, and Shamm.\n\nThere is an ongoing famine in Gaza,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Congresswoman Pettersen and Senator  Gallego, and I led over 100 Members of Congress in urging the State  Department to immediately surge humanitarian aid and ready-to-feed  infant formula to families in Gaza to save lives.\n\nIn a written response, the State Department expressed concern about  the crisis, but words without action are not only empty, they…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…child suffers from malnutrition, it stunts their growth. Their  organs shut down. For toddlers, like my 3-year-old, they can have their  body weight reduced to be as low as an infant's.\n\nWhen they suffer from extreme malnutrition, they can't be fed  traditional food anymore. In order to save their lives and to cure  their malnutrition, they need this: Plumpy'Nut.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…more than  half of our country, women do not have a place to go to get obstetric  care. Among our peer nations, the United States has the highest rate of  both maternal and infant deaths.\n\nIn 2022, there were more than double and sometimes triple the rate of  maternal deaths in the United States compared to most other high-income  countries, and unacceptable…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691420/gop-tax-scam-hurts-everyone"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…without health  insurance--for children and adults. We lead the Nation in maternal  mortality, having the highest number of mothers die during childbirth.  We lead the Nation in infant mortality.\n\nOver 4.8 million Texans currently rely on Medicaid, over 16 percent  of our State. These are not just statistics to gloss over, but they are  children, moms, seniors,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…of our country, women do not  have a place to go that provides obstetric care. Among peer nations, we  have both the highest rate of maternal deaths and the highest rate of  infant deaths--in the United States of America.\n\nThis is a crisis. It is an unacceptable crisis, and it demands  immediate action from our Nation's legislators.\n\nYet, the Republican…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689164/womens-history-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…50 percent--       of all rural births.\n\nStudies also show that being enrolled in Medicaid leads to       improved health outcomes for children, including declines in       infant and child mortality, preventive care visits on par       with privately insured children and even potentially positive       outcomes into adulthood, such as improvements in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…grandparents, and small businesses alike that the childcare  crisis is suppressing our economy and forcing families to make  impossible decisions.\n\nIt is more expensive to send one infant to daycare than it is to send  an 18-year-old to the University of Maryland.\n\nLike every State, Maryland saw devastating losses in childcare  providers after the pandemic.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…session of Congress was  getting sworn in then during such a different time in this Nation's  history. Yet it is history, and it is air that my father was breathing  even as an infant. It was America at the beginning of 1945, when a war  was still being waged around this world. The real threat of tyranny and  some, rightfully--and I join in this--say evil…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…explosion of the deficit that  triggers statutory cuts to critical programs supporting children and  families. These Paygo reductions would eliminate funding for the  Maternal Infant and Early Childhood Home Visiting program--known as  MIECHV--that is proven to improve mother and child health, family  safety, and child development. It would eliminate the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…and deserves the dignity  to make their own healthcare decisions, free from intimidation,  deception, and coercion. At a time when our country has a shameful  maternal and infant mortality crisis and is facing a worsening shortage  of obstetricians, the so-called pro-life movement is focused not on  helping women or supporting their families or delivering…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…to  the first 5 years of a child's birth. Children born in California,  including my own grandchild, have a packet that they take home and  teaches them how to care for an infant child.\n\nRob also fought against the discriminatory Proposition 8.\n\nCivically, he was a champion for the First Amendment and the creative  rights of artists. Professionally,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…physical safety in grave danger.\n\nThe CPSC is a small agency tasked with a massive job to protect  consumers from hazards associated with a vast array of consumer  products, from infant car seats to window blinds to home repair  equipment. American consumers deserve to have peace of mind that the  products we are bringing into our homes are safe.\n\nI hope my…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…line of duty while  responding to reports of larceny, passing away at the hospital. He  served with the Phoenix Police Department for 5 years and is survived  by his wife and infant daughter.\n\nOfficer Buckner was killed on March 31, 2024, when he was hit by a  car while responding to a reported crime. He is survived by his wife,  mother, sister, and three…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…infrastructure.\n\nThe opportunities to save lives--whether it's someone who suffered a  cardiac arrest following a motor vehicle incident in Evansville,  Indiana, or a 12-day old infant who stopped breathing in Clackamas,  Oregon--are the situations for which EMS professionals train and  prepare. But we should also honor the everyday professionalism, skill,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…unimaginable pain and loss simply  because their loved ones had a disability.\n\nOne of those families is from my district in Ocala, Florida, Bobbi  and Josh Sarmiento. Their infant son, baby Zion, was born with Down  syndrome and in need of a heart transplant. At just 6 months old, Zion  was denied that chance.\n\nThe doctors told the parents, Bobbi and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…identity theft and that ``the threat will never completely go away  unless she is assigned a new Social Security number.''\n\nThis mother had to battle with the SSA after her infant daughter's  Social Security number was compromised. Unfortunately, the story is all  too common for millions of Americans who have had their Social Security  numbers stolen…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Equipment Screening Enhancement Act.\n\nThis legislation will require the administrator of the Transportation  Security Administration to update guidance related to screening of  infant feeding materials. It will make the airport experience more  bearable for traveling families. I thank my Democratic colleague, Mr.  Swalwell, for leading the House version…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696791/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…access healthcare for those in rural areas.\n\nSouth Dakota will also be using its funding to create regional hubs  for emergency services and to improve access to maternal and infant  health, to ensure delivery of essential medical care.\n\nBack in June, a few months before Democrats tried to repeal the Rural  Health Transformation fund, the Democrat leader…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}]