[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…heat in their homes--up more than 15 percent  from last year. Cause and effect.\n\nUnder President Biden, with the support of a Democratic Congress, we  signed into law the Inflation Reduction Act. This historic law provided  tax credits to help households and businesses install energy-efficient  windows, insulation, HVAC, and solar panels to lower their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…by this Republican-led Congress to lower the  high cost of living. Donald Trump promised that costs would go down on  day one. Costs have not gone down. They are going up. Inflation is on  the way up. Life has gotten more expensive. Electricity bills are  skyrocketing and out of control. Now, healthcare premiums are on the  verge of increasing by thousands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…afford it and provide tax  breaks for those who don't need them.\n\nAlso among these tax changes are rollbacks to critical clean energy  taxes and credits that were part of the Inflation Reduction Act. These  include phasing out clean energy production and investment tax credits  and ending longstanding home energy efficiency tax credits.\n\nIf these aren't…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691602/environmental-protections"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…wondering how they  will pay for their health coverage next year. That would really help  our neighbors back home. Alas, we are not doing that.\n\nAt a time when prices are up, inflation is up, and despite the  Republican promises to do something about it, all of their bills and  their policies are making it worse and making life even more expensive.  Household…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, my constituents are struggling with high  costs and inflation, and more and more families are living paycheck to  paycheck, and still the supporters of this bill are trying to increase  their fees? I can't and I won't get behind that.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689843/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…important than having millions of Americans lose their  health insurance? And then basically say, ``We don't really care about  this, when we already are teetering on so much inflation, so many  affordability issues, so much of people struggling.'' And if people  think we really recovered from a post-Covid era, we haven't. People are  still struggling with…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…insurance, millions of Americans are going to lose their coverage and  many more could see their costs go up by as much as 75 percent. And  that is on top of the most recent inflation data that shows our economy  is headed in the wrong direction.\n\nDespite those numbers, everything that we have seen from this  administration--from its tariff policy raising…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…rural communities face in securing clean water. That is  why we passed historic water infrastructure investments under the  Infrastructure Investment and Jobs Act and the Inflation Reduction Act.\n\nSince 2022, the IIJA has provided $500 million for the Arkansas  Valley Conduit. These investments are critical for ensuring communities  across the West…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…go up, and then others,  when the bill passed, predicted it, but by July 24, it wasn't just a  prediction.\n\nNewsweek:\n\nElectricity prices are soaring under Donald Trump.\n\nInflation is too high because of tariffs and other chaotic economic  moves on food, on building supplies, on healthcare, on pharmaceuticals,  but the energy inflation is higher now…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…working-class, hard-working people who will be  impacted.\n\nDo you know what? This administration knows the truth. They know that  these tariffs will raise prices and spike inflation and harm American  businesses, but they want to hide it from the American people until it  is too late. This is absolutely unacceptable. It is, in fact, wrong.\n\nThe American…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689471/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…soar with their  backward policies and, essentially, their war on cheaper, clean energy.\n\nThanks to Republicans, electricity prices are climbing more than  twice as fast as inflation, and more than 80 million Americans are  struggling to pay their utility bills. Many of these Americans are  having to make the impossible choice of either paying for housing,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…people just as we did in passing the largest bills in generations  over the last several Congresses: the bipartisan infrastructure bill,  the CHIPS and Science Act, and the Inflation Reduction Act, which not  only invested millions of dollars in communities all across the United  States but created countless jobs and opportunities for our people.\n\nJust…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…were going to go  down on day one. Those are not my words. Those are President Trump's  words.\n\nCosts haven't gone down in the United States of America. Costs are  going up. Inflation is on the way up. Life is getting more expensive  for the American people.\n\nNothing in this reckless rescissions package is going to make life  more affordable for everyday…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…numbers, wondering which bill they can delay paying  this month.\n\nA report from the Joint Economic Committee found that the average  American family spent $1,625 more because of inflation than the year  prior. In Oregon, families paid $1,791 more than the year before.\n\nIt doesn't have to be this way.\n\nI grew up working class. I left home at 17, and with the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Medicare was blocked  from negotiating the price of drugs by the pharmaceutical companies.  They didn't want to cut into their profits. That changed when Democrats  passed the Inflation Reduction Act in 2022 under the Biden  administration. This law empowered Medicare to bargain for fair prices  for medications used by seniors.\n\nNot one single Republican…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…successful. This legislation prevents hard-working taxpayers from  facing the largest tax hike in American history.\n\nAfter 4 years of the Biden administration, we saw 40-year-high  inflation. The cost of everything has gone up because of massive  overspending during the 4 years of the Biden-Harris administration.  Taxpayers have already sustained a cut in their…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…always been an important issue.\n\nBut, a year ago in November, the American people delivered a clear  message that the Biden administration, which presided over 40-year high  inflation, was taking the country in the wrong direction. President  Trump received the electoral vote and the popular vote, and he won  every swing State. Republicans secured majorities…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…about  the reality facing restaurant owners, grocery stores, and convenience  stores in North Dakota and across the country.\n\nThese businesses have battled through 4 years of inflation, supply  chain disruptions, and workforce challenges. Washington bureaucrats are  now telling them to replace perfectly good refrigeration equipment at a  nationwide cost…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689268/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…reintroduced this Congress with my colleague, Congressman Josh  Gottheimer of New Jersey.\n\nAmerica's small businesses have faced a tough road, weathering the  impacts of COVID, high inflation, and burdensome regulations that have  made it harder to grow and compete. Yet, they continue to serve as the  backbone of our economy, driving innovation, creating jobs,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…faculty at       such school who previously were nurses in clinical practice,       for the most recent 3-year period ending on the date of       application, adjusted for inflation as appropriate and broken       down by credentials, experience, and levels of education of       such nurses; or\n\n``(II) if the information described in subclause (I) is…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…falling. Let's get to the facts about  what is actually happening in our economy and, most importantly, how  America is moving in the right direction.\n\nGas prices are down. Inflation, despite all the worry of the last  month, was held in check. Food prices are down. The border is secure.  Enlistments are up. Respect is back around the world.\n\nLook at…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…today.\n\nAmericans are no longer seeing these sky-high increases in prices  like we experienced over the 4 years of the Biden administration--not  at all.\n\nFive years ago, inflation began to soar because of the Democrats'  reckless tax-and-spending plan. As a result, we saw inflation hit 40- year highs, and people suffered all across this country as…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…addition to securing our national  defense, is to address our Nation's healthcare. The so-called  Affordable Care Act--better known as ObamaCare--was as dubiously named  as the Inflation Reduction Act, which did not reduce inflation, just  like the Affordable Care Act did not make healthcare affordable.\n\nWhen ObamaCare was crafted, debated, and passed, Democrats…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…billions of dollars to big health insurance plans to mask  the risk of rising unaffordability of coverage. First, in the American  Rescue Plan of 2021 and then again in the Inflation Reduction Act of  2023, Democrats sent temporary taxpayer-funded enhanced premium tax  credits directly to the coffers of big insurance plans.\n\nThey did this without a single…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…not on this  floor today.\n\nMr. Speaker, what I have tried to ask and nobody has answered is: The  enhanced tax credits, the COVID-era tax credits, were set to expire in  the Inflation Reduction Act, which was a bill under the reconciliation  process. It was solely the Democratic Party who put that in place, and  the question I have always asked is: Why…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Biden-era rule wasn't just for  redundancy. It was to put shackles on offshore energy production and to  put higher costs on American consumers, who are already struggling with  inflation that has resulted from the policies of the previous  administration.\n\nGood governance doesn't have redundancy and duplicative rules in  place that hamper Americans from building…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Democrats.\n\nAgain, in 2021, Democrats put in place what is called the enhanced  premium tax credits. They did this during their COVID-era bills: The  American Rescue Plan and the Inflation Reduction Act. These were two  bills that were massive expansions for several programs. In particular,  they were able to pass this legislation on party-line votes and set…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…prioritized were to increase wages for their frontline workers. They  said every single person at the firm got a pay increase. They grew real  wage growth without massive inflation that takes place sometimes under  a reconciliation bill.\n\nI will point to the American Rescue Plan that took place when  Democrats took control of the White House, House,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the year, where  investment is going into plant, equipment, data centers, AI, and all of  these things are happening, wage growth is actually okay. It is  actually outpacing inflation now, finally, thank Heaven. Yet the real  GDP growth is coming from that capital spend and not from wage and new  employment and the demand for labor.\n\nUnderstand why this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…deficit is being  addressed. The Federal Government's cumulative deficit for fiscal year  2026 at the end of November was 19 percent lower than the same time  last year. Core inflation is at 2.6 percent, the lowest we have seen in  4 years.\n\nRents are falling month after month, and shelter inflation is at a 4- year low. Gas prices are down to their lowest…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]