[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 859, the Informing Consumers  About Smart Devices Act.\n\nMr. Speaker, the Internet of Things has ushered in a new age of  convenience and efficiency for Americans. Smart thermostats save  consumers…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690180/informing-consumers-about-smart-devices-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…mapping, and national  security applications such as maritime surveillance.\n\nCommercial space-based images provide vital scientific information on  the health of our Great Lakes informing policy in my beloved home State  of Michigan and across the basin. These images also provide visibility  and insight into life-threatening events, such as the before and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Black history in Black  History Month.\n\nMr. Speaker, in speaking of legacies that have been stolen, we  annually honor General Gordon Granger for going into Galveston and  informing the enslaved persons there that the Emancipation Proclamation  applied to them and that they were free people, liberated people.\n\nWhen we do this, however, we do not acknowledge…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Johnson administration. Congress knew about the war in Vietnam.\n\nObviously, there was a draft, and 56,000 Americans were killed in  that war. But President Nixon, without informing Congress, extended the  war and started bombing Cambodia--it was called the secret bombing of  Cambodia--a new country that had not been covered by war  authorizations. So…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Illinois whose life was taken in the  act of anti-Palestinian violence. It is the duty of elected officials  and the media to tell the truth without dehumanizing rhetoric when  informing the public of factual information.\n\nWe know that dehumanizing rhetoric can fuel sentiments of hate that  result in violence, and each tragedy adds to a litany of evidence…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692861/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…many  other contract postal units across the country.\n\nOn June 1, Stan Boylan, a veteran and the owner of the Quartz Hill  Post Office, received a written termination notice informing him that  his post office was scheduled to close.\n\nMy family loves the Quartz Hill Post Office. My wife was devastated  to hear this news. We are not alone. It has been a…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692996/closure-of-quartz-hill-post-office"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Marion VA  Medical Center in southern Illinois. Every year, this facility serves  43,000 veterans.\n\nLike many VA employees, she received an email in the middle of the  night informing her that she was fired from her logistical job that  ensured the rural hospital's lab had what it needed for patient care.  Her supervisor had no idea this was coming. Her…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…this, and I am praying for all of the victims of this  administration's campaign of terror in my country.\n\nMr. TAKANO. Mr. Speaker, I thank Representative Watson Coleman for  informing the Nation about what happened earlier today with that family  in Oklahoma.\n\nIt strikes me that we are witnessing this evolution of this  administration's policies that began…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…such other activities and duties as may be prescribed       by law or by the President or Secretary, in directing the       Coast Guard.\n\n``(4) Recommendations.--After first informing the       Secretary, the Secretary of the Coast Guard may make such       recommendations to appropriate congressional committees, as       defined in section 1171, as the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…and professions. One thing  they all share is a solid foundation and understanding of mathematics  and modeling.\n\nThese skills are crucial to a wide variety of occupations, informing  computational and data-driven thinking that supports the growth of a  versatile STEM workforce. Statistical analysis underpins everything  from the development of artificial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…district are  struggling?\n\nH.R. 4 defunds PBS and NPR's biased media circus. For years,  taxpayers have been forced to subsidize a public media system that is  less about informing and more about indoctrinating.\n\nTo my friends across the aisle, I know you love your globalist pet  projects, but the American people are fed up. The voters that sent us…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692529/rescissions-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Christopher when he began working as a Press  Secretary for the House Committee on Energy and Commerce under Chair  Cathy McMorris Rodgers in 2022, where he served a vital role informing  the public of the work the Subcommittee on Health was fighting for  while I was Subcommittee Chairman. Christopher then went on to become  the Communications Director of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…FULCHER. Mr. Speaker, I thank the good chairman of the  Subcommittee on Commerce, Manufacturing, and Trade for yielding time.\n\nMr. Speaker, I rise today in support of H.R. 859, Informing Consumers  About Smart Devices Act. This bill would require manufacturers of  internet-connected so-called smart appliances to disclose to consumers  prior to purchase when…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…ITS is an essential part of the National Telecommunications and  Information Administration, NTIA, and we must strengthen its statutory  authority to ensure it continues informing important spectrum policy  decisions.\n\nThis testing center will also play an important role in America's  ability to stay ahead of international competitors like China on…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…gotten rich on the backs of  hardworking Americans' taxpayer money. Members sit on committees and go  to private briefings where they get privileged information from  companies informing us if the stock price will skyrocket or plunge.\n\nWe appropriate money to different economic sectors that may benefit  our own portfolios, and who gets the short end of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Informing Consumers about       Smart Devices Act''.       SEC. 2. REQUIRED DISCLOSURE OF A CAMERA OR RECORDING                     CAPABILITY IN CERTAIN INTERNET-CONNECTED…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…with Indian       Tribal Governments, including Alaska Native Tribes and ANCSA       Alaska Native Corporations, the record does not support that.       Sending one letter informing these stakeholders of a       rulemaking effort followed by a lack of adequate consultation       and doing so during an importance subsistence harvest period       without…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…refused to negotiate new trade  agreements but undermined U.S. rights under them when it waived our  intellectual property rights under the WTO TRIPS Agreement and without  informing Congress, attempting to remove the rights of American  investors under the USMCA.\n\nSecond, I also agree that we should not undertake tariff actions  lightly on our allies…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}]