[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…help quickly and effectively. GAO's  examination of Federal cybersecurity and information programs helped  with the creation and evolution of the Cybersecurity and Infrastructure  Security Agency, which helps protect American schools, hospitals,  businesses, and critical infrastructure from costly and damaging cyber  attacks. GAO's examinations of Department…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…representatives from private industry,  government, and other key stakeholders. The Council is also now co- chaired by a representative from the Cybersecurity and Infrastructure  Security Agency to help foster collaboration between our Nation's  leading cybersecurity experts across the government.\n\nHowever, given the important objectives of CSRIC, we should…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…details--let me repeat that--shocking details  about national security threats to our country's phone system that  require immediate action.\n\nThe Cybersecurity and Infrastructure Security Agency permitted my  staff to read the report at their office, and this was done in 2023.  However, they have marked this unclassified report ``For Official Use  Only''…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…understand how they can do that  while they swear fealty to law enforcement. It just makes no sense.\n\nThey want to cut $491 million from the Cybersecurity and  Infrastructure Security Agency, making our cyber and physical  infrastructure far more vulnerable to attack by foreign bad actors like  Vladimir Putin and President Xi and Kim Jong-un. I know…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, I must object to the Senate proceeding to  the nomination of Sean Plankey of Pennsylvania, to be Director of the  Cybersecurity and Infrastructure Security Agency (CISA), Department of  Homeland Security.\n\nSince July 2022, I have repeatedly urged CISA to release an  important, unclassified report by independent cybersecurity…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…don't exist right now'' and  act ``without Congress'' to ``mandate that States'' adopt her  preferred, radical election rules.\n\nIn addition, the Cybersecurity and Infrastructure Security Agency,  known as CISA, a critical Agency within DHS that works with State and  local officials to protect the security of our elections, has been  gutted. CISA has been…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…Speaker, this bill gives TSA the resources to keep the flying  public safe while getting rid of wasteful programs like VIPR.\n\nIt supports CISA, the Cybersecurity and Infrastructure Security  Agency, which is securing vital infrastructure from adversaries like  China.\n\nIt also provides FEMA with the resources it needs to support  communities following disasters,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699353/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…vehicle-based attacks.\n\n(5) The Department of Homeland Security, through agencies       like the Transportation Security Administration and the       Cybersecurity and Infrastructure Security Agency, plays a       vital role in detecting, assessing, and mitigating the risks       associated with vehicle-based threats.\n\n(6) Strengthened coordination between…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…of       the enactment of this Act, the Director of the Office of       Management and Budget, in consultation with the Director of       the Cybersecurity and Infrastructure Security Agency, the       National Cyber Director, the Director of the National       Institute of Standards and Technology, and any other       appropriate head of an Executive…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688358/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…120 days after       the date of the enactment of this Act, the Secretary of       Homeland Security, acting through the Director of the       Cybersecurity and Infrastructure Security Agency (CISA) of       the Department of Homeland Security, in consultation with the       Attorney General, the Director of the Federal Bureau of       Investigation,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…H.R. 2659 provides a clear and practical solution to this challenge.  The bill directs the creation of a joint interagency task force led by  the Cybersecurity and Infrastructure Security Agency with support from  the Federal Bureau of Investigation.\n\nThis task force will bring together the agencies responsible for  overseeing individual sectors, the intelligence…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…pass  the bill (H.R. 5078) to amend the Homeland Security Act of 2002 to  reauthorize the State and local cybersecurity grant program of the  Cybersecurity and Infrastructure Security Agency of the Department of  Homeland Security, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Administration;\n\n(B) the National Institute of Standards and Technology; and\n\n(C) the Department of Homeland Security, including--\n\n(i) the Cybersecurity and Infrastructure Security Agency;       and\n\n(ii) the Science and Technology Directorate.\n\n(2) A discussion of--\n\n(A) the degree to which customers (including consumers,       companies, and government…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…responsibility and  response actions.\n\nH.R. 2659 addresses these gaps by directing the creation of a joint  interagency task force led by the Cybersecurity and Infrastructure  Security Agency, CISA, in partnership with the Federal Bureau of  Investigation. This task force will bring together the agencies that  serve as sector risk management agencies,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…the Federal Risk and Authorization Management Program       established under section 3608 of title 44, United States       Code; and\n\n(C) the Cybersecurity and Infrastructure Security Agency of       the Department of Homeland Security, for a case in which the       project is in coordination with a Federal agency with       stringent security requirements.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}]