[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Rooted in the community that raised him, Billy served as the 26th  Ward alderman for 16 years, from 1993 to 2009, where he championed  major infrastructure and community development projects, including the  creation of Division Street's signature Puerto Rican flags, the  McCormick Tribune YMCA, and Humboldt Parks' first-ever public library  branch.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Congress made a commitment to support rural communities and the  critical infrastructure to make sure they did not get left behind.", "title": "Secure Rural Schools Reauthorization Act of 2025", "date": "2025-12-09"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "They are using the same playbook       to purge staff and destroy programs in across our entire       domestic infrastructure in government, universities, and       medical center.", "title": "U.S. Global Health Programs", "date": "2025-05-13"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "taxpayers, goes toward supporting public  safety, social services, and critical infrastructure that residents and  tourists alike rely on.", "title": "Providing for Consideration of H.R. Prohibiting Voting By Noncitizens in District of Columbia Elections; Providing for Consideration of H.R. District of Columbia Federal Immigration Compliance Act of Providing for Consideration of H.R. Protecting Our Nation's Capital Emergency Act; and Providing for Consideration of S. Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-10"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Displaced workers continue to drive Maui's recovery, rebuilding  homes, clearing debris, restoring infrastructure, and supporting their  communities.", "title": "Maui Dislocated Workers Program", "date": "2025-04-09"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "companies to rebuild  Venezuela's oil infrastructure.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Despite Republicans claiming to support farmers and rural  communities, their bill cuts investments in rural America, including  grants that help hardworking Americans buy homes in rural areas and  programs to help build drinking and wastewater infrastructure in rural  communities that need it most.", "title": "-9999", "date": null}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "George has been a leader on everything from infrastructure investment  to promoting affordable housing to ensuring that sustainability issues  are front and center for the Village.", "title": "Recognizing the Career of Skokie Mayor George Van Dusen", "date": "2025-03-14"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Stripping TPS forces many to return to a country that       is currently facing extreme humanitarian and security       concerns that no one should have to endure such as widespread       gun violence, political instability, and larger crumbling       infrastructure.", "title": "Witness Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "When Transportation Secretary Duffy testified before the  Transportation and Infrastructure Committee earlier this year, I asked  him to work with Congress to fully implement this lifesaving law.", "title": "Amendment No. 1 Offered By Mr. Massie", "date": "2026-01-22"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "As a member of the Committee on Transportation and Infrastructure and  as the ranking member of the Subcommittee on Highways and Transit, I  have been working to reduce train noise and vibrations.", "title": "Introduction of the Protecting Homes From Trains Act of 2025", "date": "2025-11-17"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "2390, the Maritime Supply  Chain Security Act, legislation that clarifies that funding provided by  the port infrastructure development program can be used to replace or  upgrade Chinese-made cranes at ports.", "title": "Maritime Supply Chain Security Act", "date": "2025-06-09"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "I think they have  ably explained why this water infrastructure project for southeastern  Colorado is so critical, a project 60 years in the making.", "title": "Finish the Arkansas Valley Conduit Act--Veto Message From the President of the United States", "date": "2026-01-08"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "He promised us that he would not cut Social Security, but what he did  was he destroyed the infrastructure of Social Security.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''", "date": "2025-04-09"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "It is the  basic infrastructure of diplomacy.", "title": "Providing Appropriate Recognition and Treatment Needed to Enhance Relations Act", "date": null}, {"senator": "Barry Moore", "party": "Republican", "sentence": "These reforms led to  multiple credit rating upgrades and allowed for significant investments  to improve public safety, infrastructure, and city personnel.", "title": "Recognizing the Accomplishments of Mayor William S. ``sandy'' Stimpson", "date": "2025-10-17"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "3898, the Promoting  Efficient Review for Modern Infrastructure Today Act, or the PERMIT  Act, which will make permitting processes under the Clean Water Act  more efficient, consistent, and transparent while continuing to protect  our Nation's water quality.", "title": "Promoting Efficient Review for Modern Infrastructure Today Act", "date": "2025-12-11"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "It stimulates investment in our energy infrastructure and  fosters innovation across the related industries.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Nita knew that real solutions come from working  across the aisle, and her ability to build consensus led to critical  investments in education, healthcare, and infrastructure that benefited  New Yorkers and Americans across our country.", "title": "In Memory of the Honorable Nita M. Lowey", "date": "2025-03-27"}, {"senator": "David Taylor", "party": "Republican", "sentence": "These projects will  help fund long-overdue water infrastructure projects and make local  improvements, ultimately driving down costs for communities throughout  the Nation.", "title": "Providing for Consideration of H.R. Saving Homeowners From Overregulation with Exceptional Rinsing Act; Providing for Consideration of H.R. Affordable Housing Over Mandating Efficiency Standards Act; and Providing for Consideration of H.R. Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-07"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "In this Act:\n\n(1) Appropriate committees of congress.--The term       ``appropriate committees of Congress'' means--\n\n(A) the Committee on Transportation and Infrastructure of       the House of Representatives; and\n\n(B) the Committee on Commerce, Science, and Transportation       of the Senate.", "title": "Mental Health in Aviation Act of 2025", "date": null}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "I thank Congressman Ogles for his leadership on this legislation and  for his commitment to enhancing the security of our Nation's critical  infrastructure.", "title": "Strengthening Cyber Resilience Against State-Sponsored Threats Act", "date": "2025-11-17"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "They support the  legislative process, ensure the security of this great institution,  maintain our technology and service infrastructure, and contribute to a  more efficient and productive House.", "title": "Recognizing Employees of the U.S. House of Representatives Who Have Reached 25 Years of Service", "date": "2025-12-17"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "However, outdated IT  infrastructure and delivery systems have left many vulnerable to fraud  and stolen tax reimbursement checks.", "title": "Recovery of Stolen Checks Act", "date": "2025-03-31"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Over the next decade, Georgia Ports Authority will invest $4.5  billion in port and inland infrastructure to ensure that the state and  entire southeast region continue to have the most competitive ports in  the Nation.", "title": "Georgia Ports Authority", "date": null}, {"senator": "John Joyce", "party": "Republican", "sentence": "This investment will support American artificial intelligence  infrastructure.", "title": "President Trump Bringing Back Investments", "date": "2025-03-24"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "It is time to end this irresponsible failure of a project--the  biggest public infrastructure failure in U.S.", "title": "Governor Newsom Backs Down", "date": "2025-05-15"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "(3) These attacks, carried out by both organized terrorist       groups and individual actors, often aim to exploit high-      density public gatherings, critical infrastructure, and key       transportation hubs, causing mass casualties and widespread       disruption.", "title": "Department of Homeland Security Vehicular Terrorism Prevention and Mitigation Act of 2025", "date": "2025-11-17"}]