[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…for skyrocketing costs.\n\nBreweries in my district are being hit. The owner of one small  Virginia brewery said that because of tariffs on his aluminum, steel,  and other ingredients, they have to raise the price of a six-pack to  $19.\n\nThe President proclaimed Liberation Day as a declaration of economic  independence, but this is doing nothing to protect…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…high-quality,  gluten-free, and allergy-safe cuisine. Through her leadership, she has  strengthened the local economy by fostering partnerships with local  businesses and sourcing ingredients from Illinois farms. Her restaurant  not only offers an upscale dining experience but also serves as a  community space that brings people together.\n\nIn addition to her…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…therapeutic food, a miracle peanut  paste that saves the lives of starving children and is produced by,  among others, Edesia Nutrition in my district in Rhode Island with  ingredients sourced from States all across our country.\n\nHere we are in May, and since the Trump administration came into  office in January, not a single dollar of that money has gone…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…shopping for what you are going to prepare for dinner. You have  readily accessible information--nutritional information--not just  calorie information, protein information, but ingredients of what is in  the product you are about to buy. There are certain things that we  cannot control, like the ingredients in the air we breathe.\n\nIf you are fortunate enough…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…States, the production lines that create this  product are virtually shut down. Edesia Nutrition in my district in  Rhode Island and Mana Nutrition in Georgia get all of their ingredients  from U.S. farmers. This is all produced in the United States. When it  is shipped around the world, it is shipped in boxes that say: ``From  the American People.''\n\nThis…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…people in  New Hampshire, more small businesses.\n\nLast week, I heard from a small company in Windham, NH, that makes  allergen-free cookies, and they can only get certain ingredients for  those cookies from Canada. The CEO built her business, which now  employs 30 people, and now she can't be sure if they are even going to  be able to keep going, let…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…stable. They are  getting more expensive.\n\nOne of the most significant inputs for any farmer of an agricultural  vegetable or grain product is fertilizer. One of the key ingredients in  fertilizer is potash, and about 80 percent of potash that goes into  fertilizer used by American farmers comes from Canada.\n\nSo the initial effect of these tariffs is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…warned of damage from tariffs, and  soon.\n\nBob's Red Mill, for example, sells delicious flour and grains, mostly  made from wheat and other crops in Oregon. But some of their  ingredients--like coconut or tapioca, which just aren't grown here-- come from outside the country. The cost of those products goes up  because of tariffs.\n\nWorse, foreign markets for…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…might have to sell his  factory because of the trade war that President Trump has started with  Canada.\n\nChatila's Bakery makes sugar-free desserts. They get some of their  ingredients from Canada. All of those ingredients are now more  expensive.\n\nWhile I was there, he showed me a fuel bill he had just gotten that  said that because of the tariffs, his…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…they  are back up to normal body weight and healthy once again.\n\nEdesia Nutrition in North Kingstown is one of two places in the  country that produces Plumpy'Nut. All the ingredients, the peanuts,  soybeans, sugar, and dairy, come from American farms and  factories. It is manufactured here in the United States and, until  recently, was shipped around…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…country because China and Mexico are heavily involved in this business.  China sends the precursors of fentanyl and fentanyl analogues, the API,  or active pharmaceutical ingredients, to the cartels in Mexico who are  then making the drugs and bringing them across our borders.\n\nBy making these analogues permanently schedule I, it removes the  incentive…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…paragraph (1)(B)       contains either--\n\n``(I) a single new active ingredient; or\n\n``(II) more than one active ingredient, if an application       for the combination of active ingredients has not previously       been approved but each active ingredient is in a drug product       that has been previously approved to treat an adult cancer.\n\n``(iii) Results…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…SAVE Act.\n\nGovernor Braun has made Indiana healthier by signing nine health- related executive orders, one of which addresses the same harmful food  dyes and artificial ingredients that President Trump and the  administration banned just this past week. This was accomplished while  the House literally saved lives by securing medical protection for…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690592/first-100-days-are-just-the-beginning"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…according to the CBO is going to  lower premiums for everybody, all Americans across the Nation.\n\nIt is time to give more choice and more competition. Those are the  only ingredients that are going to make costs lower. We can't keep  patching the same roof. Everybody has sticker shock.\n\nMr. Speaker, I urge everybody, the right answer is to vote ``no''…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…representative voice of approximately 100       companies that extract,       process, and support a vital and beneficial group of metal/      nonmetal minerals that are the essential ingredients for a       strong national defense and economy as well as many of the       products used in everyday life. Our members' minerals are       essential building blocks for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…The cafe operates as a training lab, giving students the opportunity  to apply skills they have learned in the classroom to real-life  scenarios.\n\nStudents help prepare ingredients, set up workstations, and create  menus. Those who work the afternoon shift are responsible for making  and serving food.\n\nThe students develop leadership skills and professionalism,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699201/highlighting-student-run-cafe-at-clearfield-county-career-and-technology-center"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…critical supply chains are almost fully reliant on  foreign nations, and our pharmaceutical supply chain is no different.\n\nApproximately 10 percent of the active pharmaceutical ingredients  required for domestic prescription drug manufacturing comes from  foreign supplies.\n\nSimply stated, the prescription drugs that save the lives of millions  of Americans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…responsible for the production, the  distribution, the sale, or the financing of synthetic opioids.\n\nIt is no secret that China is the leading producer of the base  chemicals, the ingredients, that are needed to make fentanyl and that  the Chinese Communist Party is more than willing to work directly with  Mexican drug cartels to ensure that this poison continues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…loophole in the 2018 farm bill by taking legal amounts of  THC from hemp and turning it into intoxicating substances. They take  these synthetic chemicals and use them as ingredients in appealing  snack and candylike products and distribute them in familiar packaging.\n\nHere, it gives you an example of how these hemp-related, THC-related  factors are…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}]