[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…our Nation. But I think if he were to say, ``I alone  can break it,'' the results of the last 100 days would have proven him  correct.\n\nPresident Trump, on Inauguration Day, inherited the strongest economy  on the planet Earth--not a perfect economy but the strongest economy,  the envy of other industrialized nations. That is what he had just 100  days…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…truth-teller, always voting her conscience, earning the  respect and admiration of those she served.\n\nThroughout her life, Judy exemplified a commitment to service, a  trait she inherited from her parents, who were both devoted to their  community--her father as the Columbus District Fire Chief and her  mother as the first certified medical assistant in the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…protect the  democracy. We have to protect it.\n\nWe can't just allow a President to become a might-makes-right  authoritarian. We have to protect the democracy that we have inherited.  We do it for ourselves. We do it for posterity. We do it because,  without this participatory democracy, the world itself becomes at  greater risk.\n\nMr. Speaker, the United…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…mentioned. He claimed that he  would save $50 billion on cleanup. Guess what? It didn't work. It just  delayed the cleanup and cost taxpayers more money.\n\nSecretary Bodman, he inherited Secretary Abraham's unrealistic  promise, and he failed to address the fundamental technical problems  emerging at the waste treatment plant--problems with hydrogen gas…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…posed by nuclear war.\n\nThe burdens inflicted by nuclear testing are not borne by the United  States alone. Following the dissolution of the Soviet Union in 1991,  Kazakhstan inherited the world's fourth-largest nuclear arsenal and the  Semipalatinsk nuclear test site. Between 1949 and 1989, the Soviet  Union conducted 456 nuclear tests at Semipalatinsk,…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…some  good trouble in this body I respect so much. I am going to try to cause  what I believe is necessary trouble. I am going to try to honor the  legacy that I know I have inherited as an American, the legacy I think  about when I come to this floor and feel sometimes overwhelmed with all  of the sacrifice and struggle that had to get me here: good people…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Let's start with some facts. Every single Democratic Presidential  administration since Kennedy has left for their Republican successor a  better deficit situation than they inherited, and every Republican  President since Nixon has left for the Democrats a worse deficit  situation than they inherited, all without exception.\n\nHere we are again. A Republican…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689903/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…cancer diagnosed as of 2025 and about 600 deaths from  testicular cancer.\n\nIt is important for men to know their family history of cancer. About  1 in 10 cancers are caused by inherited genetic mutations.\n\nTo say it differently, if grandpa had it, his descendants might, too.  Check family trees. Talk to parents. Talk to loved ones. Take a moment  and ask…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Bush, in 2001 and 2003 yet again,  there were massive tax cuts for the wealthy, the well-off, and the  well-connected.\n\nIn fact, the Republican President at that time in 2001 inherited a  budget surplus from President Bill Clinton and immediately turned  around and took that budget surplus and turned it into a deficit. He  exploded the debt.\n\nDon't ever…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…created  the program nearly 100 years ago.\n\nSocial Security accounts are yours, and it is a sacrilege to do  anything to disturb them. You might think about President Trump; he  inherited all of his money. He didn't have to work.\n\nMr. Speaker, we have to do everything possible to protect Social  Security for the millions and millions of Americans who deserve…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…nuclear weapons at sites across the Eurasian landmass. With thousands  of nuclear-armed ICBMs in places like Belarus and Ukraine, the newly- formed Republic of Kazakhstan inherited the world's fourth-largest  nuclear arsenal, which was also home of the Semipalatinsk nuclear test  site. From Semipalatinsk's establishment in 1946 to its decommission in…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…chaos, cruelty, and lawlessness under the Trump  administration. We see it in our economy, in our homes, and in our  relationships abroad.\n\nJust 100 days ago, President Trump inherited a strong economy, yet  our economy shrank in the first 3 months of this year. He imposed  punishing tariffs, then he didn't, wiping out $11 trillion in wealth in  11 weeks.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…people  who believe in hard work, common sense, and accountability. We don't  want excuses. We expect results.\n\nAfter President Trump's first term, the Biden administration  inherited near-record lows in inflation and an agricultural trade  surplus of $6 billion. After 4 years of failed Democratic policies, we  were left with a 21.5 percent increase in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that path,  to choose the path of the Constitution of limited government, of  freedom, of responsible spending, and turning over this country to our  children better than we inherited.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…cornerstone. This week, with this vote today, with our  Nation's birthday being tomorrow, we lay a fourth. With this bill, we  can vote as stewards of that great legacy that we have inherited in  this extraordinary Nation that we are blessed to live in.\n\nWe can lay another sturdy foundation for the future of this country,  a future where working Americans can…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…women have found ways to  push forward and to pioneer better ways.\n\nAs we honor the women who come before us by remembering, I hope we  will be grateful and humble to have inherited the progress of past  generations. As Americans and visitors to our country visit the  Nation's Capital and explore the museums, it seems fitting that they  would have the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "Mr. YAKYM. Mr. Speaker, I thank Chairman Smith for yielding.\n\nMr. Speaker, I rise in strong support of the One Big Beautiful Bill  Act.\n\nPresident Trump inherited a disastrous open-border policy from the  Biden-Harris administration. There were nearly 9 million encounters at  the southern border under President Biden, more than the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…on Banking, Housing, and       Urban Affairs of the Senate a report that--\n\n(1) establishes a comprehensive definition of residential       heirs property, or family land inherited without a will or       legal documentation of ownership;\n\n(2) examines the occurrence of and consequences to owners       of residential heirs property, and provides an…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…preserve stepped- up basis and to stop far-left Democrats' farm killer tax. For decades,  stepped-up basis has protected families from being forced to pay  capital gains taxes on inherited assets.\n\nPresident Biden tried his best to remove this provision, which would  have resulted in the destruction of family farms across my district and  around the country.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…America, not the wealthy.\n\nMy Democratic colleagues want to talk about fear over facts, as we  have heard from their leaders today. Let me remind them of what  happened. They inherited a government in January 2021 with 1.4 percent  inflation, and they delivered 9.1 percent inflation just 5 months  later. That was almost a sevenfold, 700 percent, increase…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…lowest it has been in 4 years. Just in the first year of President  Trump, wages grew more than all 4 years under Joe Biden. We are in an  inflation crisis that President Trump inherited because of the spending  spree, the $10 trillion spending spree, that the Democrats did when  they controlled the White House, the House, and the Senate.\n\nMr. SMITH of Missouri.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the brutal Assad regime in Syria brought  down a Russian vassal and Iran's favorite corridor of weapons and  terrorist finance.\n\nThese are the circumstances President Trump inherited. What to do  with them has been the subject of quite some debate. Some of his  advisers and supporters came with Obama-Biden-era talking points, ready  to urge him to continue…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]