[{"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "Jim Inhofe (R-Okla.), along with Sens."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Thank you, Chairman Inhofe, and I join you in welcoming our witnesses this morning."}, {"senator": "Thomas R. Carper", "party": "Democrat", "sentence": "Inhofe, Mr."}, {"senator": "Thomas R. Carper", "party": "Democrat", "sentence": "This law was the product of bipartisan work by the Chairman, Senator Inhofe, and Senators Whitehouse, Booker and Crapo."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Jim Inhofe (R-Okla.) and Jack Reed (D-R.I.) released the following statement on the year ahead today with the announcement of the first Senate Armed Services Committee hearing of 2020:\n\n\"Recent events are a sober reminder that a strong national defense is integral to protecting our way of life--not just for us, but for future generations."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Thank you, Senator Inhofe."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "In addition to Hoeven and Jones, the Senate bill is being cosponsored by Senators John Cornyn, Kevin Cramer, Ted Cruz, Lisa Murkowski, Dan Sullivan, Jim Inhofe, John Barrasso and Roger Wicker."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "I yield to Senator Inhofe."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "I want to commend Chairman Inhofe for establishing and holding a weekly call so that Committee members can be briefed by Defense Department officials and ask questions regarding the coronavirus."}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "One of  them who has been very important to this has been Senator Inhofe, of  Oklahoma."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "This resolution was also sponsored by Senators Jim Inhofe, Dick Durbin, Martha McSally, Doug Jones, Marco Rubio, Tom Cotton, Todd Young, Marsha Blackburn and Mike Braun."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), chairman of the Senate Armed Services Committee, questioned witnesses this morning at a SASC posture hearing with United States Africa Command and United States Southern Command."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senators John Kennedy (R-LA), Jim Inhofe (R-OK), Steve Daines (R-MT), James Lankford (R-OK), Marsha Blackburn (R-TN), Tim Scott (R-SC), and Kevin Cramer (R-ND) joined Cassidy as original cosponsors of the bill."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.) announced today that Lt."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "In addition to Hoeven and Cramer, the SALE Act was introduced by Senators Jim Inhofe (R-Okla.) and Tina Smith (D-Minn.), with Senators Steve Daines (R-Mont.), Joni Ernst (R-Iowa), Chuck Grassley (R-Iowa), Cindy Hyde-Smith (R-Miss.) and Jon Tester (D-Mont.) joining as original cosponsors."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), Dan Sullivan (R-Alaska) and Kevin Cramer (R-N.D.) spoke with Secretary of Commerce Wilbur Ross this past week about their position that we need to apply tariffs, including 232 national security tariffs, to oil imports from Saudi Arabia and Russia as a result of their anticompetitive behavior."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "I will continue to work closely with the Trump administration as it seeks commonsense ways to keep America's water clean and safe.\"\n\nSenator Jim Inhofe (OK): \"The EPA's release of this finalized WOTUS replacement rule is welcome news."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), committee chairman, condemned the Federal Communications Commission's decision to approve Ligado Networks's proposal to repurpose spectrum adjacent to Global Positioning System (GPS) frequencies for a terrestrial cellular network -- a move that threatens to interfere with signals that support critical military capabilities, public safety, and commerce."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "INHOFE."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), today held its weekly briefing with the Department of Defense to receive updates on response to the coronavirus pandemic."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), chairman of the Senate Armed Services Committee, today issued the following statement regarding President Trump's announcement of an agreement with representatives of the Taliban and joint declaration with the government of Afghanistan:\n\n \"I commend President Trump and his administration for this weekend's historic steps towards peace in Afghanistan."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), chairman of the Senate Armed Services Committee, applauded Senate confirmation of General Charles Q."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), member of the U.S."}]