[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…separate, and distinct. But right now, under current law, they are  deprived of the full benefits of their pension because they were  injured in combat. Just to describe this injustice should make our  stomachs turn with outrage.\n\nThe Major Richard Star Act is really a commonsense bill. We use that  word, ``commonsense,'' all the time in this Chamber, but…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Americans, including our families. My great-grandfather was  taken from his home, incarcerated without cause, solely because of his  ethnicity.\n\nNow, we are seeing the same injustice unfold again. In communities  like Kona, Hawaii, a child was taken from his elementary school  classroom. Families are taken from their homes, and people live in  fear. Children…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690504/trump-immigration-policies"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…among the things that make us great is  our system of healthcare.\n\nSpeaking at a 1966 healthcare conference, Martin Luther King, Jr.,  observed: ``Of all forms of inequality, injustice in health is the most  shocking and inhumane.'' Many of these inequalities are, in part,  attributable to the disparities in access to healthcare.\n\nDisparities in health…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…their independent system of justice. Impunity for Mr.  Levi's crime and the crimes of other settlers must end. We cannot be  complacent in the face of this deadly violence and injustice.", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694532/awdah-hathaleen"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…beautiful comments earlier and those of our  distinguished leader, Mr. Jeffries.\n\nMr. Speaker, Reverend Martin Luther King, Jr., famously said: ``Of  all the forms of inequality, injustice in health is the most shocking  and the most inhuman,'' he said, because people can die.\n\nThe Affordable Care Act, proudly also known as ObamaCare, is a pillar  of health…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698809/breaking-the-gridlock-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the Senate. The problem is in the White House  and in Environment and Public Works, Energy, and Interior. They are  simply not executing the laws fairly, and the bias and injustice and  illegality they have already demonstrated have got to stop if we are  going to go forward.\n\nIt ain't just this bill that has to come through EPW and go through  the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is there collective punishment, there is  ethnic cleansing taking place in Gaza.\n\nI rise to say that, at some point, we in this Congress have to take a  stand against the injustice being perpetrated against innocent  Palestinian men, women, and especially children.\n\nThis level of injustice is something that this country has always  stood against, but…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…central  place in American history. In doing so, she is helping to shape a  better future for all of us.\n\nThe Black Heritage Trail helps confront the systemic racism, bias,  and injustice that have festered in our country for too long. On behalf  of my constituents in New Hampshire's 1st Congressional District, I  thank Ms. JerriAnne Boggis, her staff, and…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700309/recognizing-the-black-heritage-trail-of-new-hampshire-for-black-history-month"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…this road, I tell you, we will  account for it. It was Dr. Martin Luther King who said that the arc of  the moral universe is long, but it does bend toward justice.\n\nThis injustice cannot stand. This cannot stand. And I tell you,  America, let's be careful. We cannot continue along this road. We  absolutely cannot. We must continue to encourage and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692441/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…They  cut about a trillion dollars out of healthcare. This is the dastard who  perpetrated the deed. He ought to be recognized in history as the  person who did the greatest injustice to healthcare the country has  ever seen, Donald John Trump.\n\nBut he has gone beyond this. His behavior is something that is  difficult to codify, difficult to explain, but…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are not going back, Mr. President.  Black people are going to move forward with the rest of this country.\n\nI am giving notice today that we will not tolerate this level of  injustice emanating from the highest office in this country, from the  Presidency. We will not tolerate it, Mr. President.\n\nI speak for a good many people of good will, of all hues,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…complete  nor accurate without acknowledging them. The lesson of this museum is  that all Americans share a past and a future. By staying true to our  principles, righting injustice, and encouraging the empowerment of all,  we will be an even greater nation for generations to come. I  congratulate all those who played a role in creating this wonderful…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…constituents and Americans across this  country. I call upon my colleagues to not let them be successful in  their attempts to obscure and distract.\n\nThomas Jefferson said: When injustice becomes law, resistance becomes  duty.\n\nResist.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693115/trump-leads-with-smoke-and-mirrors"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…average of $3.50  per hour. While originally well-intended, section 14(c) has not lived  up to its promise, and it needs to change.\n\nTwo of my constituents recognized this injustice as it relates to  their loved one, a high schooler, Ellie, who wants to be paid fairly.\n\nOver 10 days, the father-son duo ran 260 miles from New York City to  Washington,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…marginalized communities will  live on for generations to come. Alice was a force to be reckoned with,  stopping at nothing to ensure that others could live free of abuse,  injustice, and discrimination. Her undeniable impact will continue to  grace Kansas City with inspiration.\n\nAlice's long history of advocacy began when as a high school student,  she…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "John James", "party": "Republican", "sentence": "…out of public schools. Too many were pushed into charity-run facilities  or psychiatric institutions. Far too many were left without any  education at all.\n\nWe turned that injustice around. IDEA opened doors that had been  closed for generations. Since its inception, it has empowered families,  equipped teachers, and given children the opportunity to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…order.\n\nFor more than a decade, the Nation's largest athletic association  allowed men to compete in women's events. It will be a top priority of  mine to ensure that this injustice never happens again and that the  NCAA will fully adhere to the Executive order.\n\nWhile the vast majority of States are complying, there are some  States, blue States like…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Council's so-called Comprehensive Policing  and Justice Reform Emergency Amendment Act of 2022. If there is one  thing that act doesn't do, it is create more justice. It creates  injustice.\n\nThe CLEAN DC Act is essential to restoring public safety in our  Nation's Capital. For far too long, Washington, D.C., a city meant to  embody freedom and prosperity, has…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Native veterans who served in  Vietnam were unfairly denied the ability to apply for land allotments  due to their service overseas. While Congress took steps to correct  this injustice, the executive branch, until recently, has been slow  processing applications and conveyances, leaving many veterans in  limbo.\n\nAs of January 2025, out of more than 2,000…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693425/land-conveyances-for-alaska-native-vietnam-veterans"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…were told: By the  way, your allotment that you are supposed to be able to get, that you  wanted your whole life, that allotment changed, and you can't do it  anymore. Huge injustice.\n\nSo during the first Trump administration, I introduced legislation  called the Alaska Native Vietnam Veterans Land Allotment Act. And it  said: Hey, if you were overseas…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Springs.\n\nThe National Day of Remembrance for Aborted Children is focused on  helping to humanize our aborted brothers and sisters and deepening the  commitment to ending the injustice of abortion and providing healing to  those who have experienced an abortion.\n\nI honor the Colorado Springs Diocese and other faith-based  organizations in the Pikes Peak…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Mr. BENTZ. Mr. Speaker, I rise today to call out the injury and  injustice being inflicted on my State and my constituents by the  inappropriate and unfair enforcement of the Endangered Species Act as  it has been and is being applied to the reintroduction…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…for  working with my team to bring this bill to the floor. Of course, I  thank Congresswoman Lucy McBath for her tremendous support and her  testimony to just the terrible injustice and travesty that she has  endured. I thank her for her support and her management of this piece  of legislation, H.R. 909, across the aisle.\n\nThrough our collaboration,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Native veterans who served in  Vietnam were unfairly denied the ability to apply for land allotments  due to their service overseas. While Congress took steps to correct  this injustice, the executive branch until recently has been slowly  processing eligibility applications and conveyances, leaving many  veterans in limbo. As of January 2025, out of more…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693473/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…incredible. If the rest of the  country were like Alaska Native people in terms of service to our  military, we would have a better America.\n\nThey underwent an incredible injustice because so many Alaska Natives  went to Vietnam to serve in the war when a lot of Americans--let's face  it--were avoiding service in Vietnam. So these great men and women…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…was doing in  Minnesota.\n\nThe person who bit off the finger of an ICE agent will not suffer any  penalty at all that we can determine.\n\nNow, this is not only an incredible injustice to the ICE agent who  lost his finger, it is a danger sign for America. Every country has  immigration laws. When I talk to people in my district, even people who  think…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…always loud, not always quiet.  Standing up for your freedom is swimming against the school, looking  for those who may follow. It is a war cry against the face of tyranny  and injustice. It is a tough battle, one that we as Americans must be  proud to face every day because, simply, it is American.''\n\nOur next winner is Tanner Gill, who is in ninth grade…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the 1984 champions have had no victory cup to mark their achievement.\n\nWhat began as a casual conversation last spring has turned into the  long-awaited correction of that injustice. This Saturday, after 42  years, the 1984 team will finally be recognized with a ceremony and the  presentation of a specially made championship trophy.\n\nThese remarkable…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…fate with no economy, no jobs,  reduced subsistence, and no hope for the future of our people.'' In  front of those gathered, Secretary Burgum committed to rectifying this  injustice.\n\nBecause of the opportunities provided by oil and gas operations, this  industry has provided thousands of good-paying jobs to Alaskans, become  the primary driver of my…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…for the bill to clear the Senate. Today is  our opportunity to get this crucial issue finally across the finish  line. A vote today for the Lumbee people will fix a historic injustice,  and I urge support of this amendment.\n\nMr. ROUZER. Mr. Chair, I yield 1 minute to the gentleman from North  Carolina (Mr. McDowell).\n\nMr. ROUZER. Mr. Chair, I yield 1 minute…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]