[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…an even greater risk to children.       Even manufacturers of these devices acknowledge that       deploying them on young people increases the risk of death or       severe injury. It is therefore dangerous to expand access to       these devices before creating strong guardrails to ensure       they are not deployed against children.\n\nSandy Hook Promise…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…medical research that directly  benefit our service members and veterans. Over the years, this program  has supported lifesaving innovations in areas such as traumatic brain  injury. PTSD, breast cancer, and other conditions that  disproportionately affect our military community. Many treatments and  therapies that were once experimental are now standard…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692417/introduction-of-medical-research-for-our-troops-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Republicans taking away  healthcare from over 370,000 of my constituents who rely on Medicaid,  they are actively worsening the health problems many of them face. This  is insult to injury. I urge my colleagues to vote ``no.''", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690477/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…slowing down  processing times, and closing offices, the American people are not  getting the service they earned from the Social Security  Administration.\n\nNow, to add insult to injury, the Trump administration is vowing to  withhold the benefits of Americans as a result of mistakes made by the  Social Security Administration. Instead of making the Social…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in one of the worst days of injuries for law  enforcement officers in the United States in this century.\n\nThis affront is now adding further symbolic insult to the grievous  injury that began at the beginning of this administration. President  Trump granted full pardons to more than 1,500 insurrectionists and  rioters and commuted the sentence of the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…incompatible with self-governance and the  rule of law, and has committed high crimes and misdemeanors in  attempting to establish himself as a lawless tyrant to the manifest  injury of the people of the United States.\n\nWherefore, Donald John Trump, by such conduct, has demonstrated that  he is unfit to govern a nation by and for the people, has acted in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…local       law enforcement responsibilities and federal immigration       enforcement will only deepen inequities and disrupt local       economies.\n\nH.R. 2966 adds insult to injury by imposing sweeping new       restrictions on SBA loan eligibility, explicitly excluding       entrepreneurs with certain immigration statuses--including       asylees, refugees,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…President have done has made life harder. It has made going to the  grocery store like a military exercise. We are trying to figure out  what we can buy.\n\nTo add insult to injury, we should be working together on legislation  that will help our neighbors back home. What bills do the Republicans  bring to the floor of the House today, the day of the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…just passed their big, ugly law  that rips Medicaid by nearly a trillion dollars, adds 15 million people  uninsured, and raises costs for everybody. Now, to add insult to  injury, they refuse to extend the Affordable Care Act.\n\nThis bill that they want to replace it with is a bamboozle. It is a  hoodwink. It is a scam for the American people. It promotes…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698369/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. residents       deemed important such as mandatory public release of body       worn camera footage within five days of officer-involved       deaths or serious bodily injury, strengthened civilian       oversight of police use of force, limitations on consent       searches, requiring additional law enforcement training on       racial bias and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…approach to their health not just  during June but every month of the year.\n\nThe caucus focuses on key areas like mental health care, prostate  cancer screening, traumatic brain injury, and urological health. These  are not fringe issues; they are central to the well-being of men across  America, and yet they often go unaddressed until it is too late.\n\nWe…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…acted in a manner contrary to  his trust as President and subversive of constitutional government to  the great prejudice of the cause of law and justice and to the manifest  injury of the people of the United States.\n\nWherefore Donald John Trump, by such conduct, warrants impeachment,  trial, and removal from office.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…trust and a solemn promise to generations of America's  workers. It is a promise that includes a retirement benefit that is  earned. It is a disability benefit in the event of injury. It is also a  survivorship benefit, an insurance benefit for families if the earner  becomes ill or is fatally hurt and dies.\n\nThis belongs to all Americans who work. Workers…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the Distinguished Service Cross. Following the fighting at D-day, Mr.  Lomell continued to serve his country in other battles, earning a  Silver Star. After receiving another injury, he was honorably  discharged in December of 1945.\n\nAfter the war, Mr. Lomell returned to New Jersey, where he settled in  Toms River. He graduated from Rutgers University…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…disabled granddaughter that I am raising at home, instead of       being sent to an institution. She will put her life at risk       for a medical emergency or fatal injury without nurses here.\n\nAsh:\n\nMy daughter takes speech therapy, occupational and physical       therapy, and tutoring. So if that is all gone, she will stop       progress, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…deadly force to prevent the  escape of a fleeing suspect only if the officer has a good-faith belief  that the suspect poses a significant threat of death or serious  physical injury to the officer or others.''\n\nDuring his time with the Sheriff's Department, Deputy Larkin received  a number of awards, including being named ``Reserve Deputy of the  Year.''…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689236/recognizing-deputy-jeff-larkin"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Service to issue  regulations requiring Postal Service employees and contractors to  report to the Postal Service traffic crashes involving vehicles  carrying mail that result in injury or death, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 758\n\nBe it enacted by the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…than through an application by       such person for a specific Government financial or other       benefit, and is required to be kept secret in order to       prevent undue injury to the benefit, and is required to be       kept secret in order to prevent undue injury to the       competitive position of such person; or\n\n(6) may divulge matters required…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…proposal to an industry that I have seen in  a long, long time.\n\nThe States have made progress, and more progress is coming. Most  States have age limits.\n\nTo add insult to injury, we are given this legislation in an  appropriations bill. We have Senate rules against this.\n\nSo I would recommend that we vote for this amendment, and my  amendment would…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…outdated policy can get in the way of safer  outcomes. At the end of the day, this is about encouraging tools that  help de-escalate conflict and reduce the chances of serious injury or  loss of life.\n\nAcross the country, law enforcement officers are asked to resolve  dangerous situations every day with the least amount of harm as  possible. Less-than-lethal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…Chief  Warrant Officer 4, where he provided leadership and support to units  from the battalion to the corps and beyond.\n\nAt the end of 2023, Garrett suffered a life-altering injury to his  skull during a drone attack in Iraq. He's accomplished great strides in  his recovery with his family by his side, even learning sign language  from his son Tucker,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…art that  is going to continue to improve, autonomous vehicles are overwhelmingly  safer than human-operated vehicles by a factor of about 10 when it  comes to the risk of injury or death.\n\nWhen you think about that, that means that being in an autonomous  vehicle, in a self-driving car, is a much more effective safety  intervention than wearing a seat…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…product safety standard for fixed and freestanding       retractable awnings within the jurisdiction of the Commission       to protect against the risk of death or serious injury       related to the hazards associated with such awnings,       including the risk of death or serious injury related to the       awning unexpectedly opening and striking…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Mr. BENTZ. Mr. Speaker, I rise today to call out the injury and  injustice being inflicted on my State and my constituents by the  inappropriate and unfair enforcement of the Endangered Species Act as  it has been and is being applied…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…investigation or       ongoing prosecution, provided that such withholding is       narrowly tailored and temporary;\n\n(D) depict or contain images of death, physical abuse, or       injury of any person; or\n\n(E) contain information specifically authorized under       criteria established by an Executive order to be kept secret       in the interest of national…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…projectile at a velocity exceeding 500 feet per second.\n\nThe device is designed and intended to be used in a manner       that is not likely to cause death or serious bodily injury.\n\nThe device does not accept, and is not able to be readily       modified to accept, an ammunition feeding device loaded       through the inside of a pistol grip.\n\nThe device…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…the ladder when the spring-loaded arm of the awning  unexpectedly shot out at him, forcing his ladder to tip and causing him  to fall. Michael suffered a severe spinal cord injury, and despite  efforts to save him, he tragically passed away a few days later.\n\nHis passing affected his family profoundly and reverberated  throughout the communities he touched.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…or attempted       suicide;\n\n``(B) commit animal crushing (as defined in section 48);\n\n``(C) engage in abusive or degrading nonsexual conduct       (whether or not physical injury results) for which any person       can be charged with a criminal offense; or\n\n``(D) engage in sexually explicit conduct, as defined in       section 2256(2)(A),      shall…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…survived.\n\nHe was a 46-year-old with a history of erratic behavior. He was  charged with DWI and assault. A few days before the shooting, he had  been arrested for two charges of injury to an elderly person; one  charge of assault, family violence causing bodily injury; and one  charge of driving while intoxicated.\n\nThe Bexar County Magistrate's Office--Bexar…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…trillion. That is $2 trillion more being spent than what  is coming in. A deficit of this magnitude should be concerning enough  even on its own merits. But to add insult to injury, Congress passed a  budget just 5 months ago which set a spending cap of almost $6 trillion  for the year. So 5 months ago, Congress did actually pass a budget-- halfway through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}]