[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…identifiable information, depictions of their abuse,  or information that would jeopardize an active Federal investigation or  national security.\n\nThis was carefully crafted with the insights of law enforcement to  hold people accountable and redact only what was necessary to protect  either an ongoing investigation or to protect the victims.\n\nWe had a chance to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…links to the Proud Boys, the Oath  Keepers, and several other white nationalist organizations.\n\nMr. Martin frequently praises Mr. Posobiec online and calls his anti- Semitic insights valuable and incredible. Mr. Martin's own views are  saturated with deranged analogies that dilute the meaning of Nazism and  Fascism.\n\nIn one episode about the 2024 election,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…community policing, mental health and addiction. I have  also had the honor of working with him through my Mental Health and  Substance Use Disorder Advisory Council, where his insights have been  invaluable.\n\nChief Tate's compassionate approach to policing is respected and  recognized by his peers. He has won numerous awards including the MN  Chiefs of Police…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700084/congratulating-chief-jeff-tate-on-his-retirement"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…foremost voice for sensible climate policies, someone  who for years has warned us of the approaching dangers of climate  change and today once again has demonstrated his great insights-- particularly with respect to the cost to homeowners--of climate change.  He is raising the alarm about President Trump's environmental policy  and the effect it will have…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…the intersection of religion and science. This honor is  awarded annually to those who advance Sir John Templeton's vision of  progress in religion through discoveries and insights that deepen our  understanding across faiths. Since being elected Ecumenical Patriarch,  Bartholomew has been a courageous voice for unity, religious freedom,  and environmental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…year.\n\nMarking all hatchery fish will drastically improve data collection,  enabling better analysis of the health of wild fish stocks. This  information will provide valuable insights to help develop a science- based, collaborative fishery management program. This legislation also  ensures that the collected data will be shared with all relevant  fishery…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…medical debt.\n\nOne of my staffers kind of shook me with the reality she was dealing  with, which is she has stratospheric medical debt.\n\nSo here is an article from Healthcare Insights. It is not a partisan  rag; it is a scientific journal. ``How Medical Debt Is Crushing 100  Million Americans.'' It is from October of last year.\n\nThis author--I just want…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…And I do feel like this is so fundamental to our Nation. That is why  everyone who has come down to the floor, everyone here who has asked  questions today and made solid insights as they prepared their  question, we are collectively ringing the alarm bells. We are ringing  the alarm bells because authoritarianism is not down the road or around  the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…with any performance data. My  bill addresses this problem and requires the SBA to conduct an annual  risk assessment of the 504 program and provide Congress with detailed  insights into overall health of the program and information needed to  strengthen program performance.\n\nMadam Speaker, transparent data is the cornerstone of a productive  partnership…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…programs become more inclusive. She created an  instruction manual to share with other organizations, providing a  supply list, step-by-step instructions for building, and insights  regarding the benefits of wheelchair-accessible garden beds. This  project will have a positive impact on our community for years to come.\n\nOn behalf of Michigan's 3rd Congressional…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Triangle, Beyond the success of SEPI Engineering and Construction, she  held leadership positions at several important nonprofits and  government organizations. Her wisdom and insights were valued at the  Raleigh-Durham Airport Authority and the North Carolina Chamber of  Commerce, earning her recognition as a Top Entrepreneur, Career Woman  of the Year,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…for use on the Moon and beyond.\n\nJust last week, scientists posted new data from the Department of  Energy's ground-based Dark Energy Spectroscopic Instrument, providing  insights on the mysterious dark energy of the universe that NASA's  science satellites also study from space.\n\nWe are on the tipping point of major things. We are working on and  seeing…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…over HUD to ensure housing programs are working for  all Americans.\n\nThat being said, my bill will require the inspector general to  provide Congress with recommendations and insights into reforming HUD's  programs and rooting out waste, fraud, and abuse in our Federal  spending.\n\nHousing issues impact all Americans. I commend this administration  for their…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…advisor. Mac was instrumental in creating and managing  Representative Roby's constituent Veterans' Advisory Committee, which  allowed the Congresswoman to gain additional insights, perspectives,  and ideas to drive her oversight and legislative agenda.\n\nIn July 2014, Mac landed his next role in Congress working for the  Select Committee on Benghazi.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…addition to his work with the Eagle Eyes Program, Mr. Ross is an  invaluable member of the School Advisory Council. His contributions to  the council are marked by thoughtful insights and a collaborative  spirit. He brings a unique perspective as a parent, helping to bridge  the gap between the school administration and the parent community. His  input…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…driving home the  importance of good policies.\n\nTaiwan's per capital GDP has grown more than 35 times larger since  the end of the Chinese Civil War. The island has crucial insights to  offer an institution that seeks to put its borrowers on stable footing.  It is long overdue for Taiwan to receive the recognition and  representation it rightfully deserves…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…inventory of their  software licenses to better understand how it is used, who uses it, and  how many licenses go unused. The bill will also provide Congress with  better insights into how our Federal agencies purchase and use  software.\n\nThe text we are considering today is identical to the text we passed  out of the House by voice vote last Congress.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Wisconsin on behalf of Cliff Stearns of Florida.\n\nMs. EDWARDS. The Chair recognizes the Honorable L.F. Payne of  Virginia.\n\nMs. EDWARDS. Thank you all for these really wonderful insights,  anecdotes, and celebration of the Article I branch. You have given us  the perfect setting as FMC commences the America250 programing.\n\nI now recognize Barbara Comstock,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and\n\n(G) identifying and describing necessary tools, including       commercially available risk assessment tools, that leverage       data and industry expertise to provide insights into critical       supply chain vulnerabilities, including how such tools       fulfill the requirements described in subparagraphs (A)       through (F).\n\n(2) In consultation…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…respect--don't always agree with--the  seriousness of Mr. Freidman's writings. He has written a lot of books,  a lot of columns, especially on the Middle East, where he has a lot of  insights, no doubt about it.\n\nBut when I read this latest column called ``I Just Saw the Future. It  Was Not in America,'' I couldn't believe how shockingly naive Mr.  Freidman was…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…educator. He  published a book of POW stories for schools, and he made personal  classroom appearances. He also authored a memoir, ``Witnessing the  American Century,'' sharing insights from a life lived at the  crossroads of world events.\n\nEven in his nineties, Allen embraced new adventures as he continued  to inspire students and veterans alike. Captain…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}]