[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Operations budget by $115  million. We reduce their detention capacity, providing funding that  could only be used for body-worn cameras. We increase funding for the  Office of Inspector General, specifically for oversight of ICE  detention facilities.\n\nThese are good provisions. I am glad they are in this bill, but it is  clear that more must be done. ICE…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Meanwhile, the Trump administration's illegal shutdown of grants,  loans,  and partnership funds to our local communities and nonprofits; the  firing of public servants, like the inspector general at the Department  of Energy, whose job it is to root out waste, fraud, and abuse; the  firing of experts that oversee the nuclear enterprise and our nuclear  weapons;…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…management and  oversight.\n\nIf there were any truth to their hyperbolic claims of corruption, for  which they have offered no credible evidence, they should have asked  the USAID Inspector General to investigate, rather than fire him  without cause.\n\nAnd if they actually did discover programs they don't support, they  could have reprogramed the funds consistent…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…coordination. That is really important. It requires a  memorandum of understanding with the Army, Navy, Air Force, and Coast  Guard to share safety data, and it directs the Army inspector general  to audit pilot training, maintenance protocols and the compliance.\n\nThis bill represents real progress. I want to thank the chairman,  Chairman Cruz, for working…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…businesses. Proposals such  as cutting the SBA workforce by 43 percent; relocating SBA offices away  from New York City, the center of that region; and firing an  independent inspector general do not represent anything that looks like  America First. It is an ideological agenda, and it is imposed upon the  majority of this country that functions differently…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…staff.\n\nIn the New York City area, this would mean a loss of approximately  380 positions. While the VA claims these are unneeded openings left  from the pandemic, its own inspector general reported last August that  94 percent of VA facilities reported severe staffing shortages for  medical officer occupations, and 79 percent of facilities reported…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699027/scrimping-on-veterans-medical-care-is-un-american"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Homeland Security. I missed  the following votes, but had I been present, I would have voted no on  rollcall vote No. 458, On the Motion to Invoke Cloture, Cheryl Mason to  be Inspector General, Department of Veterans Affairs. I missed the  following votes, but had I been present, I would have voted no on  rollcall vote No. 461, On the Nomination, Confirmation:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695340/vote-explanation"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…best of our inspectors general has been Mike Missal.  He was responsible for recovering more than $37 billion during his  tenure at the Veterans' Administration. He was the inspector general at  the VA under both Republican and Democratic administrations, widely  respected by both sides of the aisle. Republican colleagues have worked  with him, I have,…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…and mismanagement of taxpayer       dollars.'' Dr. Atul Gawande, former Assistant Administrator       for Global Health, USAID\n\n``So, you know, for USAID, in the last six inspector       general reports, 94% of the spending had been audited, 0.3%       were found to have issues. Half of that was reclaimed. That       is not an enterprise that has been,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the law. I guess it started  with Signalgate, when Secretary Hegseth put on an unsecure channel  sensitive, classified information that could place our troops at risk.\n\nThe inspector general did a report on that. They concluded exactly  that, that Secretary Hegseth had unnecessarily placed our troops at  risk.\n\nHis response to this was to say: I am completely…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the flying public safe and our national air space efficient  is the responsibility of Donald Trump's FAA. They are failing  spectacularly. So today, I am demanding a full Inspector General Office  investigation into what happened at Newark so these problems do not get  worse or spread to other airports around the Nation. I am demanding  that the OIG,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690645/faa"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…haven't  heard a peep from our Republican colleagues about that nor about his  wrongful action within days of his inauguration of abruptly and  unjustifiably firing the chief inspector general of the Social Security  Administration. That is the public watchdog who is there to ensure that  no fraud--dead, living, or otherwise--occurs. In only a single year,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Senior Foreign Service Officer, retired; Steven Browning, US       Ambassador. retired, Former Principal Deputy Assistant       Secretary of State; David Buckley, Former Inspector General,       Central Intelligence Agency; Susan F. Burk, Former Special       Representative of the President; Peter Burleigh. US       Ambassador, retired; Scott Busby,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Administration.\n\n4. Calendar Number 265: Marc Andersen, of Virginia, to be       an Assistant Secretary of the Army.\n\n5. Calendar Number 355: Christopher Fox, of Virginia, to be       Inspector General of the Intelligence Community, Office of       the Director of National Intelligence.\n\n6. Calendar Number 359: Macon Hughes, of Texas, to be an       Assistant Secretary…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…would ensure that they have no direction from  Congress.\n\nThis bill flat-funds ICE, but at the same time, we also strengthen  the oversight of ICE by increasing funding to the inspector general by  over $38 million over fiscal year 2025. That includes $20 million to do  additional inspections of ICE facilities and $12.8 million to provide  oversight of the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…later this month after nearly 30 years in federal law enforcement.\n\nAfter graduating from the University of Illinois, Director Berg began  his career in 1996 as an Immigration Inspector with the former U.S.  Immigration and Naturalization Service at Chicago's O'Hare  International Airport.\n\nPeter's long career in federal law enforcement has taken him across…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Street, of       Virginia, to be Director of the National Counterintelligence       and Security Center\n\nExecutive Calendar No. 285, Peter Thomson, of Louisiana, to       be Inspector General, Central Intelligence Agency\n\nExecutive Calendar No. 289, Jeffrey Bartos, of       Pennsylvania, to be Representative of the United States of       America to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…in subsection (e), as so redesignated, by striking       ``Commandant'' and inserting ``the Secretary of the Coast       Guard''.\n\n(k) Chief Prosecutor of the Coast Guard; Inspector General       of the Coast Guard.--\n\n(1) In general.--Chapter 3 of title 14, United States Code,       is amended by adding at the end the following:       ``Sec. 324. Chief…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…indicted in 2023 and has been in Federal custody ever since,  but his partner and other associates have not been.\n\nThe Reedley lab was discovered in December of 2022 when a code  inspector came upon a suspicious warehouse. Inside, she found many  Chinese nationals wearing white lab coats, glasses, masks, and latex  gloves, along with thousands of vials of biological…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…paid to foreign governments and  elsewhere.\n\nSince my oversight shined the light on the Biden Justice Department's  failures and misguided approach, the Department of Justice inspector  general opened its own independent audit. And at my request, the  Government Accountability Office also agreed to review the Department  of Justice's administration of this…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689937/national-crime-victims-rights-week"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…7(a) lender,  and a small business. This legislation is necessary due to the  increased role of loan agents in facilitating 7(a) loans to American  small businesses.\n\nThe SBA inspector general reported that nearly one out of every seven  loans involved a loan agent. Unfortunately, the inspector general also  noted that there has been over $335 million in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691855/9999"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…MacDonald, Firefighter William Bowen, Firefighter Clayton       Lease, Firefighter David Miller, Firefighter Zack Misiura,       Firefighter Aaron Reese, Lieutenant Inspector Keith Miller,       Inspector Josh Adkins, Inspector Lisa Brooks, and Inspector       Nicholas Riffe of West Manatee Fire Rescue District, Captain       Marshall Greene,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…component service from June 1988 to October 1999, Chief  Smith performed numerous support functions within the Maintenance Group  and Logistics Group, as well as Quality Assurance Inspector and  Exercise Evaluation Team Member.\n\nChief Smith deployed in support of myriad missions, including  Operation Provide Comfort, Northern Watch, Southern Watch, Iraqi  Freedom,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698215/recognizing-chief-master-sergeant-robert-s-smith"}, {"senator": "French Hill", "party": "Republican", "sentence": "…3(b) of the United States       Housing Act of 1937 (42 U.S.C. 1437a(b))) for which an       administrative or judicial receiver or Federal monitor was       appointed.\n\n(2) Inspector general.--The term ``inspector general''       means the inspector general of the Department of Housing and       Urban Development.\n\n(3) Secretary.--The term ``Secretary''…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…bipartisan legislation with my  colleague, Congresswoman Nikki Budzinski, because we saw a program that  required action. Bureaucratic red tape is the enemy.\n\nThe reports by the inspector general are a testament to what veterans  in my district already know: Staffing shortfalls are more than a  figure. They are missed appointments, endless long waits, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Member Joseph D. Morelle and I wish  to recognize a special group of dedicated and exceptional employees of  the Office of the Clerk, Office of the Sergeant at Arms, Office of  Inspector General, and the Office of the Chief Administrative Officer  of the U.S. House of Representatives who have reached the milestone of  25 years of service.\n\nThe House's most…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…We will hear from two panels of experts who will help shine a light  on the missteps of the Biden administration. Our first panel will  include Mr. Craig Adelman, deputy inspector general at the Department  of Homeland Security; Michael Roark, deputy inspector general with the  Department of Defense, and Mr. Arne Baker from the Office of Inspector…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…now directed to report to Congress  within 90 days with a concrete plan to reopen and restore service,  including in western North Carolina. Second, the Postal Service's  Inspector General must submit a specific reopening plan for facilities  closed due to Hurricane Helene.\n\nMr. Chairman, I urge all of my colleagues to support this bill.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…interviewed agency       officials about CMS's fraud risk management activities in       this program. We reviewed relevant reports from GAO and HHS's       Office of the Inspector General. We evaluated information       from relevant documentation and interviews of agency       officials against relevant leading practices in GAO's A       Framework…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…discount window operations       and a progress report on the actions taken to implement the       identified enhancements described in subparagraph (C).\n\n``(ii) Reports by the inspector general.--The Inspector       General of the Board of Governors of the Federal Reserve       System and the Bureau of Consumer Financial Protection shall       submit an…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}]