[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…advocacy for our State  and the people who make it a special place. Rhode Island is much better  today because of senate President Ruggerio's leadership and dedication.  He inspired us all and will continue to do so.\n\nMr. REED. Mr. President, on a different topic, I note that the Senate  this week has started debate on the GENIUS Act. This bill establishes…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…However, with strong encouragement from Reverend Dr. Albert P. Jackson,  her sister Jeanette, other family members, friends, and her late  brother, Rice, Reverend Carr became inspired and felt a strong urge to  fulfill the calling she had long ignored, thus began her training and  educational journey.\n\nOn November 24, 2024, she made history by becoming…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…with which God has blessed us. For this leadership, he is being awarded  the prestigious Templeton Prize during his visit.\n\nPatriarch Bartholomew's spiritual guidance has inspired Orthodox  Christians across the globe. In my own district, he has been a shepherd  to the congregation of St. Demetrios Greek Orthodox Church in Union,  New Jersey. Under…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695736/recognizing-the-visit-of-ecumenical-patriarch-bartholomew"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…glory.\n\nTelling the story of America is impossible without telling the story  of the U.S. Marine Corps. Their sacrifices have safeguarded our  freedom. Their discipline has inspired generations. Their traditions of  toughness, honor, and duty have stood the test of time. Historic  battles exemplify the Marine Corps' unyielding commitment to courage,…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…know  what the constabulary will do. There were people who warned them,  admonished them, pleaded with some of them, saying: Those people will  hurt you. These people are inspired by hate. There are some evil people  among them.\n\nIt was courage, however, that said: Go on to the Edmund Pettus  Bridge, go on to the Edmund Pettus Bridge.\n\nNot only did…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Challenge Winner for Ohio's  13th District when he was in middle school. His app, Care Civics, was  designed to encourage young people to become civically engaged. He was  inspired by his time studying for the Ohio Civics Bee, which he went on  to win in 2024. Now, just a high school freshman, he has come out on  top at the national level, and I could…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise today to recognize Donna Minter from  Minneapolis for her extraordinary feat of completing the Grammy Climate  Ride. Inspired by her love for her grandchildren and a vision for a  healthier, more sustainable planet for future generations, Donna spent  64 days traveling 3,000 miles by bicycle to raise…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695414/recognizing-donna-minter-on-completing-grammy-climate-ride"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…perhaps greatly, by the DNA of our  Nation, which is the pioneer spirit. People are just about innovation.  They want to discover and create a stronger economy.\n\nIt is also inspired in upstate New York because I represent the  easternmost portion of the Erie Canal. This is a bold vision that  connected a great ocean, the Atlantic, with the Great Lakes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…now  serves over 312,000 patients across New Hampshire and Vermont.\n\nI have had the pleasure of meeting with Tess multiple times over the  past few years, and I am always inspired by her determination,  creativity, positivity, and genuine passion for community health. I am  so grateful to Tess for sharing her experience and knowledge with me  and other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Heroes Benefit Concert marks the  culmination of an incredible journey. Corey's dedication, passion, and  commitment have left an indelible mark on our community. She has  inspired others to give back and has demonstrated the power of music to  heal, uplift, and unite.\n\nOn behalf of the Sixth Congressional District of Colorado, I extend  my gratitude…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…CaRiMi, a pioneering group that has       played an instrumental role in shaping and elevating Haitian       music and culture. Through their infectious rhythms, they       have inspired generations and brought people together through       the universal language of music;\n\nWhereas, the band's founding members--Carlo Vieux, Richard       Cave, and Mickael…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…yielding, and I thank Representatives McClellan and Clyburn for  initiating this Congressional Black Caucus Special Order on education.\n\nLet me just say that I have been so inspired by previous speakers,  including speakers on the other side of the aisle who held their  Special Order before this one.\n\nI rise as a proud granddaughter, daughter, and mother…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…these bombs  and cause any further carnage.\n\nAn ISIS flag was found in the truck, and the FBI confirmed that ISIS  had not coordinated with the attacker but, in fact, had inspired him.\n\nThis heinous and sick act of cowardice not only shattered the lives  of victims and their families but also exposed vulnerabilities in our  urban security infrastructure.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…leadership from a new generation of freedom  lovers. Let us all rise to answer that call. Freedom means never  surrender.\n\nBravo, Ukraine. Bravo, President Volodymyr Zelenskyy. You inspired  freedom lovers across our globe.                            JD Vance Visits Toledo\n\nMs. KAPTUR. Mr. Speaker, on another front, today, Vice President JD  Vance traveled to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…again: Are our children alive?  Are they dead? And, of course, tragically, their worst fears happened.  What Omer and Itay's family have endured is beyond comprehension.\n\nI am inspired by their perseverance, by their resolve to keep calling  for the safe return of remaining hostages, even though their loved ones  are gone, and for the return of the bodies…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of slowing down, she stepped up when she heard Gulfside needed  volunteers. In just three years, she has donated more than 3,650 hours  of her time to Gulfside Hospice.\n\nInspired by her mother, a longtime hospice volunteer, Joan has always  felt a deep connection to those in hospice care. Facing her own health  challenges, including chronic pain and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…reauthorize the Congressional Award Act, including Representative  Richard Hudson of North Carolina and Senator Lummis of Wyoming.\n\nFor decades, the Congressional Award Act has inspired young people to  engage with their communities and improve the lives of their neighbors  and themselves. On the Education and Workforce Committee, we are  constantly working…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698222/congressional-award-program-reauthorization-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…with uncommon valor and lifelong dedication.  It is fitting that his service and legacy be entered into the  Congressional Record so that future generations may know and be  inspired by his example.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699080/9999"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…funding throughout my time in Congress and thank him for his  service.\n\nI am also thankful that my son, Trey, who now serves as a major in  the United States Marine Corps, was inspired to answer the call to  serve after his experience as a cadet in the Civil Air Patrol.\n\nI extend my deepest gratitude to Colonel Swain for his service and  congratulate him…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…in 1654, Jewish Americans  have made extraordinary contributions to every facet of American life-- strengthening our culture, economy, and society.\n\nThis alarming trend has inspired a growing grassroots civil rights  movement, End Jew Hatred, dedicated to making antisemitism and Jew- hatred unacceptable in contemporary American society. This movement…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…FITZPATRICK. Mr. Speaker, I rise today to recognize a remarkable  individual from my district, Mr Frank C. Parker, IV. For nearly three  decades, Mr. Parker has nurtured and inspired the musical abilities of  students in the Quakertown Community School District.\n\nMr. Parker attended Moravian College, where he earned a bachelor's  degree in musical performance…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Halls of Congress, indifferent to  politics, to make sure the  voiceless were heard and reflected in our policymaking.\n\nMr. Speaker, I thank Grant for his work, which has inspired so many,  including myself.\n\nGod bless.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688646/recognizing-grant-smith"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…tours internationally in Japan, Hong Kong, China, and  South Korea.\n\nTarquin's journey began at the age of 5 when his mother, who taught  herself to play the violin at age 34, inspired him to pursue music.  Since then, his passion has taken him to venues like the Montana Senate  Chamber where he performed a piece from Mozart's Violin Concerto No. 4  during…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693758/recognizing-tarquin-bennion"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…never stopped at her own front door.\n\nService is not just something Diane does--it is the essence of who  she is. A pillar of our community, she has led Girl Scout troops,  inspired others as a Zumba instructor, and spearheaded efforts that  have uplifted countless lives. She raised over $50,000 for the American  Heart Association's ``Go Red for Women''…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Mr. Speaker, I rise in strong support of the big,  beautiful bill.\n\nAt its heart, the big, beautiful bill is a measure that will make  America both wealthier and safer. I am inspired in thinking about the  big, beautiful bill of not only this President but two of my favorite  former Presidents.\n\nThe first would be President John Fitzgerald Kennedy, who…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…hardship.\n\nH. Res. 364 encourages Gold Shield families to turn on these trusted  groups for connection, care, and healing as they navigate life after  loss. This resolution was inspired by one such organization, Camp  Freedom in Carbondale, Pennsylvania. Their executive director, my good  friend Matt Guedes, is in the Chamber with us tonight. He brought this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…A native of Savannah, Georgia, Mrs. Melroy lived a life defined by  faith, service, and love for others. Her passion for learning led her  to become a teacher, where she inspired countless young people and  passed on her joy for education to future generations.\n\nAt home, she poured her heart into raising her sons, who remember her  not only for her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695205/people-are-sick-and-tired"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and they have a  lot of students who are on their wait list. However, the teachers at  those schools are not automatically unionized as a matter of default.\n\nThat is what inspired Gavin Newsom and his enablers to try to enact  and, indeed, succeed in enacting an anti-charter school agenda. Because  TFA placed almost 50 percent of its teachers in charter…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of his father,  Joseph, and his two brothers, Paul and Jeff. His career was defined by  an unwavering commitment to his duties, demonstrating an exemplary work  ethic that inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's  dedication never faltered--his presence was a certainty,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…testament to Dr.  Bose's groundbreaking work in power grid automation, control, and  education. His research not only shaped the future of global energy  systems but has also inspired and educated generations of engineers in  eastern Washington and beyond.\n\nWe are fortunate to have such world-class expertise in our region,  and this award is a proud moment…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}]