[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Madam Speaker, I rise today to speak out  against another outrageous move by Donald Trump: his attack on the  National Institutes of Health.\n\nThe NIH is not just another governmental agency, it is the foundation  of America's medical research. It funds lifesaving breakthroughs that  doctors and scientists…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…they had erased their addresses. So they looked and  looked and looked until they could beg them to come back.\n\nThen there were thousands of employees at the National Institutes of  Health and Centers for Disease Control and Prevention during the bird  flu outbreak that were fired. They were fired when we were facing  another pandemic.\n\nMr. Speaker, they…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…funds after  disbursement. Donald John Trump has utilized DOGE to unlawfully block  or impound appropriated funds to dozens of Federal agencies, including  the National Institutes of Health, the Federal Aviation Administration,  and the Department of Veterans Affairs. By impounding congressionally  appropriated funds, Donald John Trump and DOGE have not…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…country would invest in  itself and invest in the future. Unfortunately, this administration  seems committed to doing the exact opposite.\n\nFunding cuts to the National Institutes of Health and the National  Science Foundation have kneecapped the world-class research ecosystem  that has made America great in the 20th century.\n\nThe politicization of science…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…closing all across the country, including in rural America because of  the Republican healthcare crisis.\n\nRepublicans, Mr. Speaker, continue to attack the National Institutes  of Health, the Centers for Disease Control, the FDA, and vaccine  availability.\n\nRepublicans have launched an all-out assault on the healthcare of the  American people, and it…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698365/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to right the wrongs of their big, ugly law,  but to make healthcare even more expensive and slash research into  lifesaving cures.\n\nThey cut funding for the National Institutes of Health and the  Centers for Disease Control and Prevention. They slashed funding for  State and local health departments, substance use prevention and  treatment, mental health…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…diagnosed with cancer when she was 29 weeks pregnant 8 years ago. By  the grace of God, her family, and the medical advancements made  possible by the HHS, by the National Institutes of Health, by the CDC,  she is here today, and her youngest daughter, Rae, is in the second  grade.\n\nThese are the people we are fighting for. This is why we are fighting  back,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690049/who-we-are-fighting-for"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Medicaid, cut SNAP benefits, put lifetime  caps on student loans, Federal student loans, cut funding that Congress  appropriated for cancer research, for the National Institutes of  Health, a whole host of things. People at home are scratching their  heads saying: How does this help me? How does this solve my problem? It  creates more.\n\nI spent the August…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…grandfather was a scientist. He was a biochemist who spent four decades  unlocking the key to how our metabolism works--in large part thanks to  funding from the National Institutes of Health. My grandfather and his  colleagues pioneered breakthroughs that impacted biochemistry around  the world, leading to all kinds of developments to keep our bodies  healthy,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and community- based health clinics are closing all across America.\n\nWe have also seen an extraordinary assault on the Centers for Disease  Control and the National Institutes of Health and the Food and Drug  Administration, on vaccine availability, on public health, and on  healthcare of everyday Americans here in the United States of America.\n\nToday,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…ultimate intellectual melting pot. That is being attacked on a daily  basis.\n\nThis administration has slashed funding for the National Science  Foundation, the National Institutes of Health, and the Department of  Energy's research programs. It has attacked universities as  ``indoctrination centers.'' It has made it harder for foreign students  to get visas…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…vaccines. They do essential and timely work to  keep people safe, and disruptions to their work can be harmful to the  health of American people.\n\nLet me go to the National Institutes of Health. It is the largest  public funder of biomedical research in the  world. It is facing devastating cuts. The NIH is one of the greatest  successes in publicly funded scientific…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, I rise in strong opposition to the Trump  administration's proposal to gut the National Institutes of Health.\n\nPut simply, NIH's work is the difference between life and death for  millions of Americans. Almost everyone knows someone who has lost a  loved one to cancer or Alzheimer's,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690846/national-institutes-of-health"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…are really the cuts to  some of the most technical jobs the U.S. Government has.\n\nWhether you are talking about NOAA or the National Weather Service or  the National Institutes of Health or the National Science Foundation or  the U.S. Department of Agriculture--they have all been targeted for  reductions. These Agencies are critical to our economic growth…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…medical research in this country, created entirely  by this new Trump administration.\n\nTen years ago, I met with Dr. Francis Collins, then the Director of  the National Institutes of Health, the world's premium biomedical  research agency. I admired his work so much that I asked him what I  could do to help.\n\nHe said:\n\nIf you can provide a 5-percent increase…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Dana-Farber Cancer Institute, and the University of  Miami.\n\nVoices Against Brain Cancer also advocates for increased federal  funding for brain tumor research at the National Institutes of Health  and increased public awareness. The cure rate for most brain tumors is  significantly lower than it is for many other types of cancers, a  statistic VABC is driven…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the enactment of this Act, the Secretary of State, in       consultation with the Secretary of Health and Human Services       and the Director of the National Institutes of Health, shall       submit to the appropriate congressional committees a report       on the organ transplant policies and practices of the       People's Republic of China.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}]