[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…adequately safeguarded their computer systems  from harm, despite gutting CISA--the very Agency tasked with assisting  them in safeguarding their computers and software.\n\nTo instill fear in election workers, the administration is doing  everything it can to signal that it will punish anyone who doesn't bow  to them.\n\nSince 2020, Trump has been posting…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of  Senator John Hoffman and his wife Yvette. These are shocking and  heinous acts of targeted political violence against elected officials.  They were clearly intended to instill fear in our communities.\n\nThe additional attempt that night to target Senator Ann Rest and  Representative Kristin Bahner demonstrate that this tragedy could have  been much…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…there. It could put parents behind bars for making, after deep  consideration, and in many cases, anguish, the decision that they deem  best for their own child.\n\nThis bill will instill fear in doctors and patients and rob parents  of their freedom to make decisions for and with their own children.  Instead, it puts that power in the hands of D.C. lawmakers.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698357/protect-childrens-innocence-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…court hearings.\n\nIt is an attack on due process, plain and simple. It is an attack on  the idea that we all deserve a fair shot in this country. It is also a  clear tactic to instill fear in all of us so that we will be  intimidated into submission and stop standing up for our neighbors.\n\nICE agents without visible ID, without any official markings on…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…medical experts and leaders.\n\nLet's be truthful about the real reason why President Trump wants to  deploy the National Guard to Chicago. It is not to reduce crime. It is  to instill fear and abuse his power.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694900/national-guard-deployment"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…For five decades, the Post has served as a hub for camaraderie,  patriotic education, civic engagement, and community service.\n\nFrom mentoring youth through programs that instill duty and honor, to  assisting veterans as they transition to civilian life, Post 667 has  embodied the American Legion's mission of service not self.\n\nTheir members have organized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Trump gets richer, something darker is  happening. The walls of our democracy are being disassembled brick by  brick. Federal troops are patrolling our streets to intimate and  instill fear. Senators and Members of Congress are thrown to the  ground, handcuffed, arrested, and intimidated. They are firing our most  experienced generals and admirals who may…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…after an ICE raid at a pizzeria in Honesdale,  Pennsylvania, two people gave quotes to local news that have been  making the rounds. One of them said: ``It is just made to instill fear,  and I am not sure why we need fear in our communities instead of love  and caring and community.''\n\nThat is what we are about in this country, and that is what we will…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to recognize East Fullerton  Little League's 70th birthday.\n\nLittle League's mission is to instill in children the values of  sportsmanship, honesty, loyalty, and courage, aiming to produce well- adjusted, stronger, and happier children.\n\nThe hundreds of volunteers who…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700082/east-fullerton-little-league-70th-anniversary"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Norman said that  he had ``a love affair with America.''\n\nA love affair with America--I think that is a very apt way to put it,  something we should all try to emulate and instill in our kids and  grandkids.\n\nNorman's love affair with America, I suspect, was behind his dogged  support for Donald Trump when so many of his old friends abandoned our  party…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…is dangerous.\n\nWe have seen a rise in anti-Semitism and anti-Israel hate since the  October 7, 2023 attacks. We have seen Hamas sympathizers take over  college campuses and instill fear in Jewish students. We have seen  violent protests on our streets and now in our Nation's Capital. Jewish  Americans are afraid to walk outside or live their daily lives.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…buy the beer.\n\nI think it is nuts that we protect our beer in this country more than  our ballots in jurisdictions. This is our opportunity, Mr. Speaker, to  change that, to instill significant election integrity.\n\nBefore I close, let me say that during this debate today, we are  likely to hear all sorts of comments from my colleagues on the left.  They…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…with integrity.\n\nJudge Ginn's influence extended far beyond the courtroom, where he  not only delivered legal rulings but also mentored those around him,  always striving to instill truth and justice.\n\nAfter retiring from the bench in 2014, Judge Ginn transitioned to the  business world as he purchased a struggling horizontal pump company in  Tulsa, Oklahoma.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…his efforts. Located  by our playground, all students watch the progress of the plants as  they grow, building excitement for when it is their turn to garden. He  has helped instill a love of learning in students as look forward to  Garden Day when it is their turn to get their hands dirty and learn.\n\nIt is clear Robert ``Bob'' O'Brien has made a profoundly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…fewer than 400,000 acres.\n\nCongress left little discretion to DOI. DOI's role was only to  establish and administer a competitive program and incorporate TCJA  requirements to instill success and economic feasibility, including  granting any easements or rights-of-way across the Coastal Plain for  exploration, development, production, and transportation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…were conducted.\n\nIf I recall correctly, it was zero percent statistically of Blacks  who had a poor or negative voting experience. We should champion that.  We should work to instill election integrity provisions across the  board. When people increase their confidence in our elections, then  they are more likely to participate. Mr. Speaker, that is a…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…made it only harder.\n\nThis is a voluntary opportunity to create a pilot program that can  create a new idea, make a good recommendation, capture a best practice,  and help to instill it in a way that improves water quality not only at  source, but downstream for every State, as well.\n\nWhile I support what the EPA is trying to do at the Federal level, I…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…been restricting free speech  when it came to immigration policies. They would have been for  restricting free speech if it intervened with the type of ideas they  wanted to instill in kindergarten or first grade or second grade  students with regard to human growth and development programs.\n\nIn any event, the totalitarians are at the gates. They are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…virtue and       patriotism--the three pillars of liberty--and these       attributes are best developed and nurtured in the home. Each       generation has a responsibility to instill a love of liberty       and virtue in the hearts of the next generation.\n\nWe affirm that ``All men and women are endowed by their       Creator with certain unalienable rights…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…children. She served faithfully in teaching,  serving, and leading the women of the church with grace and devotion.  Guided by an unwavering faith, she made it her mission to instill Godly  values in her children and to encourage them to accept Christ at an  early age. Her legacy continues through her son who now pastors his own  church, carrying on the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…This is something we started last year here in  this very Chamber, and I encourage my colleagues on both sides of the  aisle to maybe adopt this in their district to try to re-instill  patriotism into our great Nation.\n\nOur prompt this year is: What does it mean to stand for freedom here  at home and abroad?\n\nOur first winner is Taylor Olendorff who is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}]