[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…I rise today not just with concern, but with alarm. In his first 100  days back in the White House, Donald Trump has unleashed a full-blown  assault on America, on our institutions, on our workers, on the rule of  law, and on democracy itself. This is not leadership. This is a broken  promise.\n\nI will talk a little bit as we go forward about the promises…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I have the honor of representing Ohio's 9th  Congressional District, a region known for its patriotic spirit, strong  civic institutions, and deep respect for those who have served our  Nation in uniform. Today, I am privileged to recognize a distinguished  leader and devoted advocate from our community--Cindy…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…and get your credit report. Then the credit bureau sells that  information--which you don't want divulged and which the lender doesn't  want divulged--to other financial institutions without your permission,  creating a so-called trigger lead. Then, as was pointed out, you become  bombarded with phone calls, text messages, and other communications  from…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Americans was removed from  Jamaica Bay in New York City. References to climate change were removed  at Fort Sumter in South Carolina and Acadia National Park in Maine.  Public institutions and gift shops were banned from carrying books. In  America, they were banned.\n\nIn addition, the Department of Education is seeking to defund  schools, universities, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…trafficking and human rights, social economic  policy and development, trauma and violence prevention, and many more.  Its students contribute countless internship hours to institutions  across Georgia. And alumni of its Athens and Gwinnett campuses, as well  as its online program, are engaged in meaningful careers in service to  the well-being of our society.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Act, or VETT Act, introduced by  Representative Van Orden.\n\nThe bill makes improvements to the Shopping Sheet that is offered to  student veterans when they are applying to institutions of higher  learning.\n\nThese Shopping Sheets give student veterans more information about  the schools they are considering before they take the major step of  enrollment.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689601/veterans-education-transparency-and-training-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…to  enrich himself, reward his friends, and punish his enemies.\n\nSo I am asking my colleague: What kind of threat does this blatant  corruption pose to our democracy, our institutions, and on the American  people?\n\nMs. HIRONO. Certainly.\n\nSo the rampant corruption of this regime, what kind of threat does  this blatant corruption pose to our democracy,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696353/trump-administration"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…cases like this.\n\nWe celebrate Hispanic heritage, but we also issue a warning. Today it  is Latinos and other immigrants under attack. Tomorrow it will be  others. Once institutions are built to target and control, they don't  surrender power, they expand it.\n\nLike the military-industrial complex, they find new enemies and new  missions, new excuses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…discussion for a more theological venue.\n\nUnlike prior iterations of this bill, the current bill prohibits demo  days from taking place at facilities owned by religious institutions.  That is what is prohibited. It allows both Native American Tribes and  startup incubators to host them.\n\nI am aware of several instances where bad actors took advantage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…This is not just cruel. It is strategically self-defeating and  economically foolish.\n\nMake no mistake, this rescission package is Project 2025 in action-- dismantling our institutions, silencing oversight, and handing U.S.  global leadership over to the dictators on a silver platter, leaving us  alone in the world.\n\nThis bill attempts to rubberstamp the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…than White women. This is absolutely  unacceptable. We must address it at the Federal level. Yet, here we  are, Mr. Speaker, because we have systems right in place and  institutions have failed our folks, but here we are saying: We are also  going to take away your healthcare coverage.\n\nCutting Medicaid, again, is going to be a life-or-death situation…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…workers.\n\nThus, it seems obvious that such a pivotal part of the global economy  should not be excluded from engagement in one of our most important  international financial institutions.\n\nAs H.R. 910 requires, the U.S. would be an advocate that the IMF  admit Taiwan as a member, allowing the IMF to monitor and evaluate the  health of Taiwan's economy, provide…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…their concern that Congress is not fulfilling its  constitutional responsibilities by allowing this administration to  rescind approved Federal funding for minority-serving institutions of  higher learning in Indiana's First Congressional District.\n\nSince this administration is also rescinding Federal funds for  economic development projects that are approved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…communications  networks within 90 days. This Council would include representatives  from trusted communications companies, public interest organizations,  and academic institutions, as well as Federal, State, local, and Tribal  Governments for a term of 2 years.\n\nThis bill also requires the Council and its working groups to submit  reports offering…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Toledo area and Harold himself from Port  Clinton and points east.\n\nTheir contributions to our Armed Forces and to our communities remain  an indelible part of our history. Institutions such as the Toledo-Lucas  County Public Library, the National Museum of the Great Lakes, and the  Liberty Aviation Museum in Port Clinton, Ohio, where this photo was  taken,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mining schools graduate       thousands of students annually to support its strategy to       secure global minerals dominance. U.S. mining schools have       dwindled to 14 institutions--down from 25 in 1982--and       graduate fewer than 200 mining engineers each year.\n\nTo solve the current minerals emergency, Congress must       amend the National Environmental…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…(c) Preparing Educators To Engage Students in Mathematical       and Statistical Modeling.--The Director shall make awards on       a merit-reviewed, competitive basis to institutions of higher       education and nonprofit organizations (or a consortium       thereof) for research and development to advance innovative       approaches to support and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…consult with--\n\n``(1) States, Indian tribes, and local governments; and\n\n``(2) appropriate industries (including fisheries,       agriculture, and fertilizer), academic institutions, and       nongovernmental organizations with relevant expertise.''.\n\n(2) Clerical amendment.--The table of contents in section 2       of the Coast Guard Authorization…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…of  Arizona.\n\nThis bill would modernize the GI Bill by approving hybrid and online  independent study programs to meet veterans' needs. During the COVID  pandemic, these institutions offered classes in both online and hybrid  settings to stop the spread of COVID. These institutions also received  GI Bill funding during that time. Many of these institutions…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Members in these committees have worked extensively. Likewise over in  the Energy and Commerce Committee, the idea of blockchain technology at  large outside financial institutions has garnered a tremendous amount  of bipartisan work.\n\nThis House wants to make sure that we prepare this country for a  prosperous, free, open Web3 technology as we go…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…on their academic opportunities  and their standing. Those fears and anxieties are not just unjust to  women but they are a poor reflection of how our higher education  institutions treat pregnant students.\n\nHigher education institutions and universities have a responsibility  to empower all their students, all of them, to succeed, including  pregnant…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…was defined by service,  leadership, and love. He exemplified the highest ideals of his people  and of this Nation. His legacy will endure in the lives he touched, the  institutions he shaped, and the Nation he served so faithfully. I offer  my deepest condolences to his family, his community, and the entire  Oneida nation. May his memory be a blessing.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…communications       industry, except companies that are determined by the Chair       to be not trusted.\n\n(B) Representatives of public interest organizations or       academic institutions, except public interest organizations       or academic institutions that are determined by the Chair to       be not trusted.\n\n(C) Representatives of the Federal Government,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…tradition, while  continually embracing progress and growth. From its earliest days to  the present, the city has served as a place where neighbors support one  another, local institutions thrive, and a strong sense of community  binds residents together.\n\nBrooksville's history is reflected not only in its historic landmarks  and longstanding neighborhoods,…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…policies, including the       following:\n\n(1) Selection by merit-review-based processes.\n\n(2) Consideration of applications from Federal agencies,       National Laboratories, institutions of higher education, non-      profit institutions, and other appropriate entities.\n\n(f) Report.--Not later than two years after the date of the       enactment of this…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…disrupt the global order, then China cannot  continue to be party to international organizations that seek to  preserve that order.\n\nChina's position in multilateral economic institutions will be at  risk should they engage in hostilities toward Taiwan. We simply cannot  overlook the value of deterrence and preparedness.\n\nChina should understand the economic…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "John James", "party": "Republican", "sentence": "…America.\n\nBefore 1975, more than a million children with disabilities were shut  out of public schools. Too many were pushed into charity-run facilities  or psychiatric institutions. Far too many were left without any  education at all.\n\nWe turned that injustice around. IDEA opened doors that had been  closed for generations. Since its inception, it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…like contract dates or intended purpose. Current regulations  permit anonymous giving. These are not clerical errors. This is a  systemic failure, one that has left our institutions wide open to  foreign influence with real consequences for American society.\n\nLet's be clear. Every dollar from an adversarial nation comes with  strings attached, expectations…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…overdraft fees is  nothing more than an eleventh hour effort from Biden's rogue financial  regulators to score political points at the expense of everyday  Americans.\n\nFinancial institutions have to be able to generate profit from the  products they offer. Otherwise, they will not be able to offer them at  all.\n\nBy capping overdraft fees, the CFPB has made it…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689840/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Secretary Kennedy has committed to addressing these failures. He has  made himself and his staff available to Congress and the American  people to restore faith in our institutions. When issues have arisen,  Secretary Kennedy has worked quickly to remedy the problem. In fact, in  recent days, Secretary Kennedy has appeared before two Senate  committees…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]