[{"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…people would be dying from cancer, heart  disease, and diabetes.\n\nMr. Speaker, medical breakthroughs of tomorrow are at risk because of  Trump's research cuts at the National Institutes of Health. These cuts  will be especially felt in my home State of Washington, where we are  leaders in advancing world-class scientific research that saves lives.\n\nWashington…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688502/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, I rise in strong opposition to the Trump  administration's proposal to gut the National Institutes of Health.\n\nPut simply, NIH's work is the difference between life and death for  millions of Americans. Almost everyone knows someone who has lost a  loved one to cancer…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690846/national-institutes-of-health"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…facing are really the cuts to  some of the most technical jobs the U.S. Government has.\n\nWhether you are talking about NOAA or the National Weather Service or  the National Institutes of Health or the National Science Foundation or  the U.S. Department of Agriculture--they have all been targeted for  reductions. These Agencies are critical to our economic…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…grandfather was a scientist. He was a biochemist who spent four decades  unlocking the key to how our metabolism works--in large part thanks to  funding from the National Institutes of Health. My grandfather and his  colleagues pioneered breakthroughs that impacted biochemistry around  the world, leading to all kinds of developments to keep our bodies…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…not to right the wrongs of their big, ugly law,  but to make healthcare even more expensive and slash research into  lifesaving cures.\n\nThey cut funding for the National Institutes of Health and the  Centers for Disease Control and Prevention. They slashed funding for  State and local health departments, substance use prevention and  treatment, mental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Speaker, I again want to add my thanks to  Representative Glenn Ivey for talking about healthcare and the fact  that this administration has been cutting grants to the National  Institutes of Health and cutting clinical trials.\n\nOver the weekend, I was at an event. We had doctors and advocates who  talked about cancer, about breast cancer. This country is actually…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 881, the DHS Restrictions on Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic of  China and Chinese Communist Party.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…78, fired nearly everyone who works on the low-income heating  assistance program and their Federal staff--fired nearly everyone.\n\nNo. 79, fired 870 workers at the National Institutes for Occupational  Safety and Health, approximately two-thirds of their workforce. That is  occupational safety and health.\n\nNo. 80, cut funding for the Head Start program.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…worth noting that there is no evidence that foreign entities of  concern are contributing to public schools at any scale. We have  already noted that there are five Confucius Institutes throughout the  United States, throughout 15,000 school systems.\n\nH.R. 1049 would impose new layers of reporting, auditing, and  bureaucracy on every school district in the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…programs. Millions will lose their health insurance and  will be hungrier and sicker.\n\nIt gets worse. In his 2026 budget, Trump has called for a 40 percent  cut to the National Institutes of Health. He wants a 44 percent cut to  the Centers for Disease Control and Prevention, and he is urging  Republicans to cut billions of dollars from the National Cancer…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691727/republican-budget-will-make-us-sicker"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…foreign  source. Schools have got to have professional development, so every  school principal and superintendent knows exactly who needs to be  reported and how.\n\nConfucius Institutes were mentioned. We have got 15,000 school  systems that will have to comply with this bill. Five Confucius  Institute classrooms have been found to exist in the United States…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Madam Speaker, I rise today to speak out  against another outrageous move by Donald Trump: his attack on the  National Institutes of Health.\n\nThe NIH is not just another governmental agency, it is the foundation  of America's medical research. It funds lifesaving breakthroughs that  doctors and scientists…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…half a billion dollars more. It rejects  Trump's plan to gut NIH funding. It, once again, rejects his illegal  plan to set a cap that would devastate biomedical research institutes  across the country, and it rejects Russ Vought's scheme to have NIH  reward all its multiyear grants in one lump sum, something that would  mean thousands of fewer grants…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…our  government and sell it for parts while replacing the professional civil  service with unqualified political sycophants.\n\nOne of my constituents working at the National Institutes of Health  wrote this summer about what it's been like to be a federal worker  during a period of administrative chaos and vicious attacks on federal  workers. This achingly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…homes, and community- based health clinics are closing all across America.\n\nWe have also seen an extraordinary assault on the Centers for Disease  Control and the National Institutes of Health and the Food and Drug  Administration, on vaccine availability, on public health, and on  healthcare of everyday Americans here in the United States of America.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698795/breaking-the-gridlock-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…unavailable for grazing or open only for trailing,       distinguishes recreational shooting from game hunting, adds       explicit protections for old-growth trees, and institutes       protection measures for migratory birds. To protect sensitive       resources, the Grand Staircase RMP creates new Areas of       Critical Environmental Concern.\n\nSome…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Mr. MOOLENAAR. Mr. Speaker, I rise today in strong support of  Representative Pfluger's bipartisan bill, H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nMr. Speaker, this legislation is about one thing, and that is  protecting American students, American research, and America's future…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…People's Republic of China. They use this all-access pass to steal our  intellectual property, abuse our student visa programs, and prop up  Communist-inspired Confucius Institutes.\n\nThis places the Chinese authorities in a real position of influence  among our young people, all the more so because our own government  doesn't try to hold our colleges…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…children. It happened because our education system and  our popular culture promote this lifestyle.\n\nIt is a good thing if President Trump tries to get this stuff out of  our institutes of public instruction.\n\nI think it is really too bad if people feel it is cool to adopt this  lifestyle. It is something for us to remember, and hopefully, we will  be having…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…accumulation of hazardous fuels,  caused by a century of fire suppression and a lack of active  management.\n\nIn 2004, Congress created the Southwest Ecological Restoration  Institutes, or SWERI, in Arizona, Colorado, and New Mexico to advance  wildfire research and promote science-based forest management. These  institutes have been invaluable partners…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Dana-Farber Cancer Institute, and the University of  Miami.\n\nVoices Against Brain Cancer also advocates for increased federal  funding for brain tumor research at the National Institutes of Health  and increased public awareness. The cure rate for most brain tumors is  significantly lower than it is for many other types of cancers, a  statistic VABC is driven…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…call up  the bill (H.R. 881) to establish Department of Homeland Security  funding restrictions on institutions of higher education that have a  relationship with Confucius Institutes, and for other purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. PFLUGER.  881.\n\nMr. Speaker, I rise in support…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…to ensure children and their families have access to the  specialized care they need and deserve. Nicklaus offers more than 30  pediatric specialties and operates leading institutes focused on  pediatric care, including the Helen and Jacob Shaham Cancer and Blood  Disorders Institute, the Brain Institute, the Heart Institute, and the  Orthopedic, Sports…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this Congress so far, we have passed legislation to secure our  elections, H.R. 222, the SAVE Act; hold rogue activist judges  accountable, H.R. 1526; bring transparency to institutes of higher  education, H.R. 1048; make changes to our border with the Laken Riley  Act and the HALT Fentanyl Act; and to repeal the Biden-era harmful  environmental regulations…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…hardworking families. Decisions  about home appliance should be left to American families, not  bureaucrats in Washington.\n\nThe Home Appliance Protection and Affordability Act institutes  commonsense accountability at DOE to protect consumers from  overregulation. Importantly, this bill will foster continued innovation  in energy efficiency technologies.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…once they are there? The second thing I will emphasize is  that TFA teachers have an outstanding track record.\n\nLast year, there was a comprehensive study that the American  Institutes for Research published. It was a meta-analysis that actually  looked at 23 preexisting studies of TFA's impact across 24 years.  Included in that were 63,134 teachers who…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…schools, as well. This is not only  an attack on education and academic integrity, it is a threat to our  national security.\n\nAcross U.S. colleges, the CCP established Confucius Institutes to  push false narratives, whitewash history, and endear American students  to the CCP while obscuring its brutal human rights abuses. However,  these propaganda operations…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Manufacturing usa.--In carrying out this section the       Secretary shall consider the following:\n\n``(A) Leveraging the resources of relevant existing       Manufacturing USA Institutes described in section 34(d) of       the National Institute of Standards and Technology Act (15       U.S.C. 278s(d)).\n\n``(B) Integrating program activities into a relevant…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…date of       the enactment of this Act, the Secretary of State, in       consultation with the Secretary of Health and Human Services       and the Director of the National Institutes of Health, shall       submit to the appropriate congressional committees a report       on the organ transplant policies and practices of the       People's Republic of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, due to a personal family matter,  I was unable to vote on H.R. 881--the DHS Restrictions on Confucius  Institutes and Chinese Entities of Concern Act. Had I been present, I  would have voted YEA on Roll Call No. 120.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690815/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}]