[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…shootings--anti-Semitic shootings--and activities that have been  plaguing America.\n\nThe new policy of the Coast Guard is shameful. It is dangerous and  another troubling instance of the Trump administration normalizing the  threat of Nazism and White supremacy.\n\nThis policy has all the markings of a dog whistle. It is a ``stand  back and stand by''…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…military down on drug traffickers is  both ineffective and unwise, as drug trafficking is fundamentally a law  enforcement matter, not a military one.\n\nThis is yet another instance of Donald Trump wildly abusing our  military, trying to blur the lines between our servicemembers and law  enforcement. We saw it when he sent the National Guard to intimidate…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…balances.  Executives have power, but the legislature should have power as well,  and the legislature should have the ability to challenge overreach by  an Executive.\n\nIn this instance, the declaration of an energy emergency, when we are  producing more energy than we ever have in our history, as a way to  give oil and gas an easy pass lane to avoid environmental…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…NIH--their basic grant-making operations--to prevent scientists from  getting the resources they need to conduct lifesaving biomedical  research in the first place.\n\nFor instance, the President has unilaterally fired more than 130  employees at the National Cancer Institute--many of them scientists.  Across the NIH, Trump and Musk have fired 160 program…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…these militarized  raids as necessary to target the ``worst of the worst.'' But the facts  tell a different story, one that I have laid out repeatedly on this  floor.\n\nIn one instance, on a list of 614 detainees submitted to a Federal  court, the administration identified criminal histories for just 16 of  the detainees. That shakes out to less than 3 percent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…part because of her tireless advocacy, our  San Diego Congressional delegation has been able to secure millions of  dollars in funding to address cross-border pollution. For instance,  last year Ally worked with staff for the San Diego delegation to  successfully advocate for funding to support environmental  infrastructure in the Tijuana River Valley…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693025/recognizing-ally-castaneda"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…a  sunset provision. In general, sunset provisions have value, forcing  Congress to reevaluate and reconsider sanctions to adjust to new  situations. However, even in the instance a new Iran deal is reached  and successfully implemented, I believe we would want this sanctions  infrastructure still in place, just as it was under the JCPOA, so that  Iran…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…If one digs into this particular resource management plan, I think  you will find that using this blunt instrument, as I have called it  during our prior debate, in this instance is probably the most  insidious of all.\n\nThere are a couple of reasons why. One, the resource management plan  that was adopted replaced a plan that was nearly 40 years old.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Otto Zehm and  John T. Williams and whether you want to do something about it.\n\nNow, I personally think that the Department of Homeland Security and  ICE should be, in this instance, investigated. I think they should be  investigated. And we should know the answers, and we should know that  we are upholding the civil liberties of Americans, particularly…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans don't care about how we can actually help the  grid. Instead, they only care about extending fossil fuels at the  expense of clean, cheap energy.\n\nThis is just another instance when Republicans are doing the bidding  of their corporate polluter friends over the needs of the American  people. If they cared about the American people, they would be…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…are doing is not efficiency.  Instead, it is chaos. Americans did not sign up for chaos, that is for  sure.\n\nAmericans did not sign up for DOGE to take its chain saw, for  instance, to aviation safety. There was another near miss, this time in  Chicago, in the air. Thank God no one was hurt, but this shows you the  immense importance of having a fully…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…accommodation, there are some instances  where an EGC, emerging growth company, is still required to provide 3  years of financials, still required under present law. One such  instance is when the EGC conducts a spinoff, which is a transaction in  which one company creates a new, independent company by selling new  shares of its existing business. So the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…make our  stomachs turn with outrage.\n\nThe Major Richard Star Act is really a commonsense bill. We use that  word, ``commonsense,'' all the time in this Chamber, but in this  instance, it seems particularly appropriate. It would right this  longstanding injustice and finally provide these military retirees  their full VA disability and Defense Department…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…journalists are subject  to a nonstop harassment campaign from the regime, such that people just  stop doing journalism or journalists stop telling the full truth.\n\nLast month, for instance, Turkish President Erdogan locked up 11  journalists simply because they were covering protests against  Erdogan's jailing of the top opposition leaders.\n\nNow, Trump has not…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the construction of the new headquarters for U.S. Space  Command, but the authority provided by this provision is broad,  permanent, and will likely be used beyond this one instance. The  Appropriations Committee meticulously considers how funds from these  accounts are to be used, and this authority offers too much room for  abuse by the Administration.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…respect to that       beneficiary.\n\n``(d) Oversight of Negligence.--(1) The Secretary shall       establish methods and timing with respect to determining       whether an instance of misuse by a fiduciary, of all or part       of an individual's benefit paid to such fiduciary, is the       result of negligence by the Secretary.\n\n``(2) The Secretary…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…repealing this antipolice law, we will make our Nation's Capital  safer. We will also restore the integrity of and faith in the law  enforcement of the District of Columbia.\n\nFor instance, this law stripped law enforcement officers of many  tools needed to execute their duties safely and without fear of  retribution, as well as limited their options in situations…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696934/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…compete with our adversaries.\n\nImportantly, Mr. Speaker, the Trump administration has prioritized  opportunities to combat undue influence from those same adversaries.  For instance, last week, the United States and the United Kingdom  signed a memorandum of understanding on strengthening cooperation  between the countries on critical minerals, supply…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…under oath and       one Member of the Committee shall constitute a quorum for the       purpose of taking testimony not under oath; provided,       however, that in either instance,       once a quorum is established, any one Member can continue to       take such testimony.\n\nRule 11. Under no circumstances may proxies be considered       for the establishment…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…parole and  asylum policies meant and reserved for those in dire need of protection  from political persecution and other areas defined in the law for  special purposes. For instance, you might be granted parole to care for  a sick loved one legally in the United States. You might be granted  some specific purpose for that one individual because we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…repeatedly--repeatedly--fabricated malicious stories about conservative  activist Robby Starbuck. He is a Tennessean, and he is a conservative  leader in our State.\n\nIn one instance, Google's large language model, Gemma, falsely  claimed that Starbuck was accused of child rape and that I publicly  defended him. Google's AI models have also falsely accused…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Following this interpretation in the CRA context, we have       only applied CRA's third exception to rules that primarily       focus on the internal operations of an agency. For instance,       in B-329926, Sept. 10, 2018, we found that updates to a       Social Security Administration (SSA) hearing manual governing       SSA adjudicators' use of information…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "French Hill", "party": "Republican", "sentence": "…cyber or economic destruction, and we certainly should routinely jaw- jaw with those great powers about our possible shared objectives and  deep concerns.\n\nHowever, in the instance of Czar Putin, he has never been interested  in jaw-jaw. He is a creature of his KGB upbringing. There was no jaw- jaw with the Chechens in 1999, and there was no jaw-jaw…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…allow our sailors to defend themselves if  these Houthi terrorists shoot a missile or a drone directly at their  ship, but it absolutely ties the President's hands if, for instance, we  have intelligence about a senior meeting of Houthi terrorist leaders.  It absolutely ties the President's hands from protecting our friends in  places like Jerusalem…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…GAO says in some cases ``we were not prompted to provide       documentation'' to verify an applicant's identity. No Social       Security number? No problem. In another instance, the       ObamaCare exchange ``notified us that it had verified the       applicant's estimated income based on documentation we       submitted. However, we did not submit…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…named Boasberg continually exercises those nationwide  injunctions, and that wouldn't necessarily be a problem, except he has  repeatedly displayed bias and partisanship.\n\nFor instance, without substance or evidence, he complained to Chief  Justice Roberts that he didn't think President Trump would comply with  judicial orders. That displayed his bias, Mr.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rule in place.\n\nAlso, the argument has been made that only 24 out of 388 miles have  been restricted to off-road vehicle use, but as we all know, roads are  networks. For instance, there is a half-mile section in this ruling  under the Biden administration that blocks off access to over a million  acres. You block off a half-mile of road, and you restrict…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…private arbitrators  instead of appealing to the Merit Systems Protection Board.\n\nThe Trump administration is exercising its electoral mandate to  address this problem.\n\nFor instance, the President has embarked on an ambitious overhaul of  the performance management system and is pursuing more streamlined  disciplinary procedures.\n\nThe reality is that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Defense Authorization Act.\n\nThese constraints recognize that the LPTA criteria are not always  appropriate for agencies seeking complex or technically innovative  services.\n\nFor instance, this can result in agencies sacrificing long-term value  for short-term savings. We also do not want the LPTA to be used in a  manner that jeopardizes national security.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…animals, and passion for finding animals homes, sharing  stories of Jocelyn's life, such as Jocelyn's efforts to nurse injured  animals back to health. Alexis recounted one instance when Jocelyn  brought a pigeon that had injured its legs into her home. Jocelyn,  without hesitation, tried to nurse the pigeon back to health in her  bedroom until it was…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}]