[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…ugly mess, especially when it comes to their healthcare and their  everyday lives.\n\nRepublicans made devastating healthcare cuts to Medicaid and the  Children's Health Insurance Program. They made $990 billion worth of  cuts. We are now just 2 weeks away from a government shutdown.\n\nSpeaker Johnson is, once again, refusing to work across the aisle  with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…then ask you a  question. This is all lead-up to a question.\n\nSo I have a constituent who was paralyzed about a decade ago, and he  now uses a wheelchair, and the only insurance program that can provide  him with what he needs from a mechanical and technological standpoint,  plus the drugs he needs to survive, is Medicaid. It is his only option.  It…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…is an all-out assault on the healthcare of the American  people.\n\nIt is an assault on Medicaid. It is an assault on Medicare. It is an  assault on the Children's Health Insurance Program. It is an assault on  the Affordable Care Act. It is an assault on Planned Parenthood and the  healthcare of women all across the United States of America.\n\nIt is an…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Affordable Care Act, which helps nearly 100 million Americans  afford health insurance, medications, and lifesaving care.\n\nNationwide, Medicaid and the Children's Health Insurance Program  provide medical coverage to nearly 4 in 10 children. Almost 40 percent  of the children in the United States get their healthcare through  Medicaid.\n\nThese programs…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688072/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Republicans are doing that caused Senator Tillis  to make this chart. Right now, States use a variety of tools to help  pay for their share of Medicaid, which is the health insurance program  for low-income families, children, seniors, and people with  disabilities.\n\nOne of the most important tools is called a provider tax. That is  when hospitals or health…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…erroneous payments, the focus on improper payments to deceased people  is just another part of the Republican plan to undermine public  confidence in Social Security, a social insurance program that has been  one of the most valuable initiatives ever approved in this Congress.\n\nYet Trump appointed Elon Musk, who proclaimed that Social Security is  ``a Ponzi…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…People in America should be  outraged by the fact that Congress has not fulfilled its responsibility  to act on behalf of its citizens.\n\nSocial Security is the number one insurance program in the country,  serving over 70 million people. Mr. Speaker, 10,000 baby boomers a day  become eligible for Social Security, and Congress continues to ignore  them and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…country  that I stand here today both incredulous and outraged that the  Republican majority in Congress is shoving a budget through that will  gut Medicaid, the very health insurance program that covers 40 percent  of all births and insures almost half of all children in our country.  As an OB/GYN, as a mother, as a Member of Congress, and as an American,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691420/gop-tax-scam-hurts-everyone"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…deficit. If this is what Trump said, then why are they  proposing to cut $880 billion from critical healthcare programs  like Medicaid, Medicare, and the Children's Health Insurance Program?\n\nYou can't have it both ways. Donald Trump promised to make America  healthy again, but gutting healthcare for millions of Americans-- gutting healthcare for millions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…including Virginia,  it also provides access to free and reduced-priced school meals.\n\nThere are over 37 million children enrolled in Medicaid and the  Children's Health Insurance Program, or CHIP, in the United States.  These are the most vulnerable people in the country who stand to lose  the most from these deep funding cuts.\n\nIf my colleagues want…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690740/medicaid-is-a-lifeline"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…trying to visit on the American people the largest cuts to healthcare  in American history, targeting Medicaid, Medicare, the Affordable Care  Act, the Children's Health Insurance Program, and women's health by  trying to defund Planned Parenthood. That is what Republicans in this  Congress are trying to do through the GOP tax scam, this disgusting  abomination,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692530/rescissions-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…United States the last time that Congress enhanced Social Security.\n\nI am sure it is of interest to some of our listeners here today that  Social Security is the number one insurance program for a Nation who  relies on their government to make sure that it passes on savings to  them that they have paid for. This is no entitlement. All one has to do  is go…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…away parents' ability to go to work and provide for their families, is  not how you persuade women to have more children.\n\nOn top of that, gutting Medicaid, the health insurance program that  covers half of all children and 40 percent of all births, is not how  you persuade women to have more children.\n\nIt is hard to imagine a more antifamily agenda.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…stories you have heard,  particularly for people who are the least among us as Americans.\n\nThere are 78.5 million people enrolled in Medicaid and the Children's  Health Insurance Program across America. This is 10 percent higher than  in February 2020, pre-COVID.\n\nOne in three people with disabilities, 15 million, have Medicaid.  Comparatively, 19 percent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Federal Government and the critical programs  that pay our first responders--and not allow  Elon Musk to decide what he thinks is worthwhile spending; and Medicaid  is the insurance program that pays the largest share of mental health  services; we cannot slash the Medicaid program to pay for billionaire  tax breaks.\n\nThese may sound like distant debates…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Mr. CASSIDY. Mr. President, this is a theme I have been speaking of  which affects States across the Nation, which is the National Flood  Insurance Program and the threat that it might lapse and the inability  of families to be able to afford.\n\nWhy are flood insurance premiums so high, you might ask? Flood  insurance premiums…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…resilience. We were able to keep those  homes from flooding in the first place. This is the type of work that  we need to do. And if we do it, then never is a National Flood  Insurance Program claim filed.\n\nThe family saves; the taxpayer saves. Investing now saves money down  the line.\n\nThat is why back in 2018, during President Trump's first term,  Congress…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…the statute.\n\nThe issue in 2008 was an action by the Centers for Medicare and  Medicaid Services directing States on how they were to administer the  Children's Health Insurance Program. CMS did not submit its action to  Congress, calling it guidance rather than a rule. Senator Rockefeller  asked GAO to determine that the CMS guidance was a rule. When…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…it  worked. They go from $12,000 a year to $758, from $4,500 to $751. This  is an investment which would lower the cost of flood insurance, saving  the National Flood Insurance Program money; therefore, it is worthwhile  to raise your home.\n\nNow, however, under a new system called Risk Rating 2.0, it doesn't  matter. Here, they pay tens of thousands…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…title 38, United States Code, to require the  Secretary of Veterans Affairs to periodically review the automatic  maximum coverage under the Servicemembers' Group Life Insurance program  and the Veterans' Group Life Insurance program, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…am tired of hearing people say there is no off-ramp or  way out of the shutdown. Here it is, the way forward: Open the  government.                       National Flood Insurance Program\n\nMr. President, I spoke on this floor a month ago about the  consequences of a government shutdown on our country and upon  Louisiana, particularly the half million Louisianans…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]