[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…climbing  the walls of the Capitol. Protesters fighting with police inside.''\n\nHe used the word ``protesters.'' We would all come to later learn  that maybe ``rioters'' or ``insurrectionists'' would have been more  accurate.\n\nI have to say, I could not believe what my brother was saying. So I  asked him to clarify. I said, ``At the Capitol?'' because after…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…on a phone call  with somebody establishes guilt by association, what about all of the  Members of this body or of the U.S. Senate who were on the phone with  January 6 insurrectionists and President Trump and his associates who  were trying to block the certification of the election as people were  chanting, ``Hang Mike Pence.'' There were a lot of phone…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…On January 6, 2021, an armed mob stormed the  people's house in an assault on our democracy, the rule of law, and the  peaceful transfer of power.\n\nOn January 6, 2021, insurrectionists targeted Congress and our  country's leaders. This included me, when a man drove across the  country to the Capitol and was eventually brought to justice for his  crimes.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…United States to honor the police officers who fought tooth and  nail, with valor, courage, and heroism, to defend us against mobs of  thousands of marauding rioters and insurrectionists, Proud Boys, Oath  Keepers, Three Percenters, who came to try to overthrow a Presidential  election. They stormed the Capitol. They injured, wounded,  hospitalized, brutalized…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…saw through  the windows or the doors--or face-to-face some of us--the pipes and  baseball bats. It was a moment that nobody who went through it can ever  forget because insurrectionists scaled the walls; they smashed windows;  they forced their way through the doors into this Chamber and the  House. They broke into the legislative branch of government.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…going after people because of the color of their skin. That  is what we object to. Let's go after the criminals.\n\nBy the way, we are not the party that pardoned all the  insurrectionists on January 6 and said that the slate is clean. By the  way, those people go on to murder innocent people, to rape women, and  molest children.\n\nThere is a difference here.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…defense  of Trump's indefensible actions earned him a top spot at the DOJ, where  he used his power to fire prosecutors who were working on criminal  cases for the January 6 insurrectionists.\n\nThat is right. Mr. Bove helped the rioters who assaulted law  enforcement officers on January 6 get off without any charges.\n\nWhat is happening to this country? What…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Finally, they are also rewriting the history of January 6. They  quietly slipped into the rule a brand-new select committee on selective  memory designed to protect the very insurrectionists who stormed this  Capitol. These were violent thugs who attacked our democracy and  brutalized police officers. Donald Trump pardoned those violent  criminals. Now, Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Senate out of their Chamber, and attempted to overthrow  a Presidential election.\n\nNow, the new administration has seen fit to pardon more than 1,500  rioters and violent insurrectionists who attempted to overthrow our  constitutional form of government on that day, and they succeeded in  bloodying, wounding, injuring, and hospitalizing more than 140 police…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…injuries to  approximately 140 others, many of whom are still paying the price for  that day.\n\nOn the campaign trail, Donald Trump promised that he would pardon  January 6 insurrectionists--but it still came as a shock when, on the  first day of his second Presidential term, he issued a blanket pardon  and 14 commutations to all of those who had been charged…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…of living have  remained unfulfilled by this administration.\n\nOn day one, President Trump said he would put America first and lower  costs. Instead, he pardoned violent insurrectionists, a mob that  attacked this Capitol to overthrow a fair and free election. It was an  attack that resulted in the deaths of five law enforcement officers.\n\nWe were promised…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…From all their botched raids and  officer-involved shootings, I have to ask: What is their training like?  What is the vetting? Is Secretary Noem recruiting January 6  insurrectionists?\n\nI was one of the last Members of Congress to escape the House gallery  on January 6. I remember hiding on my hands and knees and running  through the hallways to a safe…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Country--you could do this to any President.'' And he  then pardoned him.\n\nHard to imagine, isn't it? But it isn't hard to imagine if you were  here on January 6 and saw the insurrectionists come roaring through  this Capitol, storm this Chamber, and drive the Senate into recess as  we went to an adjoining building so that law enforcement could take  over…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…officer who stood  shoulder to shoulder with Officer Brian Sicknick on January 6. He was  with Officer Sicknick who collapsed in the Capitol after being  assaulted by insurrectionists and, tragically, passed away the next  day, trying to protect this institution, trying to protect democracy.\n\nAnd to this day, the brave officers who defended Congress…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…even just a  riot. It was an assault on the very heart of our democracy. In  attempting to stop Congress from certifying the results of the 2020  election,  the January 6 insurrectionists sought to nullify the votes and shatter  the peaceful transfer of power that has characterized our democracy for  nearly 250 years.\n\nPresident Trump provided a blanket…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…arrested? Is it just because  they look Latino? Is it just because they speak Spanish? That is not  okay.\n\nLet's talk about criminal activity. Trump pardoned the January 6  insurrectionists who beat law enforcement right outside these doors,  violently beat the law enforcement officers who were protecting us.\n\nWhat has happened since then? Do you want to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…right outside these doors, each plays an  important role. Unfortunately, not everybody respects all of our law  enforcement officers.\n\nIn this very building, January 6 insurrectionists brutally attacked  the Capitol Police and law enforcement officers from multiple  jurisdictions. More than 140 police suffered injuries and went to the  hospital. Five…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]