[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Democratic Party that means well but tries to be all  things to all people and too often fails to deliver.\n\nOur grandparents knew a Democratic Party that not only had good  intentions but that knew how to get things done. The working people I  represent don't want a handout, but they do expect a level playing  field and a fair shot, and they want a Democratic…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…innovation to solve the world's toughest challenges.\n\nLet's talk about what happens when we pull back. When the United  States steps away, others step in and not with good intentions. China  is flooding developing countries with infrastructure loans and digital  surveillance systems. Russia is exporting mercenaries and  disinformation. While we are debating…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…along the way, they could see that there were  persons waiting for them. Some of these persons were on horseback.  Others were not, but they were armed. These persons had intentions that  were less than honorable.\n\nThey knew that the intentionality was less than honorable, yet they  marched on, forward, knowing that this could become an unpleasant  scene,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…even following it. He is twisting the Monroe  Doctrine, which the United States actually used to keep colonial powers  out of our hemisphere, to justify his own colonial intentions to  exploit Venezuelan oil.\n\nThat is a complete inversion of what the Monroe Doctrine is. So I  guess the President has rightly amended it to call it the ``Donroe''  version…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…identifies isn't in the past. It  is in the present. Our inboxes are full of policymakers expressing  fears about the growth of China's nuclear arsenal or Vladimir Putin's  intentions or Iran's plans.\n\nToo often, policymakers have a reflexive response. They are building  more. Then we should build more. Mr. Speaker, this is so shortsighted.  It is a dangerous…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…reporter that same day  whether a drawdown would occur, President Trump stated: ``No, no, not  at all.'' Considering that President Trump has rejected his own Border  Czar's intentions to reduce the presence of federal agents in  Minnesota, I have no reason to believe that the Trump Administration  will implement the reforms necessary to protect the safety…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Representatives next week. I fully intend to do so. For edification  purposes, that means that I will first notify my colleagues by way of  written word that these are my intentions. Thereafter, I will come to  the House, and I will read the Articles of Impeachment. After they have  been read, some time will pass before they will come back to the floor…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Rhode Island, instead  of getting to the children who need it.\n\nMr. Speaker, I will continue to speak on this floor every day until  those boxes move because promises and intentions are not enough to save  the lives of starving children.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695735/edesia-nutrition"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…always tries to get into ``limited'' military engagements. That  is what Kennedy said about Vietnam. That is what Bush said about Iraq  and Afghanistan. We may go in with intentions of things being very  limited, but the world has a vote on how things go in these other  countries, and we do not know where Venezuela is going to go.\n\nOil companies, despite…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…someone who spends a lot of time thinking about China policy, I  don't think there is anyone that is more informed or who has, frankly,  written more scholarly articles on the intentions of President Xi in  China than Kevin Rudd. Kevin Rudd is a scholar on China and a fluent  Mandarin speaker. He puts that expertise to work each day. He reminds  me, at times,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the equipment they need to do their job.\n\nUnfortunately, that is not what is happening. President Trump,  through an arbitrary Executive order, has told this body: Your  intentions will not be followed.\n\nThe legislation that is being proposed today--the President has  already said that those DOJ grants will not go to certain States-- Illinois, California,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…than simply a press  release, about people trying to absolve themselves, and not just  another waste of taxpayer time and money misleading the American people  about the intentions of Senate Republicans.\n\nThe Senate should act on this measure. They should act on it today.  Rarely in life is there a second chance to do the right thing.\n\nI urge my colleagues…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…country.\n\nPast administrations sent cargo pallets of cash on cargo planes to  these bloodthirsty mullahs in hopes of currying their favor and  cooperation. However good the intentions, the result was to help fund  the oppression of the Iranian people and the export of terrorism  throughout the world.\n\nI believe the time has now come to provide the same…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…every one of them. As we have seen all  too well in recent decades, foreign military interventions often end up  making things worse. The road to hell is paved with good intentions.\n\nImagine the anarchy that followed our wars in the Middle East. Do we  really want to risk creating similar conditions in our own backyard?  With over 10,000 U.S. troops,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…democratic partners in the Indo-Pacific.\n\nTaiwan is under growing pressure from an increasingly aggressive  Chinese Communist Party. Xi Jinping has made no secret of his  intentions. Folding Taiwan into the People's Republic of China is  central to his vision of national rejuvenation. He has made it clear he  is willing to use force to make that happen.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…arguing we need these  additional necessary requirements for offshore wind. I am just pointing  out the blatant hypocrisy of the past administration. It is clear where  their intentions were. Overturning this rule is good for our energy  security and for our energy independence.\n\nMr. Speaker, a couple nights ago, the President of the United States  addressed…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…system unable to protect  public funds.\n\nTo be clear, expanding access to health insurance and protecting  people with preexisting conditions are worthy goals, but good  intentions do not excuse bad results.\n\nMr. Speaker, faced with these affordability problems, what have my  Democratic colleagues proposed? Their answer has been more taxpayer  subsidies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…be filed in       the Senate at the earliest practicable time.\n\n(b) Supplemental, Minority and Additional Views.--A member       of the committee who gives notice of his intentions to file       supplemental, minority, or additional views at the time of       final committee approval of a measure or matter, shall be       entitled to not less than 3…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…150,000-square-foot Muslim community center, was opened in Houston,  called EPIC City. It is in Plano, outside of Dallas-Fort Worth and it  has raised all sorts of questions about their intentions to create an  effectively Muslim-only community where sharia law no doubt would and  will be practiced. Now they have renamed it The Meadow rather than the  East Plano Islamic…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…regularly: There will never be such a thing as a  perfect piece of legislation or a perfect package of bills.\n\nPerfection is a phantom. Many may seek it with the best of  intentions, but in the end, it is unattainable. That is just a fact of  life that we must understand.\n\nI can imagine that there are Members who want to see more within  these measures,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…allegedly raped after ordering an Uber  Eats delivery to her home. The app indicated that a woman would be  delivering her order. Instead, an illegal alien with horrific  intentions is who showed up on her doorstep.\n\nLast week, I sent a letter to Meta CEO Mark Zuckerberg, demanding  answers about what his company is doing to eliminate this black market…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Knox,  Kentucky. Neither choice was a desirable option, so he chose to retire  and in 1993. he moved to Anniston, Alabama, to work at Fort McClellan.  However, he had no intentions of ending his service to the United  States. Here, he was responsible for running the Battle Simulation  Center for the Chemical School. When Fort McClellan was closed, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…military to defend ourselves in the most dangerous time we have had  since World War II.\n\nSo I have the deepest respect for my friend from Connecticut, and I  admire his intentions. But until Congress and until the authors of this  proposal identify a way to offset the expense or to make it less  expensive, we should not move forward with this legislation.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…outbound investment transparency, are included in the final  legislation.\n\nIt is no secret to any of us that China is our near-peer competitor,  and they don't have benign intentions with regard to the United States.  They want to dominate the United States economically and militarily.\n\nPresident Xi, the head of the People's Republic of China, and the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…talent, and resources  for their own gain.\n\nEveryone in this Chamber knows the growing threat from the Chinese  Communist Party. This adversary has made no secret of its intentions to  surpass the United States in key technological areas, from artificial  intelligence to quantum computing to biotechnology.\n\nIn 2022, Congress passed the Research and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}]