[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…sisters, a crisis that persists and is characterized by       the displacement of their country of origin. This situation       is the result of a legacy of Colonialism and an interaction       of internal armed conflicts, institutional collapse, natural       disasters and extreme socioeconomic conditions, which has       forced them to emigrate not only…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…through       the services of the Division of Developmental Disabilities.       Without it, she would be left to whittle away at home 7 days       a week with no community interaction. She is learning       prevocational skills in a manner that she is validated and       viewed as a person with strengths.\n\nThank you, Mary.\n\nAllison:\n\nI am my daughter's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…enormity of this challenge,  this threat that our Jewish constituents and Americans are facing. I am  proud to co-lead the resolution with the gentleman, and I think his  interaction with our office is a reflection of how things ought to work  in this Chamber.\n\nMr. Speaker, I thank the gentleman from New Jersey and the gentleman  from New York for their…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Chamber right here funds through appropriations.  Activities that we authorize, or do not, through lawmaking, which is  our constitutional role.\n\nMy favorite part of our interaction that day--1\\1/2\\ hours of our  time outside waiting to be seen--was the sign that staff from the  holding center placed on the door which reflects ICE's formal response…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…cameras. It would also require the Government Accountability  Office to conduct a study on federal law enforcement officers'  training, vehicle pursuits, use of force and interaction with the  public. In the 116th and 117th Congresses, the House passed this bill  as part of the George Floyd Justice in Policing Act.\n\nCameras can increase transparency,…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…history and culture of indigenous communities that  reside near their posts of assignment. Our Foreign Service Officers  will often be the primary American officials for interaction with these  communities, and should be well versed in specific indigenous peoples'  issues.\n\nWe must not step away from the international stage; rather we should  lead efforts…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…rip up the speech that I had written, but I am not going to give that  speech.\n\nI have to talk about the opposition party, and I have to talk about  their complete lack of interaction with the blue-collar Joe Bag of  Donuts, which is Youngstown and Akron and Canton and Cleveland and  Pittsburgh. These are working people that they have forgotten.\n\nThey…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…OF VETERANS AFFAIRS.\n\n(a) In General.--Section 3680A(a)(4)(A)(ii)(III) of such       title is amended--\n\n(1) by inserting ``that requires regular and substantive       interaction between students and instructors'' after ``course       of study'';\n\n(2) in item (aa), by striking ``; or'' and inserting a       semicolon;\n\n(3) in item (bb), by striking…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…stranger, but they are in uniform, and they look up at them in  the eyes--they regularly don't look at folks in the eyes. It is always  a little awkward for them to learn that interaction--and they just say,  ``Thank you, Officer.'' It is a neat experience and something that I am  glad I started.\n\nThe smallest thing is very much appreciated by those in our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…prevents the       Secretary from carrying out an inspection under section       107.807(c) of title 49, Code of Federal Regulations (or a       successor regulation).\n\n(4) Interaction with other statutes, agreements,       regulations.--Nothing in this section may be construed to       prevent the harmonization of cylinder standards otherwise       authorized…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…our tax system, the fact of the  matter is this incentive for this to grow, this incentive here, and the  adoption of technology. I need people to start thinking about the  interaction that there is not a simple solution to a country that,  right now, is functionally borrowing about $74,000 every second so far  this fiscal year.\n\nSorry. Let me rephrase.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Solanco High School students Robert Baxter, Lucas Vilk, and Caleb Reed  on their success in the 2025 Student Drone Challenge.\n\nThe Student Drone Challenge is hosted by the Interaction of Ionizing  Radiation with Matter University Research Alliance (IIRM-URA), which is  a collaborative partnership between universities, laboratories, and  industrial companies.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…to recognize that April is  Autism Awareness Month.\n\nAutism spectrum disorder is a developmental disability that generally  appears before the age of 3, impacting social interaction,  communication skills, and cognitive function.\n\nToday, 1 in 36 children in the United States are diagnosed with  autism, and approximately 5.4 million Americans are living…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690169/autism-awareness-month"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…April as  ``National Autism Awareness Month''.\n\nAutism spectrum disorder (ASD) is a developmental disability that  generally appears before the age of 3, impacting social interaction,  communication skills, and cognitive function. Today, 1 in 36 children  in the United States are diagnosed with autism, and approximately 5.4  million Americans are living…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…arise. The intelligence community's  ability to detect and prevent attacks against our homeland depends on  coordinated and efficient information flows.\n\nWe expect smooth interaction and joint maneuvers from our Nation's  warfighters, and we depend upon the same thing across all components of  our intelligence community.\n\nHowever, this coordination can…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Chamber. The lack of decorum has reached a new high when the  President of the United States cannot even come into our Chamber,  invited, and complete his speech without the interaction that we saw  last night.\n\nWe have to take this action of censure. Let me tell you, there are  many people on my side of the aisle that would like to take this even  further.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…efficiently and that veterans' benefits are used  responsibly as well. Programs like this one must be accredited,  approved by the VA, and provide regular and substantive interaction  between instructors and students.\n\nThe VETS Opportunity Act is about modernizing our VA benefits and  programs to empower veterans, strengthen the workforce, and honor…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699510/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…oppose H.R. 2270, a bill that makes it  easier for small businesses to offer childcare benefits.\n\nThe American people are tired of a government that treats every  voluntary interaction between an employer and employee as a potential  crime. They are tired of the 80-20 rules that make it harder for small  businesses. They are tired of joint employer standards…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…a definition of something that has been  put out through dispatch of a vehicle that we are looking for? Has it  potentially been involved in a crime that requires police interaction  in an effort to enforce and address that crime that took place?\n\nThere are a number of factors that a police officer has to figure,  but it has to be an option that you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…financial       distress;\n\n``(vii) the effectiveness of existing discount window       operating hours and whether such hours should be expanded,       taking into account the interaction between discount window       operating hours and the operating hours of payment systems of       the Federal reserve banks, such as the Fedwire Funds Service       and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}]