[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…our industry and workers.\n\nThus, it seems obvious that such a pivotal part of the global economy  should not be excluded from engagement in one of our most important  international financial institutions.\n\nAs H.R. 910 requires, the U.S. would be an advocate that the IMF  admit Taiwan as a member, allowing the IMF to monitor and evaluate the  health of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…underlying great climate insurance collapse.\n\nThat is not from me. That is not from the League of Conservation  Voters. That is not from the Sierra Club. That is from the  international Financial Stability Board.\n\nSo that was the second message: Look out. This is about to get deadly  serious, and people at the top of the finance profession are warning  about…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…act should it escalate its aggression toward Taiwan. If  China chooses to do so, the United States would be required to oppose  China's participation in a number of international financial  organizations, including the Bank for International Settlements and the  Basel Committee on Banking Supervision.\n\nMr. Speaker, I urge my colleagues to support this…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…accounting.\n\nThe intent of this rule to provide transparency was well-meaning. The  execution, when applied to BDCs, has been counterproductive.\n\nResearch by U.S. and international financial professors shows that  after BDCs were removed from major U.S. stock indexes, as a consequence  of this misguided AFFE rule, BDCs experienced a 29 percent to 33  percent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…State to determine in which  international organizations the U.S. should continue or from which it  should withdraw. Inexplicably, that includes World Bank among other  international financial institutions.\n\nThe United States has long been a leader in IFIs like the World Bank.  Our leadership in these institutions provides us with a strong voice to  improve…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 910) to require the Secretary of the Treasury to pursue more  equitable treatment of Taiwan at the international financial  institutions, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…toward Taiwan. We simply cannot  overlook the value of deterrence and preparedness.\n\nChina should understand the economic and diplomatic repercussions of  threatening international financial stability and make its choices  accordingly.\n\nMr. Speaker, I thank my colleague from Texas (Mr. Gonzalez) for his  work on this issue and for cosponsoring this legislation.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…it has  repeatedly been reaffirmed in bills passed by this Congress.\n\nMr. Speaker, advocating for Taiwan's membership in the IMF would also  unlock access to other international financial institutions. The World  Bank, for instance, requires members to first be a part of the IMF.\n\nI urge my colleagues to vote in favor of H.R. 910 and send the  Taiwanese…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reliable energy as an alternative energy source from opposing  nations.\n\nIt requires the Treasury to advocate for nuclear energy assistance at  the World Bank and other international financial institutions,  including the establishment of Nuclear Energy Assistance Trust Funds.\n\nAlso included in this funding package is Congresswoman Salazar's H.R.  6892.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699048/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…forward to future collaboration.\n\nMr. Chair, I thank Chairman Rogers for his commitment to Chairman  Hill. As chairman of the National Security, Illicit Finance, and  International Financial Institutions Subcommittee, this authorization  does go through my subcommittee, and I am happy to work with colleagues  across the spectrum here to get a good product…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695242/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…track record of interference and  aggression toward the American financial system is a serious and  growing threat. The CCP has a well-documented history of abusing  international financial norms, jeopardizing both our national and  economic security in the process.\n\nFrom manipulating currency and distorting markets to propping up  state-owned industries…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Caused directly by the Burmese military junta, this humanitarian  crisis makes one thing very clear: The regime cannot be trusted to  responsibly steward funds from international financial institutions or  deliver aid to the communities most in need.\n\nMr. Speaker, I thank Representative Williams of Georgia for allowing  me to co-lead the No New Funds…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697195/no-new-burma-funds-act"}]