[{"senator": "Laura Friedman", "party": "Democrat", "sentence": "…electrical systems, grid systems, and  the like.\n\nWe also need to make sure that in this process we not only pay  attention to those elements but we also pay attention to the  international situation that is out there. We compete internationally.\n\nThe solution that the President is proposing is that we are going to  protect ourselves with tariffs. If we are…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…in the Manhattan Project, knowing the dangers, spent much  of the remainder of their lives warning the world of the danger of a  nuclear arms race, and they advocated for international controls on  nuclear weapons.\n\nIn 1954, unfortunately, at the height of the McCarthy era,  Oppenheimer himself was targeted for his advocacy by the Atomic Energy  Commission.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…rise in support of H.R. 747, as amended.\n\nThe opioid crisis has claimed too many lives. We have seen some real  progress the last few years in part because of domestic and  international policies put in place by President Biden, including  getting President Xi to do more to stop fentanyl precursors from  reaching our shores. Of course, the issue is far…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694827/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…principle here, and it goes back  to the Founders. The American President is supposed to work for the  American people, not for his own enrichment. In foreign policy and on  the international stage, he is supposed to represent the United States  of America, not his own  business interests, or any foreign state or any business privately.\n\nAnd that is what the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Congress.\n\nWhile I have you here, today I voted against a funding measure that  would enshrine the Trump administration's illegal destruction of the  United States Agency for International Development, USAID.\n\nAmong the litany of illegal, immoral, and illegitimate acts committed  by this administration, what President Trump and Elon Musk did to USAID  will…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…economic stability, and respect for the  successful agreement that we committed to in the past. It is why this  resolution has support from the United Steelworkers, the International  Association of Machinists, North America's Building Trades Unions, and  the AFL-CIO. The Chamber of Commerce, the National Taxpayers Union, and  the National Retail Federation…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…including many in New Jersey's 3rd Congressional District.\n\nDuring this visit, Patriarch Bartholomew is being honored as the  recipient of the Templeton Prize. This prestigious international a yard  recognizes his scholarly contributions in exploring the intersection of  faith and the natural world. Past recipients include Mother Teresa and  the Dalai Lama.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the spirit of hospitality that Kentuckians everywhere  extend to our neighbors. David has opened his farm to more than 450  participants in the U.S. Department of State's International Visitor  Leadership Program from over 100 countries to learn from his practices  and spark ideas they can carry back home.\n\nKentucky is proud to call Mr. Neville one of…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…in  warehouses while children starved to death.\n\nThis was not just cruel. It was short-sighted.\n\nAmerica's reputation as a global leader suffers when we fail to  deliver international aid. Our adversaries--China, Russia, terrorist  organizations--fill the abyss when the United States pulls out.\n\nA broad coalition of Americans fought back. In April, I…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696874/recognizing-important-victory-for-countless-children-around-the-world"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…As the spiritual leader to 300 million Orthodox Christians worldwide,  Ecumenical Patriarch Bartholomew is known as a transnational  figure who has focused on organizing international and interfaith peace  conferences, challenging racism and religious fundamentalism, and  promoting religious freedom and human rights. He is also seen as a  global leader…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…service:\n\nWhereas, Apostle Dr. Dana Carson hails from Chicago,       Illinois, and is the Founder & Senior Pastor of the       Reflections of Christ's Kingdom World Outreach International       (R.O.C.K.) church in Houston, Texas, serving ministry for 40       years full-time through Executive and Pastoral leadership       roles; and\n\nWhereas, Apostle Dr.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Madam Speaker, any day now, the Supreme Court will issue  a ruling on whether the President can impose tariffs under the  International Emergency Economic Powers Act.\n\nPresident Trump's tariff policies have hurt America's small  businesses, who often cannot absorb the cost of higher duties. Now, the  economy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698342/president-trumps-tariff-policies"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…also members of the 5G and Beyond Caucus.\n\nThis bipartisan bill ensures the United States remains at the  forefront of innovation by playing a central role in setting  international wireless standards in emerging technologies such as 6G,  and what is to come.\n\nToday's policy decisions have lasting effects on the global wireless  technology development…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Instead, she is locked up in an ICE detention center in Louisiana,  facing possible deportation to Russia. This isn't just cruel, it sends  a chilling message to scientists and international students around the  world: Come to America, and you may be imprisoned instead of empowered.\n\nThen there is Ardem Patapoutian, who came to the U.S. from war-torn  Lebanon…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…making friends wherever he went, thanks to his  gift of gab and genuine warmth. He loved good food and embraced new  experiences, dedicating himself recently to a passion for international  travel. Among many things, he will be remembered for his care,  compassion, loving kindness, sense of humor, his unique laugh, and his  face full of freckles.\n\nCorey's…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…coming true.\n\nLet me talk a little bit about the tariffs. The tariffs announced by  President Trump on April 2, 2025, are a response to our economy that  will strengthen the international economic position of the United  States and protect American workers.\n\nAccess to the American economy is a privilege, and these tariffs are  a starting point to bring other…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…ADMINISTRATION COUNCIL OF BURMA.\n\n(a) In General.--The Secretary of the Treasury shall       instruct the United States Executive Director at the       International Monetary Fund to use the voice and vote of the       United States, when assessing potential changes to any       shareholding formula in connection with a governance review…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…more of the Members of Congress as cosponsors than any  other bill introduced during that entire congressional session. This  Gold Medal also recognized the significant international and historical  role the Ecumenical Patriarch has played throughout his lifetime.  Historic international figures who received the Congressional Gold  Medal immediately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…rights,  to strengthen ties among Christian denominations, and to build  relationships among the Abrahamic religions: Judaism, Christianity, and  Islam. He has co-sponsored international peace conferences, supported  reconciliation in conflict-ridden regions, and spoken out for  persecuted groups across the globe.\n\nHis All-Holiness Ecumenical Patriarch…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…responsible for a variety of activities, which include Federal  spectrum management, administration of broadband grants, internet  governance, representing the United States in international  telecommunication forums, and developing cybersecurity policy.\n\nAs the chairman has mentioned, Congress has not reauthorized NTIA  since 1992, before many of these responsibilities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…commissioned as a Logistics Readiness and Munitions Maintenance Officer  after graduating from the University of Colorado, where he received a  Bachelor of Arts Degree in International Affairs with magna cum laude  honors. As a commissioned officer, Evan has remained committed to his  educational and professional growth, earning a Master of Science Degree…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2416) to amend the Taiwan Allies International Protection and  Enhancement Initiative (TAIPEI) Act of 2019 to provide that the United  States, as a member of any international organizations, should oppose  any attempts…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…ADMINISTRATION.\n\n(a) Primary Functions.--Section 202 of Public Law 94-305       (15 U.S.C. 634b) is amended--\n\n(1) in paragraph (1), by inserting ``and the international       economy'' after ``economy'';\n\n(2) in paragraph (9), by striking ``complete'' and       inserting ``compete''; and\n\n(3) in paragraph (12), by striking ``serviced-disabled''…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687957/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…football fields, soccer fields,  pickleball courts, tennis courts, swimming pools, ski resorts, and golf  courses. Utahns value sports, and we are good at them.\n\nUtah is an international center for technology, including space tech.  Just south of Salt Lake City is a business park called Silicon Slopes.  About 100 miles north of Salt Lake City is the Space…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…9th Marines, where he  deployed to Okinawa, Japan, and participated in Exercise Forest Light  and the Korean Marine Exchange Program--strengthening joint  capabilities and international cooperation.\n\nFollowing this assignment, Timothy transitioned to Tampa, Florida,  where he served as the First Sergeant for Headquarters Company, U.S.  Marine Corps Forces…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…promote any  agenda, including their radical agenda, with stuff like what to do if  you experience a microaggression or some other promotion of their  agenda.\n\nAdditionally, international institutions have abandoned their  original missions to promote development in exchange for radical gender  ideological and climate priorities.\n\nThat is why I support the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692522/rescissions-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…them to  work for our adversaries, undermining our economy and hindering our  ability to stay at the forefront of discovery.\n\nA 2023 survey by the Center for Strategic and International Studies  found 224 reported instances of Chinese espionage directed at the  United States since 2000.\n\nAfter conducting oversight of recently enacted research security…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, Indiana is at the Crossroads of America. The  Indianapolis International Airport is in my district. It is one of the  reasons we proudly hold the claim to the distinction of Crossroads of  America.\n\nThis past month, Indianapolis International…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692118/welcoming-nonstop-flight-from-indianapolis-to-dublin"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Notre Dame as  a member of the Fighting Irish's 1988 National Championship team. He  graduated in 1990 with a bachelor's degree in business administration  and a minor in international marketing. During the 1990 NFL Draft, Pat  was drafted in the second round by the Los Angeles Rams and part of the  1990 All-Rookie Team. He also played with the New York…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Bartholomew has been an  unwavering advocate for peace, interfaith dialogue, religious freedom,  and environmental stewardship, earning him the title of ``Green  Patriarch'' and international recognition for his vision of  reconciliation and unity. He has convened historic gatherings of  Orthodox leaders, fostered dialogue with other Christian traditions,  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}]