[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…of Health and Human Services'  Administration for Children and Families.\n\nMs. Barlow has been with ACF since 1994, when she joined the agency  as a presidential management intern, and then as a budget analyst. She  became the Director of Budget in 2009 and has served as the Director of  the Office of Legislative Affairs and Budget since 2017. Ms. Barlow…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…of you. You  know, believe in yourself. You can take risks, but go forward. She had  a lot of years ahead of her to determine what she wanted to do with her  life. So this intern in my office found this to be very encouraging.\n\nThat is what I mean about teachers having a profound impact on the  life choices that their students make and how they think…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…recognized by the Sacramento Metro  Chamber of Commerce as a Young Professional of the Year.\n\nAnthony joined my staff in 2018, when he was a senior at Sacramento  State, as an intern. He came on as a staff assistant and has been  working his way up. Anthony has shown grit and perseverance,  representing the Sacramento communities of North Sacramento, Del…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699299/anthony-uribe-recognized-as-young-professional-of-the-year"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…ushered out of the room. It happened very  fast. Staff began to come in from outside the Chamber while a Senator  was still speaking. I was sitting right here, speaking to an intern who  was shaking uncontrollably with fear. It was unusual and concerning,  but we still did not understand the scale of what was happening beyond  these walls.\n\n(Mr. CURTIS…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of how  this bill is an attack on the separations of power that we all here in  the Senate have taken a constitutional oath to defend.\n\nWhen I first came to Congress as an intern for Senator Hatfield, we  were celebrating our 200th anniversary. That is so long ago, 49 years  ago. And Senator Hatfield had a saying about appropriators, and that  was that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Chicago, you will remember last July's derecho, when a  record-breaking 32 tornadoes ripped through the Chicagoland area. Eric  Carothers remembers it well. At the time, he was an intern for the  National Weather Service in Chicago under their Pathways student  program, which allowed him to gain experience at the National Weather  Service while he was earning…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…WHYY's  Fresh Air with Terry Gross & Tonya Mosely, one of the most successful  national public radio shows in the Nation.\n\nMiller, who joined the Fresh Air team in 1978 as an intern, has been  an integral part of the show's tremendous growth, now reaching over 6  million weekly listeners across 138 different countries. Miller's  leadership and judgement…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…watching them  mature through the bar exam and on to successful legal careers both  locally and across the country. She was instrumental in the creation of  the Summer Law Intern Program (known as SLIP), which encourages diverse  and talented high school students to work as interns in private law  practices, corporate law offices and government agencies,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Congressional District with skill,  compassion, and professionalism.\n\nKathryn has been a member of my staff since January 2022, after  having previously served with distinction as an intern in the office.  From her earliest days here, she demonstrated a deep commitment to  public service and a genuine concern for the people who turned to our  office for help.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Speaker, I rise to share the story of a Federal  scientist from California who, in their words, was fired by President  Trump and Elon Musk.\n\nThey wrote:\n\nI was a Pathways student intern at the EPA. I was assisting       and training under the ecotoxicology group studying the       effects and bioaccumulation of PFAS. I am completely       devastated and heartbroken.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…as chief  of staff, Rikki approached every task with the same commitment--to make  life better for the people we serve.\n\nRikki's decade of congressional service began as an intern for  Congresswoman Debbie Dingell, where she was soon hired full time as  constituent relations and press assistant. After two years with  Congresswoman Dingell, Rikki joined…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Pregnant Workers Fairness Act the  law of the land.\n\nMatt has worked for the New York Senate Democratic Conference, as a  Legislative Aide in the New York Assembly, and as an intern for New  York Senator Kirsten Gillibrand. Matt's journey on the House side of  Capitol Hill began as an intern in my Washington, D.C. office back in  2019. He then moved over…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…robberies, and car thefts.\n\nSo far in 2025, D.C. has already seen over 2,200 violent crimes and  more than 120 homicides, including the tragic killing of a 21-year-old  Capitol Hill intern. That was an incredible tragedy. Of course, any  homicide is an incredible tragedy, but that one really was.\n\nDespite these alarming trends, the radical D.C. Council has chosen…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…GUTHRIE. Mr. Speaker, I rise today to honor Kaley Stidham for her  service to the House Committee on Energy and Commerce.\n\nA London, Kentucky native, Kaley began her career as an intern for  her hometown member and Dean of the House Congressman Hal Rogers (KY- 05) followed by an internship with Senate Republican Leader Mitch  McConnell (KY). During her Senior…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…sixteen thousand trucks moving in and out every week.\n\nConsisting of more than six hundred and nine thousand jobs throughout  Georgia, they look towards the future with enriching intern and  community involvement programs that pave the way for future  generations.\n\nIn the picture next to me is one of Savannah's own, Ross Goodman, a  rising senior at the University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694778/georgia-ports-authority"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Scalise, a graduate of the University  of Louisiana at Lafayette, and a native of Louisiana's 1st  Congressional District, Mitchell Shea.\n\nMitchell first joined Team Scalise as an intern and later moved onto  my full-time staff as a Staff Assistant. Over the past ten years, he  has been promoted multiple times and is currently serving as my Senior  Legislative…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…this body, and that is Transportation and  Infrastructure Republican Staff Director Jack Ruddy, who is leaving the  Hill after 15 years.\n\nJack started out in my office as an intern. He liked it so much he  decided to come back as an intern four more times. No matter what we  did or how hard we tried, we just could not get rid of him. I am  incredibly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "Mr. ESTES. Mr. Speaker, I rise to recognize and celebrate the life of  Eric Tarpinian-Jachym of Granby, Massachusetts, who was an intern in my  office.\n\nEric's life was tragically cut short by a senseless act of violence  in our Nation's Capital. Eric was an innocent bystander who was gunned  down as he walked…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693538/moment-of-silence-in-memory-of-eric-tarpinian-jachym"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…with a purpose. She returned to the classroom, pursued her long-held  interest in law, and earned a degree with a perfect 4.0 grade point  average.\n\nShe went on to serve as an intern at the Sarpy County Courthouse,  where her curiosity and work ethic stood out immediately. I know  firsthand that the county attorney from Sarpy, Lee Polikov, values her  hard…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 41st anniversary of the CBYX exchange program and to thank David  Byrne, a current participant and intern in my office.\n\nThe CBYX program is jointly funded by the U.S. Congress and the  German Bundestag.\n\nEvery year, this unique program offers 75 young Germans and 75 young  Americans…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688275/recognizing-41st-anniversary-of-cbyx-exchange-program"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Science from the University of Kentucky in 2024.  During her time in college, Emily volunteered her time as a Court  Appointed Special Advocate in Lexington and served as an intern in my  Washington, D.C. office. Upon graduation, Emily began her career in  Washington, D.C. and joined my team to serve the constituents of  Kentucky's 2nd District as my…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…look  of the hallowed halls of Congress--just ask her about the Senate  chandelier.\n\nLeveraging her naturally spirited personality and proven expertise as  a Parliamentary Intern in the Houses of the Oireachtas, Ireland, and  clerk in the Iowa House of Representatives, Nicole remains successful  in bringing people together to accomplish great things.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…training.\n\n(2) Inclusion of interns, fellows, and detailees.--For       purposes of this resolution, an individual serving in an       office of the House of Representatives as an intern       (including an unpaid intern), a participant in a fellowship       program, or a detailee from another office of the Federal       Government shall be considered an employee…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692190/mandatory-completion-of-program-of-training-in-workplace-rights-and-responsibilities"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…married to for over 66 years;  as well as a profound legacy in service to the State of New York and  our country.\n\nHis wonderful grandson, Mark Fogelson, also served as an intern in my  office.\n\nAfter earning a law degree from Syracuse University and serving in  the United States Army, Tarky returned to New York, dedicating his life  to public service,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…resource and help to many throughout the state.\n\nAmy was also a great team builder. She created the Simpson Staff  Spotlight. It is a fun survey that highlights a staff member or intern,  so we all get to know each other better--something everyone on the team  enjoys receiving.\n\nFrom helping tens of thousands of Idahoans navigate complex federal  issues to…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…keeps  the trains running on time. While I may be biased, I truly believe that  Mariah is one of the very best.\n\nWhether it was fitting 47 meetings in 2 days, managing our intern  program, overseeing travel logistics, or simply keeping the office  running smoothly, Mariah did it all with excellence. Her calm under  pressure, strong organizational skills,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Committee on Energy and Commerce.\n\nA Dundee, Oregon native and 2018 graduate of Oregon State University,  Brannon began his career in the U.S. House of Representatives as an  intern for his home state Congressman, Representative Greg Walden (OR- 02) before joining the House Committee on Energy and Commerce in 2018  as a Staff Assistant for Chair Cathy…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690576/recognizing-brannon-rains"}]