[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…change as we are only becoming more and more connected.\n\nConsumers, therefore, deserve to stay in touch with their friends and  family, use social media, or connect to the internet without fear of  their devices being hacked. We must ensure that these devices, the  networks they run on, and the vast amount of data they hold are secure  and protected…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693422/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…with, and it entails counting and comparing a representative  sample of ballots to the reported result.\n\nTo prevent hacking, none of our voting machines are attached to the  internet. We require county clerks to use two-factor authentication to  access voter databases.\n\nAnd once a vote is cast, a bipartisan team of election judges in each  county checks…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…underserved and rural communities behind. I represent a district  that is geographically predominantly rural. We still struggle with  issues like not having access to the internet in many counties that I  represent.\n\nYou cannot participate in or leverage the benefits of a digital  economy if you can't get on the internet. That is a fact. We must stand…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693778/digital-asset-market-clarity-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…now time for the Trump administration's NTIA to unleash the  rest of this funding so that States can connect as many Americans as  possible to fast, reliable, and affordable internet.\n\nCongress has also tasked NTIA with other meaningful responsibilities.  The agency manages Federal spectrum and its users, as well as  coordinates with the Federal Communications…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Mr. President, this bipartisan bill is a crucial first  step to bring Members of Congress, industry, civil society, and  families to the table to discuss the future of the internet. It does  not aim to end the conversation.\n\nSocial media, and the internet broadly, continue to evolve. We need  to keep up. Tech platforms must be appropriately incentivized…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…$10,000, you have got to report, and you have to ascertain the  citizenship of who you are contracting with. I don't know how you do  that. If you order something over the internet, you have got to check  out somebody's citizenship. I don't know how you comply, but that is  just a little gap in the bill.\n\nEvery school system, every school would have…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…bringing out onto the floor--we are not simply undoing a  regulation; we are pulling the plug on progress in our country; we are  abandoning millions of students who lack the internet access needed to  complete their homework, to attend class, to reach their full  potential.\n\nThis repeal will widen educational disparities in our country, it  will deepen…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…countries over the years, and  most recently with Chairman Smith, I witnessed personally the benefit  of AGOA, and I witnessed the entrepreneurial spirit of the people. As  internet access becomes broadly available, rapid economic growth and  opportunity will follow.\n\nWe have the ability to benefit from this inevitable growth in Sub- Saharan Africa, and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…like Iran and  other nefarious actors to more easily get their hands on the materials  needed to build nuclear weapons. With tensions mounting in the Middle  East and the internet containing significant bomb-making instructions  which are much more accessible to terrorist groups, this is not the  time when America can afford to step back.\n\nMr. Chair,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…constitutional concerns, I am pleased to see that this bill  before us today includes several improvements that address the concerns  that we raised during our bill markup.\n\nAs the internet and online platforms continue to evolve and create  new challenges that we have to deal with every single day, it is our  job as policymakers to be responsive to those challenges,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…just said. Even after these terrible, deepfake, harming images  are pointed out to Grok and to X, formerly Twitter, they do not  respond. They don't take the images off the internet. They don't come  to the rescue of people who are victims. That is why this legislation  is critical, because this legislation says that if they are guilty of  such reckless…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…trust each other again and, by so doing, better serve the       people who elected us. Stop listening to the bombastic       loudmouths on the radio and television and the internet. To       hell with them. They don't want anything done for the public       good. Our incapacity is their livelihood.\n\nLet's trust each other. Let's return to regular order.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…but almost. Of course, the  millennials, as we were closing out the 1900s, really felt as though  America was at the top of the world. We were unstoppable. We invented  the internet. Our auto industry was booming. The sport utility vehicle,  Oakland County, Michigan, being really one of the most wealthy, if not  the wealthiest county in America, and that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…down on the carpet, and they say: There is no  recording in here.\n\nIt is a damn press conference. It is for recording. They didn't want  to hear his speaking.\n\nAnd if the internet has got it accurately, the Secretary was there  and delivering her remarks within earshot the whole time. She has  command authority over those agents who are arresting a…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…can't even name the names of those who  did this.\n\nThe private information of the American people should not be fed into  AI software somewhere or made open for the entire internet, which is  full of hackers to access. We must protect the assets of our people and  those who trust this program.\n\nSocial Security information has always been private until…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Iran deserve liberty.\n\nThe regime's response has been swift and ruthless. In an attempt to  silence dissent and conceal its abuses, Iranian authorities have shut  down the internet and the phone service. They have cut citizens off  from one another and from the outside world. Peaceful protesters have  been met with lethal force.\n\nAlthough the regime…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…they receive  requests for assistance.\n\nThe PRC allows for the open sale of fentanyl precursors and other  illicit materials on the extensively monitored and controlled PRC  internet. A review of just seven e-commerce sites found over 31,000  instances of PRC companies selling illicit chemicals with obvious ties  to drug trafficking. Undercover communications…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…will not be tolerated.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  reserve the balance of my time.\n\nMr. HARRIS of North Carolina. Mr. Speaker, the internet is  increasingly becoming a hostile place for children. The practice of  sextortion is becoming far too common. As many as one in five teenagers  report experiencing sextortion.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Second Congressional  District (Ms. Kelly).\n\nFor years, large parts of my district and rural areas across America  have lacked access to fast broadband connections.\n\nReliable internet access is more than just being able to stream your  favorite TV shows and movies. It is the critical connecting link for  all of us. Whether it is helping our seniors access…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…beyond the tokens that we know well today.\n\nChris Dixon's book titled: ``Read Write Own'' talks about a future  where blockchain technology enables a new generation of the internet  which he terms ``Web 3.0.''\n\nTechnologies like NFTs can be used as tickets to events, identity  verification tools, and serve other real-world uses that will change  our…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693780/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…credit, some of them were  actually shockingly intellectually honest saying: Oh, that is not part  of our talking notes. No one told them the truth.\n\nMr. Speaker, it is on the internet. Trust me, I am not that bright. I  just looked it up. It is there. You can find it.\n\nThe next 10 years, the Federal Government baseline was spending $86  trillion over the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…play a crucial role in the global economy. These  cables are roughly 1 to 2 inches in diameter. Yet they crisscross the  globe and carry approximately 95 percent of global internet traffic,  facilitating trillions of dollars in global financial transactions.\n\nThe Undersea Cable Protection Act of 2025 eliminates the requirement  for undersea cables to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 859) to require the disclosure of a camera or recording  capability in certain internet-connected devices.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 859\n\nBe it enacted by the Senate and House…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…roughly 500-- and that would be rounding up--I know firsthand the joys of living in a  rural community. I also know some of the challenges.\n\nEverything from package delivery to internet reliability can be more  difficult when you live far outside a major city, and access to  healthcare can sometimes be a real challenge. More than 100 rural  hospitals have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…States continues to lead the way. The uncomfortable reality  is that our payment system is outdated. Many of our financial rails  date back to the 1970s and 1980s, before the internet transformed how  we live and work.\n\nWhen a small business owner in Cheyenne uses a traditional payment  system to send a payment to a supplier overseas, they face delays up…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…head us toward being the type of country we wouldn't want to live in.\n\nThat is with regard to a committee hearing we had this week on the  First Amendment and how it affects internet platforms, but it is really  a greater topic than just that.\n\nThis week, we had a hearing in the Judiciary Committee in which we  talked about restrictions on free speech…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…B-329926, Sept. 10, 2018, we found that updates to a       Social Security Administration (SSA) hearing manual governing       SSA adjudicators' use of information from the internet       qualified as a rule of agency organization, procedure, or       practice. There, the manual outlined procedures for SSA       employees to follow in processing and adjudicating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…are desperately trying to overthrow  their oppressors and restore the blessings of liberty to themselves and  their posterity.\n\nThey need the direct satellite access to the internet that the regime  has denied them on the ground. They need us to restore economic  sanctions, as the President is doing against the regime in a renewed  boycott of Iran.\n\nMr.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…cybersecurity, and network threats;\n\n(7) participants in multistakeholder standards and       technical organizations (including the 3rd Generation       Partnership Project and the Internet Engineering Task Force);\n\n(8) international stakeholders, in coordination with the       Department of State as appropriate;\n\n(9) providers of mobile service, including small…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Healthy Kids Act, I just want to go back over a couple things as well.  Senator Welch, it is always a pleasure to work with you. Whether we are  trying to connect high-speed internet or give milk to schools, it is  always a joy. I appreciate your hard work and greatly appreciate your  staff and my staff as well. I think our staff never gets enough credit.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}]