[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…America's small, high- growth companies an opportunity to fund and grow their innovative ideas  and create jobs.\n\nThe success of this program can be seen with companies like Apple,  Intel, and FedEx, which all receive early-stage financing from SBICs.  Today, there are 319 SBIC-licensed funds participating in an array of  private investment and private credit…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…would also like to echo Mr. Khanna in  imploring a full committee hearing for the House Armed Services  Committee with Secretary Hegseth and a full committee hearing for the  Intel Committee with Director of National Intelligence Tulsi Gabbard.  We absolutely and collectively all must have the oversight and the  understanding of what is going on in Venezuela…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…the definition of socialism? Again, if you crack a book, you  will see that it is state control over the means of production. This  President has taken a 10 percent stake in Intel, a 15 percent stake in  MP Materials, a 10 percent stake in Lithium Americas, and a 10 percent  stake in Trilogy Metals, and we have a golden share in U.S. Steel-- state control…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…of this bill. We have others outside of  the jurisdiction of the NDAA who are part of this, including Coast  Guard reauthorization, Foreign Affairs reauthorization, and the intel  community's reauthorization. Those are important to meet our national  security needs, as well.\n\nThere is also a very important component on countering UAS  domestically.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…cared about denouncing authoritarian socialism,  they would start with the Trump administration. In less than 1 year,  the Trump administration has demanded U.S. companies like Intel, U.S.  Steel, MP Materials, Lithium Americas, and Trilogy Metals to hand over  stock to the U.S. Government. These are capitalist companies who are  doing business that they…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Judiciary Committee, for yielding.\n\nMr. Speaker, I rise today in strong opposition.\n\nThis resolution, this effort to censure Delegate Plaskett and to rip  away her membership on the Intel Committee, is nothing more than a  political stunt by a desperate, failed candidate for Governor trying to  pander to the people back in South Carolina. It is nothing more…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696891/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Hamilton to Lincoln to FDR. We  need a government that says: If you make it in America then we will buy  it. That is what we did, by the way, for SpaceX. That is what we did  for Intel. That is what we did in World War II. We need a government  that says: If you skill the factories here we will help finance it. We  need a government that  says that we are…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…was getting text messages. I am not saying she  was or wasn't, but considering the fact that they were talking to  another associate of the President's, and maybe she needed intel, you  would have to go talk to somebody who maybe knows what he is up to.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…unfolding before our eyes.\n\nAgain, I reference the article here: ``A stunning number of electric  vehicle, battery factories are being canceled.'' We just read about  another Intel factory in Ohio.\n\nI met with these remarkable people at the Laborers' International  Union this morning, or just as it was heading into afternoon time,  rather. I met with…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…available to our country's small businesses for whom  even small investments can mean so much.\n\nAlready SBICs have helped marquee American companies like Costco,  Apple, and Intel get off the ground, back when they were just starting  out. SBICs fill a gap in the investment ecosystem and level the playing  field for the smallest businesses which often…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…sewage that Mr. Himes said. Yeah. Thanks for  agreeing with me, Ms. Plaskett. She has got us down. Unless you are in  the Intelligence Committee, you are crap. That is what the Intel  Committee says.\n\nBut here is the deal: When you are sitting there in a sitting  committee, and you are having communications with a convicted sex  offender, and you are taking…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696896/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…exactly right.\n\nGeneral Caine has this breadth of experience, not just as a fighter  pilot with thousands of hours, combat hours, in flight but has worked  very closely with our intel services and has very significant combat  experience in Iraq and Syria.\n\nVery interestingly--and the chairman of the Armed Services Committee  knows this--he has private sector…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Lomell and his Rangers, upon successfully climbing the cliffs  despite heavy casualties, were dismayed to find when they got to the  top of the cliffs that the Allied military intel was misled by decoys  and that the entire invasion was now at risk. Bud, I know  parenthetically, was actually wounded leaving the landing craft but  tenaciously continued.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…next generation. But are we going to adopt policies?\n\nAll right. Let me go jump on a landmine.\n\nDoes it make sense to have a government that goes out and owns 10  percent of Intel? So your government is the largest shareholder of  Intel.\n\nOkay. I love Intel. But I can actually show you some brilliant  economic papers that say that it should be four different…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…don't know. If that is not a terrorist organization  that is truly poisoning our streets, then I don't know.\n\nDuring the time that the junior Senator from California sat on Intel,  not one time did he ever ask for the release of the same videos from  the Obama administration that killed 3,700 individuals, including U.S.  citizens.\n\nNow, if you think…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…destruction.\n\nMr. Speaker, I never liked the CHIPS Act because it directs cash  subsidies. Often, subsidizing last-generation technology leads to what  is going on right now. Should Intel give up 10 percent of its  ownership? What would happen if Intel were forced to break up? We might  end up with four or five creative, efficient, and cutting-edge  companies.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]