[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…disagreement on that. We didn't exercise  oversight on that either, so stepping aside from all of these issues,  simply letting the President do what he wants to do.\n\nThen, internationally, the last point, this attack on that boat down  in the Caribbean is incredibly problematic. This is an expansion of the  war powers of the President that we have never…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…benefit to the United States.\n\nThe crypto bros occasionally tell you out loud what they are  thinking. That  is they want to minimize and destroy the role of the U.S. dollar  internationally. What do they do to hobble the dollar? They say the  Chinese Communist Party can have a digital yuan, the bitcoin bros can  have a digital currency, but America is limited…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…twenty-five years, Navin KC has been a tireless force  in the world of dance and choreography, introducing Nepali language,  art, and culture to audiences both nationally and internationally. As  the Founder and Director of KC Dance Center in Virginia, he has  provided countless students, particularly second-generation children,  with dance training that emphasizes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…to stability:\n\nAs a divided Libya lies between two deepening crises in       Africa and the porous southern flank of Europe,       representatives of the       nation's internationally recognized government told Newsweek       they were looking to President Donald Trump to strike a deal       that could have profound effects across two continents.\n\nThe…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Libya is taking concrete  steps to lessen long-standing tribal animosities that have divided the  country. The new Libya is committed to a unified country without the  internationally recognized transitional government in Tripoli being  held hostage to a would-be regime in the east.\n\nThese profound changes and commitments were well-reflected in an…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697566/recognizing-the-importance-of-a-new-libya"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…need to make sure that in this process we not only pay  attention to those elements but we also pay attention to the  international situation that is out there. We compete internationally.\n\nThe solution that the President is proposing is that we are going to  protect ourselves with tariffs. If we are interested in keeping the  cost to individuals down,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…to recognize the Omicron  Kappa Kappa Chapter of Omega Psi Phi Fraternity, Inc. for its  Achievement Week and Honorees.\n\nSince 1925, Achievement Week has been an annual, internationally  mandated program of the Omega Psi Phi Fraternity, Inc. The purpose of  the program is to inspire race, pride, and public appreciation of the  Negro's potential. Chapters…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…the evidence. Their cloud-based research tool  called `Spine-online' enables them to conduct multi-center studies and  partner with research teams both in the U.S. and internationally.  Active studies are currently occurring on robotic surgery, enhanced  surgical recovery, augmented reality, a genetic basis for personalized  spine treatments, stem cell…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…president  and CEO, as well as in Veronica's role as director of education and  programming, the Ocasios have nurtured the museum to become a locally,  nationally, and internationally celebrated institution.\n\nThrough exhibits, events, oral history sharing, and more, the  National Museum of Puerto Rican Arts and Culture does important work to  preserve…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…communities.\n\nHis leadership has been honored across the world. In 1997, he  received the Congressional Gold Medal here in the United States, and he  has been recognized internationally as one of the most influential  figures of our time. Yet the true measure of his ministry lies not in  awards, but in his call for peace over division, compassion over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…make  them cleaner. All of these things were part of that testing.\n\nThe test site became a real player and had a major role in shaping  our policies, both nationally and internationally, regarding testing  and nonproliferation.\n\nThe radiation given off by more than 100 atmospheric tests had  devastating impacts, however. It wasn't a tourist attraction…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…though he has tried to pin this on former President  Biden.\n\nThe red light, green light tariff policies have caused uncertainty in  all sectors of our economy as well as internationally. Wall Street and  Main Street alike have been sending signals for weeks that they do not  like or trust those economic plans. The stock market has dropped almost  9 percent…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690572/new-federal-economic-data"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…issue within the Department of Justice. I also met with  Yehuda Kaploun, President Trump's nominee to the Special Envoy for  Combating Antisemitism--he will lead this fight internationally, within  the State Department.\n\nThese are both extraordinarily capable and energetic people--and  determined. I have no doubt they will do excellent work--they  understand,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…globally, and constructive dialogue among faiths.\n\nBorn on the island of Imvros, the Ecumenical Patriarch has spent his  life in service to both faith and humanity. He is internationally  recognized for his efforts to protect the environment--earning the  nickname ``the Green Patriarch''--as well as for his work in advancing  human rights, reconciliation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…comes from within, as President Trump and his administration       have assaulted the pillars of our democracy here at home and       our strength around the world.\n\nInternationally, Trump has questioned the value of long-      standing alliances in Europe and Asia. On our borders, he has       poisoned ties with our closest neighbors. He has undermined…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…decades, membership grew exponentially to around  600. The organization later established the Trans-Tahoe Race, the  organization's largest sailing event, which soon became internationally  acclaimed. It attracted people from across the world. This July will  mark the 62nd annual Trans-Tahoe Regatta.\n\nThe Tahoe Yacht Club has exhibited endurance and resilience…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the United Nations to use the voice, vote,       and influence of the United States to--\n\n(1) oppose any efforts to prevent consideration of the       gross violation of internationally recognized human rights in       the XUAR in any body of the United Nations;\n\n(2) oppose any efforts to prevent the participation of any       Uyghur human rights advocates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the  explosion of mobile phones and new connected technologies.\n\nWe must make sure NTIA's leadership reflects the important role it  plays today, both domestically and internationally.\n\nThis legislation elevates the NTIA Administrator from an Assistant  Secretary of Commerce to an Under Secretary of Commerce. This elevation  will help NTIA best represent…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…dance. They know the  declaration of war resides here. They know initiation of war--so they  argue first that it is not war; it is a drug bust. But then they say:  Well, internationally, people say it probably is a war, so in case you  think it is a war, we are going to tell you that it is not really a war  because we won't know if it is a war until it…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…with a single law of the land. However, they  do so looking at the arguments of both winning and losing, and they do  so while the administration is not nationally and internationally  banned.\n\nNational injunctions are being used to halt executive actions and  executive orders not just for plaintiffs before the court but across  the entire country,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…priority.  This year's bill, which was signed into law in November, supports  agricultural research programs and facilitates marketing U.S. ag  products both domestically and internationally. And it provides robust  funding for the Farm Service Agency, which producers depend on to  access the programs which keep their operations running smoothly.\n\nWe are not…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…As a performer, Mr. Parker has experience as a saxophonist with wind  bands, big bands, and variety bands in the Lehigh Valley and  Philadelphia areas, and has performed internationally in Great Britain  and the British Virgin islands.\n\nIn retirement, Mr. Parker looks forward to guest conducting, running  clinics and teaching lessons online, as well as…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Lori often says: ``The world is run by the people who show up.'' And  show up she does. Lori has made countless trips to Washington, as well  as all across the country and internationally, to advocate for her  fellow pork producers.\n\nI thank Lori for her years of relentless dedication and leadership,  and congratulate her on a successful year as president…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692906/recognizing-lori-stevermer"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Apple to perform with the  National Youth Orchestra of the United States.\n\nNot only will he debut in New York, he will also represent our Nation  and  our State as he tours internationally in Japan, Hong Kong, China, and  South Korea.\n\nTarquin's journey began at the age of 5 when his mother, who taught  herself to play the violin at age 34, inspired him…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693758/recognizing-tarquin-bennion"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…capacity of the Government       of Georgia to protect its sovereignty and territorial       integrity from further Russian aggression or encroachment       within its internationally recognized borders;\n\n(3) to call on all political parties and elected Members of       the Parliament of Georgia to continue working on addressing       the reform plan…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…development in 34,300 acres of East Texas.       Politically, Tower was up for re-election in 1984 and he       desired to broaden his legislative record beyond his       internationally recognized expertise in military and foreign       relations matters. Thus, the Arkansas wilderness bill and the       Texas anti-clear cut measure both fit neatly in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…competitive.\n\nYesterday, when Secretary Rollins was in our State of Iowa, she  remarked upon our productive farmers and ranchers and added she will be  going on six trade trips internationally over the next 6 months.\n\nFor Iowans, agriculture isn't just a way of life. It is the backbone  of our economy, and I am deeply committed to supporting Iowa's  hardworking…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…regarding Taiwan.''.       SEC. 4. OPPOSING THE PEOPLE'S REPUBLIC OF CHINA'S EFFORTS TO                     UNDERMINE TAIWAN'S TIES AND PARTNERSHIPS                     INTERNATIONALLY.\n\nSubsection (a) of section 5 of the Taiwan Allies       International Protection and Enhancement Initiative (TAIPEI)       Act of 2019 (relating to strengthening ties…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…China; the Philippines, one of America's treaty allies, is locked in a  contentious territorial dispute with China. Beijing wrongly claims  islands and shoals that have been internationally recognized as  belonging to the Philippines. Yet Manila is standing its ground with  remarkable courage despite relentless Chinese pressure, and that  deserves our deepest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}]