[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress's exercise of its express       constitutional authority to decide to admit a new state is a       classic political question, which courts are highly unlikely       to interfere with, let alone attempt to bar.\n\nThe D.C. Admission Act. The House passed the Act, as H.R.       51, on April 22, 2021, and as of this writing, the       substantively identical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…quote DOD  here, ``construction of the Revolution Wind project . . . would not  have adverse impacts to DOD missions.'' No adverse impacts.\n\nSo the idea that somehow it might interfere with the movement of  submarines from the Groton sub base or maybe testing of submarines by  electric boat or some other national security or national defense need,  no adverse…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…have descended in the first 140 days of  this administration, where we have a President calling out the military  over the objection of a Governor to try to intimidate and interfere  with law enforcement in California, calling out the Marines to try to  inflame tensions in our city; and, now, this latest act, when a U.S.  Senator goes to demand questions…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…only mischief, and I am going to be joined here by  Ranking Member Heinrich to talk about some of the more westerly tricks  that the Trump administration has been up to to interfere with clean  energy.\n\nBut that second stop work order kind of tore it for me--because any  negotiation that we would enter into, any good bill that would result  from it,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…platform  as ``very high risk,'' warning that any unauthorized user, regardless  of clearance, could access all the applications and datasets, the very  kind of thing that would interfere with our privacy from private  entities.\n\nPalantir, of course, disputes these findings, but the concerns are  real, and the consequences of getting it wrong would be enormous.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress's exercise of its express       constitutional authority to decide to admit a new state is a       classic political question, which courts are highly unlikely       to interfere with, let alone attempt to bar.\n\nThe D.C. Admission Act. The House passed the Act, as H.R.       51, on April 22, 2021, and as of this writing, the       substantively identical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…bill will not lower the cost of your healthcare. It will not  protect children. It will not ease the strain on doctors and other  healthcare providers.\n\nWhat it will do is interfere with parental choice and open private  medical data up to Federal investigation. It threatens to jail doctors  who follow evidence-based practice supported by every medical…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698352/protect-childrens-innocence-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…combat election  misinformation and disinformation.\n\nWhy would he and his administration and Republicans in Congress who  support him want to make it easier for people to interfere with our  elections?\n\nI am at a loss. I am at a loss for an answer. What I do know is that,  by failing to counter, by failing to elevate the truth, Republicans in  Congress…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…their healthcare  providers across the country.\n\nThe so-called Protect Children's Innocence Act is a blatant attack on  the rights of parents. It allows the government to interfere with very  personal healthcare decisions.\n\nMy Republican colleagues have spent years touting parental rights,  yet now they want to put moms and dads and doctors in prison…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698355/protect-childrens-innocence-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…marijuana in federally  assisted housing in compliance with a state's marijuana laws. The  Department of Housing and Urban Development (HUD), like DOJ, should not  be allowed to interfere with jurisdictions implementing their marijuana  laws.\n\nUnder this bill, HUD must develop regulations that restrict smoking  marijuana in federally assisted housing in the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…simple.\n\nIt is because the Constitution says otherwise. The Constitution  clearly entrusts elections to the States and to Congress, not to the  President.\n\nBut those efforts to interfere are underway and ongoing. We have seen  the Department of Justice sue 24 States that happen to be led by  Democrats. They are targeting their voter rolls in addition to the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…nitrite above 10 percent  concentration to businesses with verified industrial or commercial use.  That threshold is based on expert recommendations for safe handling and  won't interfere with legitimate industries like food processing.\n\nThis bill is focused and reasonable. It targets bad actors who are  exploiting a loophole to profit off tragedy, and it…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690216/youth-poisoning-protection-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…invoked, and this measure that I have reintroduced would  very simply create checks and balances and limit the Executive's  authority to deploy troops domestically. It wouldn't interfere at all  or relate to his use of troops abroad, outside the boundaries and  borders of the United States.\n\nIt allows Congress to support the President's decision to extend…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…millions of dollars into U.S. universities through Confucius Institutes  and other programs. These programs have given China, a strategic  competitor, a platform to potentially interfere with academic freedom  and free speech as well as greater access to sensitive intellectual  property and national security information.\n\nTo curtail these efforts, H.R. 881…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…granulomas--tiny clumps of inflammatory cells--in one or  more organs of the body. When the immune system goes into overdrive and  too many of these clumps form, they can interfere with an organ's  structure and function. When left unchecked, chronic inflammation can  lead to fibrosis, which is the permanent scarring of organ tissue. This  disorder…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…stop sentencing youth offenders below the  minimum sentencing guidelines.\n\nIt is time to bring back justice in America. It is time for fair  punishment for the people who interfere with people's daily lives,  specifically those with prior convictions. The revolving door of  justice ends today. I cannot thank Representative Donalds enough for  his vital…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…when they created it. They  called it the Affordable Care Act. Only Democrats voted for it.  Republicans knew it was going to be anything but affordable. It was  going to interfere with the doctor-patient relationship. Unfortunately,  it has done that.\n\nIf we want to talk about affordable, maybe the only other bill that  is more laughable in its name…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…would make it illegal for anyone, after being told to  stay back, to knowingly come within 25 feet of a Federal officer that  is trying to do their job if the intent is to interfere with the  officer's work or threaten physical harm.\n\nYou know, personally, I am the wife of a law enforcement officer. It  is incredibly dangerous, as they are trying to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…the       Architect of the Capitol and the Capitol Police Board, the       event shall be--\n\n(1) free of admission charge and open to the public; and\n\n(2) arranged not to interfere with the needs of Congress.\n\n(b) Expenses and Liabilities.--The sponsors of the Memorial       Service and Exhibition shall assume full responsibility for       all expenses…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…been ironclad.\n\nInstead, under the previous administration, American support was  delayed, restricted, and paired with attempts to micromanage Israel's  operations and even interfere with Israeli politics. And at every turn,  the progressive left and isolationist right hyperventilated about the  specter of so-called forever war.\n\nFortunately, Israel held…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…an ICE officer, we are increasing those  penalties too. Protest all you want--for God's sake, this is America,  and we have different points of view--but you don't get to interfere in  the operations of Federal law enforcement. Even if you really believe  you are wearing the white hat, you don't get to do that.\n\nFourth, as for this NGO network that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…stealing sensitive case material from a  U.S. District Attorney's Office.\n\nColleagues, I pose to you this question: Why would the Chinese  Government go to such lengths to interfere in a case involving a so- called private company in which they have no stake?\n\nWell, they wouldn't.\n\nWhile recent actions to curtail Huawei equipment and those from other…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…law--what  a thought. And I will continue to support law enforcement until every  single illegal is out of this country and comes here the right way.\n\nIf you are going to interfere in law enforcement's ability to do  their jobs, folks, in any way, don't be surprised if you are arrested  and thrown into jail--and you should be.\n\nThanks to investigative…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…attention to this growing public health challenge.\n\nAlzheimer's, the most common form of dementia, impairs memory,  thinking, and behavior, with symptoms that eventually interfere with  daily life. The effects of this disease are not limited to the  individuals diagnosed but, of course, extend to their families,  friends, caregivers, and communities.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…jurisdiction of the Coast Guard.\n\n``(d) Direct Access to Secretary and Commandant.--No       officer or employee of the Coast Guard or the Department of       Homeland Security may interfere with the ability of the       Special Advisor to give direct and independent advice to the       Secretary and the Commandant on matters related to this       section.\n\n``(e)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…their staff. This  instability makes it difficult for owners and operators to make long- term business plans. Antiworker efforts that chip away at the tipped  wage altogether interfere with employees' hard-earned paychecks and  livelihoods.\n\nMy bill, Mr. Speaker, the Tipped Employee Protection Act, provides a  commonsense solution. It puts an end to hurtful…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…things:\n\nFirst, it doubles the criminal penalty for assaulting Federal law  enforcement, and for the first time, it makes it a Federal crime to  ``inhibit, stymie, hamper, or interfere with'' Federal law enforcement  operations. That means the people blowing whistles and erecting  roadblocks on streets in Minneapolis, not just the ones who physically  attack…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…public or executive sessions, a witness,       witness counsel, or any spectator conducts themselves in such       a manner as to prevent, impede, disrupt, obstruct, or       interfere with the orderly administration of such hearing,       the Chair or presiding Member of the Subcommittee present       during such hearing may request the Sergeant at Arms…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}]