[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…retirement savings of our police officers, teachers, and  firefighters, and for the preservation of U.S. capital markets and  capitalism that is free of the meddlesome government intervention that  Republicans seem to love, I urge a ``no'' vote and oppose this  legislation.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…contradicted established medical evidence.\n\nSeveral patients reported being reassured that severe pain or  bleeding was normal, only to later require emergency medical  intervention when complications were left untreated.\n\nIf Republicans truly cared about TANF oversight, they would have  spoken out when millions of TANF dollars were stolen from struggling…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…schools, ensured screenings for individuals entering the justice  system, and reformed civil commitment laws to emphasize voluntary  treatment.\n\nShe expanded crisis and early intervention services, championed a  more diverse mental health workforce, and worked to strengthen housing  and community-based support services.\n\nHer compassion extended to her home…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…gripped by the fear  of losing the care that keeps them or their kids alive.\n\nCaroline, a young woman from Newark, has a rare condition that  requires extensive medical intervention. Without Medicaid, she told me  that she could die. Caroline tragically is not alone. If these cuts  advance, people will die.\n\nI have heard from doctors, nurses, hospital…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…say this as a mother who  watched her son put on the uniform and deploy to two wars: By investing  in global stability, we reduce the need for costly and deadly military  intervention.\n\nIsolation is not an option. When the United States pulls back, our  adversaries like Iran, China, and Russia double down. They move in to  fill the void, rewrite the rules,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…written about other       colonial attacks on British vessels that preceded the burning       of the Gaspee but provoked negligible reaction from the       crown.\n\nThe king's intervention also led to a British attempt to       circumvent the colonial courts, causing alarm and ultimately       backfiring on the crown, Concannon said. He argued that       several…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…States, and everybody basically understands and knows that.\n\nNow, the administration spent a lot of time talking about drugs.  Their initial forays with respect to military intervention in and  around Venezuela were targeting these boats that they  claimed were carrying drugs. And, you know, that makes a little bit  more sense to the American people because…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…25-year-old young adult with profound nonverbal autism  who needs 24/7 support. Our family has relied on Medicaid from the time  he was 2 years old, when he began early intervention services. At 3,  when he was diagnosed with autism, private health insurance denied him  coverage for his preexisting condition. Medicaid stepped in to provide  healthcare.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…you respect years later. You were part of the  first gun legislation to pass out of this body in 30-something years.  And now I just found out that the Community Violence Intervention money  that you allowed me to fight so hard to get in that bill is being  clawed back by Donald Trump--our bipartisan bill, our bipartisan- approved finances, money, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Over the  years, FCS has expanded its services to address the evolving needs of  the community, offering mental health counseling, financial empowerment  programs, crisis intervention, and support for survivors of domestic  violence.\n\nThrough its dedicated team of professionals and community  partnerships, FCS has transformed countless lives by ensuring…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…we walked out  of the room with more questions than answers. We need a clear  explanation.\n\nI am demanding a full Senators' briefing on this issue of Venezuela  and the intervention there, at once.\n\nIn the meantime, the Senate must act today to discharge this  resolution because Donald Trump seems ready to lead our troops over the  Rubicon with a blindfold…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…programs, programs that make our communities  safer and support our law enforcement. Our fight was fruitful.\n\nFor example, we secured $50 million for community violence  intervention and prevention initiative grants, despite the President  and the House Republicans' attempts to eliminate this funding that so  many of our local law enforcement rely upon.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698757/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…judge has found is unnecessary because whatever protests have  happened in the past weeks and months have been peaceful and without  the necessity for this kind of military intervention?\n\nMr. BLUMENTHAL. If my colleague would yield for one more quick  question.\n\nMr. BLUMENTHAL. I think he is absolutely right to call attention to  the extraordinary professionalism…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…this  violence. We cannot allow this violence to become normalized. We must  stand together to advance commonsense gun safety legislation, invest in  community violence intervention programs, and address the root causes  of gun violence.\n\nYear after year, we go back to our districts. We go to vigils. We  watch the news. We see tragedies. We come back…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…goodbye. Officer Thomas immediately engaged with the young man,  and he shared a simple, powerful message: that life is worth living and  that he was important. That heartfelt intervention saved a life. This  remarkable story is a testament to Officer Thomas's character. A belief  that we all have a gift to be something and to do something, and he has  certainly…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…this organization, led by executive director Alisha Rone, serves  close to 700 children each year. Its team of 120 individuals provide  support, advice, and--when needed--intervention to parents and their  children.\n\nThe CDC's early intervention services are key to ensuring the  lifelong success of our children. Offering free screenings and  educational…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…essential  access point for individuals transitioning from high-risk settings such  as jails and inpatient facilities, helping ensure continuity of care at  moments when intervention is most needed. The impact of this program  has been extraordinary. While the UCC initially anticipated serving 450  individuals during its first year of operation--from…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…appropriations for the       fiscal year ending September 30, 2026, and for other       purposes, with the Senate amendments thereto, and to consider       in the House, without intervention of any point of order, a       single motion offered by the chair of the Committee on       Appropriations or his designee that the House concur in the       Senate amendments.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…same: Proclaim that the regime of  the targeted country poses such a threat to the American way of life  that the only thing we can do is go to war. Tell them that our  intervention is a noble effort, one that would bring security at home  and liberty to foreign lands. Topple the government and declare a new  age of freedom. The warmongers have recycled…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and setting forth the appropriate budgetary levels for fiscal       years 2026 through 2034, with the Senate amendment thereto,       and to consider in the House, without intervention of any       point of order, a motion offered by the chair of the       Committee on the Budget or his designee that the House concur       in the Senate amendment. The…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…continuing appropriations and extensions for       fiscal year 2026, and for other purposes, with the Senate       amendment thereto, and to consider in the House, without       intervention of any point of order, a motion offered by the       chair of the Committee on Appropriations or his designee that       the House concur in the Senate amendment. The Senate…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…fulfilling lives.\n\nOur schools and early childcare programs must be equipped with the  knowledge, resources, and training to assist those living with autism.  Early diagnosis and intervention are critical, as they can  significantly improve communication, social skills, and quality of life  for individuals with autism.\n\nI would also like to take a moment to recognize…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…designees; (2) the amendment specified in section 5 of this       resolution, if offered by Representative Dexter of Oregon or       a designee, which shall be in order without intervention of       any point of order, shall be considered as read, shall be       separately debatable for 10 minutes equally divided and       controlled by the proponent and an…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…of the report of the Committee on       Rules accompanying this resolution, if offered by the Member       designated in the report, which shall be in order without       intervention of any point of order, shall be considered as       read, shall be separately debatable for the time specified in       the report equally divided and controlled by the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…legislation relating to such subjects reported by       the Committee on Foreign Relations shall be referred to the       Committee on Banking, Housing, and Urban Affairs).\n\n11. Intervention abroad and declarations of war.\n\n12. Measures to foster commercial intercourse with foreign       nations and to safeguard American business interests abroad.\n\n13. National…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…doesn't sound like a lot of money in this Chamber, but to put it  in context, that was many times more than the State of Kansas had ever  spent on addiction treatment and intervention and prevention.\n\nWe have an obligation to support these folks who are struggling down  the street from us with addiction. It shouldn't be a partisan issue. It  is more than…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is an illegal act of war to replace Maduro.\n\nAnother Senator said--and this was back in 2019:\n\nIf Trump cared about consistency, he would make the realist       case for intervention in Venezuela (getting rid of Maduro is       good for the United States).\n\nThis Senator called for intervention in Venezuela. Do you know what  he says now, after the invasion?…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…before initiating a civil action under       subparagraph (A), the attorney general shall notify the       Commission immediately upon instituting the civil action.\n\n(ii) Intervention by the commission.--The Commission may--\n\n(I) intervene in any civil action brought by the attorney       general of a State under subparagraph (A); and\n\n(II) upon intervening--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…officer, then  stopped at the homes of two other Minnesota lawmakers, one whom was  fortunately not home, and the other who was perhaps saved by a timely  law enforcement intervention.\n\nHe later arrived at the home of Minnesota State House Speaker Emerita  Melissa Hortman and assassinated her and her husband, Mark Hortman.\n\nLaw enforcement then led a…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "French Hill", "party": "Republican", "sentence": "…it should be  accessible. We should vote ``yes'' on this resolution so that we agree  with the Federal Reserve of New York when they say that to cap this fee  to do price intervention here is to deny credit and deny this product  to the hardest working families in America.\n\nMr. Speaker, I urge a ``yes'' vote, and I yield back the balance of  my time.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}]