[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…hotel room or other place of short-term  lodging.\n\nThis bill would also require hotels and other providers of short-term  lodging to provide the total cost of a room to any internet website or  other third party that the provider has allowed to advertise, market,  display, or otherwise offer the short-term lodging for sale.\n\nBy ensuring everyone in the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…B-329926, Sept. 10,       2018, we found that updates to a Social Security       Administration (SSA) hearings manual governing SSA       adjudicators' use of information from the internet qualified       as a rule of agency organization, procedure, or practice.       There, the manual outlined procedures for SSA employees to       follow in processing and adjudicating…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…underserved and rural communities behind. I represent a district  that is geographically predominantly rural. We still struggle with  issues like not having access to the internet in many counties that I  represent.\n\nYou cannot participate in or leverage the benefits of a digital  economy if you can't get on the internet. That is a fact. We must stand…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693778/digital-asset-market-clarity-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…now time for the Trump administration's NTIA to unleash the  rest of this funding so that States can connect as many Americans as  possible to fast, reliable, and affordable internet.\n\nCongress has also tasked NTIA with other meaningful responsibilities.  The agency manages Federal spectrum and its users, as well as  coordinates with the Federal Communications…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Mr. President, this bipartisan bill is a crucial first  step to bring Members of Congress, industry, civil society, and  families to the table to discuss the future of the internet. It does  not aim to end the conversation.\n\nSocial media, and the internet broadly, continue to evolve. We need  to keep up. Tech platforms must be appropriately incentivized…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…work off the clock without any compensation.\n\nFor that reason, I recommend a ``no'' vote, and I reserve the balance  of my time.\n\nMr. Speaker, I was just looking over the internet and found a Reddit  discussion board and found one entry that said: ``I am bothered by  unpaid 2-day training, which is going to be 9 hours each day.'' This  kind of crosses…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…perceived attempts by ``government officials to  silence political speech that they don't like.'' That is the old  Brendan Carr. He defended talk show hosts, saying:\n\nFrom internet memes to late-night comedians, from cartoons       to the plays and poems as old as organized government itself,       Political Satire circumvents traditional gatekeepers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…countries over the years, and  most recently with Chairman Smith, I witnessed personally the benefit  of AGOA, and I witnessed the entrepreneurial spirit of the people. As  internet access becomes broadly available, rapid economic growth and  opportunity will follow.\n\nWe have the ability to benefit from this inevitable growth in Sub- Saharan Africa, and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…like Iran and  other nefarious actors to more easily get their hands on the materials  needed to build nuclear weapons. With tensions mounting in the Middle  East and the internet containing significant bomb-making instructions  which are much more accessible to terrorist groups, this is not the  time when America can afford to step back.\n\nMr. Chair,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…constitutional concerns, I am pleased to see that this bill  before us today includes several improvements that address the concerns  that we raised during our bill markup.\n\nAs the internet and online platforms continue to evolve and create  new challenges that we have to deal with every single day, it is our  job as policymakers to be responsive to those challenges,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…just said. Even after these terrible, deepfake, harming images  are pointed out to Grok and to X, formerly Twitter, they do not  respond. They don't take the images off the internet. They don't come  to the rescue of people who are victims. That is why this legislation  is critical, because this legislation says that if they are guilty of  such reckless…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…trust each other again and, by so doing, better serve the       people who elected us. Stop listening to the bombastic       loudmouths on the radio and television and the internet. To       hell with them. They don't want anything done for the public       good. Our incapacity is their livelihood.\n\nLet's trust each other. Let's return to regular order.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…but almost. Of course, the  millennials, as we were closing out the 1900s, really felt as though  America was at the top of the world. We were unstoppable. We invented  the internet. Our auto industry was booming. The sport utility vehicle,  Oakland County, Michigan, being really one of the most wealthy, if not  the wealthiest county in America, and that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…our message out in  Ukraine, this is about countering the Government of China's propaganda  in the Indo-Asia Pacific, and this is about people in Iran having  access to the internet through VPNs that we helped them to get.\n\nAnd so some of these programs--if you are just a tech guy and you  have been assigned to find things to cut and you read a line item…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…our words will say: What can we do, Marcy? What  can we do to really help them?\n\nI said that children in classrooms can write little notes and send  them. If they use the internet and if they have internet capability,  then send them a note. Teachers all over our country: Don't expect just  the Government of the United States to do this. The American…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…cybersecurity, and network threats;\n\n(7) participants in multistakeholder standards and       technical organizations (including the 3rd Generation       Partnership Project and the Internet Engineering Task Force);\n\n(8) international stakeholders, in coordination with the       Department of State as appropriate;\n\n(9) providers of mobile service, including small…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…republic founded on  universal suffrage, as well as pluralism.\n\nTwo, freedom of speech, freedom of political parties, freedom of  assembly, and freedom of the press and the internet: dissolution and  disbanding of the Islamic Revolutionary Guard Corps, the IRGC; the  terrorist Quds Force; plainclothes groups; the unpopular Basij; the  Ministry of Intelligence;…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to show you what the hell is really going  on.\n\nOne of the things that is incredibly frustrating is we live in a  world where so much of what you are going to find on the internet right  now isn't true. Let me prove it.\n\nHere is an article I was very disturbed to find out: Complex  infection keeps the Pope in hospital. This is Newsweek from a couple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…they receive  requests for assistance.\n\nThe PRC allows for the open sale of fentanyl precursors and other  illicit materials on the extensively monitored and controlled PRC  internet. A review of just seven e-commerce sites found over 31,000  instances of PRC companies selling illicit chemicals with obvious ties  to drug trafficking. Undercover communications…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…pace, enabling real-time  settlement of peer-to-peer transactions, initiating a renaissance in  applied cryptography and laying the groundwork for the next generation  of the internet.\n\nThe United States has long had the most innovative financial and  technology sectors and the deepest and most liquid capital markets, but  while other jurisdictions are…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…the Jewish State, to drive us  out of the Mideast because we are infidels.\n\nThis is not a democracy. It is a theocracy. If you have got any time  on your hands, go on the internet and  check out the theological bases of this regime. You would understand  why Israel has to get this right as well as we do.\n\nBut it was not always that way. Iran is not…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…B-329926, Sept. 10, 2018, we found that updates to a       Social Security Administration (SSA) hearing manual governing       SSA adjudicators' use of information from the internet       qualified as a rule of agency organization, procedure, or       practice. There, the manual outlined procedures for SSA       employees to follow in processing and adjudicating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 859) to require the disclosure of a camera or recording  capability in certain internet-connected devices.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 859\n\nBe it enacted by the Senate and House…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…States continues to lead the way. The uncomfortable reality  is that our payment system is outdated. Many of our financial rails  date back to the 1970s and 1980s, before the internet transformed how  we live and work.\n\nWhen a small business owner in Cheyenne uses a traditional payment  system to send a payment to a supplier overseas, they face delays up…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…for consideration of  H.R. 3679, the Small Business Artificial Intelligence Advancement Act.\n\nAmerica has seen great innovation in its 250 years, from the  lightbulb to the internet and now artificial intelligence. The benefits  of AI must be made available for more than big corporations. They must  reach every facet of our economy.\n\nSmall businesses…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700126/small-business-artificial-intelligence-advancement-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…B-329926, Sept. 10, 2018, we found that updates       to a Social Security Administration (SSA) hearing manual       governing SSA adjudicators' use of information from the       internet qualified as a rule of agency organization,       procedure, or practice. There, the manual outlined procedures       for SSA employees to follow in processing and adjudicating…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…ascendancy a few  years ago, in documents written by their founders, wanted to get rid of  the Western-prescribed, so-called nuclear family.\n\nEven after that was out there on the internet, before they took it  down, a significant number of people in this institution, I think,  showed up at rallies, or whatever one would call them, sponsored by  Black Lives…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…play a crucial role in the global economy. These  cables are roughly 1 to 2 inches in diameter. Yet they crisscross the  globe and carry approximately 95 percent of global internet traffic,  facilitating trillions of dollars in global financial transactions.\n\nThe Undersea Cable Protection Act of 2025 eliminates the requirement  for undersea cables to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…roughly 500-- and that would be rounding up--I know firsthand the joys of living in a  rural community. I also know some of the challenges.\n\nEverything from package delivery to internet reliability can be more  difficult when you live far outside a major city, and access to  healthcare can sometimes be a real challenge. More than 100 rural  hospitals have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Duties.--\n\n``(1) In general.--The Associate Administrator shall       oversee and conduct national communications and information       policy analysis and development for the internet and       communications technologies.\n\n``(2) Particular duties.--In carrying out paragraph (1),       the Associate Administrator shall--\n\n``(A) develop, analyze, and advocate…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}]