[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…Representatives  who did such a good job on behalf of his constituents who he  represented faithfully since coming to Congress in 2013.\n\nDoug and I knew each other before then. We had interactions on a  number of issues that we were mutually passionate about beginning with  rural California and people who live in rural areas, which both  reflected his and my background.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and any future  deployment.\n\nThe use of body cameras by troops during deployments related to crime  or civil disturbance in D.C. would promote transparency in the troops'  interactions with the public and protect the public and the troops. MPD  has a well-established program for the use of body cameras, as well as  for the preservation and disclosure of…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694758/introduction-of-a-bill-to-require-members-of-the-armed-forces-performing-active-service-in-the-district-of-columbia-in-response-to-an-order-of-the-president-which-relates-to-crime-or-civil-disturbance-in-the-district-of-columbia-to-participate-in-a-program-substantially-similar-to-the-body-worn-camera-program-of-the-metropolitan-police-department-of-the-district-of-columbia"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…experience with our adversaries. While I was at NASA flying the  Space Shuttle over a decade--first flight in 2001 to my last in 2011-- every one of my missions I had a lot of interactions with Russian  cosmonauts. Most of these Russian cosmonauts--not all of them but  most--were members of the Russian Air Force, pilots, some of them test  pilots.\n\nI flew…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and thrive in schools.\n\nI met with Latino businessowners who have seen significant reductions  in people visiting their shops and restaurants. The common thread in  their interactions was the word ``terror.''\n\nEarlier this week, high school students were here advocating for  humane immigration policies. They spoke about how the Trump  administration is…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…American--the  very same rights for those veterans that he fought to protect. He used  his First Amendment right of free speech to show up for his community  and record interactions between Homeland Security officers and his  neighbors. When agents became violent with a female protester, he  stepped in to protect her.\n\nHe also exercised his Second Amendment…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Blue Envelope Act of  2025. This bill would make blue envelope programs, which improve  interactions between police officers and drivers with difficulty  communicating through speech during a traffic stop, eligible for  federal transportation safety funding. The American…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694714/introduction-of-the-blue-envelope-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…other       less-than-lethal devices currently classified as firearms.       While we appreciate Congressional efforts to decrease the       potential for lethality during interactions with law       enforcement, especially for children, the legislation could       create expanded harm to young people and does not increase       access to less than lethal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…affordable healthcare and  lifesaving prescription medications.\n\nThis is our first day back after spending time in our congressional  districts and conducting face-to-face interactions with our  constituents. As is often the case, our just concluded district work  period encompassed the sacred observances of Passover and Easter.\n\nFor those of us who celebrate…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…tactics.\n\nSince 1979, in order to build a bilateral relationship with China,  our government has maintained internal executive department guidelines  to limit official interactions with Taiwan consistent with our One  China policy. This bill simply directs the executive to report the  guidelines to Congress every 5 years so that Congress is aware of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690684/taiwan-assurance-implementation-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…together with other  people, places, events, and ideas they may not have otherwise  encountered.                             indian burial mound\n\nThese mutually beneficial interactions sadly appear to be at odds  with this administration's worldview.\n\nIt is a sad irony, I have observed over the years, that those with  the outlook held by this administration…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…Ms. Figueroa-Villa has also been active in public service, serving on  the Board of Police Commissioners. In this role, she improved policies  for the Police Department's interactions with homeless individuals, and  the Department's de-escalation and use of force protocols. Ms.  Figueroa-Villa continues to serve on numerous executive boards and  commissions,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…complaint of any form of assault,       harassment, or retaliation, or any other type of complaint,       filed by the covered individual; or\n\n(2) associated, beyond workplace interactions, with the       subject in a manner that may present an actual or apparent       conflict of interest.\n\n(c) Notification Requirement.--With respect to a member of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…In 2021 alone, Endeavors paid Christy Merrell, a music therapist,  $533,000 for her services. In addition to this nonsense, the nonprofit  conducted 1,656 people-plant interactions and 287 pet therapy sessions  between April 2021 and March 2023.\n\nThis wasn't emergency aid. It was five-star treatment funded by  hardworking American families, families…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…adults as they  navigate the difficulties of medication management.\n\nThis expertise is especially vital as we age when new prescriptions,  changing doses, and potential drug interactions become more common,  influenced by slower metabolism, reduced kidney function, and  heightened drug sensitivity.\n\nPharmacists, after six to eight years of rigorous training,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "John Thune", "party": "Republican", "sentence": "…develop forecast modeling that includes the effect of       hurricanes and other weather events on the resuspension of       bioavailable nutrients in sediments and related interactions       with harmful algal blooms;\n\n``(4) enhance communication and coordination among Federal       agencies carrying out activities and research relating to       marine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…professionalism, excellence, kindness, and fairness. Her approach to  policing was always rooted in integrity and understanding, qualities  that were exemplified in her interactions with the public and her  peers. Fellow officers remember fondly her compassion for animals which  extended into the line of duty.\n\nBeyond her law enforcement duties, Sgt.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Epstein live? In the Virgin  Islands. He was a constituent in 2019. Was she a friend in 2007 during  her service to the DOJ, which my friend has brought up? Was there any  interactions?\n\nThese are the questions we have. The good lady from the Virgin  Islands has crossed the threshold of reasonable suspicion and,  therefore, she should be investigated by…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…manufacturing practices and other issues relevant to       manufacturing medical products that are regulated by the Food       and Drug Administration; and\n\n``(B) facilitate interactions between the Food and Drug       Administration and interested parties in Abraham Accords       countries, including by sharing relevant information       regarding United…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…enacted near the end of fiscal year 2025 and that the       estimated amounts will be available each year. The cost       estimate does not include any effects of interactions among       the bills. If all three bills were combined and enacted as a       single piece of legislation, the effects could be different       from the sum of the separate…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694306/ads-for-mental-health-services-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…the 55th Wing routinely conducted high-risk and politically  sensitive reconnaissance missions along the frontiers of the Soviet  Union, with frequent and sometimes deadly interactions with Soviet  fighter aircraft.\n\nIn August of 1966, the 55th Wing moved to Offutt Air Force Base,  Nebraska, where it proudly resides to this day. During the height of  the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Chatbot usage is now  so widespread that nearly three quarters of teens have used AI  companions, and of these users approximately one in three have used  them for social interactions and relationships to include the more than  one in ten who sought emotional or mental health support.\n\nThat is why I proudly introduced H.R. 7045, the Promoting Responsible…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…In 2022, Mrs. Maddalena was appointed Manager of Consumer Affairs for  the Southern Area, Texas One. In this role, she excels at overseeing  customer policies, managing interactions with government offices,  analyzing surveys and CRM systems, while fostering cooperative  relationships. Her ability to work seamlessly with congressional  offices, staff,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…groups that       improving access to less-than-lethal tools is essential for       enhancing safety, reducing harm, and achieving better       outcomes in police-community interactions.\n\nGiven the bipartisan support in Congress, the backing of       leading law enforcement and community organizations, and the       clear public-safety benefits associated…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Quality, or CEQ, subsequently issued a  Permitting Technology Action Plan. The plan sets the foundation for the  seamless exchange of information between agencies, simplified  interactions for applicants, and greater transparency and  predictability on environmental review and permitting schedules for  project sponsors and stakeholders.\n\nThe ePermit Act would…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}]