[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…candidates whom President Trump had  previously nominated for district court judgeships. We were willing to  try to find that common ground. But clearly the White House wasn't  interested, because whether it is the Department of Justice, the FBI,  U.S. attorneys, or the Federal bench, the Trump White House is showing  us what they truly care about: unwavering…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…either.\n\nWhat are we actually here talking about? Trump and Epstein were  besties. We have all seen the pictures of them. We saw the birthday  book. So why are y'all more interested in talking about Stacey Plaskett  than Trump's relationship with the man?\n\nWhen did y'all become so moral? I can remember when y'all wouldn't  sign the discharge petition.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…$300,000, which is far greater than what many Americans have in their  total retirement funds.\n\nWhile few people are using the brokerage windows, the ones that do  may be interested in exploring funds or stocks that are not affected by  their plan. Of those mutual funds that are offered, some may be ESG- themed.\n\nIf that is the concern of my colleagues,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…hands of an executive.\n\nHe said:\n\nThe Constitution supposes, what the History of all       Governments demonstrates, that the Executive is the branch of       power most interested in war, and most prone to it. It has       accordingly with studied care, vested the question of war in       the Legislature.\n\nFor the past month, Congress's power to authorize…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are stupid.\n\nNow, I am not surprised. I am not surprised the guy who once called  Epstein a ``terrific guy'' and who Epstein considered his closest  friend is not actually interested in getting to the truth.\n\nDo you know when this clicked in for me, Mr. Speaker, and for a lot  of people?\n\nIt clicked after Trump won and then the backtracking began. It…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…these new rules take? The SAVE Act takes  effect immediately. What if States take months or years to amend their  systems? What if they never do it?\n\nYou might have someone interested in voting, but their State hasn't  acted. They have no way of proving that the name on their birth  certificate, which differs from the name on their ID, is because they…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…yield. The American abolitionists told me that eternal  vigilance is the price of liberty to keep the powerful from stealing  from the many for the few.\n\nSenator Merkley, I am interested in what you think Americans should  do to secure the benefits of liberty for themselves and their families  and future generations and what do you want Americans to take…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is Toledo,  Ohio's sister city for 40 years.\n\nThe good news is the Trump administration appears ready to posture  across America to draw forth geothermal power, and we are interested in  doing exactly that, particularly in manufacturing America.\n\nI am privileged to also represent a vast agricultural region in grain  drying. It is so expensive when we…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…force is  always  thoroughly investigated. When Renee Good was shot to death, Kristi Noem  declared her a domestic terrorist within hours. The only investigation  Noem was interested in was an investigation into Renee Good's widow.  That is not justice. That is not security for the American people.\n\nFourth, Republicans refused to agree to the simple concept…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…behalf of the American people, so we  are in this budget reconciliation process that can avoid the filibuster  in the United States Senate. Republicans, Mr. Speaker, are not  interested in trying to actually find bipartisan common ground.\n\nWe are the party of common sense. Let's be clear about it. I am going  to be spending some time on the road talking…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…providing  comprehensive prenatal, delivery, and postpartum care to newborns and  mothers. These are programs that help families and children. Medicaid  works.\n\nElon Musk is only interested in helping the richest among us. His  dream is to fully extend more than $4.5 trillion worth of tax breaks to  his billionaire friends and the wealthiest corporations in…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688072/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…produce goods that are sold  into this agricultural program would be cut.\n\nThey are cutting funding to the Small Business Administration. Most  people in my district are interested in their hustle, their small  business that they are trying to get off the ground. I thought that was  why the SBA was developed, designed, and created: to help start  businesses.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…2013 to respond to  the energy politics of the 2010s. It is simply irrelevant in this day  and age. The Keystone Pipeline has been dead for 4 years. The Canadians  are not interested in building energy infrastructure connecting our two  nations thanks to Trump's tariffs, yet this bill would gut the Federal  Government's ability to review the environmental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Constitution as  the most important. He said:\n\nThe constitution supposes what the History of all       Governments demonstrates, that the Executive is the branch of       power most interested in war, and most prone to it. It has       accordingly with studied care vested the question of war in       the Legislature.\n\nOur Founding Fathers didn't get everything…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Although section 2635.205 lists several exemptions from the       prohibition, none exempts soliciting purchases for personal       gain.\n\nAs to why the public might be interested in sending money,       the website explains: ``This Trump Meme celebrates a leader       who doesn't back down, no matter the odds.'' Under the Trump       meme website's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…These States have been examples of cooperation between the State and  Federal Government, and now Congress must provide clarity and  confidence for any additional State interested in joining these three.\n\nWe need this amendment because protecting the environment in Florida  is protecting our field of dreams.\n\nMr. BEAN of Florida. Mr. Chair, I remind…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…costs for all Americans like those  on Medicare, those with employer-sponsored insurance, and small  business owners who provide insurance to their workers.\n\nIf Democrats are interested in lowering healthcare costs, as they say  they are, reopen the government, pay our troops, and stop taking food  from children. I am tired of hearing people say there is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "Mr. McGUIRE. Mr. Speaker, I rise to recognize Gail Acampora from  Prospect, Virginia. I am lucky enough to call Gail a close friend of  mine. She has always been interested in politics and is an avid  supporter of President Trump.\n\nIn 2021, Gail was diagnosed with lung cancer. She has had a lobe and  lymph nodes removed and went through tough…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690521/recognizing-gail-acampora"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…3,000 available. She dragged her feet. She  delayed it for 2 years.\n\nSo the 5-year program has almost run out of time because Secretary of  the Interior Haaland was more interested in appeasing radical leftwing  environmental groups than she was getting Alaska Natives their  allotment, which is what the law demanded.\n\nSo this bill is very simple. Because…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…what enrages our base so that they are more politically  involved. The fact of the matter is a substantial amount of that is  just a boldface lie.\n\nFor anyone who is really interested just in sort of the academics of  what goes on here, I talked about this a couple of weeks ago. If you  have your search engine, look up ``AI Review of Congressional  Speeches.''…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…deal? Both sides claim they want peace, but what is  the evidence?\n\nAnd here is the truth: The truth is that Ukrainian President  Volodymyr Zelenskyy has shown that he is interested in peace. He has  negotiated at length with the administration. Ukraine and its President  agreed to a 30-day cease-fire. Vladimir Putin rejected the idea.  Instead, Putin…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "John Thune", "party": "Republican", "sentence": "…in  this case, no one really knows.\n\nThis is a bipartisan issue. It is a bipartisan bill, and it had a  bipartisan process from the very beginning. And if Democrats were  interested in further changes, as they claim, they would have had the  chance to make those changes on the floor. All they had to do was vote  for cloture.\n\nNot every bill that comes…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our team at House Financial Services for their staff  leadership.\n\nMr. Speaker, this bill we are debating today is essential. The  ranking member seems to think that I am interested in the subject of a  central bank digital currency, and I am. I have spent the better part  of the last 5 years studying central bank digital currencies outside  the United…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…enactment of this Act, the Secretary shall promulgate such       regulations as are necessary to establish a process, as       determined by the Secretary, for any interested party to       request a reevaluation of the approval of FMOC cylinders       under section 107.807 of title 49, Code of Federal       Regulations (or a successor regulation),…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…responsibility of most  Senators, because every Senator, even if you come from a high  population State, you still have a lot of rural areas.\n\nSo one of the things that I have been interested in is keeping  hospital services available in rural areas, even if they have a hard  time keeping their beds as part of their hospital.\n\nSo, in December 2020, I was proud…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…$1,500,000 for each of fiscal       years 2026 through 2028 for a public information campaign or       similar public education efforts to destigmatize individuals       in (or interested in joining) the aviation industry who seek       mental health care, to broaden awareness of available       supportive services, and establish trust with pilots and air…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…procedures  without a full understanding of the meaning or that impact.\n\nDemocrats have embraced an extreme position on this so-called gender- affirming care. They are more interested in promoting the radical left  policies than protecting our children from harm. Despite the American  public's widespread rejection of the practice in 2024, the radical left…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…Uyghur genocide  and the slave labor that affects the supply chains of clothes and other  products they use every day.\n\nParents may think the Chinese Communist Party isn't interested in  what their kids are learning, but the CCP wants to influence every  American.\n\nThese bills will empower parents, protect students from Chinese  propaganda, and shine…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…they  plan on sending us a rescissions package very soon. I would recommend,  personally, that they send a rescissions package on a monthly basis.\n\nI am going to be very interested to see how our Democratic colleagues  react to some of these sensible spending cuts or rescissions. So far,  what they have done is they have been in complete opposition…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Taiwan, Japan, and South Korea. Taiwan has already signed a letter of  intent with the State of Alaska to purchase Alaskan LNG, and both Japan  and South Korea are deeply interested in pursuing American energy from  Alaska as well as other Pacific Rim nations.\n\nThe message we heard at each stop was universal and resounding:  Without certainty in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]