[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…severe invasions of personal rights imaginable.''\n\nJudge Pratt went so far as to raise questions not put before the  court by parties and invite the Florida attorney general to intervene  and weigh in on these questions.\n\nHe wrote an opinion holding unconstitutional a Florida law that  allows minors to seek abortions without parental consent through  judicial…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the unity of  NATO, our most vital alliance, the most successful alliance in world  history. They risk setting precedent for authoritarian regimes all over  this world to intervene militarily under the guise of going after  leaders accused of criminal conduct or simply to access valuable  natural resources or critical technologies under their control.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…health care.\n\nCanceling this grant will disrupt critical mental health care for  students who are already receiving support, weaken the district's  ability to identify and intervene in early warning signs of distress,  trauma, or potential violence. It undermines years of progress made in  breaking the stigma around mental health.\n\nWith suicide being…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692131/crystal-lake-mental-health-program"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Veterans stepped up to defend our country, our Nation, and  they deserve more than empty slogans and broken promises in return.\n\nVA had the tools, and has the responsibility, to intervene when  veterans faced foreclosure. VASP was working. It had already helped  over 15,000 veterans keep their homes with tens of thousands more  eligible.\n\nEnding it based on…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…attended.\n\nLast night in Madison, it was standing room only. People were  bursting with questions about how a bill that can change the tax code  for the next 10 years, that can intervene in terms of our healthcare  system, in terms of taking away people's health coverage, can happen  with no transparency and no public input.\n\nAs I said, it was being written…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…clothes grabbing someone off the street and throwing them in the  back of a black SUV. It doesn't take much imagination to see the danger  involved if a Good Samaritan were to intervene.\n\nAdditionally, the lack of clearly identifiable uniforms has made it  easier for copycats and impersonators to purchase fake gear on Amazon,  allowing them to go around…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…is  exposing Californians and millions of people around the country to  unprecedented danger. We have to do something about it before it is too  late.\n\nI urge Congress to intervene, reverse these cuts, and stop this  administration from putting more Americans in harm's way.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…according to       American officials who have reviewed intelligence reports.\n\nFears of a wider war are growing among American officials       as Israel presses the White House to intervene in its       conflict with Iran. If the United States joins the Israeli       campaign and strikes Fordo, a key Iranian nuclear facility,       the Iranian-backed Houthi…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…into his       recently departed national security director, Michael Flynn,       pressed Director of National Intelligence Daniel Coats and       CIA Director Mike Pompeo to intervene in Comey's       investigation, and personally appealed to Coats and NSA head       Michael Rogers to release statements denying the existence of       any collusion with…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Justice has this  responsibility is because it is their responsibility to make sure  somebody doesn't abuse power, particularly in a law enforcement  situation like this, and intervene on the civil liberties of Americans.  So that Department of Justice, literally in the first Trump  administration, basically did not do its job and tried to basically  subvert…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…fought for our freedom almost 250 years ago. We are going to  celebrate that anniversary in one short year. Can we imagine what it  would have been like if France did not intervene on our behalf? We have  a portrait there, the Marquis de Lafayette, that stood with us shoulder  to shoulder. The French spilled blood on our battlefields.\n\nWe weren't even…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…bill. No, it doesn't.  Polluters simply want to short-circuit any oversight of their higher  costs and pollution. That is what this is about.\n\nFERC already has the power to intervene and comment on agency  rulemaking dockets if they think there could be a reliability issue, as  does NERC, as does any of the grid operators, and any utility. This  polluter-friendly…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…trouble accessing the resources they need for any adapted vehicle.\n\nIn a time when bureaucracy is getting in the way of doing what is  best for our veterans, Congress must intervene to eliminate the red  tape and provide the necessary assistance our veterans deserve.\n\nThis bill would do just that and would save hundreds of dollars for  disabled veterans…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…confidential support from trained  counselors around the clock.\n\nI thank our local mental health providers, support workers, and first  responders for the critical work they do to intervene in times of need.  Without their timely response and attentive care, our region could not  be the healthy and supportive place it is today.\n\nI recognize our local police…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…which provides for necessary and lawful  congressional oversight of the District of Columbia.\n\nThis legislation rightly exercises Congress' clear constitutional  authority to intervene in the District's affairs when its interests, or  those of its residents, are at risk. While there are many examples of  the District's poor governance that warrant scrutiny,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Federal immigration and voter fraud violations.\n\nNow, I could go down and give more and more examples. The fact is,  yes, these are good examples in which we have been able to intervene  and stop this voter fraud and identify the individuals and prosecute  those individuals.\n\nHowever, we know that there is significant additional fraud going on  that we are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…grandchildren is because he is fighting for their future.\n\nHe cares about this Nation. He believes that we are on an  unsustainable fiscal path and he believes that if we don't intervene,  we will not only jeopardize our economic strength but our national  security, our global leadership, and God forbid, a sovereign debt  crisis certainly would rob our children…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…payments.\n\nNonbank providers of digital payments are already being regulated at  both the State and the Federal levels. American consumers did not  petition us, Mr. Speaker, to intervene in this way at the last minute  in the waning days of the Biden administration. Of all the CFPB's  annual complaints that they collect year in and year out, less than 1…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…information on--\n\n(i) fostering a command climate--\n\n(I) that does not tolerate covered misconduct;\n\n(II) in which individuals assigned to the command are       encouraged to intervene to prevent potential incidents of       covered misconduct; and\n\n(III) that encourages victims of covered misconduct to       report any incident of covered misconduct;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…(A), the attorney general shall notify the       Commission immediately upon instituting the civil action.\n\n(ii) Intervention by the commission.--The Commission may--\n\n(I) intervene in any civil action brought by the attorney       general of a State under subparagraph (A); and\n\n(II) upon intervening--\n\n(aa) be heard on all matters arising in the civil…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Commission immediately upon instituting the civil action.\n\n(ii) Intervention by the commission.--Upon receiving the       notice required by clause (i)(I), the Commission may       intervene in the civil action and, upon intervening--\n\n(I) be heard on all matters arising in the civil action;       and\n\n(II) file petitions for appeal of a decision in the civil…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…how much time remains.\n\nMr. Speaker, I remind my colleague on the other side of the aisle,  the U.S. Congress has a constitutional role to oversee Washington,  D.C., law and intervene as necessary.\n\nD.C.'s noncitizen voting law is a dangerous policy. Only American  citizens should be permitted to vote in this country, especially right  here in the Nation's…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}]