[{"senator": "Steven Horsford", "party": "Democrat", "sentence": "Canada is Nevada's top international visitor.", "title": "Relating to A National Emergency By the President on February 2025", "date": "2026-02-11"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Among the organization's aims is an international treaty for nuclear  disarmament.", "title": "Risk of Conflict with Nuclear Weapons", "date": "2025-07-23"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "In this month and this year, the Pax Americana, the rules-based  international order established in the aftermath of World War II, an  order that has delivered peace and prosperity to the United States, has  been brought to a dishonorable end.", "title": "Marking Third Anniversary of Unprovoked Russian Invasion of Ukraine", "date": "2025-02-25"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "She took her  mission on headfirst and investigated bullet holes in boats, houses  that had burned down, and wounded villagers with her international  activist group, the Cross Border Network.", "title": "Recognizing the Life and Memory of Alice Kitchen", "date": "2026-01-08"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Repealing the fee would hurt American industry by eliminating  incentives to modernize operations and remain competitive in an  international market that increasingly values low-emission energy.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Militias engage in illicit mining activities to finance and sustain  themselves, often exploiting child labor and engaging in environmental  degradation practices that undermine the DRC's economic interests and  international treaty obligations.", "title": "Reintroduction of the Resolution to Condemn the Ethnic Violence in the Democratic Republic of the Congo", "date": "2026-01-30"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Agency for International Development;  $502 million from the Department of Education; $232 million from the  Social Security Administration; $192 million from the General Services  Administration; $173 million from the Department  of Agriculture; $152 million from the Department of Health and Human  Services; $133 million from the Department of Transportation; and $119  million from the Department of Commerce.", "title": "Consequences of Doge", "date": "2025-06-05"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Seventeen students in the DECA  chapter qualified for the International Career Development Conference.", "title": "Congratulating John Champe High School Class of 2025", "date": "2025-06-10"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "Additionally, Anusha had the opportunity to represent Washington  State at the 2025 Regeneron International Science and Engineering Fair.", "title": "Recognizing Anusha Arora for Scientific Excellence", "date": "2025-07-21"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, this bill also includes important provisions to ensure  that our medical product supply chain can be strengthened by working  with international partners that believe in both tolerance and respect  for every person, as well as advancement of science and medicine.", "title": "Mikaela Naylon Give Kids A Chance Act", "date": "2025-12-01"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "A native of California, Andrew attended California State University,  Northridge, where he graduated cum laude with a degree in Political  Science and International Relations.", "title": "Recognizing Andrew Heineman and His Service to the United States House of Representatives", "date": "2026-01-08"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "policy, America should  urge multilateral institutions like the World Bank to avoid rewarding  those who breach international laws and the norms that they should be  respecting.", "title": "No New Burma Funds Act", "date": "2025-12-01"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "When you cut funding for international peacekeeping and to people  escaping violence, people will die.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Sincerely,\n\nJewish Women International; Catholics for Family Peace       Education and Research Initiative; Congregation of Our Lady       of Charity of the Good Shepherd, U.S.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "1948, allows the International Boundary  and Water Commission, or IBWC, to accept up to $5 million per year from  other Federal agencies or outside entities like cities, States, and  nonprofit organizations for wastewater treatment and flood control  projects like those that would fight the cross-border sewage crisis in  and around San Diego and Coronado.", "title": "International Boundary and Water Commission Authority", "date": "2025-06-09"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "This  Gold Medal also recognized the significant international and historical  role the Ecumenical Patriarch has played throughout his lifetime.", "title": "Welcoming Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "(3) Human rights, including freedom of religion or belief,       and respect for the Uyghurs' unique Muslim identity are       legitimate interests of the international community.", "title": "Uyghur Policy Act of 2025", "date": null}, {"senator": "Bob Latta", "party": "Republican", "sentence": "It is responsible for a variety of activities, which include Federal  spectrum management, administration of broadband grants, internet  governance, representing the United States in international  telecommunication forums, and developing cybersecurity policy.", "title": "National Telecommunications and Information Administration Reauthorization Act of 2025", "date": "2025-04-28"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "He led law  enforcement teams supporting international drug interdiction operations  aboard United States Navy and allied vessels, deploying to the  Caribbean, eastern Pacific, and the Middle East.", "title": "Recognizing United States Coast Guard Cwo4 James McInnis As December 2025 Veteran of the Month", "date": "2025-12-19"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Utah is an international center for technology, including space tech.", "title": "July 24Th, Utah's State Holiday", "date": "2025-07-22"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "In 2013, Timothy reported to 2nd Battalion, 9th Marines, where he  deployed to Okinawa, Japan, and participated in Exercise Forest Light  and the Korean Marine Exchange Program--strengthening joint  capabilities and international cooperation.", "title": "Recognizing United States Marine Sergeant Major Timothy Babcock As August 2025 Veteran of the Month", "date": "2025-07-22"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Over the next 2 years, Yuri and an elite cohort will train at NASA  Johnson Space Center down in Houston as they prepare for missions to  the International Space Station, the Moon, and whatever comes next.", "title": "Recognizing Future Astronaut Yuri Kubo", "date": "2025-12-03"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "We should not allow this to continue, and the United States of  America ought to be very cautious in any dealings with an international  war criminal as Putin has been so condemned.", "title": "Russia", "date": "2025-03-25"}, {"senator": "John Carter", "party": "Republican", "sentence": "Additionally, he helped establish the Disaster  Recovery International Military Mentorship Program, which provides  transitioning veterans with training, mentorship, resume writing  assistance, job placement, and skill-building opportunities, helping  them smoothly transition into private and governmental sectors.", "title": "Saluting the Service of Master Sergeant Duane C. Bygum, Jr.", "date": "2025-03-31"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Baldrick's Children's Cancer Research, Hope for Vision, and Serving HIM  (Healthcare International Ministries).", "title": "Recognizing Congressional Patriot Award Recipient Thomas Mccall", "date": null}, {"senator": "Steve Womack", "party": "Republican", "sentence": "He later became an assistant manager at Walmart Store 894 in Tulsa,  and that launched a career with the Nation's leading retailer, with  promotions to CEO of Sam's Club in 2005, Walmart International in 2009,  and finally CEO of the entire enterprise in 2014.", "title": "Recognizing Doug Mcmillon", "date": "2026-01-08"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "A 2023 survey by the Center for Strategic and International Studies  found 224 reported instances of Chinese espionage directed at the  United States since 2000.", "title": "United States Research Protection Act", "date": "2025-03-24"}]