[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are detained, before they are imprisoned  or put on a plane to be imprisoned out of the country.\n\nBasic fairness and due process rights that involve also the President  intimidating law firms with threats that they will be denied access to  security clearances or even to go on to governmental property, and  intimidation and threatening our universities,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…We want their  funding to be shut down . . . We want to put them in trauma.''\n\nThis includes firing hard-to-replace civil servants, scientists, and  meteorologists; and intimidating and harassing those who remain in  hopes of driving them out of the Federal Government, despite their  expertise that we need to keep our country safe and prosperous.\n\nLet's…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this Constitution, the Laws of the United States, and  Treaties made'' and ``to Controversies to which the United States shall  be a Party.'' U.S. Const. art. III, sec. 2. Intimidating judges, and  recklessly calling for the impeachment and removal of judges who  disagree with him demonstrate a willingness by Trump to usurp authority  afforded by our Constitution…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…would be making stamps and  stamping your head with all of the fraud that they have found, but that  is not the case.\n\nWhat they have been doing, however, is harassing and intimidating and  disrespecting our workers, creating a hostile environment for our  Federal workers, intimidating them to resign or to leave, mostly  because of ideology, not because…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…councilmember in 1974. Her husband, who went by the nickname Peaches,  accompanied her to every single council meeting to prevent the male  councilmembers from harassing or intimidating her.\n\nIn 1999, she was elected as the city's first Black female mayor. Her  leadership spanned decades, influencing local government and paving the  way for future Black…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that has to be provided with the 600 trucks a day unabated,  continuously, and regularly. At the same time, Hamas is score-settling,  is committing public executions, and intimidating the Palestinians who  yearn for peace and a return to some degree of normalcy.\n\nThe impediments to peace are deep, and they are clear. So we need to  ask ourselves: What…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the regime. That is what happens in all of these fake  democracies, and that is what is happening here.\n\nBut controlling speech on campuses is not enough. Controlling and  intimidating journalists is not enough. You have to go after the  lawyers too.\n\nNow, maybe there is not a lot of love for lawyers in this country,  but lawyers are the ones who bring…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…feared for his life because he is gay.\n\nWe are being lied to. These kinds of cruel tactics are not necessary  to keep us safe. This is about taking away due process and intimidating  us into silence and submission. If this administration will do this to  Andry, then they will do it to anyone. We are all at risk.\n\nProtect due process.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689646/protect-due-process"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…commonsense improvements  designed to deliver timely justice, lower court costs, and greater  access for everyday Americans, small businesses, and those who  currently face intimidating and burdensome procedures.\n\nIn a system where there are high stakes for individuals, families,  and entrepreneurs, there is nothing uncommon or unreasonable about  expecting…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…crises becomes a distant       memory with the dismantling of USAID.\n\nDomestically, Trump is aggressively eliminating constraints       on his power and fomenting fear. He is intimidating       independent media outlets with frivolous lawsuits. Our       universities are retreating from freedom of speech because of       explicit threats to withdraw federal…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…choices. And that is all at risk.\n\nIn Senator Merkley's State, in Portland, they are sending armed  uniformed soldiers to do what we traditionally feel is police work-- intimidating the population, using tear gas against U.S. citizens for  no reason. By the way, National Guard and Active-Duty servicemembers  are not trained for this mission.\n\nIn my…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…efforts to remake the legal  profession into something that rewards those who agree with the  government and punishes those who do not. Words and actions matter. And  the intimidating words and actions we have heard must end.''\n\n``Consistent with the Chief Justice's report, these efforts cannot be  sanctioned or normalized. There are clear choices facing…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…border in past years.\n\nThey set out to do that, but what has happened is exactly the  opposite. Instead of taking dangerous people off the street, they are  harassing and intimidating people who have no crimes in their  background whatsoever. The stories just come tumbling in every single  day.\n\nThe head of the Department of Homeland Security calls this…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…of the worst would be pursued  and would be held accountable. However, that is not what is happening.  That is not what is happening.\n\nIn Minnesota, ICE agents have been intimidating people in hospitals,  forcing hospital management to issue protocols for employees on how to  best engage. Our doctors and nurses ought to be focused on tending to  patients…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…legislation in this area. My bill, the bipartisan Countering  Transnational Repression Act, continues this important work by stopping  Chinese Communist Party surveillance and intimidating Chinese nationals  on U.S. soil.\n\nWe have also introduced the Global Investment in American Jobs Act.  We must now come together to restrict the infiltration of the Chinese…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…such remarks or conduct is so severe or pervasive       that a reasonable person would perceive, and the individual       does perceive, the work environment as hostile, intimidating       or abusive.\n\n``(i) Response to Incidents.--Nothing in this section shall       be construed to impede the ability of the responsible entity       of the vessel to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…again, Putin is threatening nuclear war if he does not  receive the guarantees of a further demilitarized Ukraine.\n\nBut if he thinks these threats are an effective method of  intimidating the United States and President Trump, he is mistaken.  President Trump has made very clear that he will not allow Russia to  continue doing what he calls ``tapping us along.''…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…part of a day with my Joint Economic Committee economists. She has been  at the Federal Reserve. She has been at the White House. She is one of  those people that is just intimidating on how she is able to calculate  the world. She actually was looking at our reconciliation budget. She  says that if we will do just a couple policy things, it is neutral…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…District.\n\nDuring her 29 years of dedicated service to the Lone Pine Unified  School District, she has taught thousands of students, transforming  their view of math from an intimidating subject to one that is exciting  and achievable.\n\nMrs. Rost is known for her creative instructional style, integrating  hands-on activities, technologies, and real-world…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]