[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…burden and carry the  sacrifices of another potentially endless war in the Middle East.\n\nAnd so with those families and our servicemembers in mind, Senator  Kaine introduced this resolution to ensure that the President did not  risk committing the United States to yet another open-ended conflict in  the region without a debate in Congress and a decision…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…healthcare at  home, and childcare at home, not billions of dollars in missiles  targeted at the Middle East that we can't afford. That is why  Representative Massie and I introduced a resolution to prevent more  wars of choice.\n\nWhat did we achieve? The intelligence tells us that we just pushed  Iran back 3 to 4 months in building a bomb. Vice President Vance…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692976/americans-of-all-parties-do-not-want-more-war"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Standing up for our region and our seniors is one of my highest  priorities in Congress, and that is why last year, when Social Security  celebrated its 90th birthday, I introduced a resolution to demonstrate  continued support from Congress for this program. It must be  strengthened to support Americans and the next generation throughout  their retirement…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and balances that  wisely places the power to make war in our hands, not with an Executive  who may grow too fond of using it.\n\nThat is why Senator Kaine and I have introduced a resolution to  direct the President to stop engaging in armed strikes against these  vessels or the country from which they emanate without the explicit  authorization of Congress.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…stay silent while  extremists in Washington and in Florida are trying to make it more  likely that children--children--won't receive critical vaccines.\n\nThat is why I introduced a resolution opposing these extreme  policies, reaffirming something the overwhelming majority of Americans  already know, and this is this: Vaccines save lives. Vaccines protect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…protected under  Federal law. Instead, they punted, refusing to give clarity and  refusing to give peace of mind to women and doctors across the country.\n\nThat is why I introduced a resolution to reaffirm access to emergency  care and abortion care to all Americans. That is why House Democrats  have introduced bills to guarantee abortion rights across the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…High School in Colorado.                         Demanding Answers from DOGE\n\nMr. LARSON of Connecticut. Madam Speaker, I rise this morning because  Democrats have introduced a resolution of inquiry to get the  information  from the whistleblower who has talked about what happened to the more  than 300 million Americans who depend on Social Security.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…attack on our scientific workforce and on science,  specifically at the National Science Foundation, located a few blocks  from my home.\n\nToday, my colleagues and I introduced a resolution commemorating the  75th anniversary of the National Science Foundation. We should be  enormously proud to support the work of the NSF.\n\nSince 1950, the National Science…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…of inquiry, a procedure that is designed to get  Members of Congress factual information from the executive branch.\n\nEducation Committee Ranking Member Scott and I introduced a  resolution of inquiry that was scheduled to be considered yesterday  during the Committee on Education and Workforce's reconciliation  markup.\n\nUnfortunately, while the markup…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, Peter Beinart said: ``When you tell a people  to forget its past, you are not proposing peace, you are proposing  extinction.''\n\nI introduced a resolution yesterday recognizing the 77 years of the  ongoing Nakba against the Palestinian people and the need for refugee  rights. We know that thousands of Palestinians were…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…state. To shed light on this  descent into authoritarian darkness, to let the American people know  how their own government is centralizing their personal data, I  introduced a resolution of inquiry demanding that the administration  produce all the information related to the creation of this vast  searchable database with its handpicked contractor,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…rightwing, sucks up to  them.\n\nAnd now, according to the Trump administration, swastikas no longer  count as hate symbols within the Coast Guard. This is exactly why I  introduced my resolution condemning Nick Fuentes, Tucker Carlson, and  neo-Nazism. Neo-Nazism is no longer a fringe or theoretical threat. It  is real. It is growing. It threatens our democracy,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Officer Brian Sicknick, a New  Jersey native, who tragically died following injuries he sustained that  day. Many more are still dealing with trauma. In Brian's honor, I  introduced a resolution condemning those blanket pardons.\n\nWe must never forget their sacrifice. We cannot let Donald Trump and  his allies rewrite the history of one of the darkest moments…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…of Louisiana. Mr. Speaker, I rise today to discuss an  issue that affects men of all ages, races, and socioeconomic  backgrounds: prostate cancer.\n\nJust last week, I introduced a resolution designating September as  Prostate Cancer Awareness Month. As co-chair of the bipartisan Men's  Health Caucus, this issue is close to my heart.\n\nEvery year, the Black…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Managers adopted a resolution calling on NPS and  Congress to remove any mention of Newlands from the fountain. On April  19, 2022, the Montgomery County Council introduced a resolution  affirming the county's support for this bill. Newlands should not be  honored on federal land.\n\nI urge my colleagues to support this bill.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…it was the Trump administration which  graciously performed the seemingly impossible, these Democrats now  oppose one of America's greatest hours.\n\nTo this end, we introduced a resolution today to make clear that the  House of Representatives is supportive of the efforts of our brave  patriots who deftly brought an end to Maduro's terrorization of not…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…stability, yet we have a  rare moment of leverage. Iran's economy is in shambles. Its proxies are  degraded, and its air defenses have been exposed.\n\nThat is why I introduced a resolution reaffirming that preventing  Iran from obtaining nuclear weapons is a nonnegotiable American  priority. It reinforces deterrence, clarifies expectations, and ensures…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691270/preventing-iran-from-obtaining-nuclear-weapons"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…gentlewoman's concern about closed branches, we  are concerned about the lack of branches. We are concerned about  banking deserts. That is exactly why Republicans introduced a  resolution to allow for more de novo charters. We want more banks, not  less. We want more competition, not less. We want those new banks to  form in those underserved communities,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "Mr. GRAHAM. Mr. President, this is a debate worthy of the body, and I  would like to give my belief about what we are doing here--my opinion.\n\nSenator Kaine has introduced a resolution that basically requires  President Trump to come to the Congress before any other military  actions can be taken against the Islamic Republic of Iran. I think that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…the hard work  of our energy and agriculture producers fuels our economy, strengthens  our communities, and secures our very way of life.\n\nThat is why on Monday, I introduced a resolution to overturn the  Biden administration's reinstatement of the Once-in-Always-in rule.  This is a shortsighted, bureaucratic mandate that punishes energy  producers,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Washington, D.C., so that he could  not return to Boulder, Colorado, to commemorate the victims who were  the subject of this resolution that he so misguidedly introduced  because this resolution is the exact opposite of Mr. Van Drew's  resolution.\n\nThis resolution uses anti-Semitism, uses Jews, for a political  objective. This was an anti-Semitic attack.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Speaker, I rise today to recognize  Celebrate Community Week.\n\nAs co-chairs of the bipartisan Congressional Service Organization  Caucus, Congressman   Jimmy Panetta and I introduced a resolution to  designate the week of September 14 through September 20 as Celebrate  Community Week, where we honor the efforts of local service  organizations across the country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695366/recognizing-celebrate-community-week"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…action to  Congress, calling it guidance rather than a rule. Senator Rockefeller  asked GAO to determine that the CMS guidance was a rule. When GAO  agreed with him, he introduced a resolution to block the rule--the  first time such a resolution was introduced pursuant to a GAO decision  rather than an Agency submission.\n\nTen years later, Congress passed…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "John Rose", "party": "Republican", "sentence": "…achieved the same outcome. It passed the House  unanimously.\n\nYet, just like the SAVE Act, the bill sat on Leader Thune's desk week  after week, month after month. I introduced a resolution that would  have enabled Speaker Johnson to argue the unconstitutionality of the  Senate payday  provision and to ask the courts to strike it down.\n\nI even attempted…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California, and even in the early  days of COVID, I was very much opposed to the legislature having no  role in determining whether we were in a state of emergency. I  introduced a resolution many times on whether or not the state of  emergency should continue. Therefore, of course, I would not support  cutting Congress out of that process entirely here.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…buy, what they could  wear, and what they could use. Here we are, and my colleagues are  hearing the same cold rhetoric that leads to cold homes and cold water.\n\nI introduced this resolution because we are determined to restore a  quality of life in this country that we enjoyed before the Democratic  Party took over the White House and the House and the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…KILEY of California. Mr. Speaker, I will provide an update on the  nonexistent high-speed rail project in California. As I have noted on  this floor before, I have introduced a resolution or legislation to cut  off all future Federal funding for California High-Speed Rail. I was  with Secretary Duffy when he announced an investigation into where the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]