[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…nations to war by  decree.\n\nThe War Powers Resolution exists to give meaning to that  constitutional principle. It requires the President to consult with  Congress before introducing forces into hostilities and to obtain  authorization within 60 days.\n\nThe Trump administration delivered its war powers notification to  Congress on September 4. The 60-day…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, I am proud to join my colleagues Senator  Kaine and Senator Paul in introducing this War Powers Resolution that  provides that we have not authorized the use of force against  Venezuela.\n\nWe meet at a precarious moment, when we might be on the precipice…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…largest act of union busting  in American history, and it left our Federal workforce more vulnerable  to unfair treatment and political interference.\n\nI am proud that since introducing this bill, it has won the support  of 226 of my colleagues in this Chamber. This majority includes  Democrats and Republicans who recognize that collective bargaining is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Recovery Act, a critical piece of legislation  to protect and preserve the unique and irreplaceable native plant and  animal species of our precious and endangered Hawaii. I am introducing  this bill in conjunction with my Hawaii colleague, Senator Brian  Schatz.\n\nOur Hawaii is one of the most biologically unique and diverse places  on the planet. The islands…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…around the country.                                   Navin KC\n\nFor more than twenty-five years, Navin KC has been a tireless force  in the world of dance and choreography, introducing Nepali language,  art, and culture to audiences both nationally and internationally. As  the Founder and Director of KC Dance Center in Virginia, he has  provided countless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…helping in efforts of forest fire  prevention and the like.\n\nAs the elected chair of the California Democrat delegation, I was  proud to join my colleague (Ms. Barragan) in introducing a resolution  that, unlike this one, is based in fact.\n\nOur resolution condemns the President's authoritarian response to  First Amendment expressions of dissent, unlike…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…agenda.\n\nDespite being in the minority, House Democrats are working tirelessly  to push back against Trump's hostile government takeover by litigating  his illegal actions, introducing legislation to curb his powers, and  mobilizing the public against his destructive agenda.\n\nI have joined thousands of Georgians and millions of Americans  against the Trump…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…medicine and groceries.\n\nEarlier this month, Senate Republicans all voted to gut Medicaid and  the Affordable Care Act.\n\nI mean, heck, some Senate Republicans are now even introducing  legislation to roll back the very Medicaid cuts that they voted for on  this floor just 3 weeks ago, trying to cover their tracks.\n\nBy the way, these same Senate Republicans…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and I urge my colleagues to support it.\n\nMr. Speaker, while the House debates various veterans-related  legislation today, none are more urgent than the legislation I am  introducing to stop thousands of veterans from losing their homes.\n\nLast Thursday, Secretary Doug Collins and President Trump announced  the abrupt termination of the Veterans Affairs…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…of developing mental health  disorders, including PTSD, depression, and anxiety.\n\nThis Police Week, I thank the sponsors of the bill, my colleagues  across the aisle, for introducing H.R. 2240, the Improving Law  Enforcement Officer Safety and Wellness Through Data Act.\n\nI did offer an amendment to require that the Department of Justice  include recommendations…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691322/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…any of these deals. He hasn't even  hinted at it. And he will continue pursuing these corrupt foreign deals  until we, as Congress, have the gumption to act.\n\nToday, I am introducing resolutions that condemn President Trump's  violation of the foreign emoluments clause and demand the transfer to  the U.S. Government of any gifts, benefits, or payments…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…continue to function as we expand New Mexico's  outdoor recreation economy.\n\nMr. Speaker, I do want to thank Chair Westerman for his support of  the Fix Our Forests Act, introducing that bill, and I hope that it does  make it to the Senate.\n\nI think as we talk about the longevity of rural communities and  sustainability of rural communities, we have…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…servicemembers who returned to work at the Pentagon  the next day and were exposed to asbestos and other toxins, causing  lifelong negative health effects.\n\nThat is why I am introducing the Susan E. Lukas 9/11 Servicemember  Fairness Act today. This legislation will close the gap in coverage and  ensure that these servicemembers receive the care and benefits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695328/remember"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…adversaries.\n\nDespite this fast-approaching deadline, negotiations for a  comprehensive reauthorization are ongoing, and while I attempted to  start the process early by introducing a bill last December, formal  negotiations didn't start until last month.\n\nThere are many areas of overlapping priorities between the majority  and minority on this bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Tech Hub in my community is performing groundbreaking  research and development that can revolutionize industries across the  country and across the world. That is why I am introducing this  amendment that urges the Department of Defense to collaborate with Tech  Hubs to accelerate defense innovations in partnerships with academia  and industry right in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…university should be helping  the hidden agendas of the Chinese Communist Party or other nations  continue to threaten U.S. national security.\n\nI thank Mr. Baumgartner for introducing this vital piece of  legislation. I would also like to highlight that the DETERRENT Act  includes bills from my committee colleagues Representative Harris,  Representative…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…animals are more than sidekicks. They are trusted  teammates, and just like their human handlers, they face real threats,  danger, and consequences.\n\nThat is why, today, I am introducing the Leo K9 Protection Act, a  straightforward bill to strengthen the penalties for those who assault  or injure these animals in the line of duty.\n\nI am proud to champion…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…here in America. Our inability to mine only       weakens our domestic production and outsources the jobs it       creates. We thank Representative Stauber (R-MN) for       introducing this legislation and urge bipartisan support.''                                   ____                                                 International Union…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…application process for GPD grants is complex and  burdensome, often discouraging participation from groups that can make  a real difference.\n\nTo correct these inefficiencies, I am introducing the bipartisan  Simplifying Veterans Assistance Act, which requires the VA to provide  clear guidance and best practices for organizations applying for GPD  grants.\n\nBy…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688686/recognizing-essential-legislation-that-supports-our-nations-veterans"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…we hold dear in South  Carolina. I am grateful to Governor McMaster for standing firmly behind  them on this important mission.\n\nMr. Speaker, in the coming days, I will be introducing legislation to  ensure our guardsmen are better protected and supported, both during  deployments like this and beyond.\n\nGod bless our military. South Carolina stands with…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…reliability.\n\nIt strengthens Federal accountability, streamlines communication, and  puts in place commonsense guardrails needed to protect the bulk of the  power system.\n\nSince introducing this bill in the spring, I have heard from energy  leaders across Ohio--energy co-ops, utilities, manufacturers, and grid  operators--who all say the same thing: Regulatory…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Fairbanks, AK, July 21, 2025.      Hon. Nicholas J. Begich III      House of Representatives,      Washington, DC.\n\nDear Representative Begich: Thank you for introducing H.J.       Res. 106, to disapprove the November 12, 2024, Central Yukon       Record of Decision and Approved Resource Management Plan       (Central Yukon RMP). Doyon,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…thank Ways and Means Committee Chairman  Jason Smith for his leadership and also his support on this  legislation, and I thank our colleague, Judy Chu, for joining me in  introducing what I think is an important piece of legislation.\n\nThis bill, the Filing Relief for Natural Disasters Act, H.R. 517, is  a bipartisan bill and a commonsense bill. It  will…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…scientific agencies to  do better work by tackling some of our most challenging scientific  problems together.\n\nMr. Speaker, I thank my colleague, Representative Begich, for  introducing this legislation. I also thank Representative Whitesides  for cosponsoring it. This bipartisan bill earned unanimous support in  the Committee on Science, Space, and Technology…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…North Slope the opportunity to responsibly develop the  10-02 area of ANWR, which was set aside by Congress for this direct  purpose.\n\nMr. Speaker, I thank my colleague for introducing this important CRA  resolution on behalf of all Alaskans, and I urge my colleagues to join  me in voting for this resolution. I look forward to this passing this  House.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…gas alone, including  revenue for school trust lands that is meant for North Dakota  classrooms.\n\nI am pleased to join Senator Cramer and Congresswoman Julie Fedorchak  in introducing this CRA resolution, and I urge my colleagues to support  it and help overturn this overreaching and restrictive plan. By passing  this resolution, we can continue working…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…intersect.\n\nFor example, we are getting rid of all of these EV mandates or  electric train mandates or electric truck mandates or electric  lawnmower mandates. I will soon be introducing a Congressional Review  Act resolution to end Gavin Newsom's plan to ban gas-powered cars in  California.\n\nBeyond that, there are a number of State policies that everyone…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…road  signs. They have no business being on our roads, especially not behind  the wheel of a semitruck.\n\nWell, today, I am answering President Trump's call, and today, I am  introducing the Delilah Law in the U.S. Senate. The Delilah Law not  only bars States from giving CDLs to illegal immigrants, but it also  revokes all trucking licenses that are currently…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700256/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…investing in the future of rural America, creating  jobs, and ensuring resources reach all businesses across America. I  thank Representatives Goodlander, Wied, and Golden for introducing this  bipartisan legislation.\n\nMr. Speaker, I urge my colleagues to support H.R. 4549, and I reserve  the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…gone.\n\nNow the House v. NCAA settlement will unleash even more chaos with no  plan to protect small schools, Olympic sports, or competitive balance.  That is why tonight I am introducing the Restore College Sports Act. It  replaces the NCAA with a new entity under Presidential authority to  regulate public college sports as a public good. It fixes the NIL…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689618/protect-college-sports"}]