[{"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "Ms. OCASIO-CORTEZ.  5658, the Child  Care for Every Community Act, a bill originally introduced by  Representative Sherrill of New Jersey, for the purpose of adding  cosponsors and requesting reprintings pursuant to clause 7 of rule XII.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699639/permission-for-member-to-be-considered-as-first-sponsor-of-hr-5658"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…elected man and U.S. citizen ``Little  Muhammad'' and called for revoking his citizenship and for him to be  deported with no just cause.\n\nWe must always condemn hate. I have introduced a censure resolution,  H. Res. 553, against Andy Ogles for his horrific anti-immigrant  sentiment. Immigrants make our country great.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693100/censuring-anti-immigrant-sentiment"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, today I introduced the ``Bridge Corrosion  Prevention and Repair Act of 2025'' with Representative Mike Bost (R- IL), Representative Chris Deluzio (D-PA), and Representative Brian  Fitzpatrick…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693007/introduction-of-the-bridge-corrosion-prevention-and-repair-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…visited my office in Washington, DC. In 2021, I was  proud to stand together at the White House to celebrate the restoration  of the Bears Ears National Monument. When we introduced the Tribal  Access to Clean Water Act, the chairman testified before the Senate  Committee on Indian Affairs to remind Congress of the Federal  Government's responsibility…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…rise today with a heavy heart to  commemorate the life of James ``Jim'' Neil Crain and recognize him for  the excellent work and impact he had on the Grandview community.  Introduced to public service at an early age as an Eagle Scout, Jim  dedicated the rest of his life to serving the City of Grandview and  caring for anyone he crossed paths with. Jim…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…dedicated  to closing health disparities are being eliminated?\n\nFor over a decade in Congress, I have worked with CDC, HRSA, and NIH  to reduce pregnancy-related deaths. I have introduced legislation to  help diversify clinical trials so medical breakthroughs can reach the  patients who need treatment the most.\n\nPresident Trump's agenda, however, is determined…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…unconstitutional abuse of  power. An act of Congress created the Department of Education and only  an act of Congress can dismantle it, and we will fight that.\n\nLast month, I introduced H. Res. 94 in defense of public education.  We have more than 80 colleagues on that resolution. I want everyone to  join us in signing that. Do not let them bulldoze our…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…critical investments that made rail travel in New  Jersey safer and more affordable.\n\nIn honor of his legacy that inspires my leadership and shapes my home  district, today I introduced a bill to rename Newark Penn Station in  his honor: The Donald M. Payne, Jr. Transit Center at Newark Penn  Station.\n\nNewark Penn Station is where so many workers start their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698322/wishing-a-happy-heavenly-birthday-to-the-honorable-donald-payne-jr"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…for having this  Special Hour on such an important topic.\n\nMr. Speaker, I have seen the movie ``A House of Dynamite'' as well as  ``Oppenheimer'' the previous year, which introduced a lot of people in  the moviegoing world to the development of our first atomic bomb at the  Manhattan Project.\n\nIt is very important that we go from popular culture to real…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…with the  victims' identity protected.\n\nNow most people don't understand how this town works, so I am going  to try to explain this really simply.\n\nCongressman Massie and I introduced a bipartisan bill to release all  the Epstein files and to make sure victims were protected. There are 10  Republican cosponsors of that bill, including MAGA stalwarts like…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693720/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Speaker, I rise today in support of the FUTURE Networks Act, and  I thank Representatives Allen and Walberg for our joint effort in  making this a very bipartisan bill.\n\nI introduced this bill to ensure America continues our leadership and  standard setting in the global technology race.\n\nMr. Speaker, 6G is going to be a global evolution in the way we…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690227/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…community meals might be the only social contact older  Americans have during the day.\n\nI have joined Meals on Wheels for deliveries in Oregon, and it is  very meaningful. I have introduced a bipartisan House resolution  recognizing the value of these Older Americans Act programs in  addressing hunger, malnutrition, and isolation among seniors.\n\nI invite my…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and Reagan and  Presidents Carter and Obama, and we hope President Trump. I am pleased  to report that Senators Markey, Merkley, Sanders, Welch, and Van Hollen  have all introduced a version of our resolution. I urge the foreign  policy committees of both bodies to consider these resolutions  promptly.\n\nUnfortunately, Mr. Speaker, activity in House…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…free from Chinese Communist Party  influence, will be fundamental.\n\nHowever, this bill just doesn't do it. As I said before, it is a  sneaky, sneaky little bill.\n\nIt was introduced the last Congress. It hasn't gone anywhere because  it doesn't solve any problem. It doesn't get to the heart of the  matter.\n\nMr. Speaker, if you look at what they want…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…I am very proud to present. This is  a resolution for slavery remembrance month. As you know, August 1619  was the month and year that enslaved persons from Africa were  introduced into the Colonies. Since that time, we have had an adverse  impact on African Americans in the United States of America.\n\nWe need to retrace some of the history of what actually…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…permanently commemorating Jocelyn for  her compassion for animals and people who care about nature.\n\nTo ensure the name change is permanent, Congressman Babin and Senator  Cornyn introduced identical legislation that would codify the  President's executive order.\n\nThe National Wildlife Refuge System plays an important role in  coastal conservation, public recreation,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Congress  is sworn in.\n\nIf the House legislation we are debating today does not receive a  vote in the Senate, I want to make it clear that I am taking action.\n\nToday, I have introduced H. Res. 892, a House resolution that  empowers Speaker Johnson to bring this issue before the courts and  challenge the so-called Senate payday provision as blatantly  unconstitutional.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Association of Texas Professional Educators (ATPE) Elementary  Principal of the Year in 2002. He also helped the district achieve its  first-ever ``Exemplary'' rating and introduced several science-focused  initiatives, including dedicated labs and an outdoor classroom. His  educational philosophy emphasizes that every child can learn when  properly…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "John Rose", "party": "Republican", "sentence": "…government and end  the suffering. However, we never lost sight of undoing the self-serving  money grab from taxpayers by a select group of Senators.\n\nHours before our vote, I introduced the first standalone bill to kill  that provision. I also cosponsored Representative Austin Scott's  legislation, which achieved the same outcome. It passed the House  unanimously.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Mr. Speaker, I rise today in support of the Foreign  Adversary Communications Transparency Act, known as the FACT Act. I  introduced this bill in January, and I have been pleased to see it  advance through committee and now onto the House floor.\n\nFirst, I thank Chairman Guthrie, Chairman Hudson, and the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Act and the amendments made by this Act.\n\nMr. Speaker, I rise today in full support of H.R. 789, the  Transparency and Predictability in Small Business Opportunities Act,  introduced by Representatives Latimer, Alford, and Mfume.\n\nH.R. 789 seeks to bring clarity to small business owners when  solicitations for contracts are canceled. Often, small businesses…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691760/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…free Medi-Cal for illegal immigrants, a policy that no  other State in the country has, a policy that has literally driven our  Medicaid system to the point of insolvency, I introduced the No  Medicaid for Illegal Immigrants Act.\n\nWe have been applying pressure in every way we can, and finally Gavin  Newsom has bowed to that pressure. He has announced that…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I rise today in strong support of this CRA  resolution introduced by my good friend and colleague from Wyoming,  Representative Hageman. This resolution overturns the Biden  administration's actions to lock up public lands in Wyoming from…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…appropriate money to different economic sectors that may benefit  our own portfolios, and who gets the short end of the stick?  Hardworking, red-blooded Americans.\n\nThat is why I introduced the End Congressional Stock Trading Act to  level the playing field and restore public trust in Congress. Every  time I go back to east Tennessee, I get asked by my constituents:…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in California, and even in the early  days of COVID, I was very much opposed to the legislature having no  role in determining whether we were in a state of emergency. I  introduced a resolution many times on whether or not the state of  emergency should continue. Therefore, of course, I would not support  cutting Congress out of that process entirely…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…district to be with the victims and the community.\n\nMr. EVANS of Colorado. Mr. Speaker, I, unfortunately, had other  engagements that had been scheduled.\n\nThe resolution was introduced to, again, focus a component of the  dialogue. Of course, our thoughts and our condolences go out, but we  need more than thoughts and condolences. We need to have the  conversation…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…this is the seventh reason to phase them out. Wind and solar  technologies have less overhead, longer lifespans, and higher profits  than they did when these credits were introduced nearly 30 years ago in  the 1990s.\n\nFor example, the cost of solar has decreased more than 80 percent  since 2010. Truly, the market is more than capable of supporting  continued…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Small Business and Entrepreneurship of the       Senate a briefing on the plan.\n\nMr. Speaker, I rise today in support of H.R. 4491, the SBA IT  Modernization Reporting Act, introduced by Representative Cisneros from  the great State of California and Representative Jack from the great  State of Georgia.\n\nThe SBA is charged with certifying small businesses…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…complications, cancer, chronic conditions, and so much more, yet our  blood supply remains critically low.\n\nBecause of the urgent and ongoing need for blood donations, I  recently introduced H.R. 5791, the Boosting Lifesaving Operations,  Opening Donation Centers Act, or the BLOOD Centers Act, alongside my  Democratic colleague, Congresswoman Schrier.\n\nThis commonsense,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699256/national-blood-donor-month"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…about  fairness, public safety, community identity, and ensuring that every  town and city in America has the tools it needs to thrive.\n\nWhen the ZIP Code system was first introduced in 1963, it was a  revolutionary step toward modernizing mail delivery and streamlining  operations for a rapidly growing nation.\n\nAt the time, the United States Postal Service…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]