[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Constitution.\n\nI still have the ERA pin I wore that day. I have kept it for nearly  50 years because the fight isn't over.\n\nThis week, I stood with powerful women in Congress to introduce a  resolution that removes our final barrier: the arbitrary deadline set  decades ago. If it passes, the ERA becomes the 28th Amendment.\n\nWe must pass this resolution. We…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Commission of Fine  Arts District of Columbia Residency Act. This bill would require that a  majority of the members of the Commission of Fine Arts (CFA) be  District…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694733/introduction-of-the-commission-of-fine-arts-district-of-columbia-residency-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…subcommittee meeting to bring  DOGE forward to please tell us what they are doing rummaging through  everyone's personal data and information.\n\nRanking Member Neal and I are going to introduce a resolution of  inquiry to bring DOGE before Congress. Every Member, Republican and  Democrat, should be concerned about this. Every American citizen should  be aware that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…not about education, it is about control. We must ensure that  Juneteenth is not just a day off but a day of truth.\n\nIn 2005, I partnered with then-Senator Barack Obama to introduce  legislation recognizing Juneteenth. And now that it has become law, we  must defend it and the history it represents from being erased. The  history of our people is not…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  Transportation Funding Equality Act. This bill would make the District  of Columbia eligible for three federal programs that support the  development…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698538/introduction-of-the-district-of-columbia-transportation-funding-equality-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today I introduce the Francis G. Newlands  Memorial Removal Act, which would remove the plaque and inscriptions on  a fountain bearing Francis G. Newlands' name from Chevy Chase Circle, a…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…shape whether the world moves toward stability or  toward, once again, unconstrained nuclear arms races.\n\nI look forward to the discussion this evening.\n\nI am now proud to introduce my colleague,   John Garamendi of  California, a longtime advocate for arms control, with whom I have had  the honor of spending a weekend underneath the north polar ice…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to introduce bipartisan legislation,  alongside my northwest Ohio colleague, Representative  Bob Latta.\n\nOur purpose is to honor a legendary Ohioan and pioneer of American  military history,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise today in strong support of H.R.  1766, the NTIA Policy and Cybersecurity Coordination Act, which I was  pleased to introduce with the gentleman from California (Mr.  Obernolte).\n\nMr. Speaker, this important bipartisan legislation would cement the  responsibilities of the National Telecommunications…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…was important to me because  all they could see in their textbooks was what happened in the Civil  War and that is all people knew about.\n\nIt took me all the way to 2019 to introduce the legislation, and I  think it got passed in 2022. Twenty years we worked on this and then we  had the big celebration. I am getting to this DEI stuff here.\n\nWe had the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  Non-Discrimination Home Rule Act of 2025, which would end the  applicability of the Religious Freedom Restoration Act of 1993 (RFRA)  to the District…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692151/introduction-of-the-district-of-columbia-non-discrimination-home-rule-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  Board of Zoning Adjustment Home Rule Act. This bill would give the  District of Columbia the authority to appoint the members of the D.C.  Board…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693426/introduction-of-the-district-of-columbia-board-of-zoning-adjustment-home-rule-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…strawberry guava overwhelm native  vegetation, altering habitats and disrupting the food chain. These  invaders not only outcompete native species for resources but also  introduce diseases, further endangering the delicate balance of  Hawaii's ecosystems. Effective control of invasive species is crucial  for the long-term survival of Hawaii's native…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  Special Elections Home Rule Act. This bill would give the District of  Columbia complete authority to set the date of special elections for  local…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697291/introduction-of-the-district-of-columbia-special-elections-home-rule-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce a bill that would exempt  from federal government shutdowns the National Capital Planning  Commission (NCPC) and the Commission of Fine Arts (CFA). This bill is  modeled…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696109/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-national-capital-planning-commission-and-the-commission-of-fine-arts-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-the-commissions"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Madam President, I am pleased to introduce this bill  with Senators Van Hollen, Murray, Alsobrooks, Warner, and Kaine. It has  been endorsed by President Trump and also by the chairman of the House  Appropriations…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…in the House are afforded the opportunity to follow  regular order and consider an alternative bill.\n\nI have joined Chairman Graves and Ranking Members Larsen and Smith to  introduce the bipartisan ALERT Act that will fix the flaws of the ROTOR  Act, but our legislation goes much farther than the ROTOR Act to  improve aviation safety by addressing all…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700107/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. Speaker, it is my honor to introduce Dr. Michael  Gossett, pastor of Green Acres Baptist Church in Tyler, Texas, to the  United States House of Representatives to serve as the guest chaplain  this week and offer…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690047/welcoming-guest-chaplain-dr-michael-gossett"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, I rise today to introduce the Accounting  STEM Pursuit Act, which would help address workforce shortages in the  accounting profession by recognizing accounting as a STEM education  subject and adding…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…joined together with Transportation  Committee Ranking Member Rick Larsen, Armed Services Committee Chairman  Rogers, and Armed Services Committee Ranking Member Smith to introduce  the ALERT Act.\n\nThe ALERT Act is a comprehensive package of improvements that  addresses all 50 safety recommendations issued by the NTSB. Unlike the  bill before us today,…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…regulations. However, we must take further steps to prevent future  administrations from issuing similar mandates.\n\nThat is why I have partnered with Representative Fulcher to introduce  the Choice in Automobile Retail Sales, or CARS, Act, which will prevent  similar EV mandates and safeguard Americans' freedom to choose the  vehicle that is best for them.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689285/put-consumers-back-in-the-drivers-seat"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "Mr. DONALDS. Mr. Speaker, I would be remiss without thanking Chairman  Comer for the time on the floor today, and I might have to ask the  chairman to introduce me everywhere going forward. I greatly appreciate  that.\n\nMr. Speaker, I rise in strong support of my bill, the Safe and Smart  Federal Purchasing Act.\n\nFor background, lowest…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688341/safe-and-smart-federal-purchasing-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. HILL of Arkansas. Mr. Speaker, I have the pleasure to introduce  the author of this important legislation, and I yield 4\\1/2\\ minutes to  the gentleman from Minnesota (Mr. Emmer), the majority whip of the U.S.  House of Representatives.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, today, 20 of my colleagues and I will  introduce legislation to stop the abuse of universal injunctions that  we are seeing all across the country--all of this to stop the Trump  agenda.\n\nUniversal injunctions violate the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…States Code.''.\n\nMr. WESTERMAN.  1682, the bill now under  consideration.\n\nMr. Speaker, I would like to once again thank Representatives Evans  and Panetta for their efforts to introduce this meaningful legislation.\n\nThis bill would reduce the financial burden on our military families  who want to visit our national parks and expand their access to the  healing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691053/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…influence our elected  leaders. No longer will our elections be insecure if we do our jobs.\n\nLast week, I joined with my friend, Senator Mike Lee, in the Senate  Chamber to introduce a bill that we call the SAVE America Act. This  legislation builds upon bills that we introduced last Congress, the  SAVE Act, legislation that was focused on a simple idea…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…agenda.\n\nThis was put out by the Biden administration, Mr. Speaker, on  December 8, mere weeks before the transition to the Trump  administration.\n\nLast Congress I was proud to introduce the Alaska's Right to Produce  Act which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I am proud to introduce H.R. 3428, the  Mid-Atlantic River Basin Commissions Review Act.\n\nThis legislation will bring much-needed oversight and clarity to the  activities and funding streams for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…enforcement  support group open to all staff with licensed counselors and free to  anyone who needs it.\n\nAfter Blake's death, I was honored to sit down with Jon and work to  introduce Correctional Officer Blake Schwarz Suicide Prevention Act,  legislation aimed at providing the resources and recognition our  correctional officers deserve. I thank Jon and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "Mr. GRAHAM. Mr. President, it is my honor to introduce Rabbi Berman,  who just gave the prayer and who is president of the Yeshiva  University.\n\nThank you for your blessing this morning.\n\nIn his prayer, Rabbi Berman reminded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695300/dr-rabbi-ari-berman"}]