[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Arctic char  in the Canning River on the Coastal Plain, it is a moment you will  never forget as an American. These lands have provided sustenance to  the Gwich'in and the Inupiat peoples for millennia.\n\nThe bottom line, setting the unique wildlife and recreation values of  America's Arctic aside, using the CRA to overturn land management plans  is…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Alaska.\n\nLet me tell you a little bit about this special place, a place in  which I have had the privilege to spend time. The Arctic refuge, the  homeland of Gwich'in and the Inupiat people, offers unmatched, truly  wild fishing and hunting opportunities for all Americans.\n\nIt is the only national wildlife refuge that protects an entire  Arctic ecosystem,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…only spiritually and  culturally, but for our survival and subsistence. This action from D.C.  is an insult to the Gwich'in people and ignores those realities.''\n\nSovereign Inupiat for a Living Arctic also oppose this proposal. They  said:\n\nMany Alaska Native communities are already facing negative       health impacts from oil and gas development on…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…below Federal lands was  in Alaska, 14 billion barrels of it being on the North Slope of Alaska.  Importantly, the North Slope of Alaska is also the ancestral lands of  the Inupiat people, who have lived, subsisted, and called the Arctic  home for thousands of years. This is an area the size of Minnesota,  wholly above the Arctic Circle, with none of…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Hon. Nicholas Begich III,      House of Representatives, Washington, DC.\n\nDear Senators Murkowski, Sullivan, and Representative       Begich: On behalf of the Kaktovik Inupiat Corporation (KIC)       and our shareholders, I am writing to express our strong       support for S.J. Res. 91, the resolution disapproving the       Bureau of Land Management's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Villages.\n\nLast Congress, we held a bipartisan legislative hearing on H.R. 6285,  ``Alaska's Right to Produce Act,'' where we heard from Tribal  representatives, including Inupiat leadership from the Native Village  of Kaktovik, the only indigenous Tribal community within ANWR.\n\nIn that hearing, Doreen Leavitt, Director of Natural Resources for  the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…plan attempted to create a wilderness area in a petroleum reserve,  and it did so without listening to the people who actually live there.\n\nAlaska is asking us to act.\n\nThe Inupiat people who live in the area have spoken, and they could  not have been clearer. Through the North Slope Regional Trilateral--the  Inupiat Community of the Arctic Slope, the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…selected by Doyon for their economic  development potential, consistent with the intent of ANCSA. The  northernmost part of the planning area covers the traditional lands of  the Inupiat people in the Arctic Slope Region.\n\nThis vast area includes enormous critical mineral potential of  national and strategic importance. As our geostrategic adversaries  continue…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…word for  it either. We received a letter from the North Slope trilateral. This  is the political leadership on the North Slope consisting of the North  Slope Borough, the Inupiat Community of the Arctic Slope, and the  Arctic Slope Regional Corporation. They weighed in with their strong  support for this disapproval resolution.\n\nIn their words:\n\nThe…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…During the townhall, the Secretary heard the testimony of Charles  Lampe, a resident of Kaktovik--the only community located fully within  ANWR--and the President of Kaktovik Inupiat Corporation, KIC. KIC is a  village corporation established by the 1971 Alaska Native Claims  Settlement Act. KIC owns approximately 92,000 acres of surface lands,  but is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…September, triggered the CRA window that allows Congress to act today.\n\nCongress must act because Alaskans have spoken clearly, and they have  spoken loudly.\n\nThe North Slope Inupiat leadership, including the Arctic Slope  Regional Corporation, the North Slope Borough, and the Inupiat  Community of the Arctic Slope, have consistently supported responsible…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}]