[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "…NTSB  personnel who are actively supporting the victims' families through the  agency's family assistance program. Family assistance is a critical  function of the NTSB and invaluable to those mourning the loss of one  or more of their loved ones.\n\nIn times of tragedy, it can be difficult to sort through the torrent  of emotions--sadness, rage, loneliness,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today in recognition of National  Disability Employment Awareness Month, observed each October to honor  the invaluable contributions of people with disabilities to the  workforce and to reaffirm our commitment to expand their participation  in the future.\n\nIn 1945, the Nation first designated…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…restore funding. Yes, we  will fight here to restore funding, especially as so many of Trump's  cuts are, in fact, outright illegal. But we cannot restore from here  lost time--invaluable time--for kids fighting an incredibly deadly  disease. For some of them, it may be too late. And that is  heartbreaking, and it is a direct result of R.F.K., Jr.'s, disastrous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…standards and vetted by Westfield State University faculty.  Undergraduate students from the University's Department of  Communication serve as the production crew, gaining invaluable hands-on  experience in broadcast television under the guidance of seasoned  professionals. Many of these students have gone on to successful  careers in media, working at…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…beacon of inspiration for young athletes,  especially young women, throughout our community. This team represents  a pinnacle of athletic achievement and will provide an invaluable  platform to showcase the incredible talent, dedication, and  sportsmanship of professional female athletes.\n\nThe establishment of an NWSL team in Denver will undoubtedly…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694256/recognizing-denver-summit-fc"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…lowering out-of-pocket  healthcare costs, improving outcomes for patients, and expanding access  to services offered by rural and urban safety net hospitals. This data  will be invaluable as Congress contemplates the future of the program.\n\nSenator Carper championed Hospital at Home up until his last days  serving the Senate because he knew of the value it…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…continues to bring together people of  all faiths in the pursuit of peace, mutual respect, and a future more  worthy of our children. I join my colleagues in commending his  invaluable work, and I proudly join my Orthodox constituents in  welcoming him back to the United States.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…Month.\n\nThere are 25 million Asian Americans, Native Hawaiians, and Pacific  Islanders in the U.S., representing the fastest growing racial group in  the country. We have made invaluable contributions to our country and  play a vital role in shaping America for the better.\n\nHowever, at a time when we should be celebrating, our communities are  anxious and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691503/gop-tax-scam-hurts-women-and-families"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Speaker, I rise today to urge support for my Saving  Natural Ecosystems and Marine Organisms (NEMO) Act to protect the  ornamental reef species living in the fragile and invaluable ecosystems  of our world's endangered coral reefs.\n\nOur oceans, teeming with life and rich biodiversity, depend on the  health of coral reefs, some of the most biologically…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, a few days ago the U.S. House of  Representatives--and the House Armed Services Committee--bid farewell  to one of its most invaluable, talented, professional staff experts:  Mr. John Phillips MacNaughton, Jr.\n\nAt the end of January, Phil, as he is known, completed 30 years of  public service to our Nation.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…one, his  dedication has made a real difference in the lives of the people we  serve. Always calm, steady, and deeply knowledgeable, Marc has been a  trusted presence and an invaluable resource to our constituents and our  team.\n\nA true public servant, Marc earned his nickname, the mayor, in our  office because he knows the communities, local leaders, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…celebrating the Albany  Young Marines and their remarkable contributions to themselves and the  Southwest Georgia community. Their dedication, leadership, and service  are invaluable, and I am confident that this organization will continue  to shape future generations of outstanding young leaders.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…leadership preserved  essential elements of the ceremonies while still ensuring the  President-elect was sworn in on time. Stefanie Muchow from Leader  Thune's office provided invaluable support to Julia backstage as she  expertly addressed challenges.\n\nFor Mike Wagner, our executive director, participation in inaugural  ceremonies began when he was a high…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…someone will be checking in on them regularly.\n\nThe Gibson Center showcases exceptional care for the senior residents  of the Mount Washington Valley. Every day, they provide invaluable  services to those in need and make our Granite State communities better  and stronger.\n\nOn behalf of my constituents in New Hampshire's First Congressional  District, I…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691690/recognizing-the-gibson-center-for-senior-services-serving-two-million-meals"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Adoption and  Education Center in Dearborn. The center is a new facility that belongs  to the Friends for Animals of Metro Detroit, a nonprofit animal shelter  that provides invaluable services to our community and our beloved  animals.\n\nFriends for Animals of Metro Detroit has extended their animal  rescue, adoption, and education services over the past…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694353/recognizing-the-maryann-wright-animal-adoption-and-education-center"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…be that staunch ally. As I mentioned,  they have been hosting the Pituffik Space Base and allowing the United  States to have not only an important presence there but an invaluable  presence. Any colleagues who have had the opportunity to visit the U.S.  assets that we have there at Pituffik understand that strategic  geography and the level of cooperation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…for her exceptional service, tireless  dedication, and unwavering commitment to the people of Texas' 13th  Congressional District. Over the years, Kathy proved to be an  invaluable asset to my office, where her attention to detail was  crucial in my ability to represent and serve my constituents.\n\nKathy discovered her passion for public service in High…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…patience, and with her clear passion for education.\n\nShe goes beyond teaching her students the fundamentals of reading and  math and also instills values in them that are invaluable for the  learning community--the values of kindness, gratitude, and creativity.\n\nShe brings joy and cheer to the classroom and creates an environment  in which students feel…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…community.\n\nTheir accomplishment reflects the best of American spirit, teamwork,  and perseverance. Competing at this level not only showcased their  skill but also provided invaluable experience playing alongside and  against some of the best athletes in the world.\n\nI commend Izzy, her teammates, and their coaches for their dedication  and sportsmanship,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today during National Police Week  to honor the men and women in law enforcement for their invaluable  service to our Nation.\n\nI especially thank all of the police officers in my district who work  tirelessly to ensure that southeastern Arizona is safe, secure, and the  best…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…to 81 university departments and more than 50  pharmaceutical, medical research, and biotechnology companies. Today,  Research Park employs over 14,000 Utahns and provides invaluable  educational opportunities for students preparing to lead in the fields  of science and medicine.\n\nDespite this long record of success, a recent BLM review raised  questions…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Strength'' demonstrated powerful       support for the State's tourism resources by saying, ``Let's       not skimp when it comes to saving something so valuable--and       so invaluable.''\n\nOn March 8, 1984, Senator Bumpers wrote Don Hamilton       enclosing a copy of Senator Tower's statement of support       saying, ``I'm sure you had something to do with…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Williams for  receiving the distinguished Best Community Banking Award for 2025. I  thank him for his enduring commitment to Michigan's 1st Congressional  District and his invaluable contributions to our great Nation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695770/recognizing-mr-david-williams-for-receiving-the-best-community-banking-award-for-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…whole, and to the Clerk, the Sergeant at Arms, the Chief  Administrative Officer, and the Inspector General. Their long hours,  hard work, diverse skills, and team spirit are invaluable, and their  years of unwavering service and dedication set an example for their  colleagues and raise the bar for those who will follow in their  footsteps. I applaud all…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the Colfax Elementary School District, Danna McCoy, who  has dedicated the past 4 years of her career to educating the young  students of her community.\n\nMrs. McCoy is an invaluable member of the Colfax Elementary team. She  started as a paraeducator before going back to school to become a  teacher. Now, she has many different roles at Colfax Elementary,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…I am proud to recognize the Miami-Dade County Hispanic Affairs  Advisory Board for its leadership, dedication, and tireless service.  Their work not only highlights the invaluable contributions of Hispanic  Americans but also reminds us that cultural unity strengthens the very  fabric of our communities.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695658/recognizing-hispanic-heritage-month-and-the-miami-dade-county-hispanic-affairs-advisory-board"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…transferring U.S. Forest Service land adjacent to the cemeteries to the  respective counties.\n\nWhile this is a straightforward bill, I think many of us can attest  to the invaluable role a burial place can play in the grieving process.  Burial sites are sacred, eternal resting places that provide closure  for the families of the deceased. Families should…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Compounding Centers of America, PCCA.\n\nMr. Bassani earned his doctor of pharmacy degree from Drake  University's College of Pharmacy and Health Sciences. Since then, he  has been invaluable in various settings within the pharmaceutical  industry.\n\nMr. Bassani embraces opportunities to give back, teaching  extemporaneous compounding principles to pharmacy students…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…program plays a crucial role in this  effort by attracting private equity investments to help small  businesses grow, create jobs, and strengthen our economy.\n\nSBIC has been an invaluable tool for investing in small businesses  that build critical technologies and support American national  security.\n\nH.R. 754 builds on this success by increasing the maximum…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687921/investing-in-main-street-act-of-2025"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…key role in making that happen. Federal government agencies are often  difficult and complex to navigate. However, Linda's ability to cut  through the red tape made her an invaluable resource and help to many.\n\nLinda's public service did not stop at casework. She created mobile  district office hours so Idahoans--especially those living in small,  rural…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}]