[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…young nation.\n\n``But by the 1830s, it felt a little bit safer to go       there,'' Sheidley said. ``And so that's the moment where . .       . the name `Tea Party' is invented, and it becomes       popularized as a story of what led us to the revolution.''\n\nA century later, a 1922 New York Times article detailed       ``the uncelebrated burning''…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…didn't export any natural gas at  all. By 2021, we were exporting 300,000 million cubic feet per year.  Today, we are over 500,000 million cubic feet per year. It is as if we  invented cell phones and then decided to double down on exporting  rotary phone technology to the rest of the world. We are still  producing a lot of oil in the United States, but…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Over the last several years, the President of the United States  suggested people inject bleach to cure COVID, that windmills cause  cancer, that climate change is a hoax invented by China, that Tylenol  use in pregnancy causes autism--the list goes on and on. And over this  past year, we have seen systematic attacks on scientists at CDC, at  NOAA,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…rely on them for advice. Mr. Speaker, everyone knows who I mean.\n\nAmerica is a leader in science and technology. We were the first in  the world to send a man to the moon. We invented the polio vaccine and  DNA sequencing. We invented the microchip, the internet, and GPS.  Americans invented the airplane, the lightbulb, television, and email,  and we fed…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…as the most prolific inventor of American history. Why?  Because we said he invited the lightbulb and that is true. I taught  that when I was teaching history that Edison invented the lightbulb. I  am proud of that.\n\nHowever, what was not in those textbooks that I was teaching from,  and I had to go to my own book to teach my children properly, because…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…significantly reduce the unregulated toxic chemicals from tire  manufacturing facilities, facilities that my community is all too  familiar with.\n\nIn 1839, Charles Goodyear invented vulcanized rubber, revolutionizing  the way that the world travels. Decades later, the Goodyear Tire and  Rubber Company was founded and headquartered in Akron, Ohio, my…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…giant. We have a capacity to invent new  technologies. By the way, the Chinese are just on the HOV lane of new  technologies for the vehicles which they are driving. They have  invented a technology that allows for the charging of a battery in 5  minutes in a vehicle that people are driving.\n\nThat should be us. We should be the ones leading.\n\nThat is not…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, I rise to honor immigrants.\n\nThroughout American history, immigrants of all kinds have made our  country great. Sergey Brin invented Google, and Madeleine Albright  blazed trails as the first female Secretary of State.\n\nInstead of celebrating this diversity, many Republicans want to shame  immigrants. On…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693100/censuring-anti-immigrant-sentiment"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…resolution highlights Jewish American inventors who created  services and products that all Americans rely on each and every day.\n\nFor instance, Mr. Speaker, Irving Naxon invented the slow cooker. He  took inspiration from Jewish cooking traditions in Europe to allow  Jewish communities to have fresh and hot meals on Shabbat.\n\nSylvan Goldman invented…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…The U.S. Department  of Commerce used to care about those businesses, the small, creative  new launches, like Willy's Fresh Salsa, which just got into Winn-Dixie.  That was invented by a gentleman who came from Toledo. There is also  Gertie's Premium BBQ Sauce. That is a product on our shelves created  through that program to create wealth, opportunities,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…facts were that all of this new spending  was going to be independent of political campaigns--that was never  tested, never vetted, never litigated. That was a fact that was  invented behind the curtains of the Supreme Court by those five  Justices. History shows since then that had a real factfinding effort  been undertaken, it would have been clear that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…World War II but almost. Of course, the  millennials, as we were closing out the 1900s, really felt as though  America was at the top of the world. We were unstoppable. We invented  the internet. Our auto industry was booming. The sport utility vehicle,  Oakland County, Michigan, being really one of the most wealthy, if not  the wealthiest county in…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…must keep inventing. We can't go back. We  have got to go forward. Our energy future is right here at home. Over  the last 50 years, new American energy sources have been invented. All  exist in our homeland, with more to come. I am just so proud of the  inventiveness of the American people. The discovery of natural gas in  the Utica and Marcellus shale…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…undercover test in which it       submitted insurance applications for fictitious individuals       to the federal ObamaCare exchange and insurance brokers.       Nearly all of its invented people were able to enroll in       subsidized plans despite submitting false or no records to       verify their identities and incomes.\n\nOf GAO's 24 applications, 23 were…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Frankly, our own current banking system has crept too close to that.  We need to turn the other direction. The market is telling us that.  That is why cryptocurrency was invented, frankly. That is why it is so  popular and is a growing asset class. We need to say no to this, and we  need to protect what the market is telling us consumers want.\n\nWe…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693732/anti-cbdc-surveillance-state-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…traditions, and other fields;\n\nWhereas there are many Jewish American inventors that have       impacted the everyday lives of Americans for the better;\n\nWhereas Irving Naxon invented and patented the slow cooker,       taking inspiration from Jewish cooking traditions in Europe;\n\nWhereas Sylvan Goldman invented the shopping cart;\n\nWhereas Evelyn Berezin…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…decision. For nearly 50  years, Roe distorted our Constitution and did great harm to our Nation.\n\nThe decision was not rooted in the text of the Constitution. Instead,  the Court invented a constitutional right grounded in a vague,  undefined concept of privacy that the Court itself struggled to  explain.\n\nRoe silenced voters, sidelined legislatures, and eroded…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "French Hill", "party": "Republican", "sentence": "…are the rules of the SEC to privately raise money  to help somebody start a business.\n\nIn that effort, you have to be an accredited investor in order to  invest. What if you invented the technology that is doing the business,  but you did  not have a million-dollar net worth and a $250,000 income? Mr.  Chairman, you can't be an investor--it is your technology--unless…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}]