[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…bought the store from its  previous owners in 1955 and renamed it Dan & Whit's. The store has been  run by the Fraser family ever since.\n\nDan & Whit's is known for their huge inventory. The store is  deceptively large inside, and endless aisles are lined with a vast  selection of goods, rumored to number into the hundreds of thousands.  They stock everything…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Madam Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, I rise in cautious--I emphasize cautious--support for  H.R. 3494, the VA Hospital Inventory Management System Authorization  Act, as amended.\n\nThroughout my time on this committee, I have seen the importance and  necessity of an accessible and efficient supply chain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695397/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…through diplomacy,  South Africa to give up their nuclear weapons. At the time of the end  of the Soviet empire, Ukraine possessed the world's third-largest  nuclear weapon inventory, which they voluntarily gave up in return for  a guarantee of territorial integrity--one, unfortunately, which we are  not abiding by.\n\nMr. FOSTER. Mr. Speaker, I thank Mr.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Ukraine, engaged in resisting Russian aggression against       Ukraine for replacement of any weapons or articles provided       to the Government of Ukraine from the inventory of the United       States, and to recover or dispose of equipment procured using       funds made available in this section in this or prior Acts:       Provided further,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Government, and  that is a pretty remarkable statement in itself.\n\nThrough the bipartisan Count the Crimes to Cut Act of 2025, Congress  and the people will finally get an inventory of all Federal statutory  and regulatory criminal offenses. Thanks to this bill, we will know the  specific elements of each offense, the potential criminal penalties,  the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…small businesses, and those small businesses  represent one-third of all trade that our country engages in.\n\nThey are not big companies. They can't buy a year or 2 years'  inventory in advance. They live week to week. They live month to month.  And that is pretty much where they have been since April. They have  been trying to survive. They have been…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…and they are either not listening to them or not asking  questions.\n\nWhen you hear Secretary Rubio, for example, saying not to worry about  their 60 percent enriched uranium inventory because they are going to  have to convert it to metal and that will take years, anyone with  knowledge of the history of the Manhattan Project knows that is not a  major…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…paid.\n\nWhat did Donald Trump tax when he imposed these sweeping, unlawful  tariffs?\n\nHe taxed your groceries. He taxed your baby formula and your  strollers. He taxed the inventory sitting on the shelves of small  businesses that are just trying to survive.\n\nIn my home State of Nevada, families have paid nearly $1,800 more in  the last year because…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…sending all her money to  Spain.\n\nThere is a couple in their twenties. They are both young nurses. They  can't save up for a home because Wall Street is gobbling up all the  inventory.\n\nHere we are, talking about showerheads. We wonder why people look at  this place and see it as a self-serving, out of touch, dysfunctional  mess. We don't need new ballrooms.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…don't even know how many criminal laws there are.\n\nThat is why we need to pass the Count the Crimes to Cut Act of 2025,  which would mandate the creation of a comprehensive inventory, as we  have expressed, of all Federal criminal, statutory, and regulatory  offenses.\n\nI am really proud to co-lead this commonsense and, as I said before,  bipartisan solution…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…household budgets.\n\nFor families trying to buy their first home, the challenge is  steeper, because mortgage rates may have dipped below 6 percent, but  high prices and limited inventory keep homeownership out of reach for  many in my district. We cannot ignore the inequities baked into the  system.\n\nIn Ohio's 13th District, the homeownership rate overall…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…proves that       LNG export volumes are highest during our winter peak heating       season months of November through March, which accelerates a       reduction in U.S. inventory, increasing the prices of U.S.       natural gas and electricity and reducing reliability. The       severity of the problem increases as export capacity       increases…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…defense capability to deter aggression in       the region and to ensure interoperability with U.S. forces.       The Republic of Korea already has GBU-39/B SDB-Is in its       inventory and will have no difficulty absorbing these       articles and services into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Finland's capability to meet       current and future threats and enhance its interoperability       with U.S. and other allied forces. Finland already has       AMRAAMs in its inventory and will have no difficulty       absorbing these articles into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…protect Polish and allied forces in transition or combat and       significantly improve the Polish contribution to NATO       requirements. Poland already has AMRAAM in its inventory and       will have no difficulty absorbing these articles into its       armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690571/arms-sales-notification"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that was doing that investigation. It is  really interesting. That group, and I was a part of it, found that  there was more than one terabyte of missing data. Based on the  inventory of the digest and statements from Chairman Thompson, there  should have been four terabytes turned over, and there were only three.  That is equivalent to 6.5 million document…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…The solution to inflation, the solution to higher costs, is always  more supply. The reason we have affordability challenges in housing,  Mr. Speaker, is because we have an inventory shortage. Republicans are  offering solutions to provide more housing stock to lower the costs for  the American people and deliver on that American Dream of  homeownership.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Netherlands capability       to meet current and future threats by ensuring it has modern,       capable air-to-air munitions. The Netherlands already has       AMRAAMs in its inventory and will have no difficulty       absorbing these articles into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695757/arms-sales-notification"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…an  electric vehicle is more than $55,000 a year.\n\nPrices in the used car market will also surge, as dealers will not  have the gas-powered vehicles to sell because of the inventory of  unsellable EVs. My constituents simply cannot afford this ridiculous  regulation and should not be forced to purchase entirely unaffordable  vehicles that do not meet…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…States.\n\nSince its founding in 1945 by Joe DeLeo, Sr., and his wife,  Josephine, four generations of the DeLeo family have embraced the  family business that today has an inventory that includes arcade games,  pinball machines, digital jukeboxes, pool tables, dart boards, skill  games, and ATMs.\n\nIn addition to supplying the region with entertainment…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "James Risch", "party": "Republican", "sentence": "…capable air-to-air munitions. It will also advance United       States interoperability with NATO and the Italian Armed       Forces. Italy already has AMRAAMs in its inventory and will       have no difficulty absorbing this equipment into its armed       forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692629/arms-sales-notification"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…today, but the Navy for  tomorrow.\n\nThis bill also supports our airborne force projection, raising the  minimum number of aerial refueling aircraft, maintaining a strong  inventory of C-130 aircraft for intra-theater airlift, and supporting  cutting-edge aerial drone programs. As with our ships and submarines,  we are paving a smoother path toward building…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697808/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…Major General Coburn has been a close partner in improving our  Nation's tactical air mobility operations capability through  recapitalization of the Air Force Reserve's C-130 inventory. She has  heavily invested in servicemember quality of life improvements  throughout her command, especially at Dobbins Air Reserve Base. With  more than 12,000 Reserve Airmen…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "French Hill", "party": "Republican", "sentence": "…furnishings, equipment, supplies, staff       training, and recruitment and other incidental costs.\n\n(iv) Economic development activities, including equipment       purchases, inventory financing, interest subsidies, operating       expenses, and similar costs not associated with construction       or expansion of existing operations.\n\n(v) Activities to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sense of ownership of their future homes. Beyond  construction, Mr. Quinn repairs and revitalizes electrical appliances  at the organization's ReStores. By increasing the inventory of  resellable goods, he directly helps generate funds that enable the  construction of more affordable homes in our community. Neil is the  epitome of a team player, consistently…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…are not: blood draws, organ  examinations, and ultrasound scans. These are not for their health.  These results are then entered into a database, turning them into a  human inventory for a state-run organ harvesting system.\n\nThis is barbaric. These crimes, these abuses by the Chinese Communist  Party, must end. I think we can all agree that they have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Madam Speaker, I rise today in support of  my bill, the VA Hospital Inventory Management System Authorization Act.\n\nAs a Navy veteran, a nurse practitioner, and the proud Representative  of a district that is home to more than 78,000 veterans, I know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}]