[{"senator": "George Latimer", "party": "Democrat", "sentence": "…SNAP were denied their benefits, Senate  leadership added a payout provision to eight Senate Republicans whose  phone records were subpoenaed in the January 6 Capitol riot  investigation by the Department of Justice.\n\nWhile American air traffic controllers worked without pay, Senators  gave themselves the ability to sue for at least $500,000 if their  electronic…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696864/calling-for-quick-action"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Ukraine. Hamas and other  terrorist groups have turned to cryptocurrencies to funnel resources  toward violent operations against innocent civilians as was exposed in  the investigation following the violent October 7 attacks on Israel.\n\nNorth Korean hackers, operating as arms of the regime, have stolen  billions of dollars in cryptocurrency through cyberattacks,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…April.\n\nShortly after that, the Abu Dhabi-backed investment from MGX bought  $2 billion of Trump's coins to make an investment in Binance, a company  that had been under investigation for numerous legal violations. Trump  and his family will make tens of millions of dollars just on that  transaction from the interest earnings alone. That is Abu Dhabi's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…that the use of deadly force is  always  thoroughly investigated. When Renee Good was shot to death, Kristi Noem  declared her a domestic terrorist within hours. The only investigation  Noem was interested in was an investigation into Renee Good's widow.  That is not justice. That is not security for the American people.\n\nFourth, Republicans refused to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699358/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…former Governor Rick  Scott claimed erroneously that there were hundreds of thousands of  undocumented immigrants registered to vote in Florida. He launched this  massive investigation and spent all kinds of money investigating it. It  was essentially a witch hunt.\n\nI would ask my colleagues if they know how many people were  prosecuted in that or convicted…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…and that recommendations from these reports can be  revolutionary to how they fight fires and save lives.\n\nNIOSH produces these reports through its Fire Fighter Fatality  Investigation and Prevention Program, which was already significantly  understaffed, with only five investigators investigating these  incidents across the Nation. At this staffing level,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…that considers the criminality involved.\n\nYet another Trump lackey, our Attorney General, who is officially  supposed to be the people's lawyer, is ruling out a criminal  investigation into this scheme altogether.\n\nMr. Speaker, these are the same people that spent the better part of  a decade looking into Hillary's emails. They evidently do not care to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…protesting the desecration of the sacred  Scripture of Sikhs.\n\nThe killing, which took place in the Punjab region of India on  February 4, 1986, was absolutely abhorrent, but the investigation was  definitely deplorable.\n\nThe victims' bodies were disposed of in secret. No perpetrator was  ever brought to justice, and reports, commissions, and other inquiries…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699986/housing-is-a-human-right"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…aren't enough  walk-backs or pivots in the world to erase the truth. Their actions  have unnecessarily harmed America's disaster response ecosystem.\n\nLast week, I demanded an investigation into what role, if any, the  administration's staff cuts to local and National Weather Service  stations played in this tragedy. It is now clear that the  administration…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President's  friends, when a Justice Department can be told: You shall not look  further into the $50,000 in bribe money taken from a top White House  official; close down that investigation. You shall look no further into  the corruption of the mayor of New York; close down that investigation  because that mayor is useful to the administration politically.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…millions of jobs.\n\n--Medical institutions, like the CDC, NIH, and major       research centers around the country must defend science with       non-partisan funding of medical investigation and warn of the       dangers of abandoning global engagement on pandemic       prevention.\n\n--Universities and media must protect free speech. Without       a unified…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…residence of  Representative Cory Mills.\n\nWhereas, the first police report, provided to NBC4 Washington by a  source and confirmed by a second source familiar with the  investigation, said that the 27-year-old woman accused her significant  other for over a year of having grabbed her, shoved her, and pushed her  out of the door, and also said that the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…she left Charlotte and Raleigh. We have all seen what happened.  An ICE officer shot and killed Renee Nicole Good in cold blood.\n\nWithout knowing any of the facts or an investigation, Secretary Noem  lied about what happened. She called a beloved 37-year-old mom a  domestic terrorist.\n\nSecretary Noem and her rogue agents are the ones terrorizing our…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…ICE facilities are inhumane and  unsanitary.\n\nImmigrants are being treated without basic dignity and being denied  medical care. I am calling for a full and transparent investigation  into Marie's death, and I will be visiting the Broward Transitional  Center very shortly. It is this neglect and cruelty that is really  hurting our American families…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690462/immigrants-are-being-treated-without-basic-dignity-and-being-denied-medical-care"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…decade ago,  Burma's military junta engaged in a violent persecution of the Rohingya  minority, forcing 1.5 million people to flee to Bangladesh and  Thailand. A recent investigation by the United Nations concluded the  2017 attacks were a ``coordinated and organized operation'' to strip  the Rohingya of their land rights within the country. In 2022,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…challenge.  The bill directs the creation of a joint interagency task force led by  the Cybersecurity and Infrastructure Security Agency with support from  the Federal Bureau of Investigation.\n\nThis task force will bring together the agencies responsible for  overseeing individual sectors, the intelligence community, and other  Federal partners. The purpose…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Representatives quickly pass this  legislation or amend it and pass it so we can find consensus.\n\nI want to commend NTSB Chair Jennifer Homendy and her team on their  thorough investigation of the crash. Their report will guide Congress  in the coming weeks in our efforts to ensure safety in the skies.\n\nIn addition to passing and implementing the ROTOR Act,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…117-328), or the Financial Services       and General Government Appropriations Act, 2024 (title V of       division B of Public Law 118-47) for the new Federal Bureau       of Investigation consolidated headquarters facility in the       National Capital Region that were subsequently transferred       pursuant to a notification received by the Committees on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…organizations and countries using matching funds from private  donors and other countries.\n\nThe SFOPS bill, of which this is a part, already addresses concerns  about the ongoing investigation. This organization, which I have  visited in the field over the last decade, has a long and strong record  of delivering results. This one event today being misrepresented…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699438/consolidated-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…In December 2024, the University of Delaware paid $700,000 for not  disclosing that a faculty member receiving a NASA grant taught at a  Chinese university.\n\nA 2024 joint investigation between the House Select Committee on the  Chinese Communist Party and the House Committee on Education and  Workforce found 21 joint U.S.-Chinese education institutes.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…unintended consequences.\n\nThat is why I have long believed that the best way to honor victims  of aviation accidents is for Congress to wait until the NTSB completes  its investigation so that Congress first has all the facts.\n\nOn January 29, 2025, an Army helicopter collided with an American  Airlines flight while on final approach to Ronald Reagan Washington…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…additional  resources come to bear. You are going to see the ATF, the DEA, Homeland  Security, continued sources from the FBI, Tennessee Highway Patrol, the  Tennessee Bureau of Investigation, the U.S. Marshals Service. They are  all going to be there to support the Memphis Police Department.\n\nThis is going to be important to do to make certain that this  crackdown…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…line of duty, but who is subject to an official       finding of wrongdoing, shall not be eligible for the medal of       sacrifice established under subsection (a).\n\n(B) Investigation.--In the case of an official finding of       wrongdoing, the Commission established under subsection (c)       shall investigate the circumstances surrounding the law…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…enforcement information.--In preparing and       submitting a report under subsection (e), the Secretary shall       ensure that information that may jeopardize an ongoing       investigation shall not be included in the contents of the       report.\n\n``(5) Definitions.--In this subsection--\n\n``(A) the term `appropriate congressional committees'       means--…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…where students are subject to Chinese Communist Party  propaganda under the guise of Chinese language and culture programming.\n\nIn fact, a recent Parents Defending Education investigation found  that 143 schools across 34 States hosted a Confucius classroom or  otherwise had ties to the Chinese Communist Party. But wait, Mr.  Speaker, there is more. Disturbingly,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…be used or disclosed by       any officer or employee of the United States for purposes       other than the purposes of this section, except--\n\n(I) in furtherance of an investigation or the prosecution       of a criminal act; or\n\n(II) when disclosure of the information would be--\n\n(aa) to either House of Congress, or to the extent of       matter within…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…the residence of  Representative Cory Mills;\n\nWhereas the first police report provided to NBC4 Washington by a  source and confirmed by a second source familiar with the investigation  said that the 27-year-old woman accused her significant other for over  a year of having grabbed her, shoved her, and pushed her out the door,  and also said that the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Chinese nationals as the one discovered in Reedley. We know a lot about  the one discovered in Reedley because I requested a report from the  House of Representatives, an investigation which resulted in a report  by the House Select Committee on the Chinese Communist Party.\n\nI want to share some of the details of that report, but I will start  with its…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…equipment out of their networks.\n\nIn 2022, the Justice Department charged two Chinese intelligence  officers with an unsettling crime: attempting to obstruct a Federal  investigation into Huawei by stealing sensitive case material from a  U.S. District Attorney's Office.\n\nColleagues, I pose to you this question: Why would the Chinese  Government go…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…will not       be tolerated, and those involved will be brought to       justice,'' said Special Agent in Charge Maria Thomas for the       Department of the Army Criminal Investigation Division,       Central Texas Field Office. ``The Army community, and the       public, can rest assured that we remain committed to       aggressively pursuing anyone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]