[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "Ms. KELLY of Illinois. Mr. Speaker, I thank Representative McClellan  and Representative Carter for inviting me to speak tonight.\n\nMr. Speaker, I rise today because there is a gun violence epidemic in  America.\n\nI have spoken loudly and clearly on gun safety again and again and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…thank the Congressman from Alabama (Mr.  Figures) and also Congresswoman Bynum from the State of Oregon and the  chair of the Black Caucus, Yvette Clarke of New York, for inviting me  to speak this evening.\n\nMr. Speaker, as we celebrate Black History Month, I rise to honor an  extraordinary American hero that I had the great pleasure to know from  my…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…mom and dad.\n\nThen I sat, and I thought of the pain and the torment of Charlie  Kirk's family as they try to cope with the killing of their dad.\n\nToday, Mr. Speaker, I am inviting Americans across the Nation to do  the same. I invite them to sit for a few minutes in the pain of these  two families. If they can feel compassion for one family and not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695814/bringing-compassion-to-our-nation"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…down and brainstorm  together? You can't get to a common purpose if you can't even talk to  each other. You are here. Your office is open. You are available to  talk. You are inviting them to talk. They are saying no. That is a  travesty in our Republic.\n\nMr. MERKLEY. That is horrific that he is flying away. He absolutely  should be sitting down right now…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…proposed to all Orthodox churches that September 1st be celebrated as a  special day of prayer for the environment. In 1995 he started a series  of environmental conferences, inviting prominent scientists, political  leaders, theologians, ecologists, and journalists to embark on weeklong  trips to examine the destruction that pollution has caused on major…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Russell Vought have  made clear they want to continue launching partisan broadsides that  will inflict deep harm on the American people, raising costs,  unleashing chaos, inviting even deeper corruption across the Federal  Government.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…marketplace.\n\nThe second proposal is the Self-Insurance Protection Plan which would  prohibit the Department of Labor and States from ever regulating stop- loss  insurance, inviting nefarious practices that could hurt consumers and  employers by creating loopholes for plans that will escape any  regulatory oversight.\n\nFurther, Mr. Speaker, this plan does…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…servicemembers acting like vigilantes to enforce this  policy either by surveillance, profiling, or physical inspections. Our  servicewomen go through enough. We shouldn't be inviting even more  harassment. We don't need this amendment opening up the Pentagon and  the entire U.S. Government to a massive lawsuit.\n\nThis isn't good policy. This doesn't protect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…White House bathrooms with marble and gold, throwing a ``Great Gatsby''  Halloween party for the richest friends, and passing tax cuts for  millionaires and billionaires or inviting Senate Republicans down for  breakfast as Americans, many of them, struggle to pay for their own  breakfast.\n\nIt is time for this administration to stop this chaos. Families…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…bolstered at our expense.\n\nAcross Africa and Latin America, Chinese Ambassadors are giving  interviews focused on the unreliability of the United States as a  partner. They are inviting local officials to all-expense-paid trips to  Beijing to discuss further cooperation.\n\nChina is now replacing a canceled American program for child  nutrition in Cambodia,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…went to his home and raped  and abused underage girls or saw underage girls being paraded, are all  hidden. They are all redacted.\n\nIt is a little bit of a farce. They are inviting all the Members of  Congress to go see the Department of Justice's ``unredacted files,''  but they have got all redacted files from the FBI.\n\nIt is not the fault of the Justice…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…not  a full Senator until you get ripped by John McCain's anger.\n\nMr. BOOKER. And I never got ripped by him. After my meeting, I  mentioned earlier in his office, he started inviting me with him. My  first codel was with him. He told me all the time: Booker, there are  two types of Senators here. I don't mean to cast any aspersions on  others, but there…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the  agency from ever issuing a substantially similar rule on this same  topic. That means any rule regarding off-road access in this park unit.\n\nThis repeal is practically inviting a court to strike down whatever  fallback rule the administration tries reverting to, and when that  litigation ensues and they comb through the Congressional Record to  divine…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Mrs. Wilkes', this means  gathering around tables set for 10 where guests take a seat, share a  meal, and leave as friends. Every day at 11 o'clock, the doors swing  open, inviting everyone to enjoy a rotating menu of classic southern  home cooking all served family style.\n\nThe meal is always a surprise. You never know what the day's entrees  and sides…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…officers, too.\n\nThe fact is, we are letting the inmates not just run the asylum, but  letting the inmates run our communities. Then, under the Biden  administration, we are inviting other countries to dump their prisons  out into our communities. The radical progressives who allowed that to  happen, supported it, and encouraged it are now attacking President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, I thank my good friend, the  gentleman from Florida, our new chairman of the Subcommittee on Space  and Aeronautics, for inviting me to join him tonight. I am excited to  join him as a new member on the subcommittee and highlight Utah's  exciting role in the future of space exploration.\n\nWhen we think…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…through photographs and a  timeline, now displayed along the walls of the new marina.\n\nYou could not find anyone more passionate about lake life than Tony  Sloan. He enjoyed inviting families and friends to the dock for a good  fish fry and ice cream, while watching folks water ski and jump waves  with tubes, cruisers and pontoons. Tony was proud to  host…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…it should apply to partnerships.  The notice is within the Treasury's authority, but the Democrats  dislike the outcome.\n\nApproving this resolution would revive ambiguity, inviting audits,  litigation, and significant compliance costs. Therefore, I register my  objection when the unanimous consent request is made.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nI found refuge every morning hiding\n\nUnder my grandpa's inviting, embracing Tallit\n\nOf black and white woven of the tapestry\n\nOf a survivor's spared life,\n\nA wondrous cloth, never abandoned nor lost,\n\nHe managed to safeguard on the run…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…takeover of our  country, we will soon be called the ``United Caliphate of America.''\n\nIf the previous administration prioritized protecting American  citizens instead of inviting terrorists to our country, Sarah Backstrom  may still be alive today.\n\nThanks to President Trump, a travel ban has been placed on Afghans,  along with people from 18 other…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}]