[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…``barbaric'' and ``one of the  most severe invasions of personal rights imaginable.''\n\nJudge Pratt went so far as to raise questions not put before the  court by parties and invite the Florida attorney general to intervene  and weigh in on these questions.\n\nHe wrote an opinion holding unconstitutional a Florida law that  allows minors to seek abortions…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't have to call the insurance  company because their claim was denied. They don't buy their own  groceries. If you have a private jet, an offshore bank account, and an  invite to Mar-a-Lago, go ahead and support your Republican  Representative. If you are a regular person who feels like you are  getting screwed over, and if you are fed up with the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…statues  and remove the gravestones of Jackie Robinson, that does not help with  military cohesion. If there is one of our colleagues that is watching  us in the Chamber, we invite you down so we can have a debate, a  discussion on DEI and stop the polarization and racializing this. They  find it okay.\n\nMr. Pete Hegseth finds it okay to resurrect the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…has enormous  personal meaning for all of us who have served in the U.S. Marine  Corps, including for my son Matthew, who was in Helmand Province. I am  hopeful that he will invite his younger brother to one of the Marine  Corps balls. Michael served as a Navy SEAL.\n\nThis occasion is joined by our colleagues Senators Gallego and Young,  also marines,…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Florida congressional  Democrats last week. We were ready to do our jobs. Somehow word got out  to the DeSantis administration that we were showing up, and so they  decided to invite us at the same date and time we were going to show up  anyway.\n\nWe took them up on that. We went in the facility. I am here to talk a  little bit about my experiences there.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and enduring friendship throughout the years. He has been  a source of encouragement during my time in Congress, and I am proud to  have called him my friend.\n\nMr. Speaker, I invite my colleagues to join my wife, Vivian, and me,  along with the 765,000 residents of Georgia's Second Congressional  District, in extending our heartfelt condolences to Overseer…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…impossible to ensure working people like Chuy Garcia, like  me, and so many others here, are well represented in the face of  moneyed interests set on their destruction.\n\nI invite you today to vote ``no'' on this performative, bad- intentioned resolution, and join me in getting dark money out of  politics, protecting and expanding voting rights in America,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Through this annual event, John and Amy present the community with a  story of renewal--a symbolic sharpened pencil to write new love letters  or thank-you notes with--and invite folks to reflect on all of the  things they have done in the past year and welcome in the next.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692927/lake-of-the-isles-pencil-sharpening"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to invite my House colleagues to  join Congressman Joe Neguse of Colorado and me in recognizing the  critical importance of the native plants of our country by cosponsoring  our resolution…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…final passage.\n\nMrs. DINGELL. Mr. Speaker, I will note that I have no further  requests for time. I thank my colleague from Michigan (Mr. Tiffany) for  supporting this bill.\n\nI invite all of my colleagues to join me fishing on the Great Lakes.  It might be good therapy for this institution.\n\nMr. Speaker, I urge my colleagues to support the legislation, and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…said: You don't.\n\nUnfortunately, it undermines public confidence in law enforcement  across the board. To allow these masks and to not require carrying  video cameras is to invite the problems which we have already  witnessed.\n\nICE is not a secret police force. It wasn't meant to be, despite what  President Trump may wish.\n\nSecond, we need to end the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…research, heart  disease deaths dropped 75 percent over the past 40 years.\n\nIf the majority wants to have a debate about whether it is worth  curing diseases, then let's have it. I invite my colleagues to explain  to their constituents why they are fighting cancer or Alzheimer's.\n\nMr. Speaker, I urge Members to reject those devastating cuts and  stand up for…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690846/national-institutes-of-health"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…inventors have been busy  inventing our new energy future inside our borders right here at home.\n\nMr. President, if your staff allows you to watch this speech, I  personally invite you to join me with members of our American energy  team. We will show you the new energy future that is developing right  here inside our own Nation. They have you captured…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…you visited me.\n\nAnd the righteous will say: Lord, when did we see you hungry and feed  you, or thirsty and give you something to drink? When did we see you a  stranger and invite you in, or you needing clothes and we clothed you?  When did we see you sick or in prison and go to visit you?\n\nThe king will reply: Truly, I tell you, whatever you did for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…continue what we did a year ago--11  out of 12 bills passing out of the Senate committee in a hugely  bipartisan fashion--if one side comes back and breaks the deal? I would  invite my Republican colleagues: Come to the floor and explain to me  how breaking the deal that you were participating in a year ago is an  honorable thing to do, and explain to…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…resolution. Oh,  we have a saving clause. We have a rule of construction that says our  troops can defend themselves.\n\nOnce again, they are misleading the American people. I invite you to  read it closely. They may allow our sailors to defend themselves if  these Houthi terrorists shoot a missile or a drone directly at their  ship, but it absolutely ties…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…Hunterdon Art Museum Young Artist  Award recipient and has been featured in the Holland Brook School  Bobcat Bulletin. She also maintains straight A's in all core subjects.  I invite my colleagues to join me in honoring Sadie and her remarkable  achievements, and I look forward to seeing Sadie continue to be  successful both on and off the field for years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are their blue and yellow ribbons  today?\n\nAll the sanctimonious preaching sure is silent because they can't  bear to acknowledge that if you don't enforce the law, if you invite  criminals from around the world into our country with open borders, if  you let criminals on our streets with foolish policies by radical  judges and district attorneys, then,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Habitat program to Hernando  County individuals and families. Mika has worked with Habitat's  external relations team to create social media videos to promote major  events and invite people to apply to the Habitat program. Habitat will  celebrate the completion of its first home in Hernando this June. When  that happens, Mika will be one of the first in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691741/recognizing-mika-rotunda"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…quite honestly, it is a travesty to me that we  should have to pass such a bill that only American citizens vote in  American elections. That should be obvious.\n\nYou don't invite some person from some other State or some other town  into your home to ask them about your important family decisions. Yet,  somehow in America, my friends on the other side…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Outreach.--The Assistant Administrator shall--\n\n``(1) host webinars and outreach events in various regions       of the United States for rural small business concerns; and\n\n``(2) invite representatives from district offices of the       Administration, resource partners, Federal and State       agencies, and other interested persons to participate in such…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Ms. EDWARDS. The Chair is now honored to invite the Speaker of the  House,   Mike Johnson of Louisiana, to address all Members.\n\nMs. EDWARDS. I thank the Speaker so much for giving your time out of  your incredibly busy…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…remove. After the  core samples, then you have a mining plan that tells you where the  material is moved. In this case it is not an open-pit mine. It is  subsurface.\n\nI would invite my colleagues to look at the science and look at the  water tables. They say 100 percent of the mines in the past were  pollutants. They are not pollutants if you have a mining…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…McGovern to take full advantage of our unlimited debate rules in the  Rules Committee to make sure that that happens, and I see my second  sunrise in a couple of weeks here.\n\nI invite my colleagues to set aside the theatrics and focus on the  work at hand, and I encourage my colleagues on the other side to prove  me wrong.\n\nOnce again, my colleagues across…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "James Risch", "party": "Republican", "sentence": "…business of flying drugs into the United States-- drugs that kill our children and hurt our country and destabilize our  hemisphere--in violation of U.S. law, and when you invite Russia,  China, and Iran to set up shop right in our backyard and do the things  that they are doing, there is going to be a price to pay. Maduro is  paying that price today.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…with that and maybe finish with another anecdote.\n\nThe reason we are introducing this resolution is to condemn the  horrors of socialism, and I am presenting just the facts. I invite my  colleagues on the other side to vote to condemn this nefarious  ideology.\n\nThis has nothing to do with political parties. This is not a  Democratic issue. This is not a…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we are now entering a time of a shortage of young people--in 2027,  not that long from now, we actually go negative of prime-age workers.\n\nMaybe our committees should maybe invite in a demographer and talk  about saying, is this Republican or Democrat? Starting in 1990, we  started to roll over the number of children we had. Now we are paying  the price…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…spend on public safety, on our national security, or on helping  working families get ahead.\n\nWe owe taxpayers accountability, stronger oversight, and closed  loopholes that invite abuse.\n\nProtect the taxpayers. Protect the programs, and punish the scammers.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699028/trust-versus-waste"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…patrons, the Waterville Hotel  embarks on its third century with the same spirit of resilience,  innovation, and community pride that has carried it this far.\n\nMr. Speaker, I invite my colleagues to join me in celebrating the  Waterville Hotel's bicentennial, a symbol of heritage, community, and  hope.\n\nMay its doors open to new chapters for generations…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…net. There is no doubt in my mind that J.T. will do  everything in his power to ensure that the United States men's hockey  team brings home gold at the Olympics in Milan.\n\nI invite my colleagues in the United States House of Representatives  to join me in congratulating J.T. Miller on his selection to the Team  USA hockey roster for the 2026 Winter Olympics.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699838/congratulating-jt-miller-on-his-selection-to-the-team-usa-hockey-roster-for-the-2026-winter-olympics"}]