[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…not on the dairy program,  not on the Fiscal Responsibility Act--not ever. Never used in  reconciliation.\n\nSo, colleagues, two big issues are here. Are you really going to  invoke, for a bill that causes over $3 trillion in debt over 10 years  compared to current law--are you really going to invoke, for a  reconciliation bill that, for the first time,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…permanent resident or an  undocumented person and they could have been deported anyway, that is  already taken care of.\n\nI know that those are the lurid episodes that we want to invoke for  this legislation, but that is not what this legislation is about.\n\nIn any event, it doesn't do anything to reduce drunk driving in  America. Let's reduce drunk driving…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…else.       I think it's very apropos on the wake of the many faith       events that we have been at celebrating the life and legacy       of Dr. Martin Luther King Jr., to invoke one of my favorite       adages, which is, when you pray--and we have been doing a lot       of that, and I certainly do that as a woman of faith myself--      move your feet.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Shumate,  of Virginia, to be an Assistant Attorney General. Had I been present, I  would have voted no.\n\nI was necessarily absent for rollcall vote No. 298, the motion to  invoke cloture on Executive Calendar No. 49, David Fotouhi, of  Virginia, to be Deputy Administrator of the Environmental Protection  Agency. Had I been present, I would have voted…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692470/vote-explanation"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "Mr. WARNER. Mr. President, I was absent on Saturday, August 2, 2025,  for rollcall vote no. 485. Had I been present, I would have voted nay  on the motion to invoke cloture on Executive Calendar No. 186, Andrew  Puzder, of Tennessee, to be Representative of the United States of  America to the European Union.", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694675/vote-explanation"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Mr. President, I was necessarily absent, but had I been  present, I would have voted yes on rollcall vote No. 313 on the cloture  motion, Motion to Invoke Cloture: Gary Andres, of Virginia, to be an  Assistant Secretary of Health and Human Services.\n\nI was necessarily absent, but had I been present, I would have voted  no on…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692680/vote-explanation"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Mr. LUJAN. Mr. President, I was unavailable for rollcall vote No. 21,  on Motion to Invoke Cloture on the nomination of David Clay Fowlkes to  be United States District Judge for the Western District of Arkansas.  Had I been present, I would have voted nay.\n\nI was…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699909/vote-explanation"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Mr. President, I was necessarily absent, but had I been  present, I would have voted yes on rollcall vote No. 210 on the Cloture  Motion (Motion to Invoke Cloture: Lt. Gen. John D. Caine (Retired) to  be Major General in the Regular Air Force).\n\nI was necessarily absent, but had I been present, I would have voted  yes on rollcall…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690460/vote-explanation"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…violent crime reached a more  than 30-year low in D.C. in 2024 and is down 27 percent this year  compared to the same period last year. President Trump is the first  president to invoke section 740, but his invocation is unlawful. While  one crime is too many, there is no emergency or federal purpose that  allowed President Trump to invoke section 740.\n\nSection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…bottom  line is that the SAVE Act suppresses the votes of women; Black, Brown,  and indigenous people; veterans; and working-class Americans.\n\nIn advancing it, Republicans invoke those historical policies that  were intended to disenfranchise Americans. Let me remind Members what  they were: literacy tests and poll taxes for eligible voters,  grandfather…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Nothing. Worse  than nothing, they have tied their own hands with a gimmicky bill that  they passed to create a false legislative day that never ends so that  they can't even invoke Congress' Article I trade authority and put some  sensible sideboards on this trade and tariff policy.\n\nIt is madness, and the gentlewoman is right. We are outraged.\n\nMr. HUFFMAN.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Illinois, and  the litigation will go forward.\n\nBut here is the threat, the really dire and dangerous threat:  President Trump has said that if those challenges prevail, he will  invoke the Insurrection Act. He has said that if courts or Governors  delay the deployment, he will invoke an act that is 217 years old,  which was written after the Whiskey Rebellion…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, I was necessarily absent for rollcall vote  No. 415, motion to invoke cloture on the nomination of Bradley Hansell  to be Under Secretary of Defense for Intelligence and Security. Had I  been present for the vote, I would have voted nay.\n\nI was…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694603/vote-explanation"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…drafting the Constitution, the emergence of Donald Trump, the emergence  of someone who said we should nationalize the elections, the emergence  of someone who said that he could invoke the Insurgency act in order to  put marines--an army--on the streets of America during election times  in order to serve the will of the President so that he would not have…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…2025, I was unavoidably  absent for the following rollcall votes. My absence was due to an  unavoidable conflict.\n\nFor rollcall vote No. 544, On the Cloture Motion (Motion to Invoke  Cloture: Motion to Proceed to S. 2882), a bill making continuing  appropriations for the fiscal year ending September 30, 2026, and for  other purposes, I would have voted…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696064/vote-explanation"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Mr. BOOZMAN. Mr. President, had I been present and voting on rollcall  No. 628, motion to invoke cloture on Executive Calendar No. 474,  Matthew E. Orso, of North Carolina, to be United States District Judge  for the Western District of North Carolina. I would have voted…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697481/vote-explanation"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…shelter while transportation is being  arranged.\n\nDeportation is not a punishment and requires no criminal charges. It  is a simple administrative act. Challenging it does not invoke a right  to freely enter and stay indefinitely. You either wait here in  detention or in another country that will accept you. Those are your  options.\n\nReportedly, more than…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad I been present for the rollcall vote No. 651, on the motion to  invoke Cloture on the Nomination of Douglas Weaver, of Maryland, to be  a member of the Nuclear Regulatory Commission, my vote would have been  in the affirmative.\n\nMy absence is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…mandate? No\n\nContains private-sector mandate? Yes, Under Threshold\n\nH.R. 3716 would require several federal agencies to report       to the Congress if federal banking regulators invoke an       emergency determination known as the systemic risk exception.       Systemic risk is the possibility that the failure of a       financial business, market, or product…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…President, I come to the floor this afternoon to  speak in strong support of the appropriations package that will soon be  pending on the Senate floor. We overwhelmingly voted to invoke cloture  on the motion to proceed last night, and so we are in a good place with  these appropriations bills. As we were talking yesterday on the floor,  we are appropriating…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…can have the power to put on tariffs. It never says that.  This will be an extraordinary use of something never intended to be a  way to have--unilateral--one single person invoke a tax on the people.\n\nWith regard to tariffs, let's be very clear. Tariffs are simply  taxes. Tariffs don't punish foreign governments. They punish American  families. When…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "Ms. SALAZAR. Mr. Speaker, I am here today because I oppose this  resolution. It is fundamentally flawed. It is trying to invoke the War  Powers Resolution of 1973, which doesn't even apply in the case of  Venezuela.\n\nThe War Powers Resolution applies when there is active combat with  the United States…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Speaker. In 4 years, the Biden administration did not  enforce section 117. Despite the Trump administration's uncovering and  investigating, the Biden administration didn't invoke section 117 at  all, not once.\n\nLet's turn to some more recent examples.\n\nIn April 2023, the former chair of Harvard University's chemistry and  chemical biology department…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]