[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…underrepresented today in biomedical  research. In its endless quest to cancel any program that even uses the  word ``diversity,'' the Trump administration has even paused research  involving women.\n\nMake no mistake, we will be feeling the impact of these cuts for  decades to come. Universities are pausing graduate student admissions  because they aren't sure…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…years, and they cannot provide us a single  case where this problem exists. In fact, courts have readily  distinguished between deadly force and intermediate force in cases  involving law enforcement.\n\nThey don't have a single case. They just say that some State attorney  somewhere heard from another lawyer they were nervous about it. Mr.  Speaker, come…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…use of payment  apps is only increasing, with lower income households experiencing a  disproportionate share of complaints.\n\nBetween 2018 and 2021, fraud-related complaints involving Venmo, Cash  App, and other payment apps surged by over 460 percent while financial  losses skyrocketed by more than 360 percent.\n\nCandidly, we should be working together…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Supreme Court: ``Equal  Justice Under Law.'' They cherish that value in their heart that we  aspire toward a vision where everyone is accountable.\n\nPlus, in this particular case involving Jeffrey Epstein, every single  one of us, all 100 Senators, know that Jeffrey Epstein was a monster, a  monster who groomed and abused underage children, a monster who  trafficked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…father of a former committee  Republican staffer, and I believe that she is in the gallery today with  her mother. Dr. Hnat was tragically killed as the result of an accident  involving a retractable awning. We must act to ensure that other  American families do not suffer a similar tragedy because of problems  with retractable awnings.\n\nHowever, compliance…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the society has maintained the  historic Bush-Lyon Homestead and has been able to follow through with a  host of different items for this building that was built in 1760,  involving the community and activities at that site: celebration of  historic dates, fairs and festivals, and important seminars.\n\nThis month, in concert with the Village of Port Chester…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…what his global tariff regime is--without any vote  in Congress, purely on his own say-so, and to engage every nation in  the world in a trade war on his own say-so without involving Congress.\n\nPresident Trump has said in the past: ``I alone can fix it,'' and we  know that that statement is false. No one alone can fix the big  challenges facing our Nation.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…that are being  brought up are cases where those people are already deportable under  current immigration law.\n\nMany serious DUI crimes are considered what is called a crime  involving moral turpitude and, therefore, already make someone  removable or inadmissible. This bill does not recognize how widely DUI  laws differ across the country and the extremely…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…landscape.  They helped fuel the rise of President Trump and were built on baseless  claims about secret pedophile rings, while the real documented case of  child sex trafficking involving Jeffrey Epstein remains shrouded in  secrecy because President Trump refuses to release the files.\n\nMr. Speaker, what is President Trump hiding? Why won't he release the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696814/epstein-files-transparency-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…victor and become the  representative.\n\nThis case went all the way to the Supreme Court as it relates to  Texas. Mr. Lonnie Smith, a dentist in Houston, Texas, took this case  involving all-White primaries all the way to the Supreme Court of the  United States of America.\n\nThe Supreme Court ruled that Texas could not have all-White  primaries. Texas immediately…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Foreign Investment in the United States, also known as  CFIUS, when there is an agriculture-related issue. Recognizing the  importance of safe food and of national security involving agriculture,  H.R. 1713 also requires CFIUS to determine whether a national security  review is necessary upon notification from the Secretary of Agriculture  that an agricultural…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…found that gender-based violence skyrocketed  by 288 percent last year. Again, you can see the impact. According to  UNICEF, 221 children have been raped, including a case involving a 1- year-old baby.\n\nIf this is true, we just can't ignore it as another horrific detail  of a distant conflict. The world is watching, and we must hold the  people who are…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…These tests were conducted to better understand the powers and  effects of nuclear weapons, and the site played a major role in shaping  national and international policies involving nuclear testing and  nonproliferation.\n\nThe radiation, however, given off by the more than 100 atmospheric  tests had devastating impacts on those downwind. The fallout caused…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…decades potentially deportable and inadmissible in the  first instance.\n\nUnder the Immigration and Nationality Act, any noncitizen who is  convicted of or who admits to a crime involving moral turpitude, a so- called CIMT, is generally inadmissible to the country. Likewise, any  noncitizen who is convicted of a crime involving moral turpitude where  a sentence…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…conservative focus following years of state and federal       investigations into allegations of fraud in Minnesota's child       care system and social services, some involving Somali       American business owners.\n\nThat has culminated in what the Trump administration has       called its largest immigration enforcement action, with       thousands…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Big Beautiful Bill Act, as well as to urge that  the DOJ adopt this position in all litigation concerning this matter.\n\nUnfortunately, the DOJ's recent brief in a lawsuit involving NFA  registration defends the draconian NFA firearm registration and ignores  congressional intent.\n\nFirst and foremost, the legal argument to defend and keep the NFA  registration…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the Commission shall do the       following:\n\n(1) Use artificial intelligence for at least 1 of the       following purposes:\n\n(A) Tracking trends with respect to injuries involving       consumer products.\n\n(B) Identifying consumer product hazards.\n\n(C) Monitoring the retail marketplace (including internet       websites) for the sale of recalled consumer…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…appealed;\n\n``(B) the number of such civil actions, disaggregated by       the defendant agency, with a single entry denoting the lead       agency, where applicable, for cases involving multiple       Federal agency defendants;\n\n``(C) the alleged basis for each such civil action,       disaggregated by covered sectors; and\n\n``(D) the status and outcome,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…or their       subject matter. We also reserve the right to seek appointment       of an appropriate number of conferees in the event of a       conference with the Senate involving this measure or similar       legislation.\n\nI ask that you please insert this letter in the       Congressional Record during consideration of H.R. 2643 on the       House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…not just yesterday.\n\nIn Louisiana, we have a sexual predator, an illegal alien from  Honduras, whose criminal history includes active warrants for 394  counts of pornography involving juveniles and two counts of sexual  abuse of an animal.\n\nIn Kansas, a violent criminal illegal alien from Mexico was sentenced  to 20 years in prison for one count of forcible…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…often through cartel       organizations, by imposing the possibility of up to fifteen       years in prison for illegal aliens convicted of three or more       misdemeanors involving drugs or harm against others, or for       illegal aliens who attempt to reenter after being removed       three times. An illegal alien who commits a felony would face…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…(H.R. 758) to direct the United States Postal Service to issue  regulations requiring Postal Service employees and contractors to  report to the Postal Service traffic crashes involving vehicles  carrying mail that result in injury or death, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688400/mail-traffic-deaths-reporting-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…spent away  from family. I know this stuff.\n\nI know what it means to respond to a tragedy, to console a grieving  victim's family after a horrendous crime has happened to them involving  tragic accidents. I have seen things most Americans will thankfully  never have to experience.\n\nWhen others run away from danger, law enforcement and first  responders run…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Trump, has said that he  would sign it. Yet, we have to be realistic about what we are talking  about.\n\nWe vote every day on massive issues. We vote about healthcare  policies involving pharmaceutical companies that make billions of  dollars, massive insurance companies, and massive hospital  corporations. We vote on intellectual property issues in the Committee…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Republicans say: Of course, not.\n\nThe Democrats say: Sure, why not.\n\nThis ought to be a no-brainer, especially after so many incidents of  preventable DUI traffic deaths involving foreign nationals.\n\nThen gentleman from Alabama (Mr. Moore) and the gentleman from  Georgia (Mr. Carter) mentioned a few of the cases of aliens with  multiple drunk driving…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693083/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…or their       subject matter. We also reserve the right to seek appointment       of an appropriate number of conferees in the event of a       conference with the Senate involving this measure or similar       legislation.\n\nI ask that you please insert this letter in the       Congressional Record during consideration of H.R. 747 on the       House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…more  meetings open to the public and ensures that minutes from those  meetings are publicly available after the fact.\n\nThe bill also contains limited exceptions for meetings involving  sensitive information in order to protect TVA's competitiveness and  ability to carry out its mission for its customers.\n\nMr. Speaker, I support this legislation, and I…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692213/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…before the Interior Board of Land Appeals, or IBLA.\n\nThe IBLA is an appellant review board within the Department of the  Interior, and it is tasked with resolving disputes involving public  lands and natural resources under the Department's jurisdiction. This  includes appeals involving the Bureau of Land Management, Bureau of  Ocean Energy Management,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691037/expedited-appeals-review-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…the well-being  of our children.\n\nThrough gender-affirming care, Democrats are indoctrinating children  and causing them to make life-altering decisions about their body  involving hormones and surgery and jeopardizing their health. So-called  gender-affirming care is the genital mutilation and chemical castration  of children. It is not lifesaving…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…following new       subsection:\n\n``(h) Financial Assistance Prohibition.--\n\n``(1) In general.--An associate of a small business concern       who is finally convicted of any crime involving or relating       to financial misconduct or a false statement with respect to       a covered loan or grant shall be ineligible to receive any       financial assistance…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}]