[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to address the ongoing protests  in Iran.\n\nFor decades, the Iranian people have faced human rights abuses,  extrajudicial killings, and economic turmoil.\n\nProtests have been going on for almost a month. The military is  cracking down, and at least…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and he did so decisively. It was a limited, powerful, and precise  strike. It was aimed specifically at Iran's nuclear facilities--not at  Iran's leadership, not at the Iranian people. And here is more good  news: No American lives were lost--absolutely none.\n\nThis was a powerful message to Iran, but not just to Iran--also to  Russia, to China, to North…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…for asking me here to talk about this important subject.\n\nMr. Speaker, I came to speak because the cause of Iran is not just a  cause that we should care about for the Iranian people, though we  should. As Americans, we are a people whose country was founded because  a group of people were unhappy by the tyranny we faced. There is no  question they…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…economic pressure on those who  continue to support and sustain that regime. These measures send a  clear message: The United States will not ignore the suffering of the  Iranian people, and the exploitation of the Iranian people must end.\n\nThe newly imposed 25-percent tariffs on countries doing business with  Iran are designed to strike at the economic…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…planes to  these bloodthirsty mullahs in hopes of currying their favor and  cooperation. However good the intentions, the result was to help fund  the oppression of the Iranian people and the export of terrorism  throughout the world.\n\nI believe the time has now come to provide the same assistance, not  to the oppressors of Iran, but to the people of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…brave Iranians who are protesting a repressive regime that has  wrecked havoc on its own people, the region, and the world at large.  The United States must stand with the Iranian people in this critical  moment.\n\nFor decades, the Iranian dictatorship has exported terrorism  throughout the Middle East and beyond, while tormenting its own people.  At this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698899/standing-with-brave-iranians"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…they were chanting, ``Death to America'' while they were  swearing in their President. We don't do that here. Why? Because we are  not crazy. These people are crazy. The Iranian people are not, but the  people ruling the place are fanatical religious Nazis. If you don't  think it is our concern, you really have missed a lot. You need to  study before…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…don't reward this behavior.\n\nVote no to Senator Kaine's proposal. Stand up for the Constitution as  it has been implemented for over 250 years. And all of us pray for the  Iranian people and for our friends in Israel that better days are  ahead. And these better days only come with sacrifice.\n\nAnd as I speak, people in Iran are sacrificing because they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Texas. Mr. Speaker, I want to say that tonight I rise to  speak as we continue to examine what is unfolding before us. It is  important to remember that the fight for the Iranian people is not some  distant, unfamiliar struggle. In many ways, it echoes the very  heartbeat of our very own American story.\n\nLong before America became the beacon of liberty…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}]