[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…not getting into wars a central premise of his campaign. It  scrambled the political coalitions. It really did. There were a lot of  young veterans who came back from Iraq and Afghanistan and said, ``What  the hell is the Democratic Party even for if not to be the party of  peace?''\n\nIt doesn't mean that we are opposed to the use of force in all  situations.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Bush-Cheney fantasy  that America can impose its will on a foreign nation through the power  of American military force.\n\nNow, for now, this looks and feels different than Iraq or Afghanistan  because there aren't hundreds of thousands of troops inside Venezuela,  but let's make it clear. This is just a different kind of military  force because the only way…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…territory.  Despite the persistent threat from Russia, Georgians continued to forge  forward with democratic reforms and even made significant contributions  to the wars in Iraq and Afghanistan, as this legislation notes.\n\nHowever, we know too well from the experience in other parts of  Europe and at home that democratic progress is fragile and requires  constant…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…but it was also a burden--of being the commander in chief of the  Virginia National Guard. That meant that I was with our Guard men and  women when they deployed to Iraq and Afghanistan and when they came  home. I went to funerals. I went to wakes. These were very, very moving  experiences.\n\nI visited, as Governor, our troops, our Guard men and women,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…permission by this Congress, by this body, in a bipartisan way, passing  the PACT Act legislation, which funded care for veterans who were  exposed to burn pits in Iraq and Afghanistan and toxic substances from  their military service.\n\nMy resolution is about all veterans who serve this Nation. Some of  the veterans who have been laid off are park…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…next or respect for the men and women who will be sent to  fight this war--will engage in it--is going to cause problems.\n\nHe has shown us he could care less about the Iraq and Afghanistan  veterans who are screaming from the rooftops right now not to make this  mistake again. If we allow this to continue, I will have to look into  the eyes of young men…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698605/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of the protests of veterans  and VSOs who spoke out. And I thank them. I am here to say ``thank  you'' to the American Legion, Veterans of Foreign Wars, the DVA, the  Iraq and Afghanistan Veterans--I could go through the entire list. And  to all the veterans posts and organizations, thank you for helping to  save those jobs and those workers who would…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the bill, MAJ Richard Star, a decorated war veteran and  engineering officer in the Army. He suffered from lung cancer caused by  burn pit exposure.\n\nWe all know about Iraq and Afghanistan burn pit exposure. We passed  the PACT Act to provide care and benefits for victims of those burn  pits and exposure to other toxic chemicals.\n\nThey led to his retirement…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…over and over again? This  country always tries to get into ``limited'' military engagements. That  is what Kennedy said about Vietnam. That is what Bush said about Iraq  and Afghanistan. We may go in with intentions of things being very  limited, but the world has a vote on how things go in these other  countries, and we do not know where Venezuela…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the verge of a war with Iran.\n\nWhen I was elected to the Senate in 2012, having served as a Governor  from 2006 to 2010 during a tremendous upsurge in the two wars in Iraq  and Afghanistan, I visited our troops multiple times in the Green Zone  in Baghdad and in Afghanistan. I went to the deployments and the  homecomings; I went to the wakes and funerals,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…30 years of  public service to our Nation. That service began as a plebe entering  the U.S. Naval Academy in 1996, continued as a naval aviator who flew  missions in Iraq and Afghanistan, as well as missions all over the  world, and then transitioned to Capitol Hill, where he worked as a  staff member at the Navy Office of Legislative Affairs and finally…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…mistreatment. They have shared how these actions are creating fear and  instability in their lives and communities. One Federal worker, a  disabled combat veteran who served in Iraq and Afghanistan, was  recently fired from his job at the USDA. He summed it up perfectly when  he said: ``This is not the America I swore an oath to protect.''\n\nThat is the sentiment…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Venezuela. People voted for  President Trump because he was going to end the endless wars. This  Congress must stand up against another war in Venezuela like we had in  Iraq, Afghanistan, or Libya. The American people do not want a regime  change war in Venezuela.\n\nMr. Speaker, while I have such tremendous respect for the chairman of  the committee and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…have this conversation. These  places, these nations, are our allies. They pose no threat to the  United States. After thousands of brave American soldiers fought in  Iraq and Afghanistan, many losing their lives, their limbs, and their  loved ones, the last thing the American people want is to send our  troops to any new wars, especially against countries…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…our public schools.\n\nMr. Kenneth Singleton has dedicated decades of service to our  community. From serving in the U.S. Army and completing several tours,  including in Iraq, Afghanistan, and Saudi Arabia, his commitment to  service earned him the Meritorious Service Award five times.\n\nFor Mr. Singleton, public service didn't end after the uniform came…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Sun City Center who served in the U.S.       Army during the Vietnam War.\n\nJeffery Camp of Parrish who served in the U.S. Army and       Army National Guard during the Iraq and Afghanistan Wars.\n\nJack Carter of Lakewood Ranch who served in the U.S. Marine       Corps during the Vietnam and Gulf Wars.\n\nCharles Conover, Jr. of Sun City Center who served…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…America, and Korea, to  shaping strategic initiatives at the U.S. Army Aviation Center of  Excellence. He has deployed in support of critical operations in  Bosnia, Egypt, Iraq, Afghanistan, Kuwait, Haiti, and Central America. A  Master Army Aviator and Senior Parachutist, Colonel Tucker holds  advanced degrees in psychology, human resources, and strategic…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…senior leaders alike. Over the course of his  career, General Mingus deployed not once, not twice--nope--not 5 times,  not even 10. General Mingus deployed 12 times to Iraq and Afghanistan,  repeatedly placing himself along soldiers in harm's way and earning the  enduring respect of those whom he led.\n\nHe went on to serve in key staff roles at U.S. Central…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…has more than 6,000 flight hours in the  T-37, T-38, C-141B, C-123, KC-135, C-17A, C-40, C-130H/J, including 279  combat hours in support of operations in Hungary, Iraq, and  Afghanistan.\n\nMajor General Coburn has been a close partner in improving our  Nation's tactical air mobility operations capability through  recapitalization of the Air Force Reserve's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…noted:  According to its website, PACEM Solutions is currently registered and/ or partnered  with trusted local firms to work in the following countries: United  States, Iraq, Afghanistan, Pakistan, UAE, Australia, Kenya, Malaysia,  and Kuwait. Public reports indicate companies owned by Representative  Mills sought or entered into contracts to sell munitions…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…instrumental in the urgent effort to field fifteen thousand Mine  Resistant Ambush Protected vehicles, a lifesaving action that protected  countless troops serving in Iraq and Afghanistan.\n\nDave's contributions to our Nation's missile defense capability are  equally extraordinary. As Product Manager for the Sentinel Radar System  following the September…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…advanced from the enlisted ranks to  the highest levels of leadership within the Iowa Air National Guard.\n\nHis service carried him to many parts of the world, including Iraq,  Afghanistan, Qatar, and Germany. Yet through all his overseas  assignments, his heart remained in Iowa, where he guided and mentored  Guardsmen to ensure they were trained, supported,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "John Carter", "party": "Republican", "sentence": "…school, COL Wilson  honorably served on Active Duty for 29 years and the Texas National  Guard for 3 years. During his career, he courageously served our nation  in both Iraq and Afghanistan. His exemplary service earned him numerous  awards and accolades, including the Bronze Star, Legion of Merit,  Defense Meritorious Service Medal and Army Commendation…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…all travel, lodging,  and transportation. In addition to helping share the stories of WWII  Veterans, he has had the distinct honor of leading battlefield walks  for Iraq and Afghanistan Veterans.\n\nMr. Tarr has demonstrated a steadfast commitment to ensuring that the  sacrifices of our Nation's heroes are not forgotten by future  generations. In 2025,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Shepard, who was  on the scene, said the boy ``was near hypothermic and might well have  died had Danny not found him.''\n\nDanny is an Army Veteran and having served in Iraq and Afghanistan,  he is no stranger to perilous situations. And this specific situation  was personal to him. ``I've got grandkids about the same age, so it  just hit pretty close to…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690127/recognizing-the-heroic-actions-of-mr-danny-wells-of-peculiar-mo"}]