[{"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…without free trade  agreements.\n\nIn other words, this bill assumes automatically and without review  that every LNG export is good for America. That assumption is not only  irresponsible, but it is also dangerous and absolutely false.\n\nAnalyses have shown that increasing LNG exports drives up natural gas  prices here at home. DOE's own review last year…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…clarity they need to  compete with foreign countries, foreign entities that do business in  our markets effectively.\n\nDoing nothing and protecting the status quo is not only  irresponsible, it is unacceptable. Unlike the United States, our global  competitors have moved to regulate the space.\n\nIn 2023, the European Union passed comprehensive cryptocurrency…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…our students and young professionals  to pursue careers in STEM.\n\nFiring our future STEM workforce just as they are getting started in  their careers is shortsighted and irresponsible. These firings will  decimate the future Federal STEM workforce that will keep American  innovation competitive.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…the mother and the unborn child,'' but  Republican's commitment to funneling taxpayer dollars to medical  grifters endangers both.\n\nI urge my colleagues to vote No on this irresponsible bill.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699229/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…borrowed money.\n\nBorrowed money isn't free either. Who is going to pick up the tab on  this? Your kids, your grandkids, and future generations are paying the  freight for this irresponsible tax policy that is coming down the way.\n\nOn top of that, there is another $1.5 trillion in tax cuts that the  Republicans want to add to that. That is $6.1 billion of unpaid-for…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I rise today to discuss the fiscally  irresponsible one big, beautiful bill that simply gives tax breaks for  the richest Americans and takes away services for working- and middle- class families.\n\nHere are the facts: We…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…legally, but you don't need to be a veteran or a member of a  military family to see what this administration has done with our  military. It is divisive, shameful, and irresponsible.\n\nIt is divisive, shameful, and irresponsible for us to ask our  soldiers to act as local police officers, a role that undermines our  readiness for actual conflicts.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…re-imposing wealth-based pretrial detention, these bills       would re-entrench systems that have already been proven       ineffective, discriminatory, and fiscally irresponsible. They       would override the will of D.C. residents, destabilize       communities, and reinstate practices that make the District       less safe.\n\nThe residents of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Much like a family or business, it is ideal to avoid deficits and  debt. However, some level of debt can be acceptable so long as it is  not chronic, not an excuse for irresponsible spending, and remains  proportionate to our overall budget and our gross domestic product  (GDP).\n\nSadly, none of these sound budgetary principles has been followed for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…smarter, and more prepared to  face the challenges of modern warfare.\n\nThe administration's artificial barriers on who can lead and who can  serve are disrespectful and irresponsible. Firing and pushing aside  decorated female leaders who earned their positions diminishes military  readiness and devalues the standards and integrity of the very military…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…communities and rural communities for  sure.\n\nI reject this bill that explodes poverty and suffering while giving  the wealthy trillions in tax cuts.\n\nI reject this bill's irresponsible explosion of the deficit that  triggers statutory cuts to critical programs supporting children and  families. These Paygo reductions would eliminate funding for the  Maternal…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693186/one-big-beautiful-bill-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…transfer of money. It is Robin Hood in  reverse. It is just plain wrong. I have explained now that, in addition  to being morally bankrupt, it is also fiscally reckless.\n\nIt is irresponsible, and I just don't understand how this is the plan  that my colleagues came up with. Their constituents are going to hurt  every bit as much as mine and, statistically,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…please contact Bartlett Naylor.            Sincerely,                                                    Public Citizen.\n\nMs. WATERS. Mr. Speaker, let me reiterate that it is irresponsible to  turn this bill over to the President of the United States, and I  continue to reserve the balance of my time.\n\nMs. WATERS. Mr. Speaker, I continue to reserve the balance…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…SBA or SAMHSA,  not gut them.\n\nUnless you are a mega-donor or a loyal MAGA mouthpiece, you do not  matter to this Republican majority. What is happening here isn't just  irresponsible. Mr. Speaker, it is immoral, and it is a damned disgrace.\n\nMr. McGOVERN. Will the gentlewoman yield?\n\nMr. McGOVERN. Mr. Speaker, I don't like Elon Musk.\n\nMr. Speaker, I…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…breaks for billionaires'' and then, of course, on top of  all that, put forward a plan that runs up $30 trillion in additional  debt over 30 years--probably the most fiscally irresponsible bill ever  to pass through this Chamber. That $30 trillion of additional debt will  so compromise our efforts to take on the foundations for ordinary  families--for healthcare,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…determine  gestational age, rule out life-threatening ectopic pregnancies, and  identify signs of abuse before dispensing mifepristone.\n\nThis change not only poses serious, irresponsible medical risks but  also bypasses pro-life State laws, like what we  have in Georgia, by permitting the shipping of abortion pills.\n\nLet me give you an example. This is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…hurting all Americans, especially the most  vulnerable.\n\nFor example, the Biden-Harris administration attempted to spend as  much as $1 trillion through his illegal and irresponsible student loan  bailouts. Virtually nothing was done to control the cost of Federal  student loan programs, meaning students will be able to take on even  more in student…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…elected officials  and leaders in our community the way that you have described to me this  evening. It is outrageous. Not only is it outrageous, it is dangerous,  and it is irresponsible. It is leading to not only the division of our  country and our communities, but it is leading to people suffering  injuries and worse. That, Representative Roy, is on…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…yielding. I  appreciate the able job that he has done in ushering through a  responsible budget on the House side of the Capitol. Unfortunately, we  are here debating an irresponsible budget sent over to us from the  Senate.\n\nFirst, before my colleagues on the other side of the aisle applaud me  for my opposition to the Senate bill, my colleagues on…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cars being lit on fire, American flags  being burned, and roadways being blocked.\n\nToday, we will stand as a House to condemn these acts of violence and  to condemn the irresponsible politicians who refused to adequately  address them.\n\nI think it is important to understand from the beginning the events  leading to these horrific scenes.\n\nWe should…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…point out that a lot of these employees  are making over $100,000 or $150,000 a year, with anecdotal evidence  that they do very little.\n\nOne of the reasons Congress is so irresponsible is our press corps is  asleep. I hope our press corps digs into this situation a little bit  and publicizes how many people are working in desk jobs in the  Pentagon, desk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…additional spending--$1.5 trillion.\n\nOur national debt is north of $37 trillion. It is climbing. And, of  course, adding another $1.5 trillion for a few weeks is really  irresponsible. In this, they are basically trying to undo what we did-- the steps and the progress that we made when we did the Big Beautiful  Bill, which is truly--truly--a bill for…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…running the  administration.\n\nService on the debt alone increased during that time from $400  billion in 2020 to nearly $1 trillion last year. That is why we must  rein in irresponsible agencies. They have been taken over by  ideologues, Mr. Speaker, doing things that are simply not in the  interest of the people of the United States.\n\nUSAID has done some…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…left calls us Nazis, fascists, and murderers, this might be  hateful and hurtful, but it is speech, nonetheless. It should be  criticized in the strongest possible terms as irresponsible,  inflammatory, outrageous, revolting, and wrong. It should be ridiculed  and shamed.\n\nBusinesses have every right to protect their reputation, and schools  have every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…actuaries said  that those programs are going bankrupt, and the other side just wants  to demagogue and say: Leave them alone; leave them be.\n\nTo let them go bankrupt would be irresponsible. We can make them work  better for the people who are actually here in America who pay into  those programs and who have earned those programs or who had something  bad…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…the past. It will not fix the broken  system they put in place.\n\nMr. Speaker, that is why I rise today in opposition to this  Democratic discharge petition. It is fiscally irresponsible and fails  to address the waste, fraud, and abuse of ObamaCare while ignoring the  real problems in our healthcare system and ignoring the fact that these  temporary COVID-era…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…causing the deficit to double, which increased service on the  debt from $400 billion in 2019 to nearly $1 trillion last year. That is  why this package takes steps to rein in irresponsible agencies. Some  have been taken over by ideologues doing things that are simply not in  the interest of the American people.\n\nMaybe USAID has done some good things, but…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692539/rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, the moment of reckoning for  California Governor Gavin Newsom has arrived. While I have been  fighting to protect Medicaid benefits for Californians, the Governor's  irresponsible actions are now threatening deep cuts for Medicaid in  California.\n\nMr. Speaker, Newsom has made California the only State that offers  Medicaid to everyone in the State…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691000/protecting-medicaid-benefits-in-california"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…marred by breakdowns and setbacks, rendering these ships unreliable at  best.\n\nMr. Chair, forcing the Navy to maintain a fleet of broken and  expensive ships is simply irresponsible. I think it is wrong to take  our Commander in Chief's hands. Our sailors deserve the best and most  reliable vessels to defend our Nation. Every dollar spent on the LCS…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Chair, I thank Mr. Arrington for yielding  this time.\n\nMr. Chair, what is irresponsible, to those watching this debate, is  the truth about the Biden-Harris policies, that when you combine  irresponsible fiscal policy in this Nation over the past 4 years and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688083/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]