[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…this country are asking us:  What are they doing with our data? Why are they inside these systems?  Why are they downloading Treasury payment data? Why are they  downloading IRS data? Why are they downloading our Social Security  data? What are they going to do with it?\n\nThat is why this resolution will demand answers. This resolution,  which has been…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689400/demanding-answers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this bill attacks food stamps. Millions will lose access to  their SNAP benefits, taking food off the plates of hungry families,  seniors, and veterans.\n\nFive, it terminates the IRS Direct File program, a successful, free  tax filing service that helped over 140,000 people file their taxes in  2024.\n\nSix, it increases fees on asylum seekers and dumps billions…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the next Democratic administration? All bets would be  off. Consider mining permits. Consider fossil fuel project approvals;  consider LNG export licenses or offshore leases, IRS tax policies,  foreign policies, and every Project 2025 or DOGE disruption or  overreach. Every Agency action the Democrats don't like--whether it is  a rule or not and no matter…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…for the people who turned to our  office for help.\n\nIn her role as a Constituent Advocate, Kathryn handled a wide range  of complex and often deeply personal issues, including IRS cases,  housing matters, student loan concerns, and many other challenges faced  by families across the district. She approached each case with patience  and determination,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…which we determined that       those rules did not relate to agency management or personnel.       For example, in B-329916, we concluded that an Internal       Revenue Service (IRS) announcement that it would verify       health insurance coverage requirements at the time taxpayers       filed their individual tax returns rather than after their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…everywhere: A $10 billion payout that Donald Trump, the President of  the United States of America, now demands from his own Treasury  Department in a lawsuit that he filed against the IRS.\n\nBy the way, who does he demand pay him this $10 billion? The American  taxpayer. The countless pay-to-play schemes and vanity projects that  have consumed his administration,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…because of the  precedent you could be setting here at this moment.\n\nThink mining permits. Think fossil fuel project approvals. Think LNG  export licenses or offshore leases, IRS tax policies, foreign policy,  every Project 2025 or DOGE disruption. Every Agency action that  Democrats don't like--whether it is a rule or not and no matter how  much time…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…without the help of FEMA, the President  can't declare a Federal disaster, even if taxpayers impacted need  filing relief.\n\nOur bill solves this problem by giving Treasury and the IRS authority  to postpone Federal filing deadlines in response to a request by a  Governor who has declared a State-level disaster, and it would double  the minimum duration of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689384/filing-relief-for-natural-disasters-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…the agency does not substantially affect those parties'       rights or obligations.'' For example, in B-329916, May 17,       2018, we evaluated an Internal Revenue Service (IRS)       Statement announcing that it would be altering the timing of       certain compliance checks it conducted on individual income       tax returns. IRS's previous policy…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Fairness Act.\n\nTaxpayers should have one clear deadline to file documents and make  required payments. Under current law, payments or certain documents  that are mailed to the IRS are considered timely filed as long as they  are postmarked by midnight on the due date. This is called the mailbox  rule. However, if a taxpayer submits certain payments or…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689374/electronic-filing-and-payment-fairness-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…care  for some of our most medically vulnerable constituents isn't just the  right thing to do. It is the smart thing to do.\n\nThe Chronic Disease Flexible Coverage Act codifies IRS guidance to  expand the safe harbor for high deductible health plans offering  predeductible care for chronic conditions. It lets employers offer  first-dollar access to care…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…every time we have considered  this bill. I might say that we tried to overcome this deficiency and  have not yet done that.\n\nIt includes a $438 million or an 8 percent cut to IRS enforcement.  Now, what does cutting enforcement mean? It means that we have gone  from 9 percent in looking at tax returns over a million dollars to 0.6  percent. What incentive…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…but important statutory clarification that the  National Taxpayer Advocate may appoint and supervise her own legal  counsel, rather than only using attorneys that report to the IRS chief  counsel.\n\nBeing able to appoint independent counsel is an essential step to  preserving the independence of the National Taxpayer Advocate Office,  as required under…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing. The law  does not specify how the IRS must describe the math error or require  the IRS to inform taxpayers that they have 60 days to request that the  math error assessment be reversed.\n\nThis bill will fix these…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…that is according to the Joint Committee on Taxation.\n\nNow, it has been the case for decades that these huge corporations  play financial games to conceal their profits from the IRS. That is how  they winnow down their tax rates to single digits--maybe even zero. The  same goes for the private equity giants. They report to their  shareholders and investors…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…passed out of the Ways and Means  Committee last month on a bipartisan basis, and it was unanimous.\n\nIn my district alone, we have seen 376 constituents who have had  stolen IRS checks. The amount is staggering: $5.4 million, and that is  in my district alone.\n\nOut of these 376 cases, 50 times checks were stolen twice, 7 times  they were stolen 3 times,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Americans wondered whether our best  days were behind us. Democrats fueled inflation. They opened our  borders, funded illegal immigration with your tax dollars, and  increased IRS audits on the middle class, all while leaving the working  class behind.\n\nPresident Trump promised to make America great again, and 77  million--77 million Americans supported…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…U.S. Tax Court is the only venue where taxpayers can dispute a  tax estimate without first paying that tax. Taxpayers must stand on  equal footing when going toe-to-toe with the IRS. Without the guarantee  of rights, taxpayers are put in a situation where the  IRS is essentially saying: Heads, I win. Tails, you lose.\n\nMr. Speaker, the Ways and Means Committee…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Act, as amended. H.R. 5346......................  Fair and            None..............  Increase by at     Would increase                                   Accountable IRS                         least $500K.       revenues by $117                                   Reviews Act, as                                            million over 2026-…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "Mr. CRAPO. Mr. President, this isn't about spending $46 billion; it  is about saving $20 billion.\n\nThe Democrats' partisan supersized IRS funding is something we have  been battling over for a couple of years now. It is a textbook example  of the type of out-of-control spending that President Trump and  Republicans…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688897/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "Mr. FEENSTRA. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise today in strong support of my bill, the IRS MATH  Act. I thank my friend from Illinois (Mr. Schneider) for working with  me on this commonsense legislation.\n\nMr. Speaker, if the IRS finds a mistake on a tax return, such…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…and that they can access timely relief. That is why this bill, H.R.  1155, the Recovery of Stolen Checks Act, is so important.\n\nRight now, it can take months and months for the IRS to issue a  replacement for a stolen refund check. That is a long time. Due to the  frequency of mail theft that is happening right now across this great  Nation, many taxpayers…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…across the 18 counties in the  15th Congressional District to assist constituents with issues related  to the Social Security Administration, Department of Veterans Affairs,  IRS, and other Federal agencies. Appointments are not necessary, and I  am pleased that we are available to help those in need. Personally, I  hosted over 1,200 meetings in 2025…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the Federal Government  is their profit model. There are bureaucracies who despise the concept  of saying maybe you should use technology.\n\nI have a report on my desk from the IRS. I have only read the first  three or four pages. It is an analysis of their data. It turns out the  crazy thing, the chat, the computer answering the phone at the IRS, has…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…enacted levels for non-Defense discretionary spending, this bill is a  $140 million cut.\n\nThe Treasury Department is cut by 8 percent from FY 2025 enacted  levels, including the IRS. In fact, the IRS enforcement account is  below $5 billion for the first time since 2021.\n\nThe Executive Office of the President is funded at just over $870  million.\n\nFunding…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…policy, the adoption of technology, and the alignment of  incentives, and we can make the delivery of government services work.\n\nWhen only 31 percent of the phone calls at the IRS get answered, are  we doing our job? You do realize there is technology that would fix  that, but that would anger the union of the government employees there.  There are these…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…and items for chronic conditions that may be treated as       preventive care for purposes of section 223(c)(2)(C) of the       Internal Revenue Code of 1986 as set forth in IRS Notice       2019-45 shall have the same force and effect as if included       in the enactment of this Act.          (b) No Inference.--To the extent not inconsistent with…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…uncovered the details,       the criminal scheme grew, the dollar amount grew, and the       reach of her spending grew,'' said Acting Special Agent in       Charge Lucy Tan of IRS Criminal Investigation's Houston Field       Office. ``Financial crimes have victims, and this one took       opportunities away from the children and families of our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…death file, a database containing records of death       that have been reported to SSA, as of November 2024 and (2)       April 2025 data from the Internal Revenue Service (IRS) on       APTC reconciliation from tax forms filed for tax year 2023.       We assessed the reliability of all data sets by performing       electronic tests to determine the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…wanting to donate her time with us in ``blue skies'' as well.  She completed the agency's stringent 3-day VITA (Volunteer Income Tax  Assistance) training in December and became IRS certified to assist  low-to-moderate income families throughout tax filing season. Donna  volunteers her time as a tax preparer, working one on one with  families, at 3 of 5…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}]