[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…service every day.\n\nThe contributions of Muslims to Virginia should not just be measured  by titles or economic impact; they are seen in generosity, compassion,  and community. Islamic centers and mosques across the Commonwealth step  up to serve their communities with food assistance, refugee  resettlement, youth mentorship, and much more. They open their…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…access to the  outside world.\n\nAmong them is Artemis Ghasemzadeh, an Iranian woman who fled Iran  after converting to Christianity, a crime punishable by death under the  brutal Islamic regime.\n\nArtemis converted to Christianity in secret through a network of  underground churches and online classes in Iran. Last December, she set  out for the United States…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the Libyan Civil       War staging a 2012 uprising in Mali. This was followed by an       explosion of Islamist insurgency, including groups linked to       Al-Qaeda and the Islamic State, that is spreading across the       region today.\n\nTo the southeast, Haftar's troops have been accused of       aiding the paramilitary Rapid Support Forces against…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…and the world. Under the Ayatollahs, Iran  has been the largest state sponsor of terror in the world. It has  financed, trained, and directed Hezbollah, Hamas, Palestinian Islamic  jihad, and the Houthis. For the last 30 years, Iran has marched forward  in the pursuit of nuclear weapons, all while chanting: ``Death to  Israel, death to America.''\n\nLet…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…move  to discharge the Committee on Foreign Relations from further  consideration of S.J. Res. 59, to direct the removal of U.S. Armed  Forces from hostilities against the Islamic Republic of Iran that have  not been authorized by Congress.\n\nMr. KAINE. Madam President, we will begin a couple of hours of debate  on this resolution prior to a vote that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…following:\n\n(1) On January 1, 2025, a devastating vehicular terrorist       attack occurred on Bourbon Street in New Orleans, Louisiana,       when an assailant inspired by the Islamic State drove a       vehicle into a crowd and engaged in a shootout with law       enforcement. This tragic incident resulted in the loss of 14       lives and injuries to…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…ushered a  ``historic opportunity for the long-suffering people of Syria.''  However, many also warned that the potential resurgence of terrorist  groups in the regions, like the Islamic State or al-Qaida, could pose a  significant threat to Americans and U.S. interests in the region and  the homeland.\n\nThe Syria Terrorism Threat Assessment Act is responsive…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697015/syria-terrorism-threat-assessment-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…adopt the resolution,  which states, in part:\n\nCongress hereby directs the President to terminate the use       of United States Armed Forces for hostilities against the       Islamic Republic of Iran . . . unless explicitly authorized       by a declaration of war.\n\nWith continuing threat from Iran against Israel, the dangers to  American military men…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…interest in       agricultural land by a foreign person of the People's       Republic of China, the Democratic People's Republic of Korea,       the Russian Federation, or the Islamic Republic of Iran; and\n\n``(III) with respect to which a person is required to       submit a report to the Secretary of Agriculture under section       2(a) of the Agricultural…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Iran has chosen to not only take their horrific, genocidal, lunatic  policies to kill their own people, to hurt women, and to hurt people  who won't abide by their radical Islamic faiths, but they have done it  to other people around the world. They are the leading sponsor of  terrorism around the world.\n\nWe saw this most dramatically just a little…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…identified the Federation of Muslims in France, FMF, as the main French  emanation of the historic Muslim Brotherhood, which was founded 100  years ago to promote a return to core Islamic values.\n\nThey said that the FMF controlled 139 places of worship in France and  a further 68 affiliated--in all, around 7 percent of the total. The  organization ran some…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…two American guardsmen while chanting  ``Allahu Akbar.''\n\nMake no mistake, this is part of the deep state's globalist agenda  that aims to destroy this country through mass Islamic migration.\n\nWhere is the outrage from the people in this Chamber? I haven't heard  it. If we don't do something to stop this Islamic takeover of our  country, we will soon…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…opinion.\n\nSenator Kaine has introduced a resolution that basically requires  President Trump to come to the Congress before any other military  actions can be taken against the Islamic Republic of Iran. I think that  would be a disaster for the country. You can only have one Commander in  Chief, not 535.\n\nMr. President, you have been in it. You have been…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the officer with his own badge cord.\n\nIn Virginia, an Afghan national who entered the United States under  Joe Biden's ``Operation Allies Welcome,'' provided support to the  Islamic State of Iraq and Syria and his father is a commander of a  militia group in Afghanistan.\n\nIn Nebraska, an illegal alien from Honduras and a leader of MS-13,  also known as…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…affiliated with the Nation of  Islam was going around claiming to be patrolling Muslim-owned shops,  telling them to stop selling alcohol and lottery tickets because they  violate Islamic law. As communities in Texas are built upon large  pieces of land, hundreds of acres, they are building up Muslim-only  cities. This is purposeful.\n\nWe had Nigel Farage and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…people crushed underneath his iron fist for  years, Maduro turned the country into a crossroads and a playground for  the likes of communist China, Cuba, Iran, Russia, and even Islamic  terrorists like Hezbollah.\n\nI want to take this opportunity to commend the exceptional skill and  bravery of our troops, CIA officers, and FBI agents for executing such…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the ``Uyghur Policy Act of 2025''.       SEC. 2. FINDINGS.\n\nCongress finds the following:\n\n(1) The People's Republic of China (PRC) continues to       repress the distinct Islamic, Turkic identity of Uyghurs and       members of other ethnic and religious minority groups in the       Xinjiang Uyghur Autonomous Region (XUAR) in northwestern       China…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Immigration and Nationality Act (8       U.S.C. 1182(a)(3)) is amended--\n\n(1) in subparagraph (B)(i), in the matter following       subclause (IX)--\n\n(A) by inserting ``Palestinian Islamic Jihad, or Hamas''       after ``Palestine Liberation Organization''; and\n\n(B) by inserting ``member,'' after ``representative,''; and\n\n(2) by adding at the end the following:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…well as pluralism.\n\nTwo, freedom of speech, freedom of political parties, freedom of  assembly, and freedom of the press and the internet: dissolution and  disbanding of the Islamic Revolutionary Guard Corps, the IRGC; the  terrorist Quds Force; plainclothes groups; the unpopular Basij; the  Ministry of Intelligence; the Supreme Council of the Cultural…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, I rise today in recognition of the  Sharia Free America Caucus, which I am proud to have joined.\n\nAcross the world, ideologically driven Islamic movements have  destabilized entire regions; displaced tens of millions of people; and  fueled terrorism, repression, and violence.\n\nWhere civil law is subordinated to Islamic…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699120/sharia-free-america-caucus"}]