[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…other  things, some of them very worthwhile, but, in my view, none more  worthwhile than doing right by these veterans.\n\nIt isn't double dipping. It isn't overly generous. It isn't going to  break the bank, so to speak. To the Federal Government as a whole, with  its trillions of dollars, it is a miniscule fraction; to those  veterans, it is not only a matter…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…plan to bring your premiums down. We can pass it through the Senate  today, right now, if only the Republicans get out of the way.\n\nWe are going to keep at this. This issue isn't going away. We are  going to fight and fight and fight until we achieve this for the  American people because it is so important. There are other issues  Republicans have out…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…contained in a budget in all my years  here. This budget would force the biggest cut to Medicaid in American  history.\n\nThe idea and the audacity of somehow pretending like it isn't going  to hurt people is just insane. It is simply not possible mathematically  to cut Medicaid by almost a trillion dollars and not hurt people.\n\nBy the way, for the record,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…in their reconciliation bill--their ``Big Ugly Bill?'' A  provision to essentially kill every clean energy project in the country  that is not almost all finished. If it isn't going to be operational in  a very short period of time, they want to pull the plug.\n\nNow, why would they do that? Why would they do that when, in fact,  most of those projects…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…circumstance they choose. And I  speak from experience because two of my three kids fit into this  category.\n\nThe rule that has been put in place by the Trump administration isn't  going to make it particularly hard for large group plans to just re-up  insurance, but it will make it very hard for those individuals that  don't have an HR department fighting…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…medication, to legal counsel, or even basic necessities.\n\nLet me be very clear. Just because something isn't named a detention  facility doesn't mean this administration isn't going to use it as one.  If people are detained there, it is a detention facility, period.\n\nAs a member of the Homeland Security Committee, I came to the ICE  Processing Center…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…their healthcare premiums would skyrocket and Republicans  stood idly by.\n\nNow we are just 2 weeks away from the expiration of these tax  credits, and this half-baked plan isn't going to cut it.\n\nMs. McCLELLAN. Mr. Speaker, I thank Mr. Carter for his remarks.\n\nMr. Speaker, I wasn't here when the Affordable Care Act was passed. I  was in the State legislature…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…environmental laws that the  Republicans have gotten rid of.\n\nRepublicans then want to use this bill as a shield to protect  polluters. If the polluter now, under a new President, isn't going to  have the protection, and the public is going to have the protection to  make sure that the water and the air are clean, then they want to make  sure they have some shield…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…you need a permitting system that  actually works. Right now, when Americans need more energy than ever  before, our permitting system is frozen in place. It definitely isn't  going to work if Federal Agencies ignore statutory timelines, stall  approvals, issue illegal stop work orders on partially constructed,  fully permitted projects, pause leases,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…tariff on fentanyl. Really? You think the drug dealers  are going to pay a tariff on fentanyl? Fentanyl is not being tariffed.  That is some kind of mistaken notion. This isn't going to happen. As I  have stated, there is more fentanyl going from the United States into  Canada than there is coming from Canada to the United States.\n\nIt is not a real emergency.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…an alarming rate.\n\nThe Iran threat is wide-ranging and multifaceted, and the Iran  Sanctions Act is the foundation of our tools to combat this threat. We  know this threat isn't going away anytime soon, so let's stop fooling  ourselves that a sunset makes any sense on these provisions.\n\nMr. Speaker, I urge my colleagues to join me in bringing our statutes…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…be  interested in reforming it. I would be looking at some income caps. I  would do away with zero-dollar premiums. I would figure out how to  structure this so the money isn't going to the insurance companies.\n\nThat is not what they did. They just said: We are going to extend  this for 3 years--at a cost, I might add, of $83 billion, scored by the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…consolidation and less options. I believe most Members here  share a common goal to ensure financial inclusion, as well as financial  literacy and  awareness. Frankly, this rule isn't going to accomplish that. My  friends on the other side of the aisle know it.\n\nAfter the bank failures of 2023, community financial institutions  lost consumers and remain at…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…withheld  swearing in a duly-elected Representative of the people for 49 days  just to avoid this vote that is finally going to happen today.\n\nI am embarrassed that my own party isn't going to yield me time to  debate this. Even though they say they support it and I authored it,  they don't even want to yield me time to debate this during the bill  debate.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Yesterday, on CNBC, Eric Cantor was, in many ways, almost mocking us.  He is a former majority leader here. Now, he is on Wall Street. He  said: Do we really think the bond market isn't going to notice if we  just do this pretend thing and say let's call this thing current  policy, so we will keep the current tax regime. Yes, it means financing  another $5.5…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "James Risch", "party": "Republican", "sentence": "…President of the United States in  the face. That is the only effect that this vote can have. It can have  no practical effect because it is trying to stop something that isn't  going on.\n\nSo we are again here considering this War Powers Resolution to remove  the troops from a foreign country where they do not exist. The War  Powers Act was created as…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to be  temporary. It was supposed to be when coming out of a major recession.  We were going to go back to normality. Instead, it is padding for State  budgets. That cash isn't going into healthcare; it is financing other  things and raising the U.S. debt. This is borrowed money.\n\nMr. SCHWEIKERT. Mr. Speaker, most of this was designed in the late  sixties.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…will take you an  hour in your car or 2 hours if you are using existing public  transportation.\n\nThink about this. You are taking our high-speed rail which, by the  way, isn't going to be that fast. It will probably be the slowest high- speed rail system in the world if it even gets built. Then you get out  at Gilroy, and you have to somehow have a…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]