[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Mr. Speaker, the United States of America built, bought, and sold the  bombs that killed Palestinians throughout this horrific genocidal  campaign carried out by the Israeli military.\n\nThe United States of America once claimed to be a moral and just  authority, but today all the globe sees is the blood on the hands of  this Nation.\n\nIt is not too late…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Prime Minister Netanyahu's  government.\n\nIsrael totally had the right to defend itself after the heinous  attacks on October 7, and all the hostages should come home.\n\nThe Israeli military campaign has been an absolute tragedy for the  people of Palestine. The people of Gaza are in desperate need of more  humanitarian relief, which I strongly support.\n\nThe…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…lasting peace in the Middle  East. Today, I voice a concern shared by many of my colleagues: the  incarceration, prosecution, and punishment of Palestinian children in  the Israeli military justice system.\n\nAs a former public defender and member of the Judiciary Committee's  Subcommittee on the Constitution, which has jurisdiction over human  rights, I have…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to discourage  Americans from serving our Nation.\n\nFifth, this NDAA authorizes expanded military cooperation between the  United States and Israel that, considering the Israeli military  campaign in Gaza that has killed approximately 70,000 Palestinians, I  do not support. To be clear, I have always supported and continue to  support cooperative missile…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…removed the sanctions on Levi  and other violent settlers.\n\nWe need to call these actions what they are: terrorism--part of a  violent, systematic effort, supported by the Israeli military, to  forcibly remove Palestinians from their land.\n\nAwdah worked with film directors Basel Adra and Yuval Abraham on  their Oscar-winning documentary ``No Other Land,''…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694532/awdah-hathaleen"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…resume? In Gaza, one thing is absolutely  essential. Mr. Netanyahu must stop blocking the medicine and the food  for starving kids and Palestinians. We cannot condone Israeli military  and the instructions of the Netanyahu government from illegally  blocking international food aid from getting through Rafah. Yet we see  a continuation of children facing…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…and we all know this, that the death toll is likely tens  of thousands higher with countless bodies still trapped under the  rubble.\n\nThis must end.\n\nAs we speak, the Israeli military is moving to wipe what remains of  Gaza city off the map. Gaza is the largest city in Palestine, a vibrant  city of 1 million people that has existed for thousands of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Vashem's chairman of the rise and       collapse as well as fall from grace of a once enthusiastic       recruit on a sacred national mission of accompanying Israeli       high-schoolers, military personnel, VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…military and vote for my amendment.\n\nMr. STEUBE. Madam Chair, may I inquire as to the time remaining.\n\nMr. STEUBE. Madam Chair, this is a headline from 2 days ago:  ``Israeli military attacks Hezbollah sites in eastern Lebanon.''\n\n``The Israeli military on Tuesday said it attacked Hezbollah  positions in Lebanon. Fighter jets targeted military sites…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}]