[{"senator": "Ed Case", "party": "Democrat", "sentence": "…a dim room. They want nothing more than a stronger  and resurgent and unchecked Russia because that brings them renewed  hope to their singular focus of the destruction of Israel.\n\nBy the way, I say very directly to our friends of Israel, wherever  they are--and many of them were in the Capital today--if they do not  call out this abandonment of Ukraine…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…potentially join the Abraham Accords,       a series of agreements through which the United Arab       Emirates, Bahrain, Sudan and Morocco established diplomatic       ties with Israel in late 2020 and early 2021.\n\nThe deals marked the first Arab-Israeli normalization pacts       since those struck by Egypt in 1979 and Jordan in 1994, save       for Mauritania's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I will only take 1 minute.\n\nA little over a year ago, the Senate voted for $18 billion in defense  aid to Israel. On the Democratic side, the vote was 47 to 4. On the  Republican side, the vote was 22 to 27. Democrats support defense aid  to Israel.\n\nThis is not a vote to retract a single…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694436/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…East  High School and the University of Kansas.\n\nShe was a devoted member of Congregation B'nai Jehudah and was  dedicated to building understanding and connection between Israel and  the United States. Her partner, Yaron, also shared that commitment.\n\nThis hateful and targeted violence is not only heartbreaking, but it  is unacceptable. Anti-Semitism…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691841/in-memory-of-recent-gun-violence-victims"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. RASKIN. Madam Speaker, I yield myself such time as I may consume.\n\nThe terrorist atrocities committed by Hamas in Israel on October 7,  which took the lives of more than 1,200 innocent civilians, and the  subsequent war of mass destruction in Gaza, have been nothing less than  a catastrophe for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…even consider it.\n\nMeanwhile, China has already made cultivated meat a national priority  in its 5-year plan. They are scaling up production, while countries  like Singapore, Israel, Australia, and the U.K. are moving forward, as  well.\n\nIf cultivated meat helps deliver cheaper, scaleable protein solutions  worldwide, do we really want China setting the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…well. We sometimes differ even more profoundly on some of these  issues.\n\nLet me say one thing in passing. The commitment of Republicans is  unquestionable when it comes to Israel and Jewish Americans. I know to  a degree, because of a fiscal note, the gentleman questions that. I am  not going to go through the history of many events and many pieces…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Relations.  His commitment to promoting peace and understanding transcends borders,  exemplified by his work with the Partnership Together program  connecting Rochester and Modi'in, Israel, where he served as co-chair  for four years.\n\nIn 1995, Rabbi Katz was awarded the State of Israel Peace Award, a  fitting recognition of  his life's work. Today, he continues…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691618/recognizing-rabbi-alan-katz"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…Hamas, guilty of the  October 7 attacks and decades of violence. This is a wholesale attack  on the people of Gaza.\n\nIsraeli groups like B'Tselem and Physicians for Human Rights-Israel  have recently called what is happening genocide. International human  rights groups like Human Rights Watch and Amnesty International have as  well.\n\nRecently, the International…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…world among advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.\n\nInstead of helping police officers by getting guns out of the hands  of criminals, our colleagues are just looking for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. I thank the Senator from Vermont.\n\nSeveral weeks ago, several Senators joined me in meeting with the  Ambassador from Israel. It was an effort to discuss many of the things  which we are discussing this evening.\n\nWe asked him why Israel was not providing humanitarian aid in Gaza.  He said: That is…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…something that this country has always  stood against, but we find ourselves today standing with Mr. Netanyahu  and the government that is bringing shame to the country of Israel.  Israel should never do what it despises. I believe that the country of  Israel would despise this level of punishment, this level of injustice  being perpetrated upon another…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Litvin, she raised five children, and today, she is the  proud grandmother to over 100 grandchildren and great-grandchildren,  including Jewish leaders in America, Cyprus, and Israel.\n\nGeraldine's devotion to her family is equaled only by her commitment  to her community. In Boston, she distinguished herself as both an  entrepreneur and education activist.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…only division and will continue to discourage  Americans from serving our Nation.\n\nFifth, this NDAA authorizes expanded military cooperation between the  United States and Israel that, considering the Israeli military  campaign in Gaza that has killed approximately 70,000 Palestinians, I  do not support. To be clear, I have always supported and continue…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, I rise to indicate my reasons that I  will not be voting to fund Israel's military, most of which are  contained in the letter that was delivered to Speaker Mike Johnson's  office on December 10, 2025.\n\nI ask that funding for our military not be…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698049/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…funneling weapons and financial       support to its terrorist proxies throughout the Middle East,       threatening allies and partners of the United States, such as       Israel.       SEC. 3. STATEMENT OF POLICY.\n\nIt is the policy of the United States to fully implement       and enforce the Iran Sanctions Act of 1996 (Public Law 104-      172; 50…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Madam President, I remember, as a kid in Sunday school,  thinking what it would have been like to live in Israel in the age of  the apostles, in the time of miracles. And yet, perhaps we have been  transformed to another time of miracles.\n\nYesterday, I was at the White House, where President…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…the  Lebanese state is just categorically false. Hezbollah and other terror  groups that operate freely throughout the country have launched  countless attacks on our ally Israel.\n\nIn the past year alone, Hezbollah has indiscriminately launched  nearly 2,000 missiles into Israeli territory, attempting to replicate  the horrific atrocities that occurred…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Nation.\n\nWhat did they get, Mr. Speaker?\n\nWhat do you get for $30 million invested in our schools?\n\nIt is a clear act of anti-Semitism. Classroom maps where they funded  omitted Israel and instead labeled it Palestine. Following a  congressional hearing last year, New York Public Schools acknowledged  receiving large donations from Italy and South Korea.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…cease-fire.\n\nEvery starvation, every injury, every death, every  single thing that happens in this conflict is the fault of Hamas.\n\nOn October 7, when this invasion by Hamas started, Israel was doing  nothing to deserve this. Instead, Hamas invaded the country. They  killed 1,200 people. They took 251 hostages.\n\nIf that wasn't enough, the torture that they committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I rise to recognize Israel's Independence Day  and 77th birthday.\n\nThe United States and Israel have a binding, ironclad partnership  that continues to grow stronger as the months and years go on.\n\nAs…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690754/9999"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…States.  That stability is more important than ever as the LAF works to  permanently disarm and destroy Hezbollah's presence in Lebanon.\n\nBuilding on the tremendous success of Israel in weakening Iran and  eliminating Hezbollah's terrorist leader network, Hezbollah is now at  its weakest point. This is a tremendous opportunity for the LAF and for  the people…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I include in the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:       INTERNATIONAL HOLOCAUST REMEMBRANCE DAY--80TH ANNIVERSARY OF                           AUSCHWITZ'S…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…to learn more       about Jewish heritage and the contributions of Jewish people       throughout the history of the United States;\n\nWhereas, since Hamas' deadly attack on Israel on October 7,       2023, antisemitism in the United States has reached record       highs with incidents targeting Jews and those who are       perceived as Jewish;\n\nWhereas,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Savannah: NBC NEWS; Gutierrez,       GABRIEL: NBC NEWS; GUTIERREZ       RIVEROS, DIEGO FELIPE: WFDC-TV Univision; Guttin, Camille:       FRANCE 2 TELEVISION; Guttman, Nathan: ISRAEL PUBLIC       BROADCASTING CORPORATION; Guzman, Armando: TV AZTECA; Haake,       Garrett: NBC NEWS; Habib, Elias: AL-ARABIYA TV; Habib,       Mohammad Yosuf: AP-BROADCAST; Haboush,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…majority do not  support that. As President Trump has stated, the ICC has baselessly  asserted jurisdiction over the United States--and our citizens agree-- and its allies like Israel and further abused its power by issuing  frivolous arrest warrants.\n\nThere is no reason to use the ICC to define what countries are  actively seeking to harm the United States.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I include in the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nIsrael At 77--How poignant to affirm the special       relationship between the U.S. and Israel, two close…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…in America is alive and  well.\n\nPresident Donald Trump is the President of peace, ending eight wars  in 8 months. Tell me who in history has ever done this.\n\nThe war between Israel and Hamas is over. The hostages were returned  home. The Iranian nuclear program has been set back for decades, and  the Middle East is more stable than it has been in years.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Governor  Newsom and the legislature to do the right thing and bring an end to  this failed and embarrassing project once and for all.             Condemning Classification of Israel as an Adversary\n\nMr. KILEY of California. Mr. Speaker, today on the House floor, there  was an amendment offered that suffered the most overwhelming defeat  that I have ever…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…practically giving away a port on the Black Sea that  should be for the people of Georgia.\n\nThey are also subservient to the regime in Tehran, who we know  launched attacks against Israel just yesterday; and war criminal Putin,  who seeks to indeed make the people of Georgia subservient.\n\nThe Georgian people are among the bravest and most pro-American in  the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]