[{"senator": "Lori Trahan", "party": "Democrat", "sentence": "Mrs. TRAHAN. Mr. Speaker, I thank the gentleman for yielding, as well  as his leadership and that of Chair Bilirakis on this important issue.\n\nMr. Speaker, I introduced the Youth Poisoning Protection Act  alongside Representative  Mike Carey because we are facing an urgent  and deeply troubling trend, the promotion…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690216/youth-poisoning-protection-act"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…sources, there is no  reason not to accept it. For some reason, current law prevents us from  accepting even a donation from a nonprofit that would want to help us  with the issue.\n\nMr. Chair, I say let's get out of the way. H.R. 1948 passed out of  the House on suspension in June of this year, and I hope to see it  become law on any topical legislative…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…those nitty-gritty details that are very difficult to understand  to help us produce such a great product. I publicly thank both of them  for their incredible work on this issue.\n\nMr. Speaker, I do support this bill. That does not mean that I don't  have concerns. I do.\n\nThe biggest concern I have is that the Pentagon, being run by  Secretary Hegseth…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and for Assistant Leader  Neguse for organizing today. I look forward to hearing from my many  colleagues in the next hour about how we can tackle this important  issue.\n\nMr. SUBRAMANYAM. Mr. Speaker, there are a lot of reforms that people  have proposed to overturn the damage done by Citizens United. I  introduced legislation, the Campaign and Election…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…has demonstrated that he certainly is willing to do that  and we are certainly grateful that he worked closely across the aisle  to make sure that this is not a partisan issue.\n\nMr. Speaker, as an American Jew, as a Member of Congress, if anti- Semitism is used as a partisan weapon, if Israel is used as a partisan  weapon, it is bad for Jews and it…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…bargaining rights through  executive action was an illegal gray area if not outright unlawful.\n\nThis legislation ends that ambiguity. It should never have been a  partisan issue.\n\nMr. MANNION. I am grateful to my colleagues on both sides of the  aisle for working together toward this meaningful solution. My father  always said that a job is more than…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697993/protect-americas-workforce-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Speaker, I thank Representative Dingell for yielding  me time, and I thank the gentleman from Ohio (Mr. Latta), my friend,  for his bipartisan partnership on this important issue.\n\nMr. Speaker, I rise today in support of the NTIA Reauthorization Act.  We introduced this bill to ensure America continues to stand as a  global leader in communications and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…States and the people of America.\n\nI thank my colleague and yield to the Senator from Oregon, the  ranking member of Finance, who has done such a great job on this issue.\n\nMr. SCHUMER. Mr. President, first, I want to thank Senators Padilla  and Reed for holding the floor on such a vital issue to our country,  our democracy, and who we are as a people.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…change increases  the risk of sinkholes across the country.\n\nI thank my colleagues, Representatives Soto and Bilirakis, for  introducing this bill and their leadership on this issue.\n\nMr. Speaker, I urge my colleagues to support H.R. 900, and I reserve  the balance of my time.\n\nMs. HOYLE of Oregon. Mr. Speaker, I urge my colleagues to support the  legislation,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693481/sinkhole-mapping-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…whether they are going to be able to get a nutritious meal the next  day--tens of millions of people in this country, millions of children.\n\nInstead of trying to address that issue, Mr. Speaker, the one big,  ugly bill will rip nutritional benefits away from millions of  Americans, including children. It will rip food from the mouths of  hungry children,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…has been over 50 years since Congress has enhanced Social Security  on behalf of  its recipients. That is why I have introduced legislation specifically  to address this issue.\n\nYet, Mr. Speaker, at the same time, we see that Mr. Musk has been  charged by the President of the United States to cut $2 trillion from  the budget. Mr. Musk has made no bones…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…legislation is a commonsense  solution that every Member of this body should support, every single  one. Keeping firearms out of the hands of our children should not be a  partisan issue, Mr. Speaker.\n\nWe must honor those who have already been killed with a lack of  action in this Chamber. Our communities deserve better. Our children  deserve better.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, I thank my friend, Congresswoman Hayes, for  hosting this Special Order Hour and for her leadership on this critical  issue.\n\nMr. Speaker, 50 years ago Congress passed the Individuals With  Disabilities Education Act, or IDEA, because America rejected exclusion  and finally recognized a simple truth:…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…implementing are fully effective and enforced without fear or favor. We  need a strong FTC.\n\nI commend Representatives Mullin and McClain for their leadership of  this issue.\n\nMr. PALLONE. Mr. Speaker, I urge support for this legislation. I do  think that from an environmental point of view and to protect our waste  treatment facilities this is important…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…well. I hope maybe  he will speak about that, although I know he didn't necessarily plan to  do so. He is my friend and a good man. I know he cares deeply about  this issue.\n\nMr. NEGUSE. Mr. Speaker, I have a parliamentary inquiry.\n\nMr. NEGUSE. Mr. Speaker, very simply, can we amend Mr. Gabe Evans'  resolution with the inaccurate information so that it…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…and recognition our  correctional officers deserve. I thank Jon and Haley for their courage,  compassion, and relentless advocacy bringing attention to this very  important issue.\n\nMr. Speaker, I want to wish a very happy birthday to my nephew,  Andrew Martino.\n\nHappy birthday, Andrew.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Mr. Speaker, I thank Representative Donalds for sponsoring this  important legislation and applaud Chairman Comer for his steadfast  leadership on this critically important issue.\n\nMr. Speaker, I urge all of my colleagues to join me in supporting  H.R. 4922.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…appreciate where  the gentleman is coming from. This has been a long debate regarding  some of these issues surrounding what I believe is the core issue. I  believe the core issue, Mr. Speaker, is that it is time for us to put  retirees first, not second, in investment decisions.\n\nThe gentleman was talking about it in ESG funds. I have no problem  with…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…elections must be a national priority.\n\nI thank the bill's sponsors, Representative Roy and Senator Lee, as  well as Chairman Steil, for their leadership on this critical issue.\n\nMr. Speaker, I urge my colleagues to join me in voting in favor of  the SAVE America Act.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…American way of life.\n\nI am proud to be a cosponsor of this important legislation, and I  thank Whip Emmer and Chairman Hill for their outstanding leadership on  this important issue.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693725/anti-cbdc-surveillance-state-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…require the IRS to provide individuals with a  clear explanation of the error, showing the mathematical change, and  inform taxpayers that they have 60 days to correct the issue.\n\nMr. Speaker, Americans fear the IRS for very good reason. Under  current law, when the IRS claims that you made a math error on your  return, they are not required to explain…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…overpopulation of  double-crested cormorants, which threatens their way of life and harms  coastal economies. I once again thank Mr. Ezell for his diligent work  and attention to this issue.\n\nMr. Speaker, I urge the passage of H.R. 2293 and yield back the  balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…toward  reducing the urgent threat that wildfire poses to communities  nationwide. Once again, I thank Representatives Carbajal and Valadao  for their leadership on this vital issue.\n\nMr. Speaker, I urge adoption of this bill, and I yield back the  balance of my time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…is not an international charity,  and it is especially not for the illegal immigrants here in this  country. I will ask him to elaborate on his experience with this issue.\n\nMr. KNOTT. Mr. Speaker, I am ready for that debate any day, and I am  ready for that discussion any day.\n\nAgain, the Republicans believe that American tax dollars should serve  American…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…expanding the  availability of foster families.\n\nI thank Representatives Feenstra and Boyle for introducing this  legislation and for their bipartisan leadership on this issue.\n\nMr. SMITH of Missouri. Mr. Speaker, nearly 400,000 American children  today are in the Nation's child welfare system and counting on us to  help them secure access to a permanent,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…as we are, but I talk to the American people and I say to you:  We need your help. We have to Facebook this thing. It has to spread  like a wave. Do not be shy about this issue, Mr. Speaker. Our babies  depend on us to watch over them.\n\nI have two beautiful sons, and I give them the latitude they need,  but I watch over them every single day because…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the persecuted.\n\nI thank my friend, the gentleman from Pennsylvania (Mr. Perry), along  with his bipartisan cosponsors for their leadership on this critical  human rights issue.\n\nMr. Speaker, I urge strong support of this legislation, and I yield  back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…national security.\n\nI commend the entire Montana delegation, Representatives Downing and  Zinke, and Senators Daines and Sheehy, for their tireless work and  leadership on this issue.\n\nMr. Speaker, I encourage my colleagues to support the CRA, and I  reserve the balance of my time.\n\nMr. WESTERMAN. Mr. Speaker, all Americans should have on the top of  their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Blumenthal, for their bipartisan work on this vitally important bill to  ensure our veterans get their benefits. I also thank Representative  Luttrell for his leadership on this issue.\n\nMr. Speaker, I urge all of my colleagues to support S. 2392, and I  reserve the balance of my time.\n\nMr. BOST. Mr. Speaker, I have no further speakers, and I am ready to  close.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696763/veterans-compensation-cost-of-living-adjustment-act-of-2025"}]