[{"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…coast. His efforts have  strengthened our environment, commercial fisheries, and coastal  communities.\n\nWhile Commissioner, Pat engaged stakeholders on some of the toughest  issues facing our state. He worked diligently to understand the  concerns of Maine's fishing communities and translate those concerns  and recommendations into public policy. He skillfully…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…who will retain coverage will pay  double or triple for their healthcare plans.\n\nIt is not too late to do something even though we are hopelessly  divided on most of the issues facing us. Let's hope that health  insurance will be the exception. Congress can extend the tax credits  and reopen the signup period before the worst impact is felt.\n\nAt least…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…world-leading advocate for  interfaith dialogue and peace. As Ecumenical Patriarch of  Constantinople for nearly 35 years, the Patriarch has taken on the most  difficult issues facing the world, whether it's building bridges  between East and West, protecting our environment, or fostering  dialogue between religious faiths.\n\nEcumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…better than the drama playing out  between these two men, and it is time my Republican colleagues  recognize this.\n\nAt long last, let's work together to focus on the real issues facing  our beloved Nation.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692030/elon-calls-it-quits"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Now, Mr. President, I rise today to urge my colleagues  to continue to work on the affordable care issues that are facing our  Nation. We know that we have to work together to address the Affordable  Care Act and that the system needs to continue to have updates.\n\nWe know that in this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…nightmare?\n\nIt became a nightmare because after the victories of the Civil Rights  Act, after the victory of the Voting Rights Act, when he really began  to address the systemic issues facing this country of poverty, of  hatred, of war, he began to see how deeply ingrained in American  culture racism really was.\n\nHe began to see that the systemic racism couldn't…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are trailblazers who address the most pressing  issues facing their communities and the world with measurable,  sustainable, and far-reaching results. To earn the Girl Scout Gold  Award, high school-age Girl Scouts identify and investigate…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…this  country. Once the bill is law, the expanded tax credit will boost  America's housing supply.\n\nI look forward to continuing to work together to tackle the housing  issues facing America with creative solutions.                           Recognizing Randy Gates\n\nMr. FLOOD. Mr. Speaker, I rise today to recognize the hard work and  dedication of one…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…the SUPPORT for Patients and  Communities Reauthorization Act. I do not believe that there is a  person in this Chamber who does not see this as one of the most serious  issues facing our Nation today.\n\nI support the rule and the underlying legislation, and I encourage my  colleagues to do the same.\n\nThe material previously referred to by Mr. McGovern…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…user  fee program has expired, meaning patient access to new over-the-counter  treatments for common ailments is in jeopardy.\n\nI am a doctor. I want to tackle the numerous issues facing our  healthcare system. I spent my whole career fighting for patients. Let's  have a conversation about lowering costs for all Americans like those  on Medicare, those…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…exemplary businesses such as ECO-CLEAN  Solutions in the United States House of Representatives. They exemplify  how American innovation can serve as a solution to the issues that are  facing our communities and the Nation at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Small Business Capital Formation  is a vital tool for small businesses and entrepreneurs. The advocate  hears firsthand from businessowners about the real-world issues that  they are facing when raising capital.\n\nOutdated regulations make it more difficult than it needs to be. Our  current laws can trigger the full weight of the Paperwork Reduction…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…occurred just yesterday when, by a majority of the U.S.  Supreme Court, yet another judge's national ban was overturned.\n\nThese actions touch on many of the most critical issues facing our  country, such as securing our borders, reforming insufficient and  ineffective government bureaucracy, and strengthening our military.\n\nLet me be absolutely clear.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…into  what I would describe as something akin to a high school pep rally, and  that pains me to say that.\n\nWe are all adults here, discussing some of the most important issues  facing the American public, I would daresay the entire world, right  here in this Chamber. The things that happen in this Chamber that  reflect poorly on us reflect poorly on…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…State of Idaho, the land of famous potatoes, I am the one the  good Congressman referred to as ``Mr. Potato Head.'' I had the  privilege of working with Doug on the pressing issues facing the West  and America's rural communities.\n\nThere are no adequate words to express my sorrow upon learning of his  passing, but his legacy and spirit lives on. My prayers…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698717/9999"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…gentleman from Texas for  yielding, and I thank him for his passion and leadership on this topic  and many others.\n\nMr. Speaker, today, I rise to address one of the most urgent issues  facing the American family today, which is healthcare affordability.  Under the Biden administration, inflation surged to levels that we  haven't seen in decades, in generations,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…organizations like ECO-CLEAN  Solutions in the United States House of Representatives. This  organization exemplifies how American innovation can serve as a  solution to the issues that are facing our communities and the Nation  at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…have influence over this process. We really cannot leave  these decisions to unelected bureaucrats in Washington who don't know  where McCook, NE, is, who don't know the issues facing the Santee Sioux  Nation, who don't understand where Greeley is, where Gothenburg is--and  some, probably, where Omaha or Lincoln are.\n\nJust as important in bringing Federal…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…next Census.\n\nThis measure has bipartisan support. It will prevent a chaotic  redistricting war from breaking out across America. It will allow us to  focus on the real issues facing our country.\n\nToday, I am calling on Speaker   Mike Johnson to bring this measure  to a vote on the House floor.\n\nGerrymandering is a plague on our democracy wherever it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}]