[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…hometown of  Representative Kennedy to celebrate Martin Luther King Jr. Day I think  on the 18 of this month--I am thinking tonight about King's letter from  the Birmingham City Jail, which many of us remember was written in  response to a letter that he had received from eight White clergymen  who said to King that they wanted him to leave Birmingham.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…team claims their operation to oust Maduro was a  ``law enforcement'' operation about drugs. That is the legal pretext  for the action that they have led, but Maduro is now in jail in New  York City and 15,000 U.S. troops and an American armada are still  hovering off Venezuela's coast.\n\nWe already captured Maduro. He is in jail. So what are our troops…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…something a bit  more general because I have been wrestling with this for the better  part of the last 4 or 5 years.\n\nIt is Martin Luther King, Jr.'s letter from the Birmingham City Jail.  King, when he wrote that letter, said something that I will leave us  with tonight.\n\nKing was told that the officials in Birmingham wanted him to leave  Birmingham because…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Libya. We saw this in Iraq. We saw this in Afghanistan.\n\nPresident Trump is now saying we are going to ``run the country.''  And President Trump is heralding that Maduro is in jail in Manhattan.  We all are. But left behind in Venezuela is every structure that Maduro  put in place. His hand-picked Vice President is now the leader. His  repressive, brutal,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…just by virtue of  being undocumented.\n\nSecondly, under current law, having killed someone, he would be  immediately deportable. He was convicted of his offense, sentenced to  jail, and he would be deported immediately upon leaving. In fact, the  President could commute his sentence, which is what he has been doing,  and have him deported right now. You…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Presidents of both parties. Those found in violation of these statutes  are already subject to prison sentences and mandatory removal. However,  Republicans are proposing to jail undocumented immigrants for up to 10  or 20 years, wasting billions of taxpayer dollars and limited Federal  prison space.\n\nAmerican taxpayers are certainly justified in asking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…signatories:\n\nACLU-D.C., Black Swan Academy, Community Shoulders, DC       Action, DC Coalition Against Domestic Violence, DC Democratic       State Committee, DC for Democracy, DC Jail & Prison Advocacy       Project, Fair Budget Coalition, Free DC, Free Minds Book Club       & Writing Workshop, Georgetown Law Center for Innovations in       Community Safety,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…been waiting here. The  American people want to know why a President of the United States would  pardon two drug dealers. They are not just accused. They are convicted  and in jail. They were, but not anymore. They are free men now.\n\nI have been waiting for an answer. I am not playing jokes. This is  very serious. I am asking everybody, all of my Republican…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…prison.\n\nAnd, by the way, it is not like ICE does not know when someone is  arrested. In fact, the Federal Government is notified every single time  an individual is booked into a jail or prison. This means nothing is  preventing ICE from picking up individuals when they are released from  custody.\n\nBut instead of prioritizing picking up the dangerous, violent…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…right to a neutral, impartial tribunal. She had a right to a unanimous  verdict of a jury.\n\nAll of that she had, and she was found guilty. That is why she was  sentenced to jail for 20 years, even though Donald Trump has  transferred her from a real prison to a prison camp, where she has  gotten very special, pampered treatment, like she is in a Trump…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…$880  billion--would have a devastating impact on millions and millions of  children.\n\nBut it doesn't stop there. You quoted King. King said in the letter  from the Birmingham jail:\n\nWe are all caught in an inescapable network of mutuality,       tied in a single garment of destiny.\n\nTo think that there could be an injury to their family and their  child…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…my book of the times,  the challenging times we live in.\n\nCensured, but not silenced. People assumed that I was going to walk  out in shame, but I know this: Dr. King went to jail for his  protestation. He didn't want to go to jail. He was censured,  incarcerated, but not silenced.\n\nRosa Parks took a seat in a racist Southern town, taken to jail for…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…is going to happen next week at TSA or at FEMA as for  the children that are being traumatized right now in this country, who  are being thrown into what is called the ``Baby Jail,'' outside of San  Antonio; for the lives that are fundamentally changed by an immigration  policy that is out of control; to have concern for the American  citizens who have…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…screaming out a phone number. I couldn't  hear him. I couldn't get all the digits down.\n\nOnly three sources of water per cage, the spigots connected to the  toilets, much like the jail units we have seen. Usually in those jails,  it is one of those units for 2 to 4 people, not three for 32 people.\n\nI have to tell you, one of the most emotional parts for me…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…response techniques. It will advance their skills to  deescalate situations, and our goal is to deescalate people with the  care they need instead of the back of a squad car or a jail cell.\n\nBy investing in training, we protect our communities and ensure those  in crisis are met with highly trained law enforcement officers.\n\nI am proud to work along with…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689347/help-our-country-become-a-safer-healthier-place-for-all"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…go further.\n\nBy the way, the American people get this. They understand that there  are examples of voter fraud. I come from a State where our elections  commissioner went to jail--yes, went to Federal prison--for stealing  elections. We cleaned up our election system in our State. We have seen  an increase in voter participation.\n\nWhy? Again, they would…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…here the right way.\n\nIf you are going to interfere in law enforcement's ability to do  their jobs, folks, in any way, don't be surprised if you are arrested  and thrown into jail--and you should be.\n\nThanks to investigative reporters like Nick Shirley and folks at the  Maine Wire, we are slowly turning the tide on fraud and corruption.  Deep state and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…defund those particularly bad grant programs,  while we try to make sure that our local jurisdictions can fund police  properly and have judges that will actually put bad guys in jail  instead of letting them on the streets and a President that won't  commute the sentences of 2,500 people, dozens or hundreds of whom were  violent criminals and are now back…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…backfiring on  our communities. We see it time and time again.\n\nIn D.C., police recently arrested a carjacking suspect who laughed in  their faces saying: I have been in the D.C. jail six times for this  warrant. I will be out tomorrow because the victims never show up. That  is the mentality of this broken system, and it emboldens criminals.\n\nPresident Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695036/failed-social-experiment-backfiring-on-our-communities"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…argument on both sides. You can listen to the facts, but would you want  your President to be allowed to go to Brazil, free the former  President, and put the current President in jail without a vote of your  representatives? What kind of world would that be? Who could be for  that?\n\nThe Constitution empowers the President to defend the country against  sudden…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…behind a computer, the ones who created this fake material. If  you dare to do this again to another innocent child, most of them  girls, you are going to prison. You will be in jail for a long time.  Don't do it, and don't dare to do it anymore. Prison is a great place  where you can sit and ponder what you have done to another human being.\n\nToday, we take…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thousands of regulations and statutes, and  the American people often have no idea that they might be in violation  of something that would come with a penalty that might include jail  time or sufficient fines, and so forth, and they potentially could  become a felon.\n\nThis bill is pretty simple. It just directs the Federal Government  and the executive branch…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…are going to let's say reconsider the budget, they are  going to spend $45 billion for basically jails for illegal immigrants  who come across, because if we don't have that jail space or the  detention centers as they are looking at asylum, then they go into the  country. That means they might not have a court case for a few years.\n\nLet's just think…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…warrant. This is clearly beyond  using law enforcement power. The game plan is not only to take the  indicted leader of the country--who is a horrible person--and put him  in jail but to change the country in a way that doesn't threaten  America in the future, in that it will not, in the future, be a drug  haven for cocaine to be dumped into our country,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…right now. The Wall Street Journal--the  Justice Department, I guess, has been leaking. It is no longer civil  suits. It is criminal suits, saying people are going to go to jail.\n\nHas there ever been a moment where particularly the left and the  right can get together and say that we need to fix the incentives in  this program? Also, it is great economics,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…since fled  to the United States, to a country in which you can still tell jokes  about transgenderism so far. You can still tell jokes about illegal  immigration and not go to jail.\n\nNow, we were supposed to care about this, and we do care about it  because it affects our platforms. Insofar as the European governments  put restrictions on X or put restrictions…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…assaulted a girlfriend and fled the scene. After  shooting Jimmy, then the Bexar County DA only pursued aggravated  assault charges and set his bond at $200,000. He is not in jail. He was  granted house arrest.\n\nJimmy was a father and a veteran. His brother said Jimmy always put  himself before others. Why do the people entrusted with securing our  communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…these crimes are being committed by people who have  been deported and they come back. That has happened.\n\nBy the way, if you come here illegally, I think you ought to have  jail time. As a former prosecutor as the attorney general of Missouri,  I can tell you that people responded to incentives. They knew when we  had a partnership with Federal prosecutors…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…citizens  have to realize that the best shot that some of these guys that are in  the game on the criminal side of this thing, the best shot they have at  rehabilitation is jail, the very best shot.\n\nI have seen it again and again and again in my career. I have had  criminals that I have taken off the street, that have lived a life just  immersed in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…have mistakenly omitted from  her remarks.\n\nAgain, we support every measure that can be done to reduce crime and  to get criminals that have committed crimes and keep them in jail. They  deserve due process, but we can't continue this trend in these cities,  especially the Capital City, of letting violent criminals out back on  the streets.\n\nMr. Speaker,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}]