[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…visit 2 weeks ago with the new government, incoming government in  Germany.\n\nGermany is a great ally. More U.S. troops are on the ground in  Germany than any nation other than Japan outside the United States. We  are security partners in Ukraine and in European security generally.  The new German Government was just elected, the Chancellor will be  installed…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Russia has threatened to use nuclear weapons against Ukraine and even  against NATO nations. North Korea uses its nuclear weapons program to  intimidate the United States, Japan, and Korea. China continues to  build up its nuclear arsenal. It has some 600 warheads today and is  expected to pass 1,000 by 2030, according to the Pentagon.\n\nThe question…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…western  Pennsylvania, we have watched industry after industry leave the country  for China and Mexico.\n\nWestern Pennsylvania won us our freedom. They produced more steel  than Japan and Germany combined in World War II, and yet today we have  got 4 percent of the world's steel. China has 50 percent of the world's  steel.\n\nAluminum left, paper left, and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Speaker, I rise today to honor the career and service  of Makiko Shirai, a Japanese foreign service worker who worked to  strengthen the relationship between the United States and Japan.\n\nOn May 20, Makiko will be presented with Japan's Order of the Sacred  Treasure, Gold and Silver Rays, for 35 years of supporting the U.S.- Japanese relationship.\n\nThroughout…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690737/recognizing-makiko-shirai"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…going to need that unity, all Americans  working together, when we face the next existential threat to our  freedom and democracy, as we did with Nazi Germany and militarized  Japan. It is coming, and you know it.\n\nIn the Bronx and Westchester, we will be ready. We encourage the  Bruce Blakemans of the world to stop pandering and start building the  cooperation…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…enough?\n\nWhen will the Republican majority stand up and tell him for once:  ``Mr. President, you are wrong. Your policy is misguided.''\n\nHe has imposed tariffs on Canada, Mexico, Japan, and the EU, our  friends. He has not imposed tariffs on Russia, arguing they are  negotiating with Ukraine, but he imposes tariffs on Ukraine.\n\nWe are now looking at the self-inflicted…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689696/worldwide-tariffs"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…been  stored in these tanks and in the ground for 80 years will begin to be  processed. This process, called vitrification--a process that other  countries, like France and Japan and Germany have all successfully  achieved--is basically taking the radioactive sludge and turning it  into a stable, storable glass. That is what the skilled workers at the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…History shows us what happens when intelligence is ignored,  manipulated, or kept from those who need it most. In 1941, the U.S.  Navy intercepted communications showing that Japan was planning to  attack Pearl Harbor. That knowledge ended up being of little use  because it was not communicated to the people who could have taken  action to protect the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…financial  management included positions as Flight Chief, Enlisted Force  Development Manager, and Superintendent, with assignments and  deployments spanning the globe, from Japan and South Korea to  Afghanistan and the Pentagon.\n\nChief Master Sergeant Haynes' commitment to professional development  is evident in her extensive education, culminating…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…we have to do more because we have to rebuild  Palestine.\n\nI say ``we.'' I believe the United States has to make a contribution,  just as we contributed to the rebuilding of Japan after we dropped  bombs on Japan, just as we have contributed to the rebuilding of other  places when we have been involved in the destruction.\n\nWe helped to destroy Palestine.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Pacific Ocean, between us and the People's Republic of China. He will  say that that ocean offers the same illusion of insulation from the  world of reality.\n\nTell that to Japan or Taiwan or South Korea or the Philippines. Tell  them that that ocean protects them. Tell that to the ASEAN countries,  Australia and New Zealand, Singapore, India, the island…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…last week to watch Congress debate the SAVE Act. He was forced to  fly home after the Speaker canceled 3 days of legislative work.\n\nMr. Wilson is an American citizen, born in Japan to a military father  during the Vietnam war. Mr. Wilson is also a veteran. He proudly served  our Nation overseas, including in Korea and Germany.\n\nLike millions of Americans,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…across the rest of the Nation.\n\nAll I want to say is that, right now, China is investing $1 trillion  this year in clean energy, low-carbon technologies--$1 trillion in 1  year. Japan has just announced they are investing $1 trillion in clean  energy, low-carbon technologies.\n\nSo what we are debating here is going to absolutely allow for these  other countries…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of our States. It  would shield them from higher costs.\n\nWe have been hearing about some of these deals that Senator Crapo  referred to that have been reached with the EU and Japan, but let's be  clear about what those deals mean because even after those deals--those  agreements, trade agreements--Americans are going to be left paying  dramatically higher…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.\n\nInstead of helping police officers by getting guns out of the hands  of criminals, our colleagues are just looking for ways to create…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually--the liquidity of the debt  markets.\n\nI grabbed an article that was in one of my--I think it was in one of  my bond publications because I have some weird reading habits. ``Japan  prepared to use its role as America's largest creditor as leverage in  Trump's trade talks.'' The point I want to make by reading that  headline to everyone is: Japan now…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Illinois, and went on to attend Anti-Submarine Warfare Training  School in San Diego, California, where she trained as a Sonar  Technician.\n\nHer first duty station was in Yokosuka, Japan. While her ship was  operating in the Middle East, the terrorist attacks of September 11,  2001, occurred. In the days that followed, her ship launched some of  the first Tomahawk…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…wisdom and  leadership in decisively countering Iran's nuclear threat and,  therefore, to oppose this ill-conceived joint resolution.\n\nAs a U.S. Senator and former Ambassador to Japan, I understand and  respect the role that Congress plays in matters of war and peace, but I  cannot and I will not support a resolution that removes the ability of  the President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…with the  National Youth Orchestra of the United States.\n\nNot only will he debut in New York, he will also represent our Nation  and  our State as he tours internationally in Japan, Hong Kong, China, and  South Korea.\n\nTarquin's journey began at the age of 5 when his mother, who taught  herself to play the violin at age 34, inspired him to pursue music.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693758/recognizing-tarquin-bennion"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Madam Speaker, today marks 80 years since the  Empire of Japan unconditionally surrendered to General Douglas  MacArthur and Allied forces aboard the USS Missouri.\n\nOn this anniversary of V-J Day, it is fitting that we pause to  remember…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are subject to the interest  rates.\n\nWe need to be understanding. Convince the people who are loaning us  money, whether it be your personal pension, your savings account,  Japan, whoever is buying our debt, that we are stable, that we are  adults, and that we understand. We have a demographic problem, but we  are going to engage in adult-like technology…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Act, as amended,       we are forwarding herewith Transmittal No. 25-85, concerning       the Air Force's proposed Letter(s) of Offer and Acceptance to       the Government of Japan for defense articles and services       estimated to cost $82 million. We will issue a news release       to notify the public of this proposed sale upon delivery of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…limit to that.\n\nThe people who are begging, I can tell you, Mr. Speaker, for our  energy is Europe, who are our friends. I do know from just recently  meeting with friends from Japan and Korea they want the natural gas  that we have in our great State of Alaska. This is important.\n\nThe chairman of the Energy Subcommittee is a leader on this issue and  has…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…share the world's longest international land border and are  continuously at peace.\n\nCanada is a great customer of ours. In fact, Canada buys more  American goods than China, Japan, England, and France combined. So do  we want the Canadians to buy less of our stuff or more of our stuff?\n\nIt is a crazy notion to put a 25-percent tariff on this enormous…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…parade of state-of-the-art weaponry. It reminded me of similar  moments in the late 1930s, when the fascist states of Germany and Italy  teamed up with the imperialist state of Japan to form the Axis and to  plunge the world into chaos.\n\nI have often asked myself: Would I have seen and known what was  around the bend, what was happening next?\n\nWell, to…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…pipeline is one of the most crucial steps we can take to  counter China's influence in the Indo-Pacific.\n\nEarlier this year, I led a bipartisan congressional delegation to  Taiwan, Japan, and South Korea. Taiwan has already signed a letter of  intent with the State of Alaska to purchase Alaskan LNG, and both Japan  and South Korea are deeply interested in pursuing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…indeed, larger  minorities for which we have statistics.\n\nI remind everybody that people who come here from India, who are the  most successful minority, Philippines, China, Japan, Cuba, the coast of  western Africa all are succeeding wildly in America. All it takes is  hard work and strong families, and all these groups have strong  families.\n\nI encourage…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…which makes the leading-edge, advanced, ultraviolet  lithography that is necessary to produce the most advanced  semiconductor chips, but other countries, like South Korea, Japan, and  Germany, are also part of that supply chain of critical equipment and  machinery. Working and winning the AI race means we have to work hand  in glove with our allies…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…security. Even today, our  adversaries, like China, are actively targeting global communication  networks, especially cutting undersea cables that connect us to our  allies, like Japan, Korea, and Taiwan.\n\nSecure, resilient connectivity is not optional. It is a strategic  necessity. H.R. 261 is a solution that offers a balanced, commonsense  solution. It…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our collective faith. It does not do that.  Nowhere in the First Amendment does it say that.\n\nHow does a Nation conquer evil? How does a nation conquer Nazi  Germany, Imperial Japan, the Soviet Union? Was it all because we just  got together and decided to put together a military, or was there  something bigger? Was there something more important? Was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}]