[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…Medicaid from [these] harmful cuts that would impact the       access to care for millions of Americans.\n\nWe did Republican Governors. Here is a Democrat. Colorado Governor  Jared Polis joined with Oklahoma Governor Kevin Stitt. They are the  chair and vice chair of the National Governors Association--Democrat  and Republican--and they write:\n\nWithout…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Emily, powerfully, ethically,  and principally fighting hard on your behalf.\n\nKasey lives in the Second Congressional District of Maine, a district  represented by Congressman Jared Golden. I am thankful for Congressman  Golden's service. He served his Nation with distinction overseas and  has come back home to serve this Nation in the United States Congress.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…floor through  the regular process as there is enough bipartisan support to pass this  good and critical legislation, but that didn't happen.\n\nI am grateful to my colleague, Jared Golden, for filing this  discharge petition. I am proud to speak in favor of it. This is a good  bill. I encourage my colleagues to vote ``aye.''", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697868/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…American President to be flying around in a  plane created by the dictator, the theocratic monster of Qatar, while  they are collecting billions of dollars. His son-in-law, Jared Kushner,  has gotten $2 billion from Saudi Arabia.\n\nThis is totally in violation of the Constitution. Article I, Section  9, Clause 8 says that nobody holding an office of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…plagues  Apex and causes major slowdowns at the Southern Nevada Bureau of Land  Management and stifles economic growth in the county.\n\nI thank Chairman Westerman, Ranking Member Jared Huffman as well as  Representative Hoyle and the rest of the Natural Resources Committee  for allowing this measure to pass through committee and to come to the  floor.\n\nMr.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I rise today to speak in favor of the  nomination of Jared Isaacman to be the next NASA Administrator, but  first, I want to make a few comments about the unbelievable weather  events that are impacting the Pacific Northwest.\n\nWe have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Angels, and Tren de Aragua there. They  frequented this nightclub that was shut down.\n\nWe are in this mess because of far-left policies from our Governor in  Colorado, Governor Jared Polis, our State legislature, and the Biden  administration.\n\nI thank Sheriff Joe Roybal and all of the people from El Paso County  Sheriff's Office and the Colorado Springs…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690282/raid-in-colorado-springs"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…AP-BROADCAST; Arzoumanov, Abigail: CNN; Asberg, ROLF STEFAN:       SWEDISH BROADCASTING; Ascencio, Oscar: CNN; Asencio,       Cristina: CNN; Asghar, Syedah: NBC NEWS; Asher, Jared: FOX       NEWS; Ashley, Phylicia: WJLA-TV/NEWSCHANNEL 8; Asiedu, KWASI:       BBC; Asmael, Hussein: AP-BROADCAST; Assaf, Caitrin: GRAY       TELEVISION; Asthana, Anushka:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the men and  women who show up for the American people every single day.\n\nMr. Speaker, I urge my colleagues to support this bill. I thank my  friend and colleague from Maine, Jared Golden, for his partnership,  and, more importantly, for his courage in advancing this initiative.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…District Chief Beth       Tucciarone of Manatee County EMS.\n\nUnit Citation Award: Engineer Joshua Eriksen, Engineer       Zachary Gilbert, Firefighter Bo Gurskis, Lieutenant Jared       Manning, Engineer Louis Chiocchio, Firefighter George Norris,       Captain Jonathan Turpin, Battalion Chief Barry Cornelison,       Lieutenant Matthew McCabe, Engineer…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, I am honored to welcome Jared Anderson and  the Friends of Club 21 Choir here to Washington, D.C.\n\nThe choir, composed of talented individuals living with Down syndrome  and who are based in Colorado's…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699252/welcoming-jared-anderson-and-friends-of-club-21-choir-to-washington-dc"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Frank,       Thomas: E&E News; Frazin, Rachel: The Hill; Friedman, Amanda:       Politico; Friedman, Sara: Inside Washington Publishers;       Fuchs, Hailey: Politico; Gans, Jared: The Hill; Garber,       Megan: Atlantic Monthly; Gardner, Emma: Inside Washington       Publishers; Gardner, Lauren: Politico; Gardner, Sophia:       Politico; Geidner, Christopher:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of California,  Ed Case of Hawaii,   Jim Costa of California, Laura Gillen of New York,\n\nJames Himes of Connecticut, Chrissy Houlahan of Pennsylvania, Marcy  Kaptur of Ohio, Jared Moskowitz of Florida, Marie Gluesenkamp Perez of  Washington, and  Tom Suozzi of New York.\n\nThe other 200 Members who were present chose not to censure that  conduct. I find…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…January 16, 2025.      Hon. Bruce Westerman,      Chairman, House Committee on Natural Resources, Washington,           DC.      Hon. Jared Huffman,      Ranking Member, House Committee on Natural Resources,           Washington, DC.\n\nDear Chairman Westerman and Ranking Member Huffman: The       Essential Minerals…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}]