[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…energy efficiency.  More than 300 local contractors alone work on projects directly  supported by the Weatherization Assistance Program.\n\nSince taking office, Trump has been jeopardizing clean-energy jobs in  Minnesota by terminating clean-energy incentives in his so-called ``One  Big Beautiful Bill,'' canceling grants and illegally withholding funds  from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…other side of the aisle are  choosing to relax these standards for clean air, all while stripping  healthcare away from more than 13 million Americans.\n\nI mean, they are jeopardizing our health and taking away our  healthcare. I urge my colleagues to strongly oppose this bill. It is a  corporate giveaway that hurts our constituents once again.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691595/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…ugly law and redirect that money to where it belongs: lowering  healthcare costs.\n\nIn that same bill, Republicans cut more than $1 trillion from our  healthcare system, jeopardizing millions of Americans. Reclaiming this  $75 billion from ICE would prevent 700,000 Americans from losing their  health insurance. That is 700,000 Americans protected. That…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…hospitals  and a shortage of nursing homes in their communities?\n\nAnother ugly reality of this bill? It will make the largest cut to  nutrition assistance in American history, jeopardizing access to SNAP  benefits for 40 million Americans, including at least 32,000 of our  neighbors in Minnesota.\n\nMillions of children, seniors, people with disabilities, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…for mom or  dad to get off work and come get them or not.\n\nThe Trump administration's failure to release this funding on time is  disrupting school and district planning, jeopardizing the education of  millions of students, and forcing layoffs, program delays, and  cancellations for students and their families. It is wrong, and it is  completely unnecessary.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…for a wide breadth of species. They support countless jobs.  Our Great Lakes' fishing economy alone is worth more than $5 billion.\n\nUnfortunately, there are many threats jeopardizing the future of the  Great Lakes and the region's way of life, including, as my colleagues  just heard described, the highly invasive sea lamprey, one of the most  disgusting…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…government.\n\nThis bill will shut down rural television and radio stations, cutting  off coverage of local news, eliminating emergency information like  severe weather alerts, jeopardizing access to PBS KIDS, children's  programs like Sesame Street--yes, Sesame Street.\n\nThis bill rips lifesaving support away from hungry, displaced, and  sick people in developing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…including $150  million for CVI efforts. Michigan programs lost millions, forcing  layoffs and cuts. Worse, the current budget would slash dedicated CVI  funding even further, jeopardizing these lifesaving efforts.\n\nCongress must act to restore funding and protect proven prevention  strategies.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695493/community-violence-intervention-funding"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…equitably reap the earned benefits of their tireless labor.\n\nWith fewer than 100 days in office, President Trump has already  caused tremendous harm to Social Security, jeopardizing the well-being  of tens of millions of seniors, veterans, and people with disabilities.  This assault on Social Security is an assault on our nation's most  vulnerable and…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Santa Ana have created a climate of fear,       anxiety, and instability across our community. These actions       are harming hardworking immigrant families, directly       jeopardizing public safety, and impacting the local economy.\n\nThe aggressive tactics used by federal agents have       shattered trust in law enforcement and are eroding the       critical…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…month.\n\nThe legislation in front of us today would rip these benefits from  Susan and her husband, denying them access to healthcare, forcing them  to ration their food, and jeopardizing their ability to remain in their  home. For what? To line the pockets of the ultrawealthy, to pad the  bottom line of corporations already raking in profits.\n\nI offered…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688096/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Republicans  do, not what they say.\n\nRemarkably, instead of lowering costs, this reckless budget  resolution bestows tax cuts for the wealthiest 1 percent of Americans  while jeopardizing essential healthcare and nutrition programs. For  this reason, I strongly oppose the budget resolution authored by House  Republicans.\n\nShockingly, gutting programs our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Those are the  words of the Office of Management and Budget Director Russ Vought, an  unelected bureaucratic.\n\nThe Federal workforce has dwindled by 200,000 since January,  jeopardizing the public services that so many people rely on. I say:  Spare us your false concern.\n\nMr. Speaker, since January, this administration has been stealing  from our communities,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…big, ugly bill is also the largest cut to food assistance in  American history. The bill cuts SNAP benefits by 20 percent for all  participants, or roughly $200 billion, jeopardizing SNAP benefits for  more than 40 million people, including 16 million children and 8  million seniors who rely on this for nutritional assistance.\n\nRepublicans turn their…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…states from 2026 to 2034--\n\nPutting that burden from $72 billion to $190 billion on States--\n\nincreasing the state costs of expansion by 41 to 108       percent and [thus] jeopardizing [medical] coverage for       millions.\n\nForty states plus Washington, D.C. have adopted the       Medicaid expansion--\n\nForty States, plus the District of Columbia have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…interference and  aggression toward the American financial system is a serious and  growing threat. The CCP has a well-documented history of abusing  international financial norms, jeopardizing both our national and  economic security in the process.\n\nFrom manipulating currency and distorting markets to propping up  state-owned industries and weaponizing finance…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…traumatic brain injury when the next man hit them in  the face with a volleyball.\n\nThere is nothing honorable about robbing women of opportunities,  invading their privacy, and jeopardizing their safety in athletic  competitions. Allowing biological men to participate in women's sports  is incompatible with the values of our servicemembers, our service  academies,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…important, the justice they deserve.\n\nTragically, over the past 8 years, across multiple administrations,  the balance of the Crime Victims Fund, or CVF, has plummeted,  jeopardizing Federal support for these victims.\n\nThis fund does not use taxpayer dollars. It is solely financed by the  fines, settlements, and other monetary penalties collected from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Rudder's       225 Rangers was to disable five 155-millimeter artillery       guns, which could have rained artillery fire on the American       forces landing on either beach, jeopardizing the invasion.\n\n(7) Unknown to the American forces, the guns had been moved       from the tip of the Pointe and hidden, pointed in the       direction of Utah Beach, in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…door openings in an hour often undercounts the real number of door  openings. This means the appliance's interior temperature may rise  above safe food-storage conditions, jeopardizing food safety.\n\nOnce again, the left's pro-Big Government, Green New Deal agenda  harms the little guy. The Biden Department of Energy implemented a  policy that threatens…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Through gender-affirming care, Democrats are indoctrinating children  and causing them to make life-altering decisions about their body  involving hormones and surgery and jeopardizing their health. So-called  gender-affirming care is the genital mutilation and chemical castration  of children. It is not lifesaving care. It is child abuse.\n\nAll evidence…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…environmental laws or to lower prices for American families.  It was to satisfy the radical green activists.\n\nLet me be clear that this ban put politics over people by  jeopardizing the American economy and handing Vladimir Putin a lifeline  as our European allies were forced to scramble for energy. That was not  leadership. That was failure.\n\nIt gets…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…years.\n\nOver time, certain foreign producers have deliberately evaded safety  and regulatory standards to gain a competitive advantage over domestic  producers, potentially jeopardizing public safety in the process.\n\nThis bill ensures that PHMSA has the necessary tools to conduct more  frequent inspections at foreign manufacturing facilities and to hold…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…lose 17 percent of  its capacity in the next year. This has led to an average gasoline  price of nearly $5 per gallon, an increased fuel dependence on Asian  producers, and jeopardizing the fuel supply chain of military  installations in their State.\n\nWe must not let this become status quo across the country. H.R. 3109  requires the National Petroleum Council…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…energy development. Instead, the  North Dakota resource management plan seeks to curtail coal, oil, and  gas production by locking away taxpayer-owned energy reserves and  jeopardizing our Nation's energy security.\n\nUnder this plan, nearly 213,000 acres--or 45 percent--of Federal oil  and gas acreage is closed off to new leasing. It also closes off access…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…rule. In a sector that already faces stiff foreign  competition and very narrow margins, the Biden administration heaped  further unnecessary burdens onto this industry, jeopardizing the jobs  of thousands of American workers in the process.\n\nAdditionally, there is the independent and smaller scale refiner that  often lack the scale of larger competitors…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…counties  throughout Minnesota. For years, Minneapolis has passed several  sanctuary city policies while at one point attempting to defund its own  police department, further jeopardizing public safety.\n\nMy legislation, the Save SBA from Sanctuary Cities Act of 2025, would  require the Small Business Administration to relocate its offices out  of sanctuary…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…stewarding tax dollars, protecting our most vulnerable,  preserving programs that they depend on, and not allowing people in  this country illegally to siphon money away, jeopardizing those safety  nets.\n\nMr. Speaker, may I inquire as to the time remaining.\n\nI will start by thanking my good friend and ranking member, Mr.  Brendan Boyle. He is a good American,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}]