[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Jewish community  values.\n\nI rise in strong support of my resolution, H. Res. 352, to recognize  Jewish American Heritage Month and highlight the enduring contributions  of Jewish Americans to our country.\n\nI proudly sponsored this bill when I was a freshman Member of  Congress, and it was the first piece of legislation that I passed as a  freshman 20 years…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Drew for approaching me in good faith. Our teams working together put  forward a resolution that addresses the enormity of this challenge,  this threat that our Jewish constituents and Americans are facing. I am  proud to co-lead the resolution with the gentleman, and I think his  interaction with our office is a reflection of how things ought to work…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…family, these  American heroes' headstones were replaced, properly honoring their  heritage after all these years. It was so moving to honor the  tremendous sacrifices Jewish Americans paid in service to our Nation,  fighting for the same rights and freedoms every American cherishes.\n\nAt a moment when anti-Semitism is at record highs, this moment of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…with my children watching TV, we  saw that here in the United States, in 2025, Jews are being burned  again.\n\nYou see, Mr. Speaker, it feels like open hunting season on Jewish  Americans. I wear a kippah not because I am a proud and observant Jew.  I am not all that observant. I wear it out of respect for all the Jews  around America who do not feel safe…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…identity in the face of persecution, enslavement,  genocide, discrimination, and unimaginable adversity. Since the arrival  of the first Jewish immigrants to America in 1654, Jewish Americans  have made extraordinary contributions to every facet of American life-- strengthening our culture, economy, and society.\n\nThis alarming trend has inspired a growing grassroots…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…community;\n\nWhereas, since 2006, Presidents Bush, Obama, Trump, and       Biden have all issued proclamations for ``Jewish American       Heritage Month'', which celebrates Jewish Americans and       encourages all people of the United States to learn more       about Jewish heritage and the contributions of Jewish people       throughout the history of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…seen Hamas sympathizers take over  college campuses and instill fear in Jewish students. We have seen  violent protests on our streets and now in our Nation's Capital. Jewish  Americans are afraid to walk outside or live their daily lives. For  nearly 600 days now, Israel has defended itself against Iran-backed  Hamas terrorists who want to destroy Israel…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}]