[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…history. Instead, they are attempting  to whitewash history and have begun promoting so-called patriotic  education, a sanitized version of history that skips over slavery, Jim  Crow, redlining, and systemic racism.\n\nHe signed an executive order reinstating ``commonsense discipline  practices in school,'' rolling back previous administrations' attempts…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…together in pursuit of economic justice. The economic  power structure responded not by expanding economic opportunities but  by restricting the right to vote. The result was Jim Crow 1.0, which  deprived generations of African Americans of the right to vote, the  right to choose leaders who could ease their economic burdens and  expand opportunities for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…as we  did with the late Melissa Hortman. Instead, the majority proceeded with  a resolution that brings great pain to the millions of Americans who  endured segregation, Jim Crow, and the legacy of bigotry today.\n\nWe should be clear about who Charlie Kirk was. He was a man who  believed that the Civil Rights Act that granted Black Americans the  right…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…work pursuing justice in cases that  were swept under the rug, some of the most brutal crimes in our  Nation's history targeting Black Americans in the American South in the  Jim Crow era and during the civil rights movement. We passed that bill  in 2022.\n\nI am grateful for the unanimous, bipartisan support of the Senate  tonight in passing the Civil Rights…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698140/civil-rights-cold-case-records-collection-reauthorization-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…dedicated their lives to ensuring not only that their children had  a good education but every child did. Not every child is so lucky.\n\nThe legacy of 300 years of slavery and Jim Crow, massive resistance,  and chronic underfunding have created too many obstacles to the ability  of States and local governments to give every child an opportunity for  a good…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…rather than the traditional position of  Republicans to be for it.\n\nPerceiving a threat, some Republican leaders came up with a       response that evoked memories of the Jim Crow South: make it       harder for low-income minority citizens to vote. Because poor       minority voters were overwhelmingly Democratic, measures that       dampened turnout…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Voting  Rights Act and all of the laws that were passed because of the work of  Dr. King, they weren't a magic wand that erased over 300 years of the  impact of slavery and Jim Crow. That requires intention, intentional  unwinding to recognize that you have people like my mother's family,  who her parents, her brothers, and her sisters didn't go to school…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…fight for voting rights is already over.  In fact, the Assistant Attorney General for Civil Rights has said that  the Voting Rights Act ``was once necessary to push back on Jim Crow  laws.''\n\nAt her hearing in front of the Judiciary Committee, I asked her if  she will enforce section 2 of the Voting Rights Act, which the Supreme  Court of the United States,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Nation's true history  and its long history of struggles that have shaped it, from overcoming  the loss of land, the killing and displacement of indigenous people,  slavery, Jim Crow, internment, and the continued struggle for justice  across our communities.\n\nThis is our true history as a nation, not something we should be  ashamed of, but what has shaped…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…believes  should have access to vote and who should not.\n\nAnyone who votes for this resolution will go down in the history  books with the likes of Confederate politicians, Jim Crow advocates,  and white supremacists as bigots.\n\nMr. Speaker, I urge my colleagues to vote ``no.''", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the other, Republicans in Congress are pushing the SAVE Act--one of the  most destructive, dangerous voter-suppression bills in recent memory.  It is very reminiscent of Jim Crow. That is what Republicans want to  do--they want to not only restore Jim Crow in the South; they want to  have Jim Crow spread from one end of this country to the other.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…sparked my imagination as a child. It is  an idea that as I listened to my parents tell stories of what their  life was like growing up during the Depression, growing up during Jim  Crow, where they didn't always have their needs met, not because of any  fault of their own or their parents, but they saw the best of  government through the New Deal, where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…their lives to ensuring not  only that their children but every child had a good education.\n\nNot every child is so lucky because the legacy of over 300 years of  slavery and Jim Crow, massive resistance, and chronic underfunding has  created too many obstacles to the ability of States and local  governments to give every child an opportunity for a good…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…as for the SAVE Act itself, it has nothing to do with protecting  our elections and everything to do with federalizing voter suppression.  The SAVE Act is nothing more than Jim Crow 2.0. If the SAVE Act were to  become law, online registration, registration by mail, and registration  drives become a thing of the past. If you are one of tens of millions…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699484/government-funding"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…Federal right to vote by  1920, States still devised schemes to impose draconian restrictions to  prevent voter registration for people of color.\n\nThese restrictions were Jim Crow laws. I never understood it, but in  1988, when I ran for office for the first time, I wanted my grandmother  to vote for me. I was leading folk to the polls to register to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…debate today, we are  likely to hear all sorts of comments from my colleagues on the left.  They will make arguments about disenfranchisement. They will use terms  like ``Jim Crow 2.0.'' I remind everyone watching to reflect back on  the same language that was used when Georgia instituted election  integrity provisions in 2021.\n\nWe can actually look,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…show your ID.\n\nThis is not some convoluted idea, Mr. Speaker. You hear the other  side talking about it as the end of the world.  Their own leaders have referred to it as ``Jim Crow.''\n\nIt is not the first time that they have used that phrase. They used  that when the State of Georgia put an ID requirement on voting. They  said it was going to be horrible…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…a  moment.\n\nLet's look at the election integrity law that was passed in the State  of Georgia. This, if we recall, in 2021 was a law that then-President  Joe Biden called Jim Crow 2.0. In fact, the stories that were told  about that legislation earned him, I think, four Pinocchios, or  whatever they call that in The Washington Post. This is how ridiculous…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…commonsense piece of legislation that  requires two things, voter ID, plus proof of citizenship, is being  labeled by people in the Senate and people in this very Chamber as Jim  Crow-era laws.\n\nLet me remind the American people of history. It was the Democratic  Party who championed the Jim Crow-era laws. And this is the farthest  thing from it. In fact,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…started a trucking business with one truck, one trailer, and  no excuses. Then a generation later, I started a trucking company  during the COVID pandemic.\n\nHe grew up in the Jim Crow South and moved to Michigan in search of  opportunity and for the American Dream. Tooth and nail, he fought  harmful regulations and misguided rules that would have prevented…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]