[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…In the first 20 days of January, the Capitol Complex was the focus of  three large-scale events--the January 6 Election Certification, the  lying in state of former President Jimmy Carter, and the 60th inaugural  ceremonies. And after the President-elect requested the ceremonies be  held indoors, our staff and partners worked around the clock to prepare…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…need  what the 504 loan program provides: certainty and affordable patient  capital.\n\nMadam Speaker, I am proud to lead this bill, and I thank my  colleague, Representative  Jimmy Patronis, for his partnership in co- leading this important piece of legislation with me. Of course, this  bill would not be possible without the leadership of Ranking Member…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…awarded a $2,000 scholarship.\n\nAs a result of her win, this June, Mira will be representing  Northeast Ohio in the National High School Musical Theater Awards, also  known as the Jimmy Awards, held in New York.\n\nAt the Jimmy Awards, Mira will join top high school musical theater  students across the country to compete and showcase her extraordinary  talent…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691952/mira-cahalane-named-ohios-13th-district-champion-of-the-week"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…lawlessness and recklessness of  this administration.\n\nAnd it is the result of a contempt for the law, for legal norms that,  seemingly, is boundless. We have seen it in the Jimmy Kimmel episode  where the FCC Chair said, in mobster-like language: They can do it the  hard way or the easy way.\n\n``You have a nice restaurant there. It would be a shame if…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of Defense. It means universities are refusing to play ball,  declining the offer. It means Americans use the power of their purses  to say you will not silence someone like Jimmy Kimmel and he was  reinstated.\n\nBut it doesn't stop there. It is an unprecedented move by Federal  judges appointed by Democrats and Republicans alike that are speaking  out…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…seeing whole communities changed and revitalized  because of this. That was only made possible by the Department of  Energy's invention of fracking technology since President Jimmy Carter  first founded the Department when he was President of the United States  in the 1970s. Ohio's nuclear industrialized north is being positioned  to grow through fundamental…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…positions have always targeted it for  censorship.''\n\nThese are not my words. These are the words of Brendan Carr, the  current FCC Chairman.\n\nThis week, Chairman Carr called for Jimmy Kimmel's show to be  canceled for using that very same satire--Jimmy Kimmel, Stephen  Colbert, suppression of free speech.\n\nI don't see this administration saying anything…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…to our  community.                            recognizing jim oregel\n\nMr. CORREA. Madam Speaker, I rise today to honor my good friend and  fellow Anaheim High School alumnus, Jimmy Oregel, for a life of  dedication to the city of Anaheim and to Anaheim High School.\n\nAt St. Boniface, where we both attend, he helped found the Orange  County Congregation…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Communications  Commission, went on a partisan podcast and threatened ABC, the American  Broadcasting Company, and its parent company, Disney, over a joke told  by comedian Jimmy Kimmel. Carr called Kimmel's comments the ``sickest  conduct possible'' and suggested revoking the broadcast licenses of ABC  affiliates.\n\nHe then delivered a line toward ABC…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…were cut short, far too early, by President  Kennedy; and empowered in such an extraordinary way by President Lyndon  Baines Johnson; built upon aspirationally by President Jimmy Carter.  Then, it advanced to the Children's Health Insurance Program by  President Bill Clinton, furthered in such an extraordinary way by  President Barack Obama, and then…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Department of Education.                                 Point of Order\n\nMr. THANEDAR. As enacted in the Department of Education Organization  Act, signed into law by President Jimmy Carter, the Department of  Education was established by Congress to create reform in the education  system throughout the country, distribute Federal aid to students and  places…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…doesn't have the legal authority to do that. He doesn't have the  legal authority to do what he is doing right now.\n\nTrump claims to have authority under a 1977 law signed by Jimmy  Carter, the International Emergency Economic Powers Act. This law was  so uncontroversial in 1977 that it was passed on a voice vote.\n\nNow, can you imagine? Jimmy Carter is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…politburo and  judiciary.\n\nHarry Truman understood this. Dwight Eisenhower understood this. John  F. Kennedy understood this, and so did Lyndon Johnson, Richard Nixon,  Gerald Ford, Jimmy Carter, Ronald Reagan, George H.W. Bush, Bill  Clinton, George W. Bush, Barack Obama, and Joe Biden. These men,  whether you deem their Presidencies good or bad, understood…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…lifetime. Her legacy of determination and excellence paved the way for  future Black educators, ensuring the doors she opened would remain open  for others to walk through.\n\nJimmy Carter, Basketball: No, not that Jimmy Carter, but still, he  looms large in west Michigan as a basketball phenom and a name truly  synonymous with basketball excellence in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…to mention Daniel ``Chappie'' James because I remember, as a  kid in those schools I was attending in South Carolina, I would hear  all this stuff and read this stuff about Jimmy Doolittle. I read up on  Jimmy Doolittle. He was an outstanding military person, but his resume  does not touch the resume of Daniel ``Chappie'' James, who became the  first…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…have  tried to address, and there is more we can and should do.\n\nBut, under President Biden, the country experienced, as I said,  historic levels of inflation not seen since Jimmy Carter was President  of the United States. The cumulative inflation from the time President  Biden took office until he left was 20.6 percent. Stated another way,  everything…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…it's clear his most beautiful life  accomplishments have been marrying his wife, Lorna, and becoming a dad  to Tucker.\n\nI hope Garrett celebrates with a Miller High Life and Jimmy John's  and I'll be sure to do the same to honor his service today.\n\nMr. Speaker, please join me today in honoring Chief Warrant Officer  Garrett Illerbrunn for his dedicated…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the Grand Marshal of the 201st Savannah St. Patrick's Day Parade.\n\nThis prestigious role is made even more special as Jay follows in the  footsteps of his father, James F. ``Jimmy'' Burke, Jr., who led the  same parade 28 years ago in 1997.\n\nTheir legacy is a testament to the deep tradition of this event, one  of America's oldest and grandest St. Patrick's…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…thank  Representatives Rick Crawford,   David Rouzer, Doug LaMalfa, Pete  Stauber, Dusty Johnson, Burgess Owens, Eric Burlison, Jeff Hurd,  Jefferson Shreve, Dave Taylor, and  Jimmy Patronis, who all contributed  provisions to this bill.\n\nI especially thank the chairman of the subcommittee,  Mike Collins,  for working with me on this. He has shown extraordinary…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of Pennsylvania. Mr. Speaker, I rise today to recognize  Celebrate Community Week.\n\nAs co-chairs of the bipartisan Congressional Service Organization  Caucus, Congressman   Jimmy Panetta and I introduced a resolution to  designate the week of September 14 through September 20 as Celebrate  Community Week, where we honor the efforts of local service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695366/recognizing-celebrate-community-week"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…support of the Chronic Disease Flexible  Coverage Act, introduced by Ways and Means Health Subcommittee Chairman  Vern Buchanan and our Ways and Means colleague, Representative   Jimmy  Panetta.\n\nThis legislation provides employers and their employees with greater  flexibility to design healthcare coverage options that expand access to  treatments for chronic…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS. Mr. President, yesterday, the People's Republic of China  sentenced Jimmy Lai to 20 years in a Chinese prison.\n\nHis crime? Freedom. He was an outspoken, pro-democracy journalist,  and he was jailed for his reporting on government.\n\nAt 78 years old,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…name and a face on the environment that  was created by our colleagues and by the previous administration in  endangering people.\n\nWe talk about: Say his name. Say the name of Jimmy Friesenhahn. In  San Antonio, a father of a young daughter, a veteran of the Marine  Corps, Jimmy fell victim to the pro-criminal policies and the open  border that my friend…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, Jimmy Failla offered Democrats this pro  tip: If you are going to call it the Republican shutdown, you are not  supposed to get mad that it is ending.\n\nAnyone who remembers their…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696689/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Arkansas National Forest in 1907 (later renamed       the Ouachita National Forest by President Coolidge in 1924)       and the Ozark National Forest in 1908.\n\nIn 1977, President Jimmy Carter requested that the Forest       Service undertake a review of all potential wilderness areas       across the country and make recommendations to Congress.       Their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…pass commonsense legislation like H.R. 1491 to ensure that victims  of natural disasters are not burdened by our tax code.\n\nMr. Speaker, I thank my colleague, Congressman   Jimmy Panetta, for  his partnership on this critical issue, and I thank Chairman Smith for  his support and efforts to help provide relief to disaster victims.\n\nI encourage all of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…overregulations from Washington have  held our producers back. By joining the Agricultural Trade Caucus,  alongside Representatives Adrian Smith,   Jim Costa, Dusty Johnson, and\n\nJimmy Panetta, I will continue to fight to remove unfair trade  barriers, open new markets for Iowa products, and promote policies that  keep our local family farms strong and competitive.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…on this, too, and they are out of step with the country.\n\nAmericans of all political persuasions have supported tighter  election laws for decades. In 2005, former President Jimmy Carter, a  Democrat, joined former Secretary of State Jim Baker, a Republican, to  form a Commission on election integrity. They identified voter ID laws  as the single most…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…America  Act to secure our elections.\n\nMr. PALMER. Mr. Speaker, I point out that in 2005, 18 of the 21  members of a bipartisan Federal commission headed by former President  Jimmy Carter and former Secretary of State James Baker came out in  support of photo ID requirements more stringent than what Indiana had  at that time. ``Voters in nearly 100 democracies…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]