[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Virginia. Mr. Speaker, in closing, I yield myself the  balance of my time.\n\nMr. Speaker, according to last week's Bureau of Labor statistics,  2025 was the worst year for job growth in this country since the last  Trump administration. 2025 had 3 months of job losses. Meanwhile,  President Biden had 48 consecutive months without a single loss. At  this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…districts at the top of  clean energy investments are represented by my colleagues on the  Republican side of the aisle.\n\nWhat are the top three States overall of clean energy job growth?  Idaho, Texas, and New Mexico--two out of those three States represented  by Republicans in the Senate. For wind energy, it is Texas, Iowa,  Oklahoma, Kansas, and Illinois--four…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Minnesotans'  energy costs, their funding cuts will have a chilling effect on clean- energy jobs--a sector that has been growing five times faster than  Minnesota's overall job growth. More than 62,000 Minnesotans work in  clean energy, and more than 44,000 of them work in energy efficiency.  More than 300 local contractors alone work on projects directly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, 2025 was one of the worst years for job  growth in decades. In fact, if you don't count COVID, the United States  created fewer jobs last year than any year since 2009. You don't need  data. Just ask anyone who has been…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699065/2025-economic-report-and-manufacturing-jobs"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…interest rates, a move that the President has been  urging for months.\n\nInflation remains stubborn. Consumer prices rose by 2.9 percent in  August compared to last year. Job growth is slowing. Unemployment has  climbed to 4.3 percent, the highest in 4 years. We are now veering  toward stagflation: rising prices and a cooling job market.\n\nNo matter what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695597/fed-rates-and-stagflation"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…costs. When  companies shoulder new costs, they hire fewer workers. And we are  seeing that in many parts of the country. We are seeing it in Rhode  Island.\n\nUnsurprisingly, job growth, as a result, has stagnated under  President Trump. Payroll company ADP found the private sector actually  lost 32,000 jobs last month, while those Yale researchers estimate…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Trump's tariffs have been a massive tax on the American people,  costing an average household $1,000 per household just in the last  year. These tariffs have led to slower job growth, a declining  manufacturing industry, and less investment. They have hurt our farmers  and increased food costs.\n\nThese tariffs have inflicted real damage on our relationship…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699973/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…are people who  comprise roughly 30 percent of marketplace enrollees.\n\nI am deeply concerned about the chilling effect this premium hike  will have on business creation and job growth, both of which are  already under significant strain in Trump's economy.\n\nDemocrats stand ready to work collaboratively with our Republican  colleagues to fund the government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…important that that is condemned strongly and  unequivocally. I am very proud that that is exactly what the House of  Representatives did today.                         Zero Job Growth in California\n\nMr. KILEY of California. Mr. Speaker, the California Center for Jobs  and the Economy has just released an absolutely stunning report that  shows how deeply…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…will secure a healthy financial future for our children and  grandchildren. It will allow us to extend the successful tax cuts from  2017 that produced the unprecedented job growth and higher wages for  American workers. I urge everyone to support the resolution.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689894/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…tax policy so  that our companies and our families can continue to thrive and continue  to understand what their landscape is for them to compete and go and  create more job growth and actually go and create more revenue for our  Nation to become a wealthier nation. This is a priority for  Republicans. It is a priority for House GOP leadership, the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…in 1999. In  2002, he was elected to serve as the Mayor of Celina and was reelected  twice. Under Corbett's leadership, Celina transformed economically  through increased job growth and critical business investments. As a  result of his advocacy for Celina residents, he was recognized as a top  influential leader in Collin County. After his tenure as…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…and our quality of life here at  home, we must unleash growth, starting with the largest tax cut in U.S.  history.\n\nJust like the first Trump tax cuts, we can expect record job growth,  investment, repatriation of capital back to the United States, record- low unemployment, record-high wage growth, and the lowest poverty rates  in recorded history.\n\nThis…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…we had more  jobs in California. As it is, under Governor Newsom, California has the  highest unemployment rate in the country. A recent jobs report showed  literally zero job growth in California. I would love to create more  jobs.\n\nWe could create jobs by hiring people to dig a hole and hire more  people to come and fill the dirt back in, which isn't…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…low, averaging $2.95 a gallon. Advanced  manufacturing and industry are returning to U.S. soil.\n\nPresident Trump has secured over $8 trillion in investments that will  fuel job growth and create opportunity. The stock market continues to  set new all-time highs.\n\nIt is a fact that Republicans are committed to making sure  hardworking Americans keep more…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…businesses and families.\n\nFrom bringing the southwest border crossings to their lowest in  history to ushering in critical private investments to our communities  and boosting job growth, the Trump administration has wasted no time in  reversing many of the wrongs of the last 4 years.\n\nWe have much to celebrate and highlight this evening. I appreciate my…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…fails to recognize this reality, let's look  at what is  true. Fracking and shale gas have both revolutionized and transformed  American energy, leading to lower prices, job growth, and increased  American energy security. According to the Energy Information  Administration, the rapid expansion of natural gas-fired powerplants in  this country has decreased…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…heard from our  Indiana Realtors--and no one knows our communities like our Realtors-- about the importance of homeownership and having sufficient housing  inventory for job growth and economic creation.\n\nI appreciate these listen-and-learn opportunities with our local  small businesses and constituents. All policy is so very local.\n\nMr. Speaker, I…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689234/all-policy-is-local"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has  been increasing.\n\nThe LAO, the Legislative Analyst's Office, also noted in their report  on the State budget that the State's economy is not in good shape.  Indeed, job growth this year has amounted to zero, nothing. There has  literally been no job growth in the State of California.\n\nIn addition, consumers in California are increasingly pessimistic…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…excellence and customer  collaboration. This $4 million investment not only expands production  and warehouse capacity, but also strengthens the local economy and  supports job growth in Michigan.\n\nMr. Speaker, I applaud SABA's continued success and leadership, and I  am proud to welcome their expanded presence in St. Clair. I wish them  the very best…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694765/congratulating-saba-on-the-grand-opening-of-its-north-american-headquarters"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in U.S. history.\n\nI am in a 50/50 district, and I am doing bills like this because I  can do math.\n\nMr. Speaker, instead of me walking through all this, did you see the  job growth numbers today? They are actually pretty good. Did you see  the punch line in the job growth numbers?\n\nThe U.S. economy added approximately 140,000 jobs; the market added…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…What we see happening globally is the world's most successful  companies are investing in America, and $10 trillion is coming to our  shores. Record investment is driving job growth. It drives innovation  and drives opportunity.\n\nWe passed a comprehensive economic plan called the working families  tax cut law. It is the central part of our economic plan.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}]