[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…and  the Apex Industrial Park Owners Association with improved access and  management authority in the Apex Industrial Park.\n\nThe Apex Industrial Park is a critical driver of job creation,  logistics, and advanced manufacturing in southern Nevada and the  critical update provided by this bill would open the door to more  efficient growth, infrastructure…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…moral case is undeniable. Yet, the Occupational Safety and Health  Administration, OSHA, still lacks a national standard to protect  workers from dangerous heat exposure on the job.\n\nIn addition to the important legislation mentioned by the gentleman  from Arizona to address the issue, I am a proud cosponsor of the bill  introduced by the gentlewoman from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…businesses, large and small, against the  chaotic actions of this administration.\n\nForeign direct investment can be part of the solution to revitalize  American manufacturing and job creation. Over a third of all foreign  direct investments are in domestic manufacturing, exceeding a total of  $120 billion a year.\n\nThis bill will help ensure we keep that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…But, of course, we are hearing that Republicans may still try to  bring this legislation to the floor as soon as tomorrow. That is not  real legislating. This is a total rush job. This is Donald Trump  bullying Senate Republicans to get a bill passed no matter what is  actually in it, and this is Republican leadership perhaps daring their  own members…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…ADHD, autism, and other disorders that       require extra care and attention. It is my life's mission to       bring what I know to those who want to learn it. I love the       job I do. I love that I get to spend time with those who need       it most and deliver care and education. The job that I do       helps my students live more independently and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…her. And if she doesn't get fired, she should be impeached,  because while she is not the only one who is the brains behind these  operations, she was the one who got the big job. She was the one who  sat in front of many of us for Senate confirmation. And she has done  nothing to defend the values that she claimed when she held her hand up  and swore…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…truly a priority. Federal, State,  local, and Tribal officers face very long hours, immense pressure, and  unpredictable dangers every day. Over time, the constant strain of the  job can take a significant toll on their bodies and minds.\n\nWhile there are some mental health resources currently available to  our officers, there is still so much more that we…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…She got fired on February 14 because she was a probationary  employee. Probationary, not because she had done anything wrong, but  because she had been promoted into the new job. She was with me last  night, and she had to sit here and listen, along with me--and I had  spent the day with her--to Donald Trump saying one of their top  priorities is to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688507/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…across the aisle, obviously, wants us to be ``sleep''  because that is the opposite of being woke. I guess my colleagues  should introduce sleepy policies and be ``sleep'' at the job.\n\nMr. Speaker, I rise to voice my strong opposition to the efforts to  undermine American small businesses by the very agency tasked with  fueling them.\n\nLet me be clear. This…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…to strengthen education  in America. He is looking for someone to destroy it. President Trump  has said publicly that he wishes that Mrs. McMahon would ``put herself  out of a job.'' And it is clear that she is ready to do it. And to  justify it, I know I have heard of her countless accusations of  Department of Education overreach or that the Department…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…service-connected disabilities  deserve every opportunity to succeed in civilian life. That includes  access to the Veterans Readiness and Employment, VR&E, program, which  provides job training, education, employment accommodations, and the  resources to build a meaningful career. However, too often, that  support comes too late. In Portland, it currently…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695413/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Department  of Homeland Security are reallocating resources away from investigating  major crimes so they can terrorize undocumented immigrants who are just  trying to work a job and provide for themselves and their families,  including some who were legally present here and had legal status until  this administration suddenly reversed it.\n\nFor all its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…opposed helping working  families. The Trump White House also hated this amendment and sent out  a statement of opposition. They went to FOX News to complain that we  are doing our job to serve the people. Call me crazy, but I believe  that the work we do in Congress should improve the lives of the  American people.\n\nAs the Congresswoman proudly representing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690944/gulf-of-america-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Congressional  Review Act to strike down a recent regulatory attack on the Affordable  Care Act launched by the Trump administration.\n\nI think my colleagues have done a pretty good job of explaining what  is at stake. Even the Trump administration's own experts at CMS, the  Centers for Medicaid and Medicare Services, say that implementation of  this rule could…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…trading  partner in auto parts, machinery, and food products. Disrupting the  supply chains through tariffs or threats to pull out of trade deals  like the USMCA could destabilize job-creating industries within  Illinois.\n\nMoreover, this trade strategy is not only economically damaging, but  also unconstitutional. Congress, not the President, holds the exclusive…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I thank the chair and ranking member for  their leadership. They did a wonderful job on this.\n\nMr. Speaker, this NDAA contains substantial wins for servicemembers  and their families. It continues the committee's tradition of improving  the quality of life of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697792/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…district and as they talked to normal people to see whether their  concerns and observations squared with those of the people in this  building.\n\nDonald Trump has done a great job of trying to remove the diversity,  equity, and inclusion from our government, including our military. We  have, to a degree, gotten rid of some of the bureaucrats who pushed…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…where they belong with workers, families, and employers,  not the Federal Government.\n\nBottom line, the Lower Health Care Premiums for All Americans Act  empowers workers and job creators and makes healthcare more affordable  for everyday Americans. By the way, perchance you want to keep the  unaffordable care act for yourself, you still can.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…we went home to our loved ones and pretended everything was okay. That  is because if you didn't, Mr. Speaker, you thought you would come off  as weak or unable to handle the job.\n\nAs a former police officer who required professional help after a  specific call for service, I understand the importance of seeking help.  It is not a sign of weakness.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…make it impossible for tens of thousands  of trucking companies to do business because they are unwieldy and  inconvenient.\n\nThis policy is unsustainable, unrealistic, and a job killer. Most  importantly, it will end lives. Telling the Michigan trucking industry  and all other industries that they are willing to move forward with  this policy is unacceptable.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…2009 (47 U.S.C. 1305) is amended by striking ``Assistant       Secretary'' each place the term appears and inserting ``Under       Secretary''.\n\n(11) Middle class tax relief and job creation act of       2012.--Title VI of the Middle Class Tax Relief and Job       Creation Act of 2012 (47 U.S.C. 1401 et seq.) is amended--\n\n(A) in section 6001 (47 U.S.C.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Americans do what they do best. That is  why I have been so proud to champion the One Big Beautiful Bill Act.\n\nThis legislation cuts red tape and gives families, farmers, and job  creators more freedom to succeed. The stories and feedback brought back  from my district aren't just conversations; they are the reason that I  am fighting every day for commonsense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…would do just that and would save hundreds of dollars for  disabled veterans across the country. It would also ensure that the  disabled veterans have the ability to get to a job and earn money to  support themselves and their families.\n\nI thank the DAV and the VFW for supporting this bill last Congress  and for their tireless work on the Hill advocating…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689675/deliver-for-veterans-act"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…competent people. No one can question the  competence of these four people. No one can. All right? These are  competent people who have served our country and who do a great job. So  what we are doing is we are saying: Because some people don't like our  Secretary of Defense, we are not going to allow the President to put a  team together of very competent…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…immigrants from Iran. Right  now, 670 Iranian nationals are being detained. President Trump's  detentions are working.\n\nNow the administration needs more resources to finish the job. That  is why Republicans are fighting for our comprehensive safety agenda.  Our bill increases funding for border security and enforcement by $160  billion. It finishes the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Obama famously said he didn't have the  authority to do things and then did them later and dared the Court to  stop him.\n\nI think we have to come here and realize if we do our job, we are  drawing the appropriate balance on one of the two branches that we do  have an obligation to keep an eye on. We keep an eye on the executive  branch, and the minority…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Army Acquisitions Officer to deliver  critical capabilities to our warfighters. He is also a champion for  expanding vocational education for all students, ensuring they are job-  or college-ready upon graduation.\n\nCOL Wilson continues to lead with strength, integrity, and dedication  for the betterment of his community. Aside from his role as State…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…to uphold the rule of law, serve their neighbors, and keep  their communities safe. Yet, too often, they are met with hostility and  policies from Washington that make their job harder and put their  safety at risk.\n\nLet me be clear. I unapologetically stand with the men and women in  blue. I will always oppose any effort to defund, demoralize, or…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…President Trump on a great speech last night. He is a great orator. I  think of the six speeches I have heard him give in this Chamber. That  was the best one yet.\n\nHe did a great job of recounting the successes he has had in  immigration, the successes he has had in healthcare, the successes he  has had using the tax code to help out parents with children,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700208/president-trumps-great-speech"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…is why housing starts are not going up.\n\nNow, what is Congress's usual reaction to that? Well, we start  passing bills telling the folks in local government how to do their  job. You won't find housing starts in the U.S. Constitution. You won't  find the subject of housing in the U.S. Constitution. It is a State but  it is really more of a local issue.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]