[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "We have seen hand clapping and high fives over people losing their  jobs, people losing their livelihoods.", "title": "People, Not Statistics", "date": "2025-03-05"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "With global demand for building materials set to rise through this  century, we must prioritize investments in advanced materials science  and scale-up domestic manufacturing by fostering an innovation pipeline  that creates jobs and enhances our competitiveness on the world stage.", "title": "Innovative Mitigation Partnerships for Asphalt and Concrete Technologies Act", "date": "2025-03-24"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "His mom and  dad, Shannon and Chris, work full-time jobs, and Medicaid is backup  insurance.", "title": "Recognizing Nkh Awareness Day", "date": "2025-05-01"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "The bill allows employers       to label training as ``voluntary,'' even when workers feel       pressured to attend to keep their jobs or advance, and       removes current protections that ensure training closely tied       to a worker's job is paid.", "title": "Empowering Employer Child and Elder Care Solutions Act", "date": "2026-01-13"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "In fact, they want to replace many of these jobs with loyalists, even  setting up loyalty tests.", "title": "Backlog in Irs", "date": "2025-06-10"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Our colleagues in the Senate just need to do their  jobs.", "title": "Doe and Nsf Interagency Research Act", "date": "2025-03-24"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Is this how Donald Trump has improved the lives of American  families--by damaging their retirement plans, jobs, and social safety  nets?", "title": "Protecting Americans From Harmful Crypto Practices", "date": "2025-05-08"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "It gives young people the tools to succeed, real skills, real  credentials, real jobs.", "title": "St. Louis Job Corps Center", "date": "2025-06-05"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Jobs.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "In an industry that America has been striving to bring back to full  production in this country, we have lost so many jobs abroad to cheap  labor and places that have no labor rights.", "title": "Trump's Reckless Tariff Policies", "date": "2025-07-23"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "This amendment  perpetuates a false narrative that leaves thousands of family- sustaining union jobs at risk.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "That is one reason I am urging my colleagues to vote yes on my  Protect Veteran Jobs Act--a simple amendment that would reinstate every  veteran who has been fired because of Trump and Musk's betrayal.", "title": "Full-Year Continuing Appropriations and Extensions Act, 2025", "date": "2025-03-14"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Through public and  private partnership with certified development companies, the 504  program helps small businesses to grow, create jobs, and invest in  their communities.", "title": "504 Program Risk Oversight Act", "date": "2026-01-20"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "These businesses are crucial to our economy and national security,  creating two-thirds of all new jobs, employing half the private-sector  workforce, and generating almost half of our Nation's economic  activity.", "title": "Made in America Manufacturing Finance Act", "date": "2025-12-01"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Americans are justifiably concerned that these unelected intruders  are acting as judge and jury on people's lives and livelihoods as they  gleefully and illegally feed tens of thousands of jobs and vital  programs into a woodchipper.", "title": "Department of Government Inefficiency", "date": "2025-02-25"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "The information from this audit will help us do our jobs as  policymakers and properly plan for the future of the CVF and avoid  another crisis like this.", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "But here is the reality, folks: These policies make everything more  expensive for families, they kill jobs, and they hurt our small  businesses.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "More investment means more  manufacturing at home and more American jobs--jobs that have been  shipped overseas by the Democrats in the past.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "We have far too many regulations in the United States, and this bill  is about rightsizing our regulations in support of investments and  jobs.", "title": "Expanding Wksi Eligibility Act", "date": "2025-12-01"}, {"senator": "French Hill", "party": "Republican", "sentence": "Chair, because of Arkansas' many rivers, lakes, and other natural  beauties, recreational fishing that is done on the Little Red River now  contributes $1.2 billion and 10,000 jobs to the Arkansas economy.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "In my district, where energy production, manufacturing, and  agriculture are paramount, we know the looming threat of the Chinese  Communist Party on jobs and national security.", "title": "Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-07"}, {"senator": "David Valadao", "party": "Republican", "sentence": "That includes extending key  provisions of the Tax Cuts and Jobs Act, like doubling the standard  deduction, expanding the child tax credit, and maintaining the death  tax exemption.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "However, for decades,  America's policies have shipped good-paying manufacturing jobs overseas  and opened the door for foreign adversaries to fill the void.", "title": "Made in America Manufacturing Finance Act", "date": "2025-12-01"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "My home State of Ohio ranks third in the Nation with almost 700,000  manufacturing jobs.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''", "date": "2025-05-21"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "In 2012, Congress worked to fix that problem, passing the JOBS Act to  create a more affordable path for smaller companies to go public, raise  capital, and fuel the next wave of American innovation, but there is a  problem.", "title": "Greenlighting Growth Act", "date": "2025-07-21"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "And what  this is--what this is--this is us voting for very low positions in the  sub-Cabinet of appointees and nominees--not unimportant jobs, by the  way, but low positions in comparison to the Cabinet--one every 2 hours,  one every 2 hours, because that is as fast as we are allowed to go with  the 1,200 or so nominees that we have the responsibility of confirming  or not.", "title": "-9999", "date": "2025-08-02"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "We certainly shouldn't be looking at ICE agents, condemning ICE  agents who are showing up to do their jobs.", "title": "Providing for Consideration of H.R. Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "economy added approximately 140,000 jobs; the market added  181,000.", "title": "Math is Such An Anathema", "date": "2026-02-11"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Another criminal illegal alien and his family members ran a sex  trafficking operation where they would approach women and girls, some  as young as 14, and lure them to the United States under promises of  jobs.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "We know what is at stake with the next-generation economy: cutting- edge technologies, like AI and advanced manufacturing, hold tremendous  promise to lift up communities across the country with stable, good- paying jobs, while lowering costs for hardworking families.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}]