[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…district.\n\nThis includes people like Yvette from Van Nuys who said that she  wants to retire without spending a large portion of her pension on  medical coverage.\n\nI also heard from Joe from Panorama City who, without the help of  Medicaid, would not be able to afford medical treatments for his  children.\n\nCutting Medicaid will be a disaster for families across…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691409/gop-tax-scam-hurts-women-and-families"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…because of that  relationship, she, obviously, along with others, is locked into this  wokeism that has been plaguing the country.\n\nI didn't even get into the relationship that Joe Courtney had with  Bert and Ernie on the Armed Services Committee. However, Mr. Speaker,  you can only imagine the job and the skill that our colleagues used on  the other side…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…nuclear war and halt and reverse the nuclear arms race.''       With 21 cosponsors, the resolution ``calls on the president''       to take major steps toward sanity, none of which Joe Biden       chose to take and none of which Donald Trump shows any       indication of taking.\n\nLooking at the names on the nonbinding resolution, a reason       for discouragement…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…this year--42,000 down,  not up--not as promised. And that is supposed to be at the center of  his tariff policy? We are losing manufacturing jobs at an accelerated  rate after Joe Biden increased manufacturing jobs.\n\nAnd I would like to, again, really point out what a great job you  have been doing, Senator Kaine, on this in putting a great big  spotlight…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Congressman Brandon Gill of Texas  has our back with a bill to require the $100 note to include a portrait  of Donald J. Trump. No, thank you.\n\nNot to be outdone, Representative   Joe Wilson of South Carolina has  the Donald J. Trump $250 Bill Act. Really? That is a hard pass.\n\nFlight travel has become more dangerous. We have an ongoing air  traffic control…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…supporting Trump or       Harris collectively received more than $500 million from dark       money groups.\n\nFuture Forward USA Action, the main dark money group       supporting Joe Biden and then Harris, gave the most. The       501(c)(4) nonprofit poured more than $304 million into       spending on ads and contributions to its closely tied super…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Madam Speaker, during this Small Business Week, it is my  honor to recognize Joe Clontz on his receipt of the John L. Stanley  Award from the Orange County Chamber of Commerce.\n\nThis award is given to those who are committed to going above and  beyond to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690866/constituent-of-the-week-joe-clontz"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…instrumental in passing  the most significant piece of gun reform legislation in nearly 30 years  with the Bipartisan Safer Communities Act, which was signed into law by  President Joe Biden.\n\nWith that historic legislation, we took meaningful steps to protect  our children, keep our schools safe, and reduce the overall threat of  gun violence around our country…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to congratulate Chancellor  Joe Garcia on his retirement from the Colorado Community College System  (CCCS). Joe spent more than 35 years working in higher education and  leaves CCCS in a strong position for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…threatening to break up the Ninth Circuit.\n\nThe president took an indirect swipe at the judiciary in       August 2017 when he pardoned the controversial former Arizona       sheriff Joe Arpaio, who was convicted of violating a federal       court order to stop racial profiling. Arpaio was a political       ally and a hero to many of Trump's anti-immigrant supporters.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Jason Miller, Jason R. Crawford, Jayme Epstein, Jeanne       Otersen, Jennifer McConnell, Jennifer Ubiera, Esq.\n\nJessica Wang, Jillian W., Jo Harvey, Joanne S. Metzler, Joe       LeBlanc, Jon Drago, Joy Welan, Kahlil Goodwyn, Kameron Davis,       Karen Cassell, Kathleen A. Mireault, Kathy Colton, Kenedi       McCormick, Kerry Krebill, Kerry Krebill,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…another step forward by confirming Justice Jackson, the first Black  woman to serve on the Court.\n\nI want to give credit where it is due. This was the initiative of  President Joe Biden, who made it clear when he was elected President  this was his highest priority when it came to the Supreme Court.  President Biden kept his word.\n\nWith Justice Jackson's…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…should fully understand that they are subject to  investigation at the highest level and expressing a desire to remove  the pardons they received, stating the pardons that sleepy Joe Biden  gave to the unselect committee of political thugs, and many others, are  hereby declared void, vacant, and of no further force or effect.\n\nDonald John Trump has made…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…because he is such a fiscal hawk--he said: If you just read their own  numbers, this is a lie, a sham. It increases the deficit by trillions.\n\nLet me go to some Republicans.\n\nJoe Lombardo, the Governor of Nevada:\n\nAn abrupt reduction in federal funding would not only       disrupt care of those who rely on Medicaid, but would also       destabilize public…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, no one in America is safe from ICE today.  Joe Rogan said that ICE agents are acting as ``villains,'' stripping  away freedoms from Americans. This agency has gone rogue. It is  lawless, and it needs to be reined in.\n\nThe…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699073/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…Illinois. Mr. Speaker, I rise today in strong support  of the SAVE Act, which includes robust measures to prevent illegal  aliens from participating in our elections.\n\nUnder Joe Biden, millions of illegal aliens flooded into our country,  and many were given the benefits and privileges that should be reserved  for American citizens.\n\nIn Illinois, JB…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…went to illegal immigrants.  The Democrats have never understood that. They have never understood  that Americans were upset about that.\n\nThen for the 4 years previous to this, Joe Biden's term, Joe Biden  let in 15 million--million--people. One million is a lot of people.  Five million is a lot of people. Fifteen million people came into this  country…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…New York Bombers, a blind beep baseball team, and showed us all  what it means to persevere with humor, courage, and grace.\n\nMy deepest condolences go out to John's parents, Joe and Patti; his  brothers, Joey and Michael; and everyone who had the privilege of  knowing him.\n\nMay God bless his memory.                         Honoring Layla Elizabeth So…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…question of  affordability, which they have all of a sudden gotten into their hands,  is rich given that they presided over the worst inflation spike in 40  years.\n\nUnder President Joe Biden, families paid more for everything, for  food, housing, transportation, and energy. It all exploded on their  watch when they ran three Houses of government.\n\nEnergy prices…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Vance, now Vice President JD Vance, to repeal  this same misguided D.C. Council law. The resolution passed both the  House and the Senate with bipartisan majorities, yet President Joe  Biden foolishly vetoed our commonsense measure, underscoring just how  little the previous administration cared about the American people's  safety and law enforcement officers'…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…accepted a  fully qualified appointment to the United States Military Academy in  West Point, New York.\n\nLucas is the son of Becky and Mike Gaston and the grandson of Hazel  and Joe Gaston, as well as Nancy and Ted Fox of Brookville.\n\nAs a student of Brookville Area High School, Lucas is active in the  classroom and on the athletic field and throughout…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…are the lowest they have been in 5 years. Inflation is the  lowest it has been in 4 years. Just in the first year of President  Trump, wages grew more than all 4 years under Joe Biden. We are in an  inflation crisis that President Trump inherited because of the spending  spree, the $10 trillion spending spree, that the Democrats did when  they controlled…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…also passed a law that banned contracts for immigration  detention centers.\n\nThis is lawlessness, and this body should recognize it as such.\n\nIn 2024, my good friend, Sheriff Joe Roybal of El Paso County, and  other county leaders filed a lawsuit against the State arguing that  these laws are unconstitutional and that they hamper public safety.\n\nContrast…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…CARTER of Georgia. Mr. Speaker, I rise today to honor the life of  Mr. Joseph Rylon Wills, Jr., a man of faith, service, and dedication.\n\nBorn in 1957 in Plant City, Florida, Joe was raised by his loving  parents, Rylon and Gail. He was active in church and sports,  demonstrating a commitment to faith and teamwork from a young age.\n\nIn 1982, he married…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…also across the globe, that they are  near saltwater.\n\nWe have all seen the horrible fires that occur when saltwater and  batteries mix. They are horrific, runaway fires. In the Joe Biden  Department of Defense, I can only imagine a scenario where a natural  disaster causes critical installations, just like in my district, to be  stuck with a large fleet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…President Trump  for bragging ``about his Venezuela policy'' but failing to bring ``an  end to the Maduro regime.'' It sounds like a call for regime change to  me, just like Joe Biden's decision to increase the bounty on Maduro's  head seems like a call for Maduro to be apprehended and brought to  justice. Yet when President Trump did exactly that last…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, 1 year ago today, the American people  rejected high prices; they rejected open borders; they rejected the  weakness of Joe Biden and Kamala Harris. One year ago today, the  American people voted to get America back on track, and they did so by  voting for a unified Republican government.\n\nRepublicans…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…anything other than what we are actually  doing to deliver for those families.\n\nIt is interesting how they talk about Jeffrey Epstein because for 4  years, Mr. Speaker, President Joe Biden had those files and not a  single Democrat that you are hearing tonight tried to get those files  released.\n\nThe House Republicans are working to do that and, of course,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…ObamaCare. That is insulting to the American people.\n\nThat is a program that is riddled--riddled--with fraud. That is what  they want, these COVID bonus programs put forth by Joe Biden. They want  to just--3 more years, more direct checks to insurance companies,  taxpayer money with no accountability.\n\nSo how bad are these programs? Well, let's just…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Hope Riley. Riley  was a 22-year-old nursing student who attended Augusta University. She  was killed by a Tren de Aragua gang member illegally paroled into the  country under Joe Biden.\n\nWe have Rachel Morin, a 37-year-old Maryland mother of five. While  going out for a walk, she was raped and murdered by an illegal alien  who snuck across the border…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]