[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…foundation for the nonpartisan cost estimates  for the past 40 years, estimates produced by the independent  scorekeepers: the Congressional Budget Office and the Joint Committee  on Taxation. The Senate has never, before consideration of H.R. 1, used  cost estimates based on something other than the section 257 baseline  to assess reconciliation legislation…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…How much did it cost?\n\nThey said it would cost $1.8 trillion. Now, that is not pocket  change. We all know that, but it is a heck of a lot less than the  recent Joint Committee on Taxation estimate of $4.6 trillion that it  will cost to extend the Republican Trump tax cuts that favor those who  don't need any help.\n\nThe thing is, if Republicans would…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…we are going to utilize it to cost out programs, do the  modeling, be nonpartisan. Then we are going to utilize this other  organization that already existed, the Joint Committee on Taxation, to  have their staff produce honest, nonpartisan numbers for the cost of  revenue provisions.\n\nThe section of the law that controls this special reconciliation…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…administration tore a giant hole in the minimum tax with a  new policy change, a change that amounts to a $10.3 billion corporate  handout--and that is according to the Joint Committee on Taxation.\n\nNow, it has been the case for decades that these huge corporations  play financial games to conceal their profits from the IRS. That is how  they winnow down their…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Again, they don't like what they see.\n\nMr. Speaker, I just want to say that it is not just CBO saying that  your big, ugly bill costs trillions of dollars, it is the Joint  Committee on Taxation, Budget Lab at Yale, Penn Wharton Budget Model,  and the right-leaning Tax Foundation. All of them, all of them say that  your big, ugly bill is going to add trillions…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…that are covered by  Medicare.\n\nAgain, this is because of the reckless deficit spending that this  bill creates. That is not me saying that. The calculation of the Joint  Committee on Taxation was $3.7 trillion of new debt on top of the $36  trillion of debt that we have today.\n\nThe Wharton School of Finance, where President Trump attended school,  calculated…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…That is the independent,  nonpartisan Congressional Budget Office, CBO.\n\nIt isn't just CBO. Every other reputable independent analysis of the  bill, including the Joint Committee on Taxation, Yale Budget Lab, and  Penn Wharton Budget Model came to the same conclusion. Even the right- leaning Tax Foundation agrees that this bill explodes the deficit,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…worse along the way when it was already a pretty bad  product. In terms of expertise, let's reject what the Congressional  Budget Office says. Let's reject what the Joint Committee on Taxation  might have to say. Of course, when the going gets tough, let's blame  the Federal Reserve Board because of interest rates.\n\nUnder this bill, here is a fact, Mr.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…enrage my brothers and sisters because  so much of what we are having to deal with in this reconciliation  budget--look, I hope the scorekeepers are wrong. I hope the Joint  Committee on Taxation economists are wrong. I hope the Ph.D.s over at  CBO are wrong. Because much of it is extending current tax policy--what  we get today--instead of what is in the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…number of politicians on the left and the  right who spend day and night making up math. Mr. Speaker, can you  believe that?\n\nThey attack the CBO. They attack the Joint Committee on Taxation,  this and that. I am going to walk us through parts of the accuracy and  what we call the variance report done by the Congressional Budget  Office and try to demonstrate--yes,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…2025. ---------------------------------------------------------------------------------------------------------------- Source: Congressional Budget Office; Joint Committee on Taxation\n\nFor the reasons I explained earlier, I urge all of my colleagues to  support this bill, and I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…enforce it reflect current tax policy and  assume provisions of the 2017 Tax Cuts and Jobs Act are permanently  extended. I am also including in this filing the Joint Committee on  Taxation's estimate of the budgetary effects of these current tax  policy adjustments relative to the Congressional Budget Office's  unmodified baseline.\n\nThe Congressional…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…2025. ---------------------------------------------------------------------------------------------------------------- Source: Congressional Budget Office; Joint Committee on Taxation\n\nMr. DAVIDSON. Mr. Speaker, I urge my colleagues to support this bill,  and I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…of 2025. ---------------------------------------------------------------------------------------------------------------- Source: Congressional Budget Office; Joint Committee on Taxation\n\nFor reasons I explained earlier, I urge all of my colleagues to  support this bill, and I yield back the balance of my time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}]