[{"senator": "Dina Titus", "party": "Democrat", "sentence": "Foster for his time and for allowing me to join  him on this important topic.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Speaker, in closing, I ask all of my colleagues to join me in  passing H.R.", "title": "Prioritizing Veterans' Survivors Act", "date": "2025-04-07"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "Speaker, I ask my  colleagues to join me in celebrating Owen Zhang and this victory for  science education in Washington state.", "title": "Recognizing Owen Zhang for Scientific Excellence", "date": "2025-03-05"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "It is my honor to join my fellow Democrats to lay the case before the  American people for how Republicans plan to destroy Medicaid as we know  it and harm millions and millions and millions of Americans.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, I sincerely hope my colleagues will join me in honoring  NOW-NJ for their exceptional contributions to the community and  congratulating them on their 50th anniversary of service.", "title": "Recognizing the 50th Anniversary of the National Organization for Women of New Jersey", "date": "2025-11-25"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "I was  on the Joint Commission on Health Care, and I began to really look into  the maternal mortality crisis that we have in this country.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Speaker, when the President  of the United States of America was here for a joint session of  Congress, the President of the United States of America indicated that  he had a mandate.", "title": "Censured but Not Silenced", "date": null}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "We pushed hard to force Republicans to join us at the table on this  because it is plain as day to Americans across the country that ICE and  CBP have gotten out of control.", "title": "Appropriations", "date": "2026-01-30"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "We urge  our Republican colleagues to join us.", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Speaker, I ask all of us to join in a moment of  silence in honor of Melissa and Mark Hortman.", "title": "In Memory of Mark and Melissa Hortman", "date": "2025-06-23"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Speaker, I join my colleagues in honoring  Black History Month and uplifting the connection between the Black and  Asian community.", "title": "Black History Month and the Alliance Between the Black and Asian Community", "date": "2025-02-25"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "Speaker, I hope my colleagues will join me in  voting for this motion to recommit.", "title": "Flexibility for Workers Education Act", "date": "2026-01-13"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "In addition to welcoming His All-Holiness to the United States and  recognizing his lifetime of service and commitment to peace, I also ask  that the House join me in congratulating Patriarch Bartholomew for  receiving this year's Templeton Prize.", "title": "Welcoming His All-Holiness Bartholomew I, Ecumenical Patriarch of Constantinople", "date": null}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "I ask my colleagues to join me in honoring this important visit and  in celebrating the Ecumenical Patriarch Bartholomew.", "title": "Welcoming His All-Holiness Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Upon graduation, Jimmy  joined the football booster club and took over as president in 1976,  and he has held that position.", "title": "Congratulating Kendall Pierson", "date": "2025-07-14"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Madam Speaker, again, I welcome all my colleagues to join me in  supporting this bipartisan program.", "title": "Agoa Extension Act", "date": "2026-01-12"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "The people of Whiting stepped forward with investments of more than  $1 million for the watershed restoration project, and I was pleased to  join the effort by securing $2.9 million in Federal funds.", "title": "Town of Whiting 200th Anniversary", "date": "2025-07-08"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "I encourage everyone to join me in recognizing their sacrifices.", "title": "-9999", "date": "2025-05-13"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "Speaker, I urge my colleagues to join me in supporting this  legislation and to act swiftly to make sure that our veterans never see  their care delayed, denied, or diminished because of outdated laws.", "title": "Protecting Veteran Access to Telemedicine Services Act of 2025", "date": null}, {"senator": "Rick Scott", "party": "Republican", "sentence": "The United States must always stand with Israel and the Jewish  people, and today we join together to remember the innocent lives taken  in an act of hate and pay tribute to their lives and the contributions  of the Jewish people to our Nation.", "title": "Recognizing the Significance of Jewish American Heritage Month and Calling on Elected Officials and Civil Society Leaders to Counter Antisemitism", "date": "2025-05-22"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Donalds) for  leading this effort again in this Congress, and I encourage my  colleagues to join me in supporting this legislation.", "title": "DC Criminal Reforms to Immediately Make Everyone Safe Act", "date": null}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "On June 12, Barbara will join the  additional four laureates at the UNESCO Headquarters in Paris, France  for an official recognition of her groundbreaking research.", "title": "Recognizing the Achievements of Dr. Barbara J. Finlayson-Pitts", "date": "2025-06-12"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "I ask my colleagues to join me in honoring Becky  Koenig for a remarkable career and wishing her all the best in  retirement.", "title": "Recognizing Becky Koenig", "date": "2025-07-15"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "I invite my colleagues in the United States House of Representatives  to join me in congratulating J.T.", "title": "Congratulating J.T. Miller on His Selection to the Team Usa Hockey Roster for the 2026 Winter Olympics", "date": "2026-02-09"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "Well, in the spirit of bipartisanship, I encourage my Democratic  colleagues to join me in support of this resolution to protect and  champion hundreds of blue-collar American jobs in the heart of our  country.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Speaker, I rise today to ask my colleagues to  join me in congratulating several remarkable Girl Scouts from  Wisconsin's 5th Congressional District for demonstrating leadership,  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.", "title": "Recognizing Gold Award Girl Scout Recipients", "date": "2025-04-30"}, {"senator": "John Carter", "party": "Republican", "sentence": "He served full time in operational  assignments including Director of the Joint Staff, Chief of Staff to  the Adjutant General of Texas, and the Texas Army National Guard  Director of Operations.", "title": "Saluting the Service of Major General Patrick Hamilton", "date": "2025-03-31"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "That is why I urge my colleagues to  join me in support of this critical legislation.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Speaker, I urge my colleagues to join me in supporting H.R.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Speaker, I ask my colleagues to join me in recognizing Ms.", "title": "Recognizing Warminster Township Board of Supervisors Judy Hoover", "date": "2025-12-04"}]