[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…come. As she embarks on this new phase, Dorothy is joined  by her beloved two sons, husband, Alex Giamboi, two shih tzus, and  grandchildren.\n\nMr. Speaker, please join me on congratulating Dorothy Giamboi on her  fourteen years of service with the Borough of Metuchen. It is my  privilege to recognize her remarkable contributions to our community  and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…The 2025 Impact Award will be presented to IACC--Pars       Place.\n\nThe 2025 Education Award will be presented to Marco Rando.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  recipients of the 2025 Arts Awards and recognizing the visionaries,  leaders, and supporters who help to make our Northern Virginia  communities rich with cultural…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697103/recognizing-the-recipients-of-the-2025-artsfairfax-arts-awards"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…lives, making our communities  stronger and more resilient.\n\nMr. Speaker, I am proud to represent such an impactful organization  in my district. I ask my colleagues to join me in congratulating Family  Counseling Service on its 100th Anniversary. Their tireless efforts  have enriched the lives of so many, and I am confident that their  legacy of service…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…dedication,  talent, and teamwork that goes into earning a State championship title.\n\nOn behalf of Alabama's Seventh Congressional District, I ask my  colleagues to join me in congratulating our outstanding high school  basketball champions. I am confident that these young student athletes  have bright futures ahead of them.\n\nThis weekend, the city of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, I rise today to ask my colleagues to join  me in congratulating Adelyn Kim. Adelyn is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4255. She has exemplified extraordinary  leadership, innovative problem-solving,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…have lived and worked alongside Mr. Jennings, who has made outstanding  contributions during his time at SpartanNash.\n\nMr. Speaker, I once again ask my colleagues to join me in  congratulating Robert Jennings on his retirement from SpartanNash. We  commend him for his decades of service. I wish Mr. Jennings, a much- deserved, restful retirement surrounded…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689251/recognizing-the-retirement-of-robert-jennings"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…compassion found in our  community. I am proud to have Mr. Deyasso as a constituent, and I am  honored to commend his bravery.\n\nMr. Speaker, I ask my colleagues to join me in congratulating Tesfaye  Deyasso on his remarkable and well-earned honor.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Speaker, I am proud to represent Nancy Merkling, whose dedication  as both an artist and a mentor has made a lasting impact on our  community. I ask my colleagues to join me in congratulating Ms.  Merkling on receiving this well-deserved recognition.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the teachers and coaches who worked  with the teams and these impressive students for giving us hope for the  future at a time when it is desperately needed.\n\nPlease join me in congratulating Lincoln High School and Sprague High  School on their cochampionship win of We the People: The Citizen and  the Constitution competition.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…gratitude to the leadership and staff of the Boston  Passport Agency--past and present--for a century of exemplary service  and stewardship.\n\nI ask my colleagues to join me in congratulating the Boston Passport  Agency on its 100th anniversary and in wishing its team continued  success in the years ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to represent the Crystal Lake Strikers, whose  contributions to the arts and education have had a profound and lasting  impact on the city. I ask my colleagues to join me in congratulating  the Strikers on receiving this well-deserved award and for continuing  to inspire the next generation of performers.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, I rise today to ask my colleagues to join  me in congratulating Paige Kitts. Paige is a member of Girl Scouts of  Michigan Shore to Shore, Troop 4504. She has exemplified extraordinary  leadership, innovative problem-solving,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694162/recognizing-paige-kitts"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…appointment to this position was  also historic, as he became the first African American Lieutenant  Colonel and Chief Deputy.\n\nMr. Speaker, I ask my colleagues to join me in congratulating Lt.  Colonel Jabar Shabazz on his retirement. On behalf of myself and the  citizens of Fairfax County, I thank him and his family for his  honorable 31 years of selfless…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Foundation.\n\nMr. Speaker, I am proud to represent Rhienna McClain, whose  exceptional contributions have made a lasting impact on McHenry County.  I ask my colleagues to join me in congratulating her on receiving the  ATHENA International Leadership Award, a recognition that is truly  well-deserved.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…each day.\n\nIn addition to welcoming His All-Holiness to the United States and  recognizing his lifetime of service and commitment to peace, I also ask  that the House join me in congratulating Patriarch Bartholomew for  receiving this year's Templeton Prize. Established in 1972, the  Templeton Prize honors individuals whose exemplary achievements advance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise today to ask my colleagues to  join me in congratulating several remarkable Girl Scouts from  Wisconsin's 5th Congressional District for demonstrating leadership,  creativity, and a commitment to making a lasting impact…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690499/recognizing-gold-award-girl-scout-recipients"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…history for  their athletic program.\n\nUnder Head Coach Tim Orlosky, these young men exhibited persistence,  sportsmanship, and humility in their title run.\n\nMr. Speaker, join me in congratulating this team of incredible young  men and everybody who supported them in their journey to achieve  history for Frederica Academy.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Mr. STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Dakota Partelow. Dakota is a member of Girl Scouts of  Gulf Coast Florida, Troop 608, and has exemplified extraordinary  leadership, innovative problem-solving, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…not occur by chance; they  are the result of sustained hard work, personal sacrifice, and a  devoted commitment to excellence.\n\nMr. Speaker, I ask my colleagues to join me in congratulating  Madeline Brobst on this milestone of academic distinction. We commend  her for this outstanding accomplishment and look forward with  confidence to the many successes…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…rise today to celebrate a tremendous achievement that  brings national recognition to our State and to one of our leading  institutions of higher learning.\n\nPlease join me in congratulating Regents Professor Anjan Bose of WSU  for receiving the prestigious IEEE Power and Energy Society's Lifetime  Achievement Award.\n\nThis is one of the highest honors…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Family  was recognized for their leadership, stewardship, and contributions to  both the dairy industry and our local community.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  Atsma Family on this well-deserved honor. Their work represents the  very best of the Central Valley's agricultural heritage, and their  impact will be felt…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698674/recognizing-the-atsma-family"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…ensure that the United States men's hockey  team brings home gold at the Olympics in Milan.\n\nI invite my colleagues in the United States House of Representatives  to join me in congratulating J.T. Miller on his selection to the Team  USA hockey roster for the 2026 Winter Olympics.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699838/congratulating-jt-miller-on-his-selection-to-the-team-usa-hockey-roster-for-the-2026-winter-olympics"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…with both truth and compassion, empowering individuals,  strengthening families, and preserving freedom for future generations.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  outstanding woman for her public service and leadership.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Mr. STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Harley Cross. Harley is a member of Girl Scouts of  Gulf Coast Florida, Troop 5005, and has exemplified extraordinary  leadership, innovative problem-solving, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690443/recognizing-harley-cross-gold-award"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…collaboration, and community enrichment has played an essential role in  shaping Hernando County into the thriving place it is today.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  Greater Hernando County Chamber of Commerce on its centennial  anniversary. May its legacy of service continue to strengthen our  communities for generations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…County Cattlewomen, Ms. Woody also remains active in  her church and throughout the community.\n\nMr. Speaker, we ask our colleagues in the House of Representatives to  join us in congratulating Ms. April Woody on being named Kern County's  2025 Cattlewoman of the Year. Her dedication to agriculture, education,  and service to the community embodies the values…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Mr. STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating Hannah Dickinson. Hannah is a member of Sandy Beaches  Service Unit within Girl Scouts of Southeast Florida, and has  exemplified extraordinary leadership, innovative…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Mr. STEUBE. Mr. Speaker, I rise today to ask my colleagues to join me  in congratulating  Reagan Graham. Reagan is a member of Girl Scouts of Gulf Coast Florida,  Troop 441 and has exemplified extraordinary leadership, innovative  problem-solving, and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690446/recognizing-reagan-graham-gold-award"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…presence brought warmth  and camaraderie to the department, leaving a lasting impact on those  who had the privilege of working alongside her.\n\nMr. Speaker, let us all join in congratulating Sergeant Christine  Bettis for a remarkable career with the Michigan State Police. I wish  her great happiness in retirement and thank her once more for keeping  Michigan's…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}]