[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…we should perhaps  prepare to ration dolls and toys this Christmas. Yet, they want to  debate renaming the Gulf of Mexico.\n\nCongress, which more and more appears to just be a joke, is now  advancing a bill that literally started off as a joke. That is right.  The first person to publicly suggest the name change was not Donald  Trump or the author of this…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…items includes renaming the Gulf of Mexico. As a member  of the House Committee on Natural Resources, I saw this bill make its  way through the committee thinking that it was a joke. I was correct to  think that because the origin of renaming the Gulf of Mexico was from a  joke.\n\nIn 2011, Stephen Colbert joked about renaming the gulf during the  2010 Deepwater…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…afford them. We are trying to change that, or I  am. I support this.\n\nIt goes on to say: forcing hospitals and community health centers  across the Nation to close. That is no joke. People are starting to see  it. They are starting to express their consternation. They are starting  to let the people know that somehow this must not happen. They want to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…comparison.\n\nI haven't put all the lyrics of the song up on my chart, but one of  the other lyrics was about sending the Ayatollah home in a box. I mean,  is this some kind of a joke? Is this the way we treat war now? We run a  victory lap, overstate it, and we turn it into a funny music video, or  we use a Hiroshima and Nagasaki comparison as if that is…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it would be a national  scandal. Yet, we are hearing nothing from Republicans because they are  in a cult.\n\nI will say what they won't: None of this is normal. This is not a  joke. This is not something Republicans can  shrug off or turn away from. This President is threatening a NATO ally  in writing, and the world is responding.\n\nEuropean allies have…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…are attacking civil society, journalists,  and public servants who show independence or speak freely.\n\nThey are censoring media because someone dares to question or make a  joke about the President. They are snatching people off the streets  with masked agents in unmarked vehicles. They are forcing American  troops to get on their knees and roll out…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, may I ask how many more speakers the  gentlewoman has.\n\nMr. Speaker, before I close, let's talk about what is actually in  front of us.\n\nThis rescissions package is a joke. Republicans passed a massive tax  giveaway for the rich, one of the most expensive in history. That  giveaway was 450 times the size of these rescissions, and every single…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Mar-a-Lago. I  can tell you that. He needs to get out there.\n\nAnd it is time to start taking cues and listen to real people and not  memes and not deepfake videos. This is not a joke.\n\nOur bill is a path forward, and we ask them to come to the table and  negotiate with us.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…savings from investment accounts, and retirement savings  from 401k's.\n\nIt is not too late to change course and declare Liberation Day as a  poorly constructed April Fools' joke.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…trade association.\n\nYou can't make this stuff up. You really can't. This idea that the  National Coal Council will be important and that anyone really cares  about it is just a joke. The Trump administration obviously doesn't  think the National Coal Council is important. The last time it existed,  it didn't even seem to do anything.\n\nI don't understand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…colleagues from Minnesota. Some of them were together at  a dinner the night before the shooting. To think that one moment, you  can celebrate each other's company--laugh and joke, share a meal, a  drink--only for violence to strike the next moment makes us all sick to  our stomachs. It is haunting.\n\nMy prayers are with the families of the victims. I…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692586/minnesota-lawmakers-shootings"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…safer. We need to fund  education.\n\nThese guys are bringing up a bill about foreign infiltration in third  grade math class. Are my Republican colleagues kidding me? Is that a  joke?\n\nThey are so concerned about China funding our schools. Well, here is  a novel idea. Why don't we have America fund our schools? Why isn't  funding our schools a bigger priority…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…any  explosive devices that had been planted after the break-in. Up and down  these halls, you could hear murmurs and questions.\n\nFor those of us who were here, this is not a joke. This is not Donald  Trump's history, and it is not his story. It is what actually happened  to our Nation's Capitol. Some of you who were here will remember that  day. I had…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698547/january-6-attack"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Chairman of the Federal Communications  Commission, went on a partisan podcast and threatened ABC, the American  Broadcasting Company, and its parent company, Disney, over a joke told  by comedian Jimmy Kimmel. Carr called Kimmel's comments the ``sickest  conduct possible'' and suggested revoking the broadcast licenses of ABC  affiliates.\n\nHe then delivered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…abortion  care. We have not funded healthcare in rural communities across the  country. We have gutted programs that provide actual support for  pregnant people.\n\nThis is a joke. This let's make sure they get an email with all of  the information. It is unserious.\n\nMr. Speaker, I urge all of my colleagues to vote ``no'' on this bill  and to take serious…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Do you think the electrician  could vote by proxy to get the house wired? Do you think the dentist  could vote by proxy to get the teeth fixed and fillings filled?\n\nIt is a joke. With all the problems this country has, here we are,  arguing over proxy voting.\n\nYou brought up the Speaker voting by proxy. I voted by proxy. Speaker  Pelosi put it in order…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689410/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I thank Representative Moore for  yielding. I never get tired of that joke.\n\nMr. Speaker, as we consider the critical reforms in the  reconciliation process, I rise today to make the case for why we must  eliminate the generous Federal subsidies for…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…something very distinct from those hydrology and hydraulic  engineering courses, and that is that water flows downhill. If it  doesn't, you can get a pump. That is an engineering joke. It is  probably not very funny.\n\nThe thing about these mines in Minnesota is, they are below-grade  mines. They are not pit mines. They are actually digging tunnels down  into…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Emily responds quickly to fill it. In addition to being so  hardworking, Emily is just a pleasure to work with. She always has a  smile on her face and is ready with a quick joke to make those around  her laugh. The entire staff adores her and is so appreciative of her  efforts in making Double Branch a wonderful place for students to learn  and grow.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…because  every week somebody sponsors it. His death was so sudden that it  literally had been prepaid. It arrived, and we sat there thinking of  the person who had the best joke every week, who had a constant,  positive sense of humor, even about dire times.\n\nWe talked not long ago about how much he got done during the shutdown  and what it was like…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698722/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…allowed to roam free under the very  aforementioned Soros DAs that refused to prosecute the criminals.\n\nEverybody in America knows what is going on. Everybody in America  gets the joke. They saw their cities burning in the summer of 2020.  They saw the reality of what happens when you allow these radical  Democratic policies to take root, and they want it…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…friends across the pond can barely find themselves able to defend  what little free speech remains on their island. A comic, a comedian,  came to the United States and made a joke about transgenderism. I don't  even know what the joke was. He flies home to the U.K. and is arrested  for hate speech even as the Parliament is advancing an Islamophobia  bill,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…they stream or get over-the-top or however they get their digital  content, they can still do that. There are a lot of options. There has  never been more options.\n\nSome people joke that they buy their services for their cable or  whatever else they get and that there are 200 channels, but they might  only watch 4 or 5 of them. There is still going to be…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…would boost  transparency and help Americans grow in confidence and understanding of  the Federal Judiciary if we had cameras in the Federal courtrooms.\n\nIt has been maybe a joke that a couple of the Supreme Court Justices  said that having cameras at the Supreme Court would be over their dead  body. I don't wish anybody at the Federal court, whether…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696518/cameras-in-the-courtroom"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hikes--every time we have someone over on that side  saying: Just raise taxes--if we do every one of their tax proposals,  then we get 01.5 percent.\n\nHopefully, everyone knows what the joke is.\n\nWe are going to borrow 7.3 percent of the economy this year, and in 9  years we are borrowing 9 percent of the economy.\n\nHow do we tell the truth to the American people…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…streets and die from overdoses because he is not properly funding this.\n\nThe mayor of San Jose, who is a Democrat, has said that the  Governor's refusal to fund Prop 36 is ``a joke.'' This is coming from a  fellow Democrat mayor in California. Newsom's refusal to fund the  initiative that Californians passed is a joke.\n\nHe doesn't have the money for it,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…get  serious about spending?\n\nThe House budget actually does a job of trying to get to budget  neutrality, balancing tax policy and spending policy. The Senate sent  over a joke, and we are going to capitulate to the Senate, knowing full  well that the Senate instructions carry the day.\n\nWe are going to be sitting there in a reconciliation debate where…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…chair the Joint Economic Committee, so I  have people who are much smarter than I am.\n\nMy colleagues will be happy to know that all of our economists now  bathe. It is a running joke, particularly if Members know economists.\n\nWe work through the math that said what would happen if you did both  things and paid for as much of this reconciliation budget, the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}]