[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…blocked independent investigations. These are not isolated incidents.  They are part of a growing pattern.\n\nFor border communities, this violence is not new. In 2012, 16-year- old Jose Antonio Elena Rodriguez was shot and killed by Border Patrol  through a border fence while he was walking home on the Mexico side of  the border in Nogales, Sonora. He was unarmed.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…responded quickly and capably, but we lost a lot that  morning, none more priceless than the six lives that perished: Maynor  Yassir Suazo Sandoval, Miguel Angel Luna Gonzalez, Jose Mynor Lopez,  Alejandro Hernandez Fuentes, Dorlian Ronial Castillo Cabrera, and  Carlos Daniel Hernandez. They are irreplaceable. Their names are  forever remembered--six hard-working…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…women's sports nationwide.\n\nMichelle's contributions extend beyond her work as a journalist. She  also has demonstrated her leadership and service in public relations at  San Jose State University and the Alameda County Office of Education.  Her dedication to public service further includes her tenure as an  elected official on the Zone 7 Water Agency…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…provides  LIHEAP assistance to 179,082 working people in Cook County to weather  extreme temperatures.\n\nI stand here for the Puerto Rican Cultural Center under the  leadership of Jose, the AIDS Foundation, La Casa Norte, and so many in  Illinois-03 serving organizations that meet the needs of our diverse  constituents who are facing uncertainty about Federal…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…testimonies:\n\nThank you, Congresswoman Ayanna Pressley and Senator Ed       Markey, for holding this public forum to hear directly from       TPS holders like myself.\n\nMy name is Jose Urias, and I am a TPS holder from El       Salvador. I am also one of the Co-Coordinators of the       Massachusetts TPS Committee and a member of the National TPS       Alliance.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…LICCARDO. Madam Speaker, I rise today to recognize the  extraordinary life of Colonel Vu Van Loc, a South Vietnamese Army  veteran and beloved community member and leader in San Jose, for his  selfless dedication to Vietnamese refugees and to cultural  preservation.\n\nBorn in 1933 in northern Vietnam, Loc Vu and his family fled their  homeland during the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Preble High  School in Green Bay. In recent days, his classmates have reached out to  me and his friends and his teachers to share with me and the world who  Alex really was.\n\nJose from Green Bay met Alex in the ninth grade. They became fast  friends, participating in theater and show choir together. Jose shared  about Alex that, ``even as a fellow student,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…backyards.  The solution has many names: granny flats, backyard cottages, or  accessory dwelling units, but all expand our affordable housing supply.\n\nWhen I was mayor of San Jose, we made building backyard apartments  easier by enabling thousands of homeowners to be able to get their  permits online in a single day. The problem, though, is that many…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693705/america-faces-a-housing-crisis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…ends there, and  that should terrify every American.\n\nI want to take the opportunity to draw attention to another case that  has captured the public conscience, that of Andry Jose Hernandez  Romero, a 31-year-old gay Venezuelan makeup artist and asylum seeker  who was forcibly disappeared without due process.\n\nAndry entered the United States legally,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…slammed his face on the hot sidewalk while their three  children watched on in horror.\n\nIn East Boston, my constituent Mercedes and her son are struggling  after her husband, Jose, was arrested at work and detained for 2 days  at an ICE facility in Burlington. Jose was living here legally with  temporary protected status but was told by the ICE agents…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…freckles.\n\nCorey's circle of love extended to his beloved partner, Laurence  Jones; many aunts--including Carole (and husband Clayton), Clarice,  Yvonne, and Sylvia; cousins Juan, Jose, Thomas, and countless others;  and a wide community of close friends who will dearly miss him.\n\nCorey touched countless lives with his kindness, faith, and joyful  spirit.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…administration  continues to defy a Supreme Court ruling to return this man to his  family. In fact, it is a full-blown constitutional crisis.\n\nThere are other people--including Andry Jose Hernandez Romero, a  makeup artist and legal asylum seeker, and Merwil Gutierrez, a teenager  who was mistakenly picked up by immigration enforcement--languishing in  El Salvador.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690509/trump-immigration-policies"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jose Luis  Gonzalez Chacon for earning the Arvada Wheat Ridge Service Ambassadors  for Youth Award.\n\nJose has overcome many challenges along his journey to success,  demonstrating…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690363/recognizing-jose-luis-gonzalez-chacon"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Mr. LICCARDO. Mr. Speaker, today I rise to commemorate the 50th  anniversary of Black April.\n\nAs Pulitzer Prize-winning author and one of San Jose's favorite sons,  Viet Nguyen, has written: ``All wars are fought twice; once on the  battlefield and a second time in memory.''\n\nOn this day, 50 years ago, fathers, mothers,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…service in public education have profoundly shaped  the lives of students, families, and educators across California.\n\nParvin Ahmadi began her career as a classroom teacher in San Jose  before taking on administrative roles in Fremont and ultimately serving  as Superintendent of the Castro Valley Unified School District for the  past decade. Her unwavering…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Roger: SWISS BROADCASTING; Aghguiguian, Avedis:       WETA; Agnew, Robert: SRN NEWS (SALEM); Agnew, Singeli: AL       JAZEERA ENGLISH; Agobian, Faiez: AP-BROADCAST; Agredo, Jose:       TELEMUNDO NETWORK; Agudelo, David: WUSA-TV; Ahmadzai, Khan:       NEWSMAX TV; Ahmed, Faiza: AL JAZEERA ENGLISH; Ahrimou, Sr.,       Mohamed: ALARABY TV; Aiello, Nicholas:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Informer;       Loeb, Saul: Agence France-Presse; LoScalzo, James: European       Pressphoto Agency; Lott, Joshua: Washington Post; Lynch,       Mary: Freelance; Magana-oceja, Jose Luis: Freelance; Mages,       Evy: Freelance; Mallin, Jay: Freelance; Mara, Melina:       Washington Post; Marovich, Peter: Freelance; Martin,       Jacquelyn: Associated Press…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, we are gathered here today to  honor the lives of Staff Sergeants Jose Duenez, Jr., Edvin F. Franco,  Troy S. Knutson-Collins, and Private First Class Dante D. Taitano.\n\nThese men, these heroes, were part of the 3rd Infantry Division out  of Fort…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689658/moment-of-silence-in-remembrance-of-staff-sergeants-jose-duenez-jr-edvin-f-franco-troy-s-knutson-collins-and-private-first-class-dante-d-taitano"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Lia: CQ Roll Call;       Delaney, Arthur: Huffington Post; Delaney, Matthew:       Washington Times de la Sotilla Puig, Francisco Javier: La       Vanguardia; Delgado-Robles, Jose: El Nuevo Dia; Demas,       Alexander: Dispatch; Demirjian, Karoun: New York Times;       Dendrinou, Viktoria: Bloomberg News; Deng, Xianlai: Xinhua       News Agency.\n\nDennett,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…lost one of its finest, its  truly great citizens.\n\nEduardo Agullo Garcia was born in Barcelona, Spain, during the  Spanish Civil War. He was the second child and only son of Jose and  Esperanza. His favorite memory as a child was playing marbles in the  streets, although he frequently returned home with an empty bag.\n\nHis life was forever changed when…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…mauled and has a laceration across  his face because he is trying to stop murderers, rapists, and child  pornographers from being on American streets?\n\nIn my home State of Texas, Jose Alfredo Uzeta, a criminal illegal  alien from Mexico, operated a dental clinic and performed dental  procedures on patients, despite not having a license for more than 20  years.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…members Roberto Alonso, Dr. Dorothy  Bendross-Mindingall, Mary Blanco, Danny Espino, Dr. Steve Gallon,  Joseph Geller, and Luisa Santos, along with Superintendent of Schools,  Dr. Jose Dotres, Miami-Dade has once again earned an A rating, the  largest district in Florida to do so.\n\nThis success reflects the tireless work of our students, parents,  teachers,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Nicholas Riffe of West Manatee Fire Rescue District, Captain       Marshall Greene, Lieutenant David Snyder, Lieutenant Luke       Hitchins, Lieutenant JC Rapier, Lieutenant Jose Garcia       Santos, Lieutenant Michael Patterson, Lifeguard Jack       Bratcher, Lifeguard Josh McCarthy, Lifeguard Nate Hilbrands,       Lifeguard Shannon Cielinski, Lifeguard…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that are  needed.  He is all too willing to continue to let people wither away on our  streets and die from overdoses because he is not properly funding this.\n\nThe mayor of San Jose, who is a Democrat, has said that the  Governor's refusal to fund Prop 36 is ``a joke.'' This is coming from a  fellow Democrat mayor in California. Newsom's refusal to fund…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Schwartz, Matthew: Bloomberg       Industry Group; Seddiq, Oma: Bloomberg Industry Group;       Segers, Grace: New Republic; Seiden, Daniel: Bloomberg       Industry Group; Sermeno, Jose: Kiplinger Washington Editors;       Serrano-Roman, Angelica: Bloomberg Industry Group; Shane,       Leo: Sightline Media Group; Shapero, Julia: The Hill; Sharp,       Alexandra:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Jose Santiago for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project. In May, a courageous team of 16 WREC employees…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…and to recognize the courage of their family  members who gave the gift of life on their behalf: Chase Agudelo, Seth  Anthony Beyrooti, Michael Robert Brown, Shawn Carpenter, Jose Collins,  Linda Marie Couch, Giovanni Cruz, Brooke Dawkins, Andrew Dorsey, Blake  Eden, ``CJ'' Jordan-Michael Grey, Melissa Houser, Kory Humphrey, Jacob  Monroe, Tribhawan Anand…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691332/fourteenth-annual-footprints-in-the-sand-kidney-walk"}]