[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…violence.\n\nWe have witnessed it in my home State of Pennsylvania with the  attempted assassination of Donald Trump in Butler; and, again, with the  arson attack on Governor Josh Shapiro's home on Passover with his  family sleeping upstairs; and again in Minnesota with the murder of  House Speaker Emerita Melissa Horton, her husband, Mark, and their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and debating his political views  in a public space without being threatened or silenced, and he was  targeted because of this.\n\nBefore this assassination, in April, Governor Josh Shapiro's house  was set on fire, endangering his entire family. Just 2 months after  that, two Democratic lawmakers, Melissa Hortman and John Hoffman, were  gunned down in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…essential services, from eggs to gasoline to  medicine and childcare, continue to rise.\n\nThis should not be a partisan issue. Republicans like former Senator  Mitt Romney, Senator Josh Hawley, and even Vice President J.D. Vance  have supported the Child Tax Credit because the evidence that it helped  families is so overwhelming.\n\nBut Republican leadership…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…behalf of Nathan Flynn, a Howard County firefighter who  tragically died in the basement of a large house fire in 2018.\n\nI rise on behalf of Frederick County firefighter Captain Josh Laird,  who we lost in 2022 when he, too, fell through a floor and into a  basement fire.\n\nAfter each of these tragedies and tragedies just like them across  this country, the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…disastrous for my situation.'' Lynn knows that this one big, ugly bill  puts a target on the back of Medicaid.\n\nOne of the Senators from the great State of Missouri, Senator Josh  Hawley, spent months warning about the damage that Donald Trump's one  big, ugly bill would do to the people of Missouri as a result of the  all-out assault on Medicaid and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…alternative options for       transportation. We look forward to working with you to pass       this legislation.            Sincerely,                                   Fire Chief Josh Waldo, CFO, EFO,      IAFC President and Board Chair, 2024-2025.                                   ____                                             TIC Council Americas,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…services in physical therapy and mental health counseling. It is  going to mean, unfortunately, that rural hospitals close.\n\nDon't take my word for it. Take the word of Senator Josh Hawley, who  represents the State of Missouri. He said that these Medicaid cuts  would be a total betrayal by the President and the Republican Party of  the working class.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…today I reintroduce the ``Forest Legacy  Management Flexibility Act,'' alongside Representative Ken Calvert (R- CA). I thank my colleagues, Representatives Jim Costa (D-CA), Josh  Harder (D-CA), Kevin Mullin (D-CA), and Suzanne Bonamici (D-OR) for  cosponsoring my bill.\n\nAs the former Deputy Secretary of the Interior, I know our national  conservation…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…day--my colleagues  will--if they vote for this nominee.\n\nAnd we should not in any way turn a blind eye toward the other  nominees that will be before us for the district court: Josh Divine,  Maria Lanahan, Jordan Pratt--all nominated to serve as district court  judges on the Federal bench. They have made careers of crusading  against reproductive rights.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…a       compost pile and into that kind of system, we can re-collect       the nutrients and re-integrate it into our soil to rebuild       that cycle,'' Urban Farm Manager Josh Lesko said. ``Then, our       plants are just re-feeding themselves and feeding us more in       the future.''\n\nThe compost system also helps keep the farm eco-friendly.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…ago today, the blast of an AR-15  shattered a beautiful spring morning in Louisville as a lone gunman  walked into Old National Bank on Main Street and opened fire. We lost  Josh Barrick, Deana Eckert, Juliana Farmer, Jim Tutt, and my friend,  Tommy Elliot. Five friends, neighbors, and loved one were taken too  soon.\n\nAmong the eight wounded was Officer…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690063/stopping-senseless-gun-violence"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, I rise today in strong support of Joshua  Dunlap to serve on the U.S. Court of Appeals for the First Circuit.\n\nJosh is an attorney of extraordinary intelligence, extensive  experience, and demonstrated integrity. He is highly respected in the  legal community throughout the State of Maine,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…attack in Boulder, Colorado, is the most recent incident  following the murder of two Israeli Embassy staff members in  Washington, D.C., and the attack on Pennsylvania Governor Josh Shapiro  and his family, as we previously heard.\n\nThis growing trend of politically and religiously motivated violence  directed at Jewish individuals and institutions across…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…dominant performance.  Kebryl Chandler claimed the individual State title, finishing first  overall. He was followed by outstanding efforts from Caleb Cooper, who  placed sixth; Josh Cooper, eighth; Logan Wheelock, ninth; and Hinckley  Lovelace, who finished 12th. Their combined strength, discipline, and  endurance propelled Parry McCluer to another well-earned…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697358/congratulating-parry-mccluer-boys-cross-country-team"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…asset--she has  been family.\n\nMr. Speaker, I am excited for Amy as she enters the next chapter in  her life and am extremely grateful to her husband, and former staff  member, Josh, for sharing Amy with us for all these years. I also want  to recognize Josh and Amy's incredible children; Sam, Sydney, Jane,  Henry, and Lucy. They were all born while Amy…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…him. This is a bipartisan issue. Today, I  rise to introduce the Preventing Elected Leaders from Owning Securities  and Investments Act. My bill is complementary to Senator Josh Hawley  over in the Senate.\n\nIf you travel the Fourth District of the great State of Missouri,  just south of Reverend Cleaver's district in Kansas City, and you ask  the average…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the Scout law:  trustworthy, loyal, helpful, friendly, courteous, kind, obedient,  cheerful, thrifty, brave, clean, and reverent.\n\nAlso today, on a personal note, I welcome Josh and Finn Kirby to  Washington, a Scout leader and a Scout, from the Boy Scout Council in  the Juniata Valley.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Illinois Governor JB Pritzker claimed ICE is turning the country into  Nazi Germany.\n\nNew York Governor Kathy Hochul accused ICE of ``terrorizing people.''\n\nPennsylvania Governor Josh Shapiro claimed ICE officers ``make our  neighborhoods less safe.''\n\nMinnesota Lieutenant Governor Peggy Flanagan said ICE officers caused  ``chaos and terror.''\n\nSenator Chuck…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Bowen, Firefighter Clayton       Lease, Firefighter David Miller, Firefighter Zack Misiura,       Firefighter Aaron Reese, Lieutenant Inspector Keith Miller,       Inspector Josh Adkins, Inspector Lisa Brooks, and Inspector       Nicholas Riffe of West Manatee Fire Rescue District, Captain       Marshall Greene, Lieutenant David Snyder, Lieutenant Luke…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…States who have experienced unimaginable pain and loss simply  because their loved ones had a disability.\n\nOne of those families is from my district in Ocala, Florida, Bobbi  and Josh Sarmiento. Their infant son, baby Zion, was born with Down  syndrome and in need of a heart transplant. At just 6 months old, Zion  was denied that chance.\n\nThe doctors told…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Chair Wagner for yielding me time.\n\nMr. Speaker, I rise in support of my bill, H.R. 3352, the HALOS Act,  a bill I reintroduced this Congress with my colleague, Congressman Josh  Gottheimer of New Jersey.\n\nAmerica's small businesses have faced a tough road, weathering the  impacts of COVID, high inflation, and burdensome regulations that have  made…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…first, I say thank you to Ms. Sewell, and Mr. Neal for  their help in order to get this across the finish line. This is an  important piece of legislation that I know my staff, Josh Snead and  Hilary Pinegar, have worked tirelessly on for a long time to make sure  that this program does not die. I thank both the Democrat and  Republican staff. I thank Jorge…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…to recognize Marine  Sergeant Joshua Elliott of Stevens County in eastern Washington and to  highlight the incredible work of Homes For Our Troops.\n\nAfter the 9/11 attacks, Josh enlisted in the Marine Corps to serve  his country. During his second deployment to Afghanistan, he was  gravely injured by an improvised explosive device, losing both legs…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}]