[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Alma Moreno Del  Valle for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nAlma has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alma, develop crucial skills and a  work ethic that will…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691061/recognizing-alma-moreno-del-valle"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Isabella Ekman  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nIsabella has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Isabella, develop crucial skills and  a work ethic that…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690024/recognizing-isabella-ekman"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…instead it  became a nightmare that has rocked our community to its core.\n\nMr. Speaker, I ask for a moment of silence to honor the victims,  including Amari, Susano, Maya, Journey, and their families as they  navigate this tragedy.\n\nMy wife, Pam, and I are praying for the victims, their families, and  our community. We are and always will be Stockton…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697396/horrific-mass-shooting-in-stockton"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…I rise today to recognize Alexander Aro  Cavillo for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nAlexander has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alexander, develop crucial skills and  a work ethic that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690160/recognizing-alexander-aro-cavillo"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…has worked for the New York Senate Democratic Conference, as a  Legislative Aide in the New York Assembly, and as an intern for New  York Senator Kirsten Gillibrand. Matt's journey on the House side of  Capitol Hill began as an intern in my Washington, D.C. office back in  2019. He then moved over to the House Ethics Committee and was promoted  to Advice…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Omar Lautenbach  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nOmar has overcome many challenges along their journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Omar, develop crucial skills and a  work ethic that will…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689451/recognizing-omar-lautenbach"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Nathan Angel  Perez for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nNathan has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Nathan, develop crucial skills and a  work ethic that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691983/recognizing-nathan-angel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Kariza Cortez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nKariza has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Kariza, develop crucial skills and a  work ethic that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691432/recognizing-kariza-cortez"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Chicago's own, Justina  Machado, a celebrated actress and proud ``daughter,'' ``hija'' of  Chicago's northwest side.\n\nRaised in a working-class Puerto Rican family, Ms. Machado's journey  from Lane Tech High School, which is also in my district, to the  Broadway stage and Hollywood screens is a testament to her talent, her  perseverance, and her deep cultural…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Heyzel Perez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nHeyzel has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Heyzel, develop crucial skills and a  work ethic that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…today to recognize Carlos Alberto  Gutierrez Pachecho for earning the Arvada Wheat Ridge Service  Ambassadors for Youth Award.\n\nCarlos has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Carlos, develop crucial skills and a  work ethic that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689812/recognizing-carlos-alberto-gutierrez-pachecho"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…country if we backtrack on  those founding values? We would not be the country that inspired our  parents, our neighbors, and our grandparents to make a dangerous and  brave journey in the hopes that their children will have a better life  than they did.\n\nEveryone has a story that they can relate. Mine is about my mother,  who emigrated from Mexico in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize Christelle  Kumeso for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nChristelle has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Christelle, develop crucial skills  and a work ethic…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689494/recognizing-christelle-kumeso"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…15, 2025. A funeral service to celebrate  his remarkable and committed life was held on Sunday, June 22, 2025, at  First Monumental Faith Ministries in Albany, Georgia.\n\nThe journey of the resilient life of Overseer Roosevelt Carter began  with his birth on June 16, 1944, to the union of Deacon Enoch and  Deaconess Mary Magdalene Carter in Leesburg, Georgia.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Lucas Steiskal  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nLucas has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Lucas, develop crucial skills and a  work ethic that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1692004/recognizing-lucas-steiskal"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…distinction. We commend  her for this outstanding accomplishment and look forward with  confidence to the many successes that will undoubtedly follow in her  academic and professional journey.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…White House: Let's do a rescissions  package every month because America has had enough--enough to wasteful  spending, enough to out-of-control deficits.\n\nWe do have a long journey ahead, but, thankfully, not as far as the  Moon. All systems are go. Let the countdown begin, and let's launch to  fiscal sanity by voting ``yes'' to clawing back $9 billion.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693715/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…leadership. He mentored thousands of soldiers and cadets, contributed  to groundbreaking Army modernization efforts, and helped shape the  future of America's defense forces. His journey from the glaciers of  Alaska to the deserts of Iraq reflects a career built on resilience,  integrity, and an unyielding devotion to duty.\n\nMr. Speaker, let us express our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…persistence,  sportsmanship, and humility in their title run.\n\nMr. Speaker, join me in congratulating this team of incredible young  men and everybody who supported them in their journey to achieve  history for Frederica Academy.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…colleagues to join me in extending heartfelt  congratulations to the faculty, staff, and volunteers as they celebrate  this extraordinary milestone and continue their inspiring journey into  the next century of learning, leadership, and community.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…embodied the values of  public service and law enforcement with passion, professionalism, and  courage.\n\nBefore his career in law enforcement, Mr. Camhi began his public  service journey as a chief of staff for the New York State Assembly. In  that capacity, he gained invaluable experience in legislative affairs  and policy development, providing him with…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…never left him. In 1975, he answered that call by joining the Floral  Park Fire Department as a volunteer firefighter, which would only be  the start of his overall 50-year journey in fire service.\n\nIn 1986, after relocating to Yardley, Pennsylvania, Larry joined the  Yardley-Makefield Fire Company, where he has served ever since.\n\nThroughout his 40…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695286/recognizing-larry-newmans-40-years-of-service-with-the-yardley-makefield-fire-company"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Foundation's 2025  Community Leadership Award.\n\nPrior to becoming Executive Director of the Association of Asian  Pacific Community Health Organizations, Jeffrey began his journey at  the University of California, San Diego where he studied biochemistry  and cell biology. After graduating UC San Diego in 1988, he continued  his studies at the University…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Supporting Pregnant and Parenting Women and Families Act allows  States to better partner with pregnancy centers who are providing real  help to new mothers who are taking the journey of parenthood. These  centers are a pillar for nearly 2 million families every year, making  it easier to provide and foster a loving bond throughout communities  just like…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699217/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…of this  congregation for their dedication, their prayers, and their service.  May God continue to bless them as they move forward into the next  chapter of this remarkable journey.\n\nCongratulations, and happy 150th anniversary.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691555/special-recognition-of-150-years-of-first-baptist-church-of-biloxi"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…big sisters with students on campus, with 10 success stories to  date. It is exciting for students to have someone from their community  encouraging them in their educational journey.\n\nIt is clear Alyssa Reas has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690144/recognizing-alyssa-reas"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…heart. He was a faithful son, wonderful brother, and a fun  uncle to his nephews and nieces.\n\nHis personal relationship with Jesus Christ took him through his last  difficult journey with the strength and confidence that he could trust  his Lord with the outcome of his life. We will miss him dearly but look  forward to the day we will be reunited in Heaven.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…serve. Their dedication has energized ten  homesteads and countless lives, creating a legacy of service that  embodies the true spirit of cooperative values. The WREC team's journey  inspires us all, proving that with compassion and teamwork, even the  most daunting challenges can be overcome to light up lives and  communities. I commend the entire team…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Not only will he debut in New York, he will also represent our Nation  and  our State as he tours internationally in Japan, Hong Kong, China, and  South Korea.\n\nTarquin's journey began at the age of 5 when his mother, who taught  herself to play the violin at age 34, inspired him to pursue music.  Since then, his passion has taken him to venues like…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693758/recognizing-tarquin-bennion"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…that if you  live with one eye on your eternal destiny that you have not earned but  rather have been given as a free gift from God, it would affect how you  approach your journey here on Earth.\n\nSo I think of Pastor Bjorge today. I think of his family, and I wish  I could be at the celebration of his life. Tomorrow, no doubt, there  will be lots of…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]