[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…United States this decade, citing the early phaseout of the Federal tax  incentives and regulatory shifts under this administration.\n\nMr. President, I ask that the Wall Street Journal article titled  ``IEA Cuts U.S. Renewable Energy Growth Outlook on Trump Policies'' be  printed in the Record.\n\n7, 2025]      IEA Cuts U.S. Renewable Energy Growth Outlook…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…not what the American people deserve.\n\nMr. Speaker, I hate to be the one to have to inform the gentlewoman  of this fact, but the head of CBO, according to The Wall Street  Journal, is a registered Republican.\n\nNow, we are being told by the Republicans that we can't trust the  nonpartisan Congressional Budget Office to give us correct numbers on  how…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…will end inflation and make sure that America is affordable again  and bring down prices on all goods.'' Well, I don't think that is what  is happening today.\n\nThe Wall Street Journal editorial board put it well this morning when  they wrote: ``Trump takes the dumbest tariff plunge.'' I agree. We  don't need to be doing this.\n\nThese tariffs are attacks…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Inquiring minds would like to know.\n\nMr. NEGUSE.  Sanchez).\n\n``U.S. Manufacturing Is in Retreat and Trump's Tariffs Aren't  Helping,'' February 2, 2026, headline, The Wall Street Journal.\n\nApparently, The Wall Street Journal has Trump derangement syndrome,  too, according to my colleague from New York. American consumers must  also. Everyone apparently has…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the Republicans are trumpeting the dawn of  a golden age of economic growth. However, this week, The Wall Street  Journal had an editorial, ``Trump's Tariffs Whack Trump Voters'' with a  subhead of ``Whatever happened to GOP concern for the working class?''\n\nThe Wall Street Journal said: ``President…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…for a Bronze Star, which includes a  signature from then-Army Brigade Commander Arnold N. Gordon-Bray;  however, Retired Brigadier General Bray told the Daytona Beach News- Journal in August 2024 that he did not sign a Bronze Star  recommendation for Congressman Cory Mills;\n\nWhereas, five people who served with Representative Cory Mills,  including two…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…individual engaging in criminal behavior or police       misconduct can simply resign and join another law enforcement       agency. A recent study published in The Yale Law Journal       found 800 officers in Florida who were fired, some even for       serious misconduct, and were rehired at another police       department. Police misconduct records…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…speed about veterans not deserving the benefits provided to  them or of defrauding the compensation and pension system en masse:  Project 2025, The Economist, The Wall Street Journal, and The  Washington Post.\n\nWe have even heard this from some veterans themselves at recent  congressional hearings that somehow veterans' benefits make them lazy  and reward…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Before my departure on January 20, I briefed this committee       about several major opportunities ahead for the next few       years. Among them were three breakthroughs. The journal       Science had just declared one of them the scientific       breakthrough of 2024. American scientists had developed a       drug called Lenacapavir that could prevent…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…healthier.\n\nLet me read just briefly from their findings, summarized in a  National Geographic article from March of 2015 that said:\n\nIn the study published in the New England Journal of       Medicine, researchers followed 2,000 kids from five southern       California cities with some of the worst air, including Long       Beach, Riverside, San Dimas,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…morning, I am going to do everything I can  to elevate the voices of Republicans because this is not intended to be  a partisan speech.\n\nFrom the Cato Institute to the Wall Street Journal, to nonpartisan  groups, to the Congressional Budget Office, everyone is pointing to  what is happening as not normal, not what the President says it is, as  something that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…yesterday in The Washington Post read: ``Long waits, waves  of calls, website crashes: Social Security is breaking down.''\n\nNext to me is a poster board from The Wall Street Journal. Some  people may say that The Washington Post is always critical of President  Trump, but this is The Wall Street Journal, an impeccable, center-right  newspaper whose headline…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…halls, trying not to get in             trouble with no bond       Late nights are long, senators congregate like they're in             frats      While the Parliamentarian and Journal Clerk chat.      And before you I stand, in my shoes,      Dodging my cloakrooms' ``urgent'' news.       I may not be Goldilocks, but through your heated debates      I keep…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the perpetrators. Why? Because the man in the Oval Office, Mr.  Trump, told us he wants us to protect those files, does not want them  public.\n\nOn July 17, the Wall Street Journal reported on a letter allegedly  written by Trump to Epstein as part of a birthday book for his 50th  birthday in 2003. The letter is signed at the bottom ``Donald.'' It  features…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Speaker, 65 percent of the people who have  been taken by ICE since this administration began had no criminal  convictions at all.\n\nThat is why we read articles in The Wall Street Journal about small,  rural towns that voted for Donald Trump. They are up in arms and are in  an uproar because people who have done nothing wrong and are pillars of  the community…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we could do to offset. The deal was, okay, go  ahead. See if you can get anyone to sponsor it and vote for it.\n\nWe have been chasing for over a year. Go read The Wall Street Journal  articles, the MedPAC report--the amount of fraud, waste, misalignment.  Some of it is perfectly legal misalignment. We are the idiots that  screwed up the law in Medicare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…difficult because, let's be honest, it is really hard putting a couple  of hundred pages of facts and details in a tweet.\n\nThe fact of the matter is that MedPAC, The Wall Street Journal  series, and the ProPublica series have gone over Medicare Advantage. If  any of you have your phone and like tracking stories, put in ``Medicare  Advantage fraud'' right…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…States like California and other  States to game the system, to get Federal dollars sent back in a money- laundering scheme, as has been reported widely by The Wall Street  Journal and others? They are openly and knowingly doing it. Why  wouldn't we fix that?\n\nWhy wouldn't we apply eligibility rules and work requirements,  combined with lowering that…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and Activity Director after his  retirement from DHR.\n\nMayor Baker was awarded a State of Alabama Senior Citizens Hall of  Fame Civic Award in 2008 and received the Piedmont Journal Citizen of  the Year award in 2013.\n\nMayor Baker has served the City of Piedmont since 1988, when he was  first elected to city council. He was appointed mayor August 4, 1996,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693645/recognizing-the-retirement-of-mayor-bill-baker"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…and get malign foreign influence out of our schools. The legislation  will strengthen the thresholds of reporting foreign gifts and  contracts.\n\nAccording to The Wall Street Journal, in the last 12 years, U.S.  schools had nearly 3,000 contracts with China valued at no less than  $2.32 billion. That raises an important question: Why would a country  that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…but I know the prosecutors are desperately trying to get to the bottom  of it. And I don't want to say that this is true, but a report came out  in a publication called City Journal, which is published by the  Manhattan Institute. They are alleging that money--part of this billion  dollars that was stolen--they are alleging at least a portion of it  went…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, on Monday, the Wall Street Journal  editorial board published an article titled ``ObamaCare is a Mecca For  Fraud.''\n\nIt articulates the waste, fraud, and abuse in the ObamaCare Program,  so I am going to read…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…legal  counsel to represent Ms. Kotschwar in this matter.\n\nMr. THUNE.   on Thursday, June 5; that following the prayer and pledge, the morning  hour be deemed expired, the Journal of proceedings be approved to date,  the time for the two leaders be reserved for their use later in the  day, morning business be closed, and the Senate proceed to executive…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…where our Democratic colleagues have  nothing to say about how we address these problems, other than: Let's  raise taxes on the American people.\n\nAccording to the Wall Street Journal, about 62 percent of taxpayers  would see their taxes go up if Democrats had their way and the  temporary tax provisions in the Tax Cuts and Jobs Act had expired.\n\nBut it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…documents even the Biden administration produced on waste and fraud,  and I am sure every Member here has actually read them. We have some  other articles from The Wall Street Journal on Medicare Advantage and  all these others. Many of them, when all added up, are a trillion-plus  dollars. Are we capable of actually being intellectually honest and  walking…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that actually reduce spending and  modernize.\n\nI do want to sort of start with this. We have spent time since last  summer working on pieces of legislation. The Wall Street Journal series  and the ProPublica series came out about the scale of bad acts that  were happening in what we call Medicare part C, which is Medicare  Advantage for most of us, which…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…protesters did you have in  your office this last couple of days? ``You can't review. You can't go  after waste and fraud and Medicaid.'' Medicare Advantage, The Wall  Street Journal has done a five-part series that, if you add it all up,  is $1 trillion to $2 trillion of waste and fraud over 10 years. ``That  is hard. You can't actually talk about that.''…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…signed up and had no  idea. Brokers are going to prison right now because they have been  signing up folks in the system.\n\n``ObamaCare Is a Mecca for Fraud,'' The Wall Street Journal from just  a couple days ago. ``Open Enrollment is Healthcare's Most Expensive  Lie.''\n\nHow many more studies do we need to explain that you are being  defrauded, Mr. Speaker?…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Miller, Mark: Washington Post; Miller, Robert: Washington       Post; Millis, Leah: Reuters News Pictures; Mills, Douglas:       New York Times; Mohammad, Taameen: National Journal; Mohatt,       Kevin: Freelance; Moneymaker, Anna: Getty Images; Morgan,       Joshua: USA Today; Morigi, Paul: Freelance; Munoz, Paula:       Associated Press Photos; Munro,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…through the  filibuster in the Senate under the 1974 Budget Control Act.\n\nI have brought pieces of legislation to reform Medicare Advantage  because you have seen The Wall Street Journal and ProPublica stories  of, functionally, the criminality that is going on. The MedPAC report  basically shows hundreds and hundreds of billions of dollars of waste  and fraud…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}]