[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…part of a broader  pattern by the Federal Communications Commission under Brendan Carr's  leadership. Over and over again, he has used his office to attack and  undermine journalists and broadcasters and news organizations that dare  to speak in ways which he personally dislikes. He has threatened media  companies with investigations for their editorial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Americans, deny citizens their right to legal representation,  point weapons at civilians, zip-tie children, arrest elected officials,  ransack apartment buildings, injure journalists, and shoot a priest in  the head with pepper balls for the so-called crime of peacefully  praying for nonviolence. They have even shot two people, leaving one--a  father…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…of prayer for the environment. In 1995 he started a series  of environmental conferences, inviting prominent scientists, political  leaders, theologians, ecologists, and journalists to embark on weeklong  trips to examine the destruction that pollution has caused on major  waters. Designed to draw international attention to the ecological  degradation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…sites/default/files/documents/hrbodies/hrcouncil/sessions-regular/ session60/advance-version/a-hrc-60-crp-3.pdf.\n\nMr. Speaker, these new determinations only confirm what Palestinians,  eyewitnesses, journalists, and researchers have been saying for nearly  2 years: This is a genocide.\n\nJournalists have been murdered in unprecedented numbers in human  history, so there is no one…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…person or  President, as much as he may want it to. It depends on teachers who  refuse to teach lies. It depends on students who refuse to abandon  their dreams. It depends on journalists who refuse to stop asking  questions, on scientists who refuse to abandon facts, on neighbors who  refuse to turn against each other, on Americans who refuse to accept…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…clear rules for how governments should  treat their citizens.\n\nMore than seven decades later, we are again seeing election  interference and political repression, attacks on journalists and civil  society, war crimes committed with impunity, and a broader disregard  for basic human rights. One of the clearest examples is Russia's  invasion of Ukraine. To…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…articulate the sheer brutality and the bone-chilling  horror of the Renee Good and Alex Pretti murders, citizens shot dead  while exercising their First Amendment rights.\n\nTwo journalists have been arrested. Children have been taken from  their homes. U.S. citizens have been unjustly detained. At this point,  more than 35 people have died in ICE custody,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Winters.\n\nAmid the shock and horror, just hours after the shooting, the Capital  issued a simple statement: We are putting out a damn paper tomorrow,  and that they did.\n\nThese journalists made clear that the fourth estate cannot be  silenced, and they made Maryland damn proud.\n\nOn this tragic anniversary, I will make it clear on this House floor  that as…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693114/capital-gazette-shooting"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…officials who find themselves on the wrong  side of the President's cronies. They are threatening American cities  with war and violence. They are attacking civil society, journalists,  and public servants who show independence or speak freely.\n\nThey are censoring media because someone dares to question or make a  joke about the President. They are snatching…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…legitimacy, and threatened to cut federal       funding to major cities. Predictably, these attacks triggered       dismay, shock, and anger across the political spectrum.       Journalists found themselves at the front lines, exposing--      but also provoking--the president's norm-breaking behavior. A       study by the Shorenstein Center on Media, Politics,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…changing results.\n\nEvery single one of those claims, Mr. Speaker, has been investigated  again and again by Republican Governors and Republican Secretaries of  State, by journalists, by academic researchers, and by President Trump  himself, whose own voter fraud commission was disbanded because he  couldn't find enough evidence to warrant the absurd…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…our actions have set off a new wave of oppression.\n\nIn Venezuela, that means pushing for an end to that repression. It  means the release of political prisoners, including journalists and  civil society leaders. It means freedom of expression and freedom of  the press. We must also ensure that Venezuela's future is decided by  Venezuelans.\n\nOur future…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to state for the record  what is happening on the ground in my state.\n\nMinnesotans are experiencing a coordinated violation of our civil  rights by the federal government. Journalists and protesters are being  arrested in violation of their 1st amendment rights to speech. The  right of protestors under the 2nd amendment to lawfully be armed in a  public…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…assault on those four key institutions of  accountability. Democrats and Republicans need to see what is happening  before our eyes, rise up, and defend the independence of journalists,  of lawyers, of universities, and of the private sector.\n\nSo I want to spend a minute or two to walk you through what President  Trump is doing and how it, frankly, chillingly,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…deported  and left along the side of the road in Mexico.\n\nYou, my sweet boy, are precious and deserving of love and safety. No  child should endure what you are going through. Journalists,  pediatricians, and people of good conscience have rallied around your  family to keep you safe.\n\nMadam Speaker, I rise today for 2-year-old Daphne from Massachusetts.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Labor Act.\n\nThe Chinese Communist Party is carrying out a campaign of genocide  against Uyghur Muslims in Xinjiang.\n\nThe evidence, documented by human rights organizations, journalists,  and survivors, is overwhelming: over a million people detained,  families torn apart, entire communities forced into labor in factories  that feed global supply chains.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…tank the dollar, drive up prices, destroy the  markets, and threaten a recession.\n\nOne hundred days of chaos in the White House, where Secretary Hegseth  texts war plans to journalists, and the administration belittles allies  while embracing dictators like Putin.\n\nOne hundred days of corruption, as billionaires like Musk and DOGE  take Americans' personal…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…organization to report on the PRC's vast, mass       arbitrary-detention program in the XUAR in 2017.\n\n(13) Credible evidence from human rights organizations,       think tanks, and journalists confirms that more than       1,000,000 Uyghurs and members of other ethnic minority groups       have been imprisoned in extrajudicial ``political       reeducation'' centers.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…certainly: the McCarthy  era, the Red Scare, periods when we were not as committed to free  speech as we might be. But, historically, we have not persecuted and  jailed those journalists who dared challenge the government.\n\nAnd so I chose to speak today partly because of the event of Jimmy  Lai being sentenced and partly because of a growing concern that…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Central  Bancshares, Baptist Health, Kentucky-American Water Company, and the  American Heart Association.\n\nWayne has mentored young entrepreneurs, student athletes and  journalists who have become respected leaders in their fields and  established exceptional businesses across the state. His coaching  success and business expertise have been of great…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…walkouts and  tearful TV monologues for American sons like Travis? Where were CNN and  MSNBC? Where were the New York Times and the Washington Post? Where  were the armies of journalists and camera crews to tell their stories,  to interview their grieving parents, to regale us all with stories  about their kindness and their decency and their innocence?…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Blacks       throughout the United States, and he later bought the paper;\n\n[Whereas Douglass was the first Black reporter allowed into       the Capitol press galleries, where journalists watch       lawmakers on the floors of the Senate and the House of       Representatives;\n\n[Whereas Douglass was a member of the congressional press       galleries from…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]