[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…access to our national emergency weather  alert system. Simply put: Americans will die because of these cuts.\n\nIn addition to gutting one of the last vestiges of independent  journalism, which is only biased if you think the truth is biased, the  Republicans are also defunding free children's educational programs  enjoyed by millions around the country.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…librarian or a scholar but only a  Trump loyalist.\n\nIt doesn't stop there. Republicans have repeatedly pushed to zero out  funding for NPR, a lifeline for rural news and local journalism. They  have attacked PBS, which brings educational programming to children who  don't have access to cable or broadband.\n\nFor decades, American children have learned from…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…activist and Pan-African  leader.\n\nCaribbean Americans have made significant contributions to all  aspects of society, including fine arts, education, business,  literature, journalism, sports, fashion, politics, government, the  military, music, science, medicine, engineering, and technology. They  also share their vibrant culture through festivals, carnivals,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Senate is not in session, with changes       that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would protect funding to support rural broadcasting and       journalism.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693634/hr-4"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for keeping readers across Canton Ohio's 13th Congressional  District in northeast Ohio region informed.\n\nThese five journalists earned top honors in the 2025 Ohio's Best  Journalism contest sponsored by the Cleveland, Columbus, and Cincinnati  chapters of the Society of Professional Journalists.\n\nTheir work at the Canton Repository is truly exceptional,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694044/recognizing-canton-repository-reporters"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…as a recipient  of the 2025 Curt Gowdy Media Award. Her induction into the Hall of Fame  stands as a testament to her decades-long commitment to advancing  women's sports journalism and her influential voice within the world of  basketball.\n\nA trailblazer in her field, Michelle Smith-McDonald became ESPN.com's  first-ever regular women's basketball columnist…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…where one party  just keeps on winning. These are places where journalists are subject  to a nonstop harassment campaign from the regime, such that people just  stop doing journalism or journalists stop telling the full truth.\n\nLast month, for instance, Turkish President Erdogan locked up 11  journalists simply because they were covering protests against…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…the associate director of office services and  the director of the mailing department.\n\nWhile she worked at Point Park, Mrs. Cole earned her associate of  arts degree in journalism and communications. She was inducted into the  Alpha Sigma Lambda, a National Honor Society for part-time students, as  one of the 13 charter members of Point Park Gamma…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…fields. Six will continue their athletic pursuits at the collegiate  level.\n\nMembers of the class made their mark at this year's Loudoun Now's  2025 Excellence in High School Journalism Awards ceremony. Others were  National Merit Scholarship winners and so much more.\n\nAmong the impressive things about Dominion are its proud alumni  networks. School representatives…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Jesuit education at Rockhurst High School,  before attending the University of Missouri-Columbia, where he would  graduate with honors in 1980 with a bachelor's degree in journalism.  Following graduation, Gerard briefly enjoyed working as a reporter for  the Kansas City Labor Beacon, before joining the staff of U.S. Senator  Thomas F. Eagleton. As the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…community.\n\nAs an avid listener and frequent guest, I know firsthand the  dedication of WJBC's incredible team--past and present--who have made  this station a pillar of local journalism. From legendary broadcasters  like Don Munson and Steve Vogel to today's voices like Scott Miller,  WJBC has been a reliable source of news, sports, and thoughtful  discussion.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690795/recognizing-wjbc-radios-100th-anniversary"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…I rise today to recognize and celebrate the  distinguished career of Randy Gorbman, the News Director of WXXI, who  will retire at the end of March. With over 45 years in journalism, he  is leaving an indelible mark on the industry and our community as one  of the longest-serving news directors in all of New York State.\n\nRandy oversees WXXI's daily news…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688914/recognizing-randy-gorbmans-retirement"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…own potential through storytelling.\n\nChayanee has created a welcoming space for her students to express  themselves and share their stories through creative avenues like  journalism and documentary storytelling, where they highlight topics  such as family separation and mental health. You know that these are  areas that the students not only care about…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…immigrants, those that followed and the subsequent generations  eventually became trailblazers in politics and government, the  military, business and entrepreneurship, journalism, popular culture,  music and the arts and more.\n\nOur resolution honors the tremendous and increasing contribution of  Filipino Americans to our country in all areas including…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…today in strong support of H.R. 1461.\n\nBettie Cole was a longstanding community leader in her home State of  Pennsylvania.\n\nBorn in Edgeworth on April 5, 1923, she studied journalism and  communications. Later in 2000, she became known as the historian of  Sewickley Valley's Black community. That year she published ``Their  Story: The History of Blacks/African…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697613/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…whether or not they       actually know the truth is open to interpretation and subject       to one's own preference or prejudice. It's a key concept in       my business, journalism, where truth is the lynchpin. We are       bound to be truthful to the best of our ability and we are       prohibited from writing anything that we know to be false. We…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…hours.\n\nWestern North Carolina is stronger today because of the courage and  dedication of these broadcasters. Their work is a powerful reminder of  the vital role that local journalism and community-centered  broadcasting play in times of crisis.\n\nOn behalf of the people of North Carolina's 11th District, I extend  my deepest gratitude to iHeartRadio Asheville…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695854/recognizing-iheartradio-asheville"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Matthys graduated from El Campo  High School in 1965, later earning degrees from Wharton County Junior  College and the University of Houston, including a BA in English and  Journalism and a master's in Curriculum and Instruction. In 1967, he  married Pamela, his high school sweetheart, and together they built a  loving family and a legacy of service.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…far-left propaganda outlets like NPR should be  defunded. Remember, this is an outlet that believes writing articles  about fat phobia and queer animals constitutes serious journalism. They  have the right to say whatever they want to, but they do not have the  right to our tax dollars.\n\nTo my colleagues who say that this is only a small part of our  budget,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692538/rescissions-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri. Dr. Cozean, a veteran of the  U.S. Marine Corps, died November 11, 2025, at the age of 87.\n\nJon was a lifelong learner. He started a radio station. He studied  journalism at the University of Missouri, earned a master's degree from  George Washington University and a doctorate in international relations  from the American University. He worked…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…community and a living record of our shared history.\n\nJames Claude Wilkerson first bought the newspaper in June 1925,  beginning a proud family tradition of civic service through journalism.  This year, the Wilkerson family is celebrating an extraordinary  milestone of 100 years in print.\n\nToday, James Bradley Wilkerson is a fourth-generation owner, carrying…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…service, and commitment to community reflect  the very best of civic engagement and personal dedication. A graduate  of the University of Georgia's Henry W. Grady School of Journalism, Ms.  Seiler built a distinguished career in corporate communications and  public affairs before retiring.\n\nMs. Seiler served Georgia Power and contributed her talents to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…intellect and voice  have continued to influence conversation across the country.\n\nFrom education to healthcare and beyond, he has shaped debates in  higher ed, politics, journalism, and more through the years. Ben did  this all at a young age. Even though he has a very public profile, he  and his wife, Melissa, have built a vibrant family. All of this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Medal, eight  Air Medals, two Meritorious Achievement Medals, the Combat Readiness  Medal, and numerous other decorations. Later in his Air Force career,  he cross-trained in journalism, working in public relations and  advertising and coordinating with local officials for USAF Thunderbirds  aerial demonstration performances.\n\nTom's commitment to community…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Public Law 112-174, which directed Frederick Douglass' statue       placement in the Capitol Visitor Center's Emancipation Hall;       and\n\n[Whereas Douglass was a pioneer in journalism who broke       through glass ceilings throughout one of the most crucial       times in American history, exhibited great perseverance to       become an American hero,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…extraordinary life  guided by curiosity, integrity, engagement, and helping those in need.\n\nMr. Murphy was raised in Gainesville and attended Mercer University,  where he began his journalism career. Throughout his career, Mr. Murphy  experienced success working in a variety of esteemed publications,  including The Macon Telegraph and The Atlanta Journal-Constitution.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…1980, Arnie founded The Valley Log, a weekly  newspaper in Huntingdon County. Arnie has served as the publisher and  editor over the last 45 years.\n\nArnie's contributions to journalism also include multiple books on  Pennsylvania history. Additionally, Arnie and his wife, Linda, are  partners in the McClure Mills Farms.\n\nArnie's wife, Linda, is a community…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…moderating debates. Sheri  brought clarity, dignity, and heart to every story she told.\n\nHer excellence has not gone unnoticed. Sheri is a proud inductee of  both the Michigan Journalism Hall of Fame and the Michigan Association  of Broadcasters Hall of Fame. She's received multiple Emmy nominations,  accolades from the Associated Press, and recognition from…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690456/recognizing-sheri-jones"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…exceptional coverage of  Savannah's 200th Saint Patrick's Day celebration, a signature event in  the city's history and culture.\n\nWTOC-TV represents the very best in local journalism, combining  heart, hustle, and hometown pride. Covering Savannah's Saint Patrick's  Day is no small task. It is an all-hands-on-deck event that calls for  early mornings,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693027/recognizing-wtoc-tv-in-savannah-georgia"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…continued success and leadership on behalf of Norfolk.                            Honoring Andrew Ozaki\n\nMr. FLOOD. Mr. Speaker, I rise today to honor a giant in Nebraska  journalism, Andrew Ozaki.\n\nOver the course of his 43-year career, Ozaki led KETV's Lincoln  bureau and built a reputation for both tenacity and kindness.\n\nWhether he was covering the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}]