[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Rose.  Whether it is helping organize the annual Tucson Juneteenth Festival or  volunteering at a neighborhood food bank, she is always there, quietly,  consistently, and with joy.\n\nFrom mentoring youth and distributing books to supporting families  facing food insecurity, Rose shows up, not for recognition but because  she believes in the power of community.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699984/recognizing-rose-taulton-volunteer-of-the-year"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…kitchen, I  looked through the kitchen, and John McCain was sitting there with  another elderly, tough-looking man on the couch, engaging in some  conversation. So I didn't get my joy of breaking into John McCain's  house, but I walk in, and he is sitting there with a former Secretary,  if I remember correctly, of the Navy.\n\nAnd they were like: Booker, skedaddle.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…and independence. We must ensure healthcare and housing are  affordable and readily available. We must protect our air, water, and  open spaces for all to enjoy health and the joy of getting outside in  our beautiful State.\n\nA better future is possible if we fight for it. I can assure you all,  I came here to do just that. It is time for the Federal Government…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699588/stop-the-republican-affordability-crisis"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…spent his life bettering the lives of countless individuals in our  country and around the world.\n\nBorn in Providence in 1948, Alan dedicated his professional life to  bringing joy to generations of children as the CEO of his family's  company, Hasbro Toys.\n\nAlan helped the company acquire quintessential children's brands like  Play-Doh, Monopoly, and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…times of crisis and honoring the sacrifices of these brave men and  women. The Make-A-Wish Foundation grants life-changing wishes to  children with critical illnesses, bringing joy and hope to families  facing immense challenges. Through the Wishes & Heroes Benefit Concert,  Corey has made a tangible difference in the lives of countless  individuals served…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…in a spreadsheet.\n\nThese are real families that we are talking about. These aren't just  numbers in some speech or in some press  release that my colleagues put out expressing joy over the misfortune  of hundreds of thousands of people. These are real people, some of whom  I know, some of whom I have met, and some of whom my colleagues know.  These are…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…bill in the House.\n\nProtecting and restoring our Great Lakes has long been a bipartisan  priority. I am proud of our work together on this topic. Lake Michigan  is the pride and joy of Chicago, but the native ecosystems are at risk.\n\nMy colleagues might have noticed the poster behind me. This is a sea  lamprey. They are not native to the Great Lakes, but…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…``Heavy Minded.'' This piece  shows how your inner thoughts can sometimes feel heavy. However, this  piece also shows how to appreciate the beauty in the things that you  find joy in. This piece will proudly be on display in the Cannon tunnel  for the next year.\n\nMr. Speaker, I am proud of all the students who submitted their  pieces for this year's art…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692266/congratulating-californias-29th-districts-congressional-art-competition-winners"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…deserves the chance  to read. Their AmeriCorps Fellows work every day in our schools,  shoulder-to-shoulder with teachers, helping struggling readers build  confidence, skills, and joy.\n\nTheir CEO said this recognition reflects the trust placed in them by  educators, the hard work of their Fellows, and the resilience of the  students themselves.\n\nMoreover,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and I recently had the pleasure of attending a  service at The Remedy Church, which was also their fifth anniversary.  We were moved by the enthusiastic spirit of fellowship, joy, and  genuine camaraderie that filled the sanctuary.\n\nI sincerely congratulate Pastor Lav, Pastor Lesa, and The Remedy  Church congregation on their fifth anniversary. May they…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Wolverines, they have taken a meaningful step to make our school a  better place. Many of them have actively contributed to making  Woodgrove safer through Project Safety. They brought joy and creativity  to our halls in their performance of ``The SpongeBob Musical.''\n\nBeyond that, Woodgrove High School was recognized in Virginia for its  growing attention to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…the 70th year of  its existence.\n\nAs a lifelong baseball fan, there is nothing quite like watching  young players take the field. Their energy and determination fill me  with joy and hope for the future.\n\nSports are more than just games. They are a powerful tool to help our  children build confidence, discipline, and a strong sense of teamwork.\n\nBurbank…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689732/congratulating-burbank-national-little-league"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Florida, a safe haven for Orlando's LGBTQ+ community that was  turned into the site of unimaginable horror and a mass grave.\n\nPulse was more than just a club. It was love. It was joy. It was  freedom and a space for a community facing constant adversity, from our  State, and people like in our inner administration.\n\nJust today, Governor Ron DeSantis deleted…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today with a heart full of joy to  celebrate a story that reminds us why sports, family, and community  matter.\n\nAt the University of Toledo, sophomore Rocket Miriam Diala was  greeted after a hard-fought…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699647/family-sacrifice-and-the-rocket-spirit"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…director  of Palenque LSNA.\n\nJuliet's love for Black, Brown, indigenous, and immigrant communities  and her bold vision of collective liberation is deeply rooted in  healing, joy, and solidarity, especially among young Latinos and  ``madres immigrantes''; ``immigrant mothers.''\n\nTo fight erasure, she connects young leaders to their history and  genealogy.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692643/recognizing-travis-brown"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…of  community and the arts.\n\nAs we celebrate this incredible honor, I look forward to more  captivating performances, more incredible meals, and more nights filled  with the joy that only the Alhambra can provide.\n\nWhen Craig is there, and he is most nights, he personally welcomes  each audience. When you step through the doors, Mr. Speaker, you are…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…way, of bored people because they were living off of  welfare largely, in a choice between that and a well-run, Western,  honest country like Israel, Greta Thunberg got more joy out of engaging  in protests or whatever these people do to try to help the Hamas group  that brutally killed a thousand people.\n\nOur country has to identify Thunberg syndrome…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We got an updated letter from the Congressional Budget Office.  Apparently, it didn't make me particularly popular with a few people,  which actually provides me a perverse joy. If you read it, in the 30- year window, it looks like if we do all this without an attempt to pay  for, if we drive up interest rates by 1 percent, in the 30-year window,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…help--then doing exactly that. Joan is truly a  Hero Among Us. As she puts it, ``I started volunteering to help others  but never realized it would help me too. It has given me more joy than  I could ever imagine. Volunteering for hospice saved my life, and I  hope it does the same for others too.''\n\nIt is clear Joan Moore has made a profoundly positive impact…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…contributing  to community events. He was known for his generosity, kindness, and  willingness to help others, always offering a listening ear and  thoughtful advice.\n\nJoe found joy in family, good friends, music, cycling, and long walks  on the beach with his dogs. His legacy of service, faith, and love for  his community will continue to inspire all those…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…SPECTRUM NEWS; Jones, Taylor: WDCW; Jones, Torrance: FOX       NEWS; Jordan, Rosiland: AL JAZEERA ENGLISH; Joseph, Akilah:       AL JAZEERA ENGLISH; Journiette, Derek: C-SPAN; Joy, Richard:       VENTANA PRODUCTIONS; Joynt, Carol: CBS NEWS; Judd, IV.,       Donald: CNN; Judge, Padraic: NBC NEWS; Jurek, Thomas: CNN;       Kachroo, Rohit: INDEPENDENT TELEVISION…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…their strength and resilience are vital to the success of  our armed forces.\n\nAs Mr. Austin embarks on this next chapter, I wish him and his family  a future filled with peace, joy, and well-deserved rest. The United  States Army Reserve--and indeed, our Nation--is better because of his  service.\n\nI thank Steve for his extraordinary career and your enduring…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Charlie Kirk, in a debate with an atheist: ``I  would argue you have a lot more faith than I do. You have a lot more  blind faith to believe that everything around you, love, joy, peace,  sadness, is all just a construct of neurons firing in your brain. We,  as Christians, have hope that we are going to see our loved ones again  and that we will be in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "John Rose", "party": "Republican", "sentence": "…and the acoustics around you make for an  unforgettable evening. No matter how many chances I get to see a show  in person, I always sense the history, the importance, and the joy that  the Grand Ole Opry represents.\n\nAs the United States Representative of Tennessee's Sixth  Congressional District, I rise today to enthusiastically congratulate  the Grand…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…connection, opportunity, and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692478/recognizing-michael-goodwin"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…time when our Nation often feels divided, ``[. . .] it is  exciting to see the City of Palm Bay, along with the city's businesses  and the citizens, create an event where love, joy, and peace are  expressed.''\n\nMr. Speaker, the spirit of the holidays is about generosity, service,  and time spent with loved ones. The Family Christmas Extravaganza  reflects…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…connection, opportunity and the return of future  generations to their ancestral homes. The emotional moment when power  was turned on for the impacted families--bringing tears of joy and  renewed hope--is a testament to the profound difference this project  made. WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692647/recognizing-jamen-monbarren"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…to those who served our  Nation. His dedication to attending naturalization ceremonies for new  citizens reflected his profound love for our community and country,  bringing joy to those he welcomed as his fellow Americans.\n\nHis legacy as a public servant made him a pillar of Haverstraw in  Rockland County and continues to benefit residents every single…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697700/paul-piperato-post-office-building"}]