[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…a problem of immense magnitude and seriousness. It changes  the lives of families all across the country all the time.\n\nI wish our colleagues on the House Committee on the Judiciary would  bring out the End Driving While Intoxicated Act legislation to spread  the compulsory ignition interlock device around the country. A majority  of States and jurisdictions…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Frankenstein-level  monstrosity of extreme provisions that many of them did not realize  were in there.\n\nOne such provision was the one in that bill that would effectively  neuter the judiciary's power to hold any administration official in  contempt. This provision is a little wonky. In essence, it prohibits  Federal courts from enforcing contempt citations which…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to thank Daniel Rubin for his  outstanding service to the House of Representatives, to the House  Judiciary Committee, and to the constituents of New York's 12th  Congressional District.\n\nDaniel Rubin is an exceptional talent, with years of experience  working at the highest levels…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that goes on in  every generation about what is the right policy; the tug-of-war that  goes on in every generation with competing efforts to get more power in  either the judiciary, the executive, or the Congress; the checks and  balances system that we have where a check we have, as U.S. Senators,  is the right to make that decision whether the citizens…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…side of the aisle, no whisper of  dissent yet. I hope that changes. I hope that changes.\n\nThe Founders separated the powers between the executive and the  legislative and the judiciary because they wanted to set ambition  against ambition--ambition of one institution against another--to  protect all of our freedom, but that requires that we go beyond our…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…DURBIN. Mr. President, on a separate issue, I want to say a word  about some nominations that are pending before the Senate this week.\n\nAs the ranking Democrat on the Senate Judiciary Committee, I pay  closer attention than some when it comes to the nominees who are  suggested for Federal positions on the courts. These are positions that  are lifetime…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…working to stop this President from acting unlawfully  and unconstitutionally.\n\nWe are seeing great success in the courts, which is why this  President is now attacking the judiciary and attacking judges, and we  will talk about that later during this Special Order hour, which I have  been asked to lead.\n\nI also participate in a hearings working group…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…you know and understand that you want to hide.\n\nBefore I go into much more, I yield 5 minutes to the gentleman from  Maryland (Mr. Raskin), who is the ranking member of the Judiciary  Committee, to tell them what socialism is really all about.\n\nMs. WATERS. Mr. Speaker, I would just like to say that the  Republicans are confusing socialism with despotism…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…ought to be identified so that a person will  know who arrested them. However, he doesn't care. It doesn't matter to  him that we have a branch of the government called the judiciary. He  wants to impeach the judges when they differ with him. We have got a  Member of Congress who has filed Articles of Impeachment against a  judge because they don't agree…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…urge my colleagues to support  the bill, and I yield back the balance of my time.\n\nMr. HARRIS of North Carolina.\n\nMr. Speaker, I thank the members of the Committee on the Judiciary  for unanimously supporting this bill in markup. I am grateful for my  colleagues who have all risen to speak today and to the ranking member  and leadership on the other…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…normally, a DC Circuit Court seat was  associated with a State, and the Senators from that State had the  ability to recommend a nominee to the President.\n\nThe Republicans on the Judiciary Committee undid that--what we call  the blue-slip rule--for circuit courts. So Senators lost that power.\n\nWhen we were in the majority, when President Biden was there, there…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696140/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…was sitting there with the President of El Salvador. I  raised concerns about that. I had Republican friends who got on me  about it. Guess what? The House Committee on the Judiciary and the  Committee on Homeland Security had votes. The Democrats proposed  amendments that said let's make it illegal, let's make a ban on  deporting American citizens. Every…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…appears more than any other in the Epstein  emails.\n\nIn the pantheon of violence, a sexual predator is the worst of the  worst, so why protect him? It is also curious that the Judiciary  Committee is managing this debate and has not even had this come before  the committee. I wonder why. Release the files now.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696809/epstein-files-transparency-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Action Fund.\n\nEverytown for Gun Safety.\n\nGIFFORDS.\n\nNewtown Action Alliance.                                   ____       Hon. Jim Jordan,      Chairman, Committee on the Judiciary,      House of Representatives, Washington, DC.      Hon. Jamie Raskin,      Ranking Member, Committee on the Judiciary,      House of Representatives, Washington, DC.\n\nDear…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Representatives and trial by the  Senate.\n\nARTICLE II. Abuse of Presidential Power to Intimidate Federal Judges  in Violation of the Separation of Powers and Independence of the  Judiciary.\n\nIn his conduct of the office of President of the United States,  Donald John Trump, in violation of his constitutional oath to  faithfully execute the office of President…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…authorized to meet during the  session of the Senate on Thursday, July 17, 2025, at 2:45 p.m., to  conduct a hearing on a nomination.                          COMMITTEE ON THE JUDICIARY\n\nThe Committee on the Judiciary is authorized to meet during the  session of the Senate on Thursday, July 17, 2025, at 9:15 a.m., to  conduct an executive business meeting.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693750/authority-for-commitees-to-meet"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…(1) Appropriate congressional committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Homeland Security, the Committee on       Judiciary, and the Select Committee on Intelligence of the       House of Representatives; and\n\n(B) the Committee on Homeland Security and Governmental       Affairs, the Committee…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…employee ``didn't know the context when a reporter asked him a  hypothetical question and has promised to check before any future  public statements that could overlap with Judiciary Committee work.''\n\nSo I hope it is clear. It appears that, based on Government  Accountability Project's representations to my office,  the New York Times misled the Government…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Mr. ISSA. Mr. Speaker, I include in the Record the CBO estimate for  this bill.     H.R. 1526, NORRA OF 2025 AS REPORTED BY THE HOUSE COMMITTEE ON THE                        JUDICIARY ON MARCH 25, 2025 ------------------------------------------------------------------------                                           By fiscal year, millions of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…savings. Education, they  found a bunch of savings. I can go through committee by committee. Last  night, we added a lot of fees to pay for border security and stuff in  the Judiciary Committee. There are other things we could do.\n\nThe math is still going to have to be math. We are going to spend  about another $300 billion in this bill for defense and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Solicitor General's Office. She drafted numerous briefs and presented  oral argument to the U.S. Supreme Court. Her former colleagues in the  Justice Department wrote to the Judiciary Committee, commending Ms.  Taibleson for tackling some of the most difficult legal questions  facing the country and doing so with very thoughtful leadership.\n\nMost importantly,…", "date": "2025-10-27", "source_url": "https://justfacts.votesmart.org/public-statement/1696407/nomination-of-rebecca-l-taibleson"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…supporting the ongoing development of       democratic values in Georgia, including free and fair       elections, freedom of association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law, countering       malign influence, and anti-corruption efforts and to impose…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…the U.S. District Court for the District of Montana.\n\nPresident Trump made an excellent choice when he picked Bill. I was  thrilled to see him quickly approved by the Senate Judiciary Committee,  and now, today, the U.S. Senate will vote in the next hour or so on his  final confirmation. And I urge my colleagues to join Senator Sheehy and  I in supporting…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…exemplifies the principles upheld in the Supreme Court's  landmark Loper Bright Enterprises v. Raimondo decision. By overturning  Chevron deference precedent, the court restored the judiciary's  rightful role in interpreting statutes and checking agency overreach.\n\nThis is important for all of us. What Biden's administration did for  4 straight years was to overreach,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Report on Criminal Statutory Offenses.--Not later than       1 year after the date of enactment of this Act, the Attorney       General shall submit to the Committee on the Judiciary of the       Senate and the Committee on the Judiciary of the House of       Representatives a report, which shall include--\n\n(1) a list of all criminal statutory offenses,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…government has been vetting or failing to  vet aliens who have entered the country, and I believe that these  questions deserve answers.\n\nFor that reason, I am chairing a Judiciary Committee subcommittee  this afternoon, alongside our colleague Senator Hawley from Missouri,  entitled ``Biden's Afghan Parole Program--A Trojan Horse with Flawed  Vetting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Innovate Less Lethal to De-Escalate Tax       Modernization Act. H.R. 2189 has received significant       bipartisan support and was marked up and approved by the       House Judiciary Committee with favorable guidance on November       18, 2025.\n\nH.R. 2189 addresses a serious and growing challenge:       outdated statutory language within the 1968 Gun…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Relief Act, is a  strong, bipartisan piece of legislation--and bicameral, actually--that  will help one of our most vulnerable populations.\n\nThis legislation passed the House Judiciary Committee by a voice vote  earlier this year, and I am looking forward to seeing it pass the full  House.\n\nHuman trafficking is a heinous crime that we are all too familiar…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Affairs,       the Committee on Finance, the Committee on Foreign Relations,       the Committee on Homeland Security and Governmental Affairs,       the Committee on the Judiciary, and the Select Committee on       Intelligence of the Senate; and\n\n(B) the Committee on Financial Services, the Committee on       Foreign Affairs, the Committee on Homeland…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Mr. Speaker, I include in the Record the CBO score for this bill.   H.R. 2189, LAW-ENFORCEMENT INNOVATE TO DE-ESCALATE ACT, AS REPORTED BY         THE HOUSE COMMITTEE ON THE JUDICIARY ON JANUARY 30, 2026 ------------------------------------------------------------------------                                           By fiscal year, millions of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}]