[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…nightmare that is unfolding for my constituent and his family.\n\nLast month, ICE detained Benjamin Guerrero-Cruz while he was walking  his dog. Benjamin is a rising senior and in Junior ROTC at Reseda High  School. He is a kid who wants to serve our community. He has been in  ICE detention for the past month, separated from his family and  friends.\n\nLast week,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694911/ice-is-out-of-control"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…life has been a shining example of courage,  service, and commitment to country and community. A proud son of the  Eastside, Paul attended Franklin Elementary, Santa Barbara Junior High,  and Santa Barbara High School. In 1943, during what would have been his  senior year, Paul made the brave and selfless decision to leave school  and enlist in the United…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…was  an African-American artist who is now recognized as a major American  painter of the 20th century. She attended Howard University and went on  to be an educator at Shaw Junior High School here in D.C.\n\nShe had a deep understanding of the importance of the arts in  children's self-expression and created enrichment programs for her  students. Her most…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…career in education. His  educational journey included roles at his alma mater, South Girard High  School, South Girard Elementary, and Ridgecrest Elementary, where he  coached junior high basketball teams and instilled in his students the  importance of winning in the game of life.\n\nThroughout his career, Cliff pursued continuous improvement through  advanced…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…outdoors.\n\nI rise today in support of this incredible piece of bipartisan  legislation that I cosponsored with another great midwesterner, Rudy  Yakym, the Reauthorization of Junior Duck Stamp Conservation and Design  Program Act.\n\nThis program is an art- and science-based curriculum that educates  children on the importance of wetlands and waterfowl conservation.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…winning that trophy which so far had  eluded her is just a storybook way for her career at the University of  Connecticut to finish.\n\nShe was joined by Azzi Fudd, who is a junior, 24 points, 6 rebounds,  and 3 assists. She was named the Most Outstanding Player of the Final  Four, which is really saying something when we have a teammate like  Paige Bueckers.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…disservice to the students who we are purporting to support.\n\nI have had a chance to work with a lot of students who have become  pregnant, both from around the time I was in junior high, when a friend  of mine had a pregnancy scare, to a time when I was in college, to  being a volunteer in the bay area where I was on a rapid response line  in case someone…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Addelynn Ferguson  as  Ohio's 13th Congressional District Champion of the Week.\n\nAddelynn is a junior from Portage Lakes Career Center in Uniontown,  Ohio, and out of nearly 50 participants, she took home the first-place  prize for this year's Congressional Art Competition…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690574/champion-of-the-week-addelynn-ferguson"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…in Education that touched the lives of thousands of  young people. Her career encompassed 12 years as a classroom teacher, 7  years as Director of Guidance at Talbotton Road Junior High School, 7  Years as Director of Guidance at Daniel Junior High School, and 20  Years as the first Coordinator of Guidance Services for the Muscogee  County School District.…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…undefeated season, not giving up a  single touchdown before the Super Bowl.\n\nDuring their championship run, people from all walks of life,  including the owner of the iconic Junior's Restaurant came together to  support the Jaguars to make sure they could travel to Florida,  participate in the Pop Warner Super Bowl, and bring the trophy home to  Brooklyn.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the law is carved into the  facade above the Supreme Court pillars, and it says ``Equal Justice  Under Law.''\n\nYou know, the very first political act I took was when I was a junior  in high school and I read an article in the evening paper--back when  there was often a business paper in the morning and a labor paper in  the evening--in the Oregon Journal.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community for nearly five decades.\n\nFounded on October 22, 1975,…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…slow  recruiting efforts and delay servicemember moves, throwing our military  families into limbo, not to mention it would potentially negate the  14.5 percent pay raise for junior-enlisted servicemembers, delay  military housing projects, and undercut initiatives to improve  servicemember quality of life and mental health.\n\nAlso, since a yearlong CR…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…across America.\n\nMr. Speaker, guess who stopped it without my knowledge, without their  knowledge, and without anybody's knowledge?\n\nIt was one DOGE employee, one of Elon Musk's junior lieutenants who  spent his career at Tesla, and then he decided he was going to wipe out  hundreds of millions of dollars going to our people.\n\nMr. Speaker, are our colleagues…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…way. They assured us that our  baby was healthy, and they gave us such peace of mind.\n\nHere we are, 17 years later, and our daughter Elle is smart. She is  beautiful. She is a junior in high school, and we are out looking for  colleges. The pregnancy resource center in my community was there for  us when we were young and scared, when we had very limited…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…is a debate. Some say  there is not a war; some say there is a war; some say we won't know for  a while if there is a war or isn't a war.\n\nLast year, we had this debate. The junior Senator from Texas came  forward and presented a War Powers Resolution for Gaza. He said that  President Biden's decision to send U.S. troops in to build a beachhead,  to build…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Corpus Christi aviation hangar. Sec. 276. Report on impacts of joint travel regulations on members of                Coast Guard who rely on ferry systems. Sec. 277. Report on Junior Reserve Officers' Training Corps program. Sec. 278. Report and briefings on implementing section 564 of title 14. Sec. 279. Report on role of Coast Guard. Sec. 280. Report…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…five.\n\nLook, it breaks my heart because we keep having these discussions,  and I have come behind this microphone for over a decade now and feel  like sometimes I am doing a junior economics lecture.\n\nThe point is trying to say: Here is the scale of the problem, but  there are actually solutions if we can be bold, if we can be creative,  and if we can…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…led by the coaches. It is not led by the teachers. It is  led by students that just say: Let's ask God to help us in this.\n\nI am always impressed when I am on high school and junior high  campuses as I walk around the campus during lunch, and I see everyone  kind of gathering for lunch and all the conversation happening, and I  will see a couple students…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…PIAA Class 3A Track and Field  Championship, held on May 23 and 24.\n\nThe 2025 PIAA Class 3A track and field championship took place on May  23 and 24,  during which Ephrata junior Sophia Rivera excelled in shot put and  discus. On the first day, Rivera captured the state title in girls'  shot put with a distance of 43 feet, 3 inches. Her domination continued…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691701/congratulating-sophia-rivera-girls-shot-put-and-discus-state-champion"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise to recognize Madison Wasmer.\n\nMadison is a junior at Jackson High School and has recently earned  the Eagle Scout Award, becoming the first female in Jackson County to  earn this distinction. To achieve this, Madison obtained…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  Young Marine Corporal Chase Muchmore on being named the Pennsylvania  Regiment Junior Young Marine of the Year.\n\nChase Muchmore is a current student at Manor Middle School and is a  Corporal with the Young Marines of Lancaster County. As a member of the  organization's…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…that I rise  to pay a very special tribute to an outstanding high school water polo  team in Ohio's 5th Congressional District. The young women of the  Napoleon High School junior varsity girls water polo team  have represented their school ably on their way to achieving the JV  State Girls Water Polo Title. In their effort to surpass all other  teams,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697932/recognizing-the-napoleon-high-school-on-winning-the-junior-varsity-state-girls-water-polo-championship"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize an outstanding  young leader in our community, Kacee Gray, who has been named the Cass  City Junior Citizen of the Year for 2025. Kacee exemplifies the values  of hard work, dedication, and service, making a profound and lasting  impact on Cass City and beyond.\n\nA soon-to-be…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Yorker: ``The End of Children.''\n\nRealize that the Census Bureau of the United States says that in  about 7\\1/2\\ years this country has more deaths than births. Tell me as  a junior actuary, or someone who wishes he was smart enough to be one,  how I make the math of the future work in a society that has a shortage  of young people.\n\nIs that Republican…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Association.\n\nLet me repeat that: Five decades of commitment, sacrifice, and  leadership in the name of public safety. Glenn's journey with the fire  service began in 1975 as a junior firefighter. But really, you could  say it started even earlier--his family has proudly served in the  Newtown Fire Association since 1915. Service is in his blood.\n\nOver the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691839/recognizing-chief-glenn-forsyths-50-years-of-service-with-the-newtown-fire-association"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…``education'' means an associate,       baccalaureate, graduate, or professional degree, specified       coursework, or other form of educational attainment awarded       by a junior or community college, college, or university that       is accredited as a collegiate institution by a recognized       accrediting agency or approved by the appropriate State…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700121/skills-based-federal-contracting-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…FITZPATRICK. Mr. Speaker, I rise today to recognize Master  Sergeant Shawn Worthen, United States Marine Corps, Retired, of  Bensalem High School, who has been named the Marine Corps Junior  Reserve Officers' Training Corps (JROTC) Instructor of the Year for the  past school year.\n\nThe Bensalem Township School District is proud to celebrate this  extraordinary…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696209/recognizing-bensalem-high-school-jrotc-instructor-of-the-year-master-sergeant-shawn-worthen-retired"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…critically  important. It is critically important for us continuing to have the  gold standard for the economy, the gold standard for the rule of law.\n\nWe cannot allow some junior U.S. attorney--assistant U.S. attorney-- in some jurisdiction here, all of a sudden, to play with fire. They  didn't know what they were doing. They didn't look through the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}]