[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…found that in the last  weeks and couple of months, there has been no violence on any  widespread scale. The same findings more or less have been done by  courts in other jurisdictions. But even if there were, police forces  there have state-of-the-art weapons, equipment, analysis tools,  communication platforms, and training--all that is necessary to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…recruiting and retaining police officers. Police departments of all  sizes across the country have had this difficulty for many years. A  survey conducted in 2019, before jurisdictions across the country  enacted police accountability and transparency legislation after the  murder of George Floyd, found ``that the difficulty in recruiting law  enforcement…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…principles.\n\nThe Pacific Islands, spread across the vast Pacific Ocean, have a  collective maritime area that exceeds the land area of Russia and China  combined. These jurisdictions are key partners in maintaining a free  and open Indo-Pacific and meeting vital security and economic  challenges. It is imperative that we develop, maintain, and grow…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…change its approach to marijuana.  For example, for the last several years, Congress has prohibited the  Department of Justice (DOJ) from using federal funds to prevent  jurisdictions from implementing their medical marijuana laws. This bill  would similarly allow individuals to use marijuana in federally  assisted housing in compliance with a state's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Undocumented  immigrants are not going to want to identify themselves, including  their address, where they live.\n\nNoncitizen voting, again, this is consistent in a lot of  jurisdictions across the entire country. We talked about 20  municipalities doing this to allow universal adult suffrage, the  ability for people to take part in local elections.\n\nThe…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…biolab that was created in 2023 in Reedley, California. This  does not surprise me.\n\nWe cannot assume that communities across the country are immune from  similar risks. Many jurisdictions simply do not have the expertise or  Federal support needed to quickly identify and respond to unauthorized  biological operations. That is why I have introduced legislation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…that the PIF will establish a  mission to the U.S.\n\nScattered across the three traditional Pacific subregions of  Melanesia, Micronesia and Polynesia are over two dozen jurisdictions  collectively known as the Pacific Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…not  about ensuring that only citizens vote. This is about making it  impossible for people and new voters to vote.\n\nMr. Speaker, this has played out in Texas and other jurisdictions  across the country. Yet, in 2021, Texas has led the Nation in voter  suppression, rejecting nearly 13 percent of mail-in ballots. Texas  rejected nearly 13 percent of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689407/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Judiciary would  bring out the End Driving While Intoxicated Act legislation to spread  the compulsory ignition interlock device around the country. A majority  of States and jurisdictions are using it right now. It is working. It  should be nationwide.\n\nWe can save literally thousands of lives by doing that because it is  a very, very small percentage of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…individualized conditions of release to support community       safety. The results of D.C.'s current risk and safety based       pretrial system outperform most cash-bail jurisdictions in       the country. Ninety-two percent of people released pretrial       in D.C. remain arrest-free before trial, 87% appear for their       court dates, and 86% complete…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of Chiefs of Police, vehicular pursuit policies must  ``balance the risks, take all of the factors into consideration, and  reach a decision that is best suited to their jurisdictions.'' Unlike  D.C., 2 percent of local police departments prohibit vehicular pursuits  altogether. The sponsor of this bill, who is from Louisiana, thinks he  knows better…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…enforcement agencies.\n\nHistorically criminal justice laws and policies have been       determined by local jurisdiction based on their specific       needs. Several other jurisdictions have enacted policies       similar to those in the CPJRAA. States across the country       have enacted policies like these because many believe that       holding law…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the driver has difficulty  communicating through speech and that holds the documents a police  officer might request during a traffic stop. These programs exist in  many jurisdictions across the country, including statewide in  Massachusetts, Connecticut, Arkansas, Rhode Island, Arizona and  Vermont.\n\nI urge my colleagues to support this bill.", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694714/introduction-of-the-blue-envelope-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…would repeal a 2022 law       extending voting rights in local District elections to non-      citizen residents. Non-citizens enjoy similar voting rights       in 15 other jurisdictions, including San Francisco and       Oakland, California, Montpelier, Vermont, and a number of       jurisdictions in neighboring Maryland. It continues to be       unlawful…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…attacks on D.C.'s       autonomy. Allowing such federal overreach would set a       dangerous precedent for undermining local governance       nationwide, particularly in jurisdictions with progressive or       Black leadership. This fight is not just about the District       of Columbia, it is about protecting democracy, equity, and       self-determination…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…commonsense and bipartisan piece of  legislation. I urge all of my colleagues to support it. Law enforcement  has been demonized and attacked. They have been defunded in leftwing  jurisdictions many years ago.\n\nI hope that that movement is forever in the dustbin of our history  because we owe it to law enforcement to support them in any number of  ways that we…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…registration, turning election day into  election month, and forbidding proof of identity all make cheating easy  and destroy the public's confidence in the process.\n\nIn many jurisdictions, the Democrats have made it clear that they  intend to allow noncitizens to vote, the ultimate in foreign election  interference.\n\nI have news for my colleagues on the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…multiple gunshot wounds.\n\nIn the hours and the days following, the largest manhunt in our  State's history ensued, with over 200 officers from local, State, and  Federal jurisdictions working together around the clock to bring the  shooter to justice.\n\nI thank the officers who conducted this successful manhunt and  ensured the safety and security of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it needs to do on Medicaid,  and not doing what it needs to do on countless other issues.\n\nI am not going to do it if it is going to be a big giveaway to blue  State tax jurisdictions in State and local taxes. My friends in this  Conference who represent big tax States like New York and California  want a bigger deduction for their State taxes. Why the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…(H.R. 2931) to direct       the Administrator of the Small Business Administration to       relocate certain offices of the Small Business Administration       in sanctuary jurisdictions, and for other purposes. All       points of order against consideration of the bill are waived.       The amendment in the nature of a substitute recommended by…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…go down to Georgia for the Fani Willis debacle.  So this will be looked at.\n\nWas there a coordinated effort between Jack Smith--the special  counsel--and the most liberal jurisdictions in the country to knock  Trump out of the race by throwing everything you could at him, whether  it made sense or not, and his friends? See, I don't know, but we are  going…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…immediately approved and  expedited for completion.\n\nThis legislation directs the Secretaries of the Interior and  Agriculture to identify all Federal lands in their broad jurisdictions  that may be suitable for hardrock mineral exploration, development, and  production.\n\nFinally, this legislation targets legal and regulatory bottlenecks  that impede domestic…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…entrepreneurs in law-abiding  communities be second in line to support from their own government?  They shouldn't be.\n\nThis bill will relocate SBA regional offices from sanctuary  jurisdictions to communities that actually respect the rule of law,  that actually put American citizens first, and that is not  controversial. It is just common sense.\n\nPresident Biden's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of  Immigration and Customs Enforcement while protecting our officers and  protecting the public.\n\nHowever, such reforms must go hand in hand with a commitment to stop  jurisdictions like Minnesota and California from releasing dangerous,  wanted individuals as some sort of act of defiance, thereby forcing  immigration authorities to go into communities…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699574/consolidated-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…It creates a private right of action so that Americans who are harmed  by a removable alien in a sanctuary city can sue for damages.\n\nIt bans student visas in sanctuary jurisdictions. You do not get to  continue profiting off of importing foreign students if you won't even  deport the dangerous illegal aliens on your streets.\n\nWe are at a crossroads.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…it back to the issues at  hand, we are here to do the important work of safeguarding our  elections in the United States, supporting the police, and ensuring  that local jurisdictions aren't obstructing immigration enforcement.\n\nSimilar bills on these topics have gained support from some  Democrats. Instead of trying to belittle these issues or endlessly…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…cost-free access to existing Federal and State databases so they can  perform this important voter list maintenance.\n\nIn recent years we have seen an increasing number of jurisdictions  across the country allowing noncitizens to vote in municipal elections.  Right here in our Nation's Capital, noncitizens are eligible to vote in  these municipal elections.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…rhetoric that has come from the left on this and my Democrat  colleagues--we talk about, why was Minnesota a flashpoint? It is the  sanctuary city status, the nine sanctuary jurisdictions in this  country. In them, ICE agents are 590 times more likely to be assaulted.  Since January of last year, there has been a 1,347-percent increase in  assaults against…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…all of our law  enforcement officers.\n\nIn this very building, January 6 insurrectionists brutally attacked  the Capitol Police and law enforcement officers from multiple  jurisdictions. More than 140 police suffered injuries and went to the  hospital. Five officers died. Then, President Trump pardoned the  violent thugs who battered those police officers.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…performance;\n\n(2) construction costs and potential impacts on housing       affordability, including the potential for increasing housing       supply in high-cost jurisdictions;\n\n(3) flexibility for diverse consumer needs, including       family sizes, unit configurations, and accessibility;\n\n(4) examples of single-stair codes adopted or considered…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]