[{"senator": "George Latimer", "party": "Democrat", "sentence": "…purchases of  their food no longer have an important market, and it means that  locally grown, more nutritious food is no longer available for food  banks and schools.\n\nJust yesterday, USDA announced that it was ending part of the Farm to  School Program. This program for years incentivized local food  procurement for school meals. Dozens of schools…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…votes.\n\nHere, they need our votes. Yet what have we been offered to get those  votes? Nothing--not even discussions. The President only met with the  Democratic leaders just yesterday, and he didn't seem to be aware of  what was at stake here for the Americans who are about to lose a huge  healthcare benefit.\n\nThey just go wildly forward. We have seen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…has been a revolving door of resolution after  resolution attacking conservation standards for different appliances.  In fact, I should point out, we were on the floor just yesterday  afternoon debating an effort to repeal another energy efficiency  standard for commercial refrigerators and freezers.\n\nInstead of investigating--which is what they should…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and reassert our power so that we can  put forward and pass into law bills that aren't only bipartisan but  that make sure all of our constituents come first.\n\nIn fact, just yesterday, we put out a bipartisan package for S-FOPS  and FSGG funding bills, and it is a package that once again saves  crucial investments in our communities, in our small businesses,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…who won the last election  there--would have no place, no role in the new government because this  was no more about democracy than it was about drugs. It was about oil.\n\nJust yesterday, the Secretary of Energy said that the United States  intended to maintain significant control over Venezuela's oil industry,  including by overseeing the sale of the country's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Speaker, I rise today outraged at the ongoing assault  on the rights and protections of the Federal workers who serve our  Nation, over 48,000 of them in Hawaii alone.\n\nJust yesterday, this House passed the NDAA, meant to strengthen our  national defense. However, the NDAA means nothing if we cut down, take  away rights, and fail to protect the very…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697988/protect-americas-workforce-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…transport their kids to daycare and doctors and the grocery  store. So much for the guy who said he was going to bring down prices  on day one.\n\nIt is worth noting that just yesterday in our Rules markup, our  Republican colleagues voted, once again, to keep the Trump tariffs in  place. Over a month ago, they rigged the rules of the House to prevent…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…children around the  world are unnecessarily dying.\n\nNow, the good news is that Elon Musk, Marco Rubio, and others have  said that this funding will be restored. In fact, just yesterday, at  his Senate hearing, Secretary Rubio said again that essential  humanitarian aid, he meant food aid, will be continued. So do it  already.\n\nIt is good that the administration…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…clock is ticking. Some Republicans in  Congress keep saying: Let's wait. We have time to deal with this later.\n\nUnfortunately, we now know that there is a cost to waiting. Just  yesterday, the CBO, the Congressional Budget Office, estimated that if  we don't act, if we wait until the end of the year to pass an  extension, that 1.5 million more people will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…conclusion of the testimony, that Republican  Senator reportedly embraced the prosecutor and lauded the work of the  grand jurors as cathartic. That same Senator announced just yesterday  that he intends to seek his payout of tens of millions of dollars from  Federal taxpayers.\n\nIt should be clear to everyone here: Under no circumstances should  the power…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…is what this year has produced. Republican energy  policy is creating a less reliable environment for businesses, making  it harder for companies to invest in America.\n\nJust yesterday, Ford announced they were laying off all 1,600  employees at their battery manufacturing plant in Glendale, Kentucky.  In October, on top of the grid modernization cuts…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…would say  you shouldn't file the Articles of Impeachment if you can't win. No,  you need to know where people stand. You really do. We need to know. I  heard a Member just yesterday indicate that we need to have a certain  thing brought before the House to understand where people are. It is  not unusual for us to have votes to find out where people…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…democracy, now being rounded up indiscriminately.\n\nIf you think I am exaggerating with this concern, let the comments  coming out of the Department of Homeland Security just yesterday leave  no doubts. A Department of Homeland Security spokesperson declared for  the first time--now, I want to make sure I get this right, so I am  going to quote:\n\nIllegal…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Durbin for his leadership and commitment to saving public  broadcasting and educational programming for Americans all across our  beautiful country.\n\nNow, unfortunately, just yesterday in New Mexico, the Rio Ruidoso  rose to nearly 20 feet in a matter of minutes amid heavy rainfall,  sweeping away homes, debris, and people. The flooding claimed the lives…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…and justice for all.''\n\n``Liberty and justice for all.''\n\nI do pledge allegiance to liberty and justice for all, and I rise  today to thank the courageous persons who, on just yesterday, took a  stand for liberty and justice for all.\n\nI rise to thank the 140 persons who, on yesterday, voted to support  H. Res. 939, House Resolution 939. This resolution,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…have had people killed by MS-13. Teenagers have been killed by MS-13.  The President is working to stop that from happening.\n\nI would also remind the ranking member that just yesterday--he should  know this, he was standing on stage with me--we had a classified  briefing  with the Secretary of War and the Secretary of State. His comments  afterwards did…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…away a port on the Black Sea that  should be for the people of Georgia.\n\nThey are also subservient to the regime in Tehran, who we know  launched attacks against Israel just yesterday; and war criminal Putin,  who seeks to indeed make the people of Georgia subservient.\n\nThe Georgian people are among the bravest and most pro-American in  the world. I…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…being put on that same map with a target being put  on their backs. Antifa is known to be radicalized and engaging in  terrorist activities, which the President recognized just yesterday, I  believe rightfully.\n\nThe extent to which there is an extraordinary network funded not just  by George Soros but a large number of radical billionaires that are  funding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…along--and has to be dealt with       differently.\n\nThank you, Mr. President, for saying that.\n\nOne of the President's staunchest supporters in this body echoed that  statement just yesterday.\n\nSenator Kennedy of Louisiana said:\n\n[P]utin thinks that America has taken the bullet train to       chump town.\n\nChump town.\n\nThe President is right, and Senator Kennedy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…drugs from Venezuela, I also  highlight that Venezuela has become a strategic outpost for China,  Russia, and Iran, not to mention criminal and terrorist organizations.\n\nJust yesterday, at a Europe Subcommittee hearing, I made the point  that China and Russia are engaged in hybrid war against the United  States today.\n\nNot only has Maduro's regime purchased…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, I know that many of our colleagues and  the American people have seen the tragic news out of my hometown just  yesterday. And I am grateful for their thoughts and their prayers this  morning directed toward the people of Louisville.\n\nFolks around our county, Jefferson County, need those…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…committee that the chairman  presides over represents the future of this great country. I always  tell people that the Science, Space, and Technology Committee is not  just about yesterday or tomorrow, but it is 5 years, it is 50 years, it  is 250 years into the future, and that is just an amazing thing.\n\nToday, I rise in support of H.R. 1325, the Commercial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…effect, and it doesn't produce a good  outcome--not for people of either party, not for people of either  legislative Chamber, and, certainly, not for the American people.\n\nJust yesterday, we were able to do some things on the floor the right  way. Senator Sullivan came to the floor and passed his bill to extend  the deadline for Alaska Native Vietnam-era…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…me found that adversaries  like Russia and China are taking disruptive action against undersea  cables on a more frequent basis around the world. Here is an article  just from yesterday talking about a Chinese cargo ship captain who has  been charged with severing a natural gas pipeline and a communication  cable in the Baltic Sea.\n\nIf we stick to the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…they will lose their benefits. This  is because in America right now we discourage work, and we actually  discourage savings as well, and we discourage marriage as well.\n\nJust yesterday, I heard of another couple. They just had their second  child, but they weren't getting married. I didn't dig into it, but I  know what is going on when you have people…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…good-faith conversations on that front. He also has been  explicitly clear that holding the government hostage is wrong. I  wholeheartedly agree with him.\n\nAs he stated just yesterday: We need to get the government open, and  I hope all Republicans and Democrats will join me in supporting this  bill, and send it to my desk without delay.\n\nI say to this…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…California and New York,  where you have sanctuary cities, then there are dangerous people  throughout our country, too.\n\nThis is just the worst of the worst from yesterday, just yesterday.\n\nIn Virginia, a 20-year-old citizen of Guatemala was convicted for  possessing obscene material of a minor and filming child porn.\n\nIn my home State of Texas, a criminal…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…whom they have sought out to  take their cases and weaponized nationwide injunctions to stall dozens  of lawful executive actions and initiatives.\n\nProof of that occurred just yesterday when, by a majority of the U.S.  Supreme Court, yet another judge's national ban was overturned.\n\nThese actions touch on many of the most critical issues facing our  country,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…advanced this critical  legislation last year. This was an important step, but our progress has  been stalled in the House.\n\nThe National Transportation Safety Board's hearing just yesterday  further confirmed that this legislation could have made a difference on  January 29 a year ago. We cannot afford to waste any more time. I  urgently insist the House of…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…gentlewoman from  Georgia's passion for ensuring support for our overseas allies are a  wise use of taxpayers' dollars, but support for Taiwan must be part of  that equation.\n\nJust yesterday, the Trump administration released a statement of  administration policy for the Defense appropriations bill. I was very  supportive of the bill we produced. One of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}]