[{"senator": "John Larson", "party": "Democrat", "sentence": "…storied 100-year  history, the club has grown into the premier location for members to  enjoy organized social, intellectual, and artistic gatherings.\n\nOn May 21, 1925, just five years after the 19th Amendment guaranteed  women's suffrage, 400 women founded the Town & County Club as  Hartford's first private women's club. The club's first President,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…children from birth to age three, Little Hands alleviates financial  stress for families, improves early childhood outcomes, and strengthens  community support systems. In just five years, they have grown from  serving 100 children a month to reaching over 10,000 annually through  partnerships with 130 local organizations. Their work not only  addresses…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…dangerous  imports.\n\nBut I don't think a tax is the right solution for those issues. In  fact, this is breaking the U.S.-Mexico-Canada Agreement that President  Trump negotiated just 6 years ago. And if we are going to break the  very deal we have negotiated--I think, one of the most important  achievements of the first Trump administration--why would people…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…a year.\n\nBeyond the growing costs, demand is growing too. Grid Strategies, the  power sector consulting firm, predicts electricity demand will grow 32  percent by 2030, just 5 years from now. Across New Mexico and the  country, people are looking at their bills and asking how they are  going to find the money to keep their lights on.\n\nThe answer is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…impact red States, blue States, and especially the rural places across  the United States.\n\nLike many people, my family has been impacted by the opioid epidemic.  When I was just 6 years old, my mom hurt her back. She was  overprescribed opioids and became addicted like so many Americans.  Through my struggle fighting to save my mom's life, I saw how broken…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…thousand incidents since 2019. The number of fires has been  rising relentlessly, from 30 in 2019 to 44 in 2020, 104 in 2021, 219 in  2022, 268 in 2023, and 279 in 2024. In just 4 years, America's largest  city has seen an over 800 percent surge in these fires, creating an  unprecedented crisis in public safety.\n\nPoorly manufactured lithium-ion batteries…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, folks in this Chamber may know this, but  the fight for affordable healthcare is deeply personal to me.\n\nWhen I was just 9 years old, I had a very serious childhood illness.  It was a diagnosis similar to spinal meningitis--that wasn't the exact  diagnosis--but I was actually in the hospital for 3…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…This is not theoretical. Kansas tried to implement its own State- level SAVE Act in 2013, with disastrous results. The law blocked over  30,000 potential registrants in just 2 years--about 12 percent of all  voter registrations during the period. State officials acknowledged in  court that over 99 percent of affected voters were U.S. citizens.\n\nNow,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…It was Russia's invasion that shattered Ukraine's peace, beginning  with the invasion and annexation of Crimea in 2014 and through the  full-scale invasion that began just over 3 years ago. Russian forces  are committing horrific and documented war crimes against Ukrainian  soldiers and innocent civilians. Senator Cassidy called it out for what  it…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688193/rapid-response-subgroup"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…this is going to  add $7 trillion to our national debt. It will blow up our deficit. In  fact, Donald Trump is responsible for roughly 40 percent of the  national debt just in the 4 years in which he was in office.\n\nHe oversaw, of course, the worst jobs record of any President since  Herbert Hoover.\n\nThat is right. He oversaw the worst jobs growth of…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…saints caring for them.\n\nA wife called worried her husband going through chemo for cancer  treatment would lose his Medicaid because of the cuts that are being  proposed here just 3 years before he becomes Medicare eligible.\n\nIf families are denied access to Medicaid without the finances to  cover care, what will happen to them? If your family is lucky and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…for everyone. That is what they are setting up if  we take wind and solar out of the mix, forcing families, on average, to  pay $150 more per month on their energy bills just in 5 years, and $260  per month more each month in 10 years because there won't be the  competition, and there won't be the supply.\n\nAnd the less the supply is the higher the price…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…opposite,  largely benefiting the highest income earners in our country, and in  the process increased the Federal debt by trillions--trillions--of  dollars. In fact, in just 3 years, these tax laws caused our country to  double the amount of debt that it had accumulated since our Nation was  founded, putting us on a worse financial footing when we later…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…10 percent because  one of their provinces--just one--took out the Reagan ad.\n\nWho would make a deal with a person who acts like this, who ignores a  deal that was made just a few years ago and who constantly threatens to  annex their country?\n\nThat is what Donald Trump has done with Canada.\n\nThese tariffs are doing nothing to help Americans. They are…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…childcare providers and create critically needed seats.\n\nThe Growing Opportunities for Family Child Care program has opened  nearly 300 daycares, or 2,000 childcare slots, in just 3 years by  providing training, coaching, and resources to individuals who happen  to be almost entirely women-based businesses in opening and operating  family care childcare businesses.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…July of 2023, another Lyft driver, who previously served as an  interpreter for the U.S. military in Afghanistan, was fatally shot  while driving. The teen responsible was just 14 years old. They were  sentenced to only 3 years of secure detention. Old enough to commit  horrific and senseless murder, yet he will be back on the streets in  just 3 years.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…not only imperative to our  district but to the Nation for so many different reasons.\n\nI think the chart behind me is really telling the story about America  today. Just a few short years ago, we ceded space dominance to other  nations. We actually had to get a ride to space from, of all people,  our former adversary, Russia. Here we are today, as you…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…the Jewish people in concentration camps, gas chambers, and they tried  to extinguish an entire race of people--our Jewish brothers and  sisters--killing 6 million.\n\nJust a few years ago, the Jewish people got back to the numbers  before the war. Eighty years later, we are having a discussion about  what should we do, as civilized people, regarding…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…resident in 1994 after marrying his  wife, Dianne, in 1994. Born in 1929 into a naval family, Captain Brady  committed to attend the Naval Academy and become a pilot at just 8  years old. He fulfilled that vow after graduating from Annapolis in  1951 and earned his wings in Pensacola 2 years later.\n\nHe flew combat missions in Korea, survived nuclear…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…survive  this thing.\n\nUnder this House majority and administration, it is just no longer  the American way. We promised the American people energy dominance. We  had that just 6 years ago. Can you imagine? We were energy dominant. We  set the price of a barrel of oil just 6 years ago.\n\nWhat happened?\n\nThe bill before us today is a necessary, much-needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…already true now then it will be true  in a very short time, that every child in America now has the ability  to get a richer and more immersive education than any child did just a  few years ago.\n\nI was part of an organization when I was a teacher that was aimed at  closing achievement gaps in America. The different opportunities that  are afforded to young…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Joan's journey  into volunteering began later in life. At nearly 79 years old, instead  of slowing down, she stepped up when she heard Gulfside needed  volunteers. In just three years, she has donated more than 3,650 hours  of her time to Gulfside Hospice.\n\nInspired by her mother, a longtime hospice volunteer, Joan has always  felt a deep connection…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…estimated regulatory compliance cost for businesses in the United  States is about $3 trillion per year. As has been mentioned, about $1.8  trillion of that was added in just the 4 years of the prior  administration. To put that in context, the entire Federal budget is  about $7 trillion per year.\n\nDo you know what the difference is between a tax and a…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the American people.\n\nThat is a program that is riddled--riddled--with fraud. That is what  they want, these COVID bonus programs put forth by Joe Biden. They want  to just--3 more years, more direct checks to insurance companies,  taxpayer money with no accountability.\n\nSo how bad are these programs? Well, let's just take a look at the  headlines.\n\nMonday's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…income distribution with lower-wage workers experiencing 50  percent higher wage growth than high-income workers. Higher wages led  to a rapid growth in household income. Just 2 years after enactment of  the tax cuts, real median household income rose by over $5,000.\n\nIn total, the Tax Cuts and Jobs Act's pro-growth policies helped  contribute to 3 percent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…against persons who aided and abetted the Nazi's Holocaust?\n\nIf not, then why would they oppose extending the same sanctions to  the Nazi's would-be, modern-day successors who just 2 years ago  slaughtered more than 1,200 innocent civilians, including children,  infants, and the elderly because they were Jewish?\n\nMr. McCLINTOCK. First of all, I am not familiar…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…is consistently high crime rates and a staffing shortfall of about 800  officers that puts both police and residents at risk. I mean, I don't  know if people forget, just under 2 years ago, one of our own  colleagues was mugged at gunpoint several blocks from the Capitol. That  might not have happened if we weren't understaffed by about 800  officers…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692303/protecting-our-nations-capital-emergency-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Fred Smith, Memphis acquired the NBA's Grizzlies in 2001  when he committed to purchasing the naming rights for the future home  of the basketball team, the FedExForum.\n\nJust 2 years ago, when The University of Memphis was ambitiously  pursuing stadium upgrades for the football team, Fred Smith and his  family committed $50 million to help the school…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…listen to what Putin says  but also watch what he does as he attempts to stall peace negotiations  while attempting to achieve his larger aims.\n\nPutin's invasion of Ukraine just over 3 years ago is an obvious  violation of another international agreement that Russia was a party  to--the 1994 Budapest Memorandum. Under this agreement, Ukraine  willingly gave…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]