[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…are a whole array of challenges that you can make in court, but  we wanted something more than that. We wanted to have a political  intervention narrowed just to rules, just to that short time period  window that the Congressional Review Act provides. That was the idea.  And the two concerns were what we described in our argument to the  Parliamentarian…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…ramifications for millions of our fellow Americans and indeed for our  country for decades to come.\n\nThere may not be a lot of people able to watch at 4:05 in the  morning, but in just a few short hours, some of them on Medicaid will  be waking up and turning on the news to find out if what we did here  tonight means they are about to lose it. Some of the people…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I rise to express my support for H.R. 970, the Fairness  for Servicemembers and their Families Act of 2025.\n\nMr. Speaker, just a few short years ago we increased the maximum  coverage amount under the Servicemembers' Group Life Insurance (SGLI)  program and the Veterans' Group Life Insurance (VGLI) program…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689628/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Now, I don't blame my Republican colleagues for wanting to shroud  what they have set out to do tonight in secrecy. I don't blame them for  trying to hide it. It was just a few short weeks ago the Republican  leader assured this body that he would never do any such thing, but  that was then.\n\nBut hide or not, the blame will lay squarely on my Republican…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, in just 1 short year, our constituents have  already begun to suffer the consequences of the Trump administration's  agenda to undo lifesaving environmental protections.\n\nThe latest rollback…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699294/consequences-of-delaying-coal-ash-cleanup"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, after just four short years since  I proudly cast my vote to establish Juneteenth as a federal holiday  through the Juneteenth National Independence Day Act, the very history  that this day…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…and technological  innovation for which Israel is renowned, I see a story that has played  out in Virginia and elsewhere. Virginia's technology economy has  blossomed in just a few short decades, largely due to its first-rate  higher education sector, careful attention to cultivating a strong  workforce, and the efforts of organizations like NVTC and people…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Court will back the unitary Executive, strengthen  the Executive powers of this country.\n\nI just shook my head. I am like, that can't possibly happen. But what  happened just a short time ago? A piece of this went to the Court and  in their shadow docket. The question was, Could the administration  slow-walk funding to the last 45 days of the fiscal…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…award-winning scientists,  titans of business, educators, doctors, and artists. Our community has  nurtured leaders in all walks of life, turning adversity into  opportunity in just five short decades.\n\nMany of these people are children of refugees or refugees themselves,  and they represent just a few of the countless contributions that  Vietnamese Americans…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…heartbreaking stories of what happens when they come home, often  looking healthy, only to be blindsided by a late-stage cancer diagnosis  and a bleak outlook.\n\nIn fact, just a few short days ago, at a roundtable I hosted, we  heard directly from veterans, caregivers, and survivors about the  profound toll that this takes. We are talking about individuals…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…thanks to the Biden  administration's continued war on coal, his job and his livelihood was  on the line, as the mine he worked in was set to run out of coal  reserves in just a few short years.\n\nThanks to the Biden administration's resource management plan that  blocked new coal leasing, the mine wouldn't be able to access  additional reserves and would…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…perhaps they should reconsider given their own record  when it comes to tolling day counts.\n\nThey want to claim that Republicans are stopping time, but perhaps  they forget just a few short years ago, in the Democrat-controlled  117th Congress, their own House rules package, H. Res. 8, conveniently  stopped time for both legislative and calendar days regarding…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…organized  inventory, communicated with other volunteers, and showed up each day  with a smile, ready and willing to help however needed. In preparation  for Hurricane Milton, just a few short weeks later, Donna helped the  organization pack up thousands of relief and recovery items onto a 40  foot trailer. She and her husband patiently waited on stand-by for…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…from the other Chamber.\n\nMr. Speaker, House Republicans remain on a positive, forward moving  trajectory in delivering upon the American people's mandate from  November. Just a few short weeks ago, we passed the One Big Beautiful  Bill Act.\n\nThis week, we are taking up a nearly $10-billion rescissions package,  and soon we will be moving into the appropriations…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senators should never oppose nominations, but it does mean the  nominations should not be held up for purely partisan reasons. Or, in  the words of the Democrat leader, just a few short years ago:\n\nThat doesn't mean we don't disagree. But it does mean, when       nominees are held up, opposed, or blocked--it's for a       legitimate purpose, not for leverage…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…country get invaded by at least 10  million people that came across our country's borders with the direct  will of the President to do it. President Trump has proven in just less  than 2 short months the ability for a President to roll this all back  with executive orders. Yet, the cost to New York alone was $7 billion  in costs on New York taxpayers. Where…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Well,  that is a promise that he has kept.\n\nWhat we are seeing is the most comprehensive audit of Federal  spending of money in history. This administration already, in just  these short weeks, has identified $55 billion of savings.\n\nPresident Trump promised to secure the border. Well, he has kept that  promise as well. He immediately began deporting…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…recognize and celebrate the  one-year anniversary of T1 Energy's operations in Wilmer, Texas. On  November 1, 2024, production began at its state-of-the-art facility. In  just twelve short months, the company has already created more than  1,200 good-paying Texas jobs, including 200 held by proud residents of  Texas' 6th Congressional District.\n\nBy all…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, in just a short time, our Nation will  celebrate America's 250th birthday. This is a moment to reflect on how  far we have come as a nation and the shared ideals that have carried us  through…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…go on. The task of improving  government efficiency is one that will never be finished.\n\nI believe that Elon Musk and his team at DOGE have made monumental  progress in just a few short months. Let me give you a few examples.\n\nThe Department of the Treasury started its first automated payment  verification system at the recommendation of DOGE. So far,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…is not only imperative to our  district but to the Nation for so many different reasons.\n\nI think the chart behind me is really telling the story about America  today. Just a few short years ago, we ceded space dominance to other  nations. We actually had to get a ride to space from, of all people,  our former adversary, Russia. Here we are today, as…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…on the campaign trail and is  one of the main reasons that 77 million Americans elected him as  President--promises made, promises kept.\n\nIt is hard to believe that, in just 6 short months, President Trump  has reversed 4 years of disastrous open-border failures from the  previous administration. For 4 years, President Biden and Vice  President Harris…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, as the Presiding Officer will recall, it  was 2:30 in the morning on Saturday--just a few short hours ago, it  seems like--that the Senate voted to pass a budget resolution amending  the House budget resolution, the next important step to passing  President Trump's…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…championship, and state playoffs to end up exactly where  they had been the previous year: in the PIAA Class 2A championship  match against the same opponent. Manheim Central came up just short  with a silver medal in last year's championship match against Meadville  but avenged their past loss this season. The Barons played with  determination and delivered a commanding…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}]