[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…one in this country--the  richest most powerful country in the world--should ever have to make  that kind of tradeoff.\n\nYet we see right now--we are on the cusp of it, not just 3 hours away  from a shutdown. But over the course of tomorrow and the coming days,  Americans all over this country will be getting their new bills when it  comes to  healthcare.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…oaths.  Remember your legacy.'' That is what he said.\n\nIt is pride in assaulting the officers, pride in assaulting  democracy, pride in driving the Congress, thankfully for just hours,  out of this Capitol so they could not proceed in doing their  constitutional duty.\n\nThat pardon list included 600 who were charged with assaulting or  obstructing law enforcement.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…constituents have that enables us to work for full funding and support  for our military, embodied by the National Defense Authorization Act  that we will consider hopefully just within a few hours.\n\nWhen the Armed Services Committee considers the National Defense  Authorization Act, the votes at the end are almost always near  unanimous. In fact, in my 15 years…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and every mother's worst  nightmare. For now, the shooter remains at large, and we urge residents  in the area to listen  to guidance from local law enforcement.\n\nThen, just a few hours later, on the first night of Hanukkah, on a  popular beach in Sydney, Australia, two terrorists opened fire on  Jewish Australians who gathered in celebration. At least…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Mr. President, we are just a few hours away from the start  of a government shutdown that could have been prevented by Washington  Republicans just talking to us, but Donald Trump and Washington  Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, in just a few hours, the Rules Committee  will be making the final touches to America's worst budget ever. They  are doing it in the middle of the night to hide the fact that this bill  will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691426/gop-tax-scam-hurts-women-and-families"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…exhausted every other option. With no notice, no  replacement, and no plan, the Trump administration decided that these  veterans are on their own.\n\nThe decision came down just hours after the new Trump tariffs sent  our economy reeling, plunging the stock market, increasing job  insecurity, and deepening financial strain on working families,  including…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first responders and civilians to end the  gunmen's rampage.\n\nThis act of violence is a grim reminder that we cannot stop combating  anti-Semitism. This tragedy occurred just hours after Brown University,  in Providence, RI, here in the United States, experienced its own mass  shooting.\n\nIn the aftermath of these two tragedies, I am in awe of the bravery…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…fired, RIF'd, and harassed by this administration.\n\nLast week, I heard from a constituent who received a termination  letter from the Department of Health and Human Services just hours  before it went into effect with no access to their equipment, no  offboarding information, and no details about their severance. This is  one of the many, many stories that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694177/demanding-answers"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Capital Gazette and killed five members of our hometown newspaper:  Gerald Fischman, Rob Hiaasen, John McNamara, Rebecca Smith, and Wendi  Winters.\n\nAmid the shock and horror, just hours after the shooting, the Capital  issued a simple statement: We are putting out a damn paper tomorrow,  and that they did.\n\nThese journalists made clear that the fourth estate…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693114/capital-gazette-shooting"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…profit from  their positions.\n\nRecent events have only made this more urgent. Last month, markets  moved sharply after the reversal of tariffs that had been threatened.  Just hours before that announcement, there were posts on social media.  I don't need to recount all of that now, and we don't know exactly who  had advance notice of that decision or…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691224/stock-trading-ban-for-members-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of MAGA  radicals want to highjack government funding to push an outlandishly  toxic bill called the SAVE Act that would disenfranchise millions of  American citizens.\n\nJust a few hours ago, Donald Trump said he wants to nationalize  elections around the country. That is what Trump said--you think he  believes in democracy? He said, ``We want to take…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699484/government-funding"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…with the budget reconciliation bill. Mr. Speaker, because  of the disarray within the Republican Conference, all of a sudden,  these bills appeared.\n\nThat is because in just over 13 hours, Mr. Speaker, the House Rules  Committee will meet starting at 1 o'clock in the morning to debate a  bill that steals from the American people so they can help out the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, it is all over the news this morning.\n\nIn just a few hours, it is expected that Donald Trump will sign an  executive order to shut down the Department of Education. I condemn  that in the strongest possible terms.\n\nThis will slash…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…followed was  a full-scale assault on reproductive healthcare: abortion,  contraception, IVF, and even access to emergency care.\n\nIn Ohio, we felt the effects immediately. Just hours after the Dobbs  decision was handed down, an extreme and deeply unpopular 6-week  abortion ban went into effect, essentially outlawing abortion before  many people even…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…half a million barrels a day of oil from Venezuela--day after  day, after day. In exchange for that oil, the Chinese Communist Party  loaned Venezuela over $100 billion. Just hours before his arrest,  Maduro was meeting in Caracas with officials of the Chinese Communist  Party. This axis of aggression is weaker now because President Trump  has taken…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…to serve his country after he completed  high school when he enlisted in the United States Marine Corps. He  reported to the 3rd Marine Division on September 11, 2001, just two  hours before the tragic attack on the World Trade Center occurred. Over  a remarkable near-decade career, Scott worked to forge strong  relationships with foreign leaders, serving…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…adjourned from our markup after 18 straight hours. We went  through the night. Other committees did that as well. The Energy and  Commerce Committee recently finished up, just a few hours ago.\n\nI want to express how proud I am of the work that went into this, the  countless amendments that the Democrats also put up to create an  opportunity to dialogue,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "John Thune", "party": "Republican", "sentence": "…consistent with this long- held national security imperative. I am grateful for the  professionalism of all of our servicemembers in carrying out this  important mission.\n\nJust a few hours ago, Iran launched an attack against our  servicemembers in Qatar and Iraq. President Trump has been clear that  he is not afraid to hold Iran accountable for any retaliation,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692769/iran"}]