[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…back  from lending not to violate ECOA.\n\nMr. Speaker, we have heard supporters of this bill say it is about  protecting taxpayer dollars and stopping fraud, but the facts just  don't back that up. There is no evidence that undocumented immigrants  are getting loans they are not supposed to. In the one case Republicans  like to cite, not prove, that…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…as a rule.\n\nSo it was easy for GAO to say: This ain't a rule. This is a waiver.  It is not allowed under the Congressional Review Act. Not allowed. But  the GAO is just advisory; they don't make any decisions for us.\n\nThe rules of the Senate are actually the Parliamentarian, and that is  where the going nuclear happened because we went in with the California…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…existed and why it was so important.\n\nIt was courage.\n\nJohn Bonifaz, constitutional scholar par excellence. John Bonifaz has  something that many of the constitutional scholars just don't have.  They are brilliant. They can elucidate and explain to you the  Federalist Papers in great detail. They can tell you why you shouldn't  or why you should do something,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…executive branch, has  rolled over and played dead rather than holding anybody accountable.\n\nToday, we heard another oversight hearing about something that people  in my district just don't care about: trans athletes who are fencing in  different types of competitive atmospheres. That may be something for  local sporting bodies to take up. It is not something…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Robin Hood in  reverse. It is just plain wrong. I have explained now that, in addition  to being morally bankrupt, it is also fiscally reckless.\n\nIt is irresponsible, and I just don't understand how this is the plan  that my colleagues came up with. Their constituents are going to hurt  every bit as much as mine and, statistically, with more rural areas…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…single page of every  transcript, are posted online publicly. Maybe the gentleman can't find  them. I would be happy to give him the website information.\n\nThe truth is, they just don't like what the evidence shows, so they  want to go on a fishing expedition to try to twist the truth instead of  accepting the fact of that day. The fact is this: The people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…plan, here is your new  price. And those new prices are going to be astronomical.\n\nNow, we do have a disagreement between the parties. I think there are  a lot of people who just don't like the public subsidy of healthcare  insurance premiums. I am sure the Presiding Officer has her  reservations about that kind of thing. It is about the size and the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…we possess those talents in fields  because we have suffered along the way.\n\nYou have heard the stories of our parents. You have heard the stories  of our grandparents. We just don't come tonight for a Special Order to  tell you our stories, but we want America to know that we are  suffering. We want America to know that we stand with them in this time…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…so much concern today about what this will do to the  average American people.\n\nIt is not that we don't want to revisit not raising taxes on the  American public. We also just don't want to cut away their healthcare,  their SNAP benefits, their ability to put food on the table, and the  like.\n\nMr. Chair, I am ready to close when the distinguished chair…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…cronies like Russ Vought--say that  this bill targets government fraud, waste, and abuse--something that I  have spent my entire life fighting against--we know that it is just not  true.\n\nDon't forget, they just passed a bill that is going to add $3  trillion to the deficit. They don't care about balancing the budget or  limiting waste. They want to cut services…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…where  the kids can't take care of them?\n\nSecond, given the housing shortages we face--and the tariffs will  make that worse with the wood--isn't it true that many families just  don't have room to take an elderly person, particularly one who needs  care, into their homes and that this would cause chaos to all sorts of  people who are not on Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…their better connected classmates. It is  not that their intelligence is less than the kids in the suburbs. It is  not that they wouldn't study as hard. They would. It is just that they  don't have access.\n\nThe Department of Education's National Assessment of Educational  Progress, for example, has repeatedly shown that high-performing  students had much…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we can't consider bipartisan approaches,  even if they are good ideas, is because of the urgency of this moment.\n\nAll I am saying is--this is, obviously, a fait accompli--I just don't  want my colleague to walk away thinking this is some kind of stunt.  This is my attempt to take away an argument for us to do the work on  Thursday. Clearly, it has been…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…I am reminded, Mr. Speaker, of how fast the Ways and Means Committee  and the majority moved to give tax breaks to the wealthy, but when it  comes to regular families, we just don't seem to have the time. We  could be doing that here on the floor now. This is a marvelous bill we  are passing today, but I would much rather be securing the time for  that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…get some pops and productivity.  Pops and productivity means pops in people's wages and pops in tax  collections.\n\nWe have to get all the stars aligned at the right time. I just don't  see us doing that because somehow it is not part of our lexicon. I will  do presentations. We have too many people, particularly even on my  side, who say things that aren't…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…the horrifying offices habitable  again would cost the taxpayers--and prepare, unfortunately, for a jump  scare--$370 billion. Yes, folks, that is billion with a ``b.''\n\nI just don't know what possesses Washington to hold on to decaying  properties.\n\nMeanwhile, around the country, other old haunts are returning from  beyond the grave. But there is no…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Alabama. Madam Speaker, I reserve the balance of my  time.\n\nMr. MOORE of Alabama. Madam Speaker, I yield myself the balance of my  time to close.\n\nMadam Speaker, how about we just don't mutilate our children? I think  that is a good call. This is allowing people above the age of 18 to  make those decisions.\n\nMost of us here were young people at one time…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…of this is distraction. This is  the same bill that we passed last year. In fact, 13 Democrats supported  this bill. The smoke and mirrors that is created by the minority just  don't actually exist in reality.\n\nThis is a very commonsense bill. Law enforcement officers put their  lives on the line every single day. They should be able to purchase  their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…intelligence and wealth aren't directly correlated. This  is another example of that, where people are held back from their  ability to use their expertise and their knowledge just because they  don't have a specific net worth. That is what H.R. 3394, the Fair  Investment Opportunities for Professional Experts Act seeks to clarify.\n\nMany individuals, whether through…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692774/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…over the next generation and maybe our own retirements by not  telling the truth about the math.\n\nIt doesn't have to be dystopian. There are ways to deal with this  stuff. We just don't have a lot more time.\n\nLook, we have something called the Sunset Act. We have been looking  at regulations, command and control, that are woven through the  economy, particularly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…will tell  you the main reason housing has gone up so much and hasn't come down:  because the demand for a house is greater than the supply. We don't  have enough houses; we just don't.\n\nYou are probably thinking to yourself, boy, then why doesn't somebody  build some? Well, the private sector is trying, but in many States--not  all, but in many States…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…priority.\n\nMr. Chair, I don't understand the logic that the best way to send a  message to the President that you support these programs is to vote  ``no'' on the bill. I just don't understand that logic. I hope we can  get bipartisan support. We will put the bill on the President's desk,  and I believe the President will sign the bill.\n\nMr. Chair,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…the rest of the country--I might say the unsuspecting  country--regardless of what it costs working families, what it costs  farmers, job creators, and, yes, truckers. They just don't care.\n\nThis CRA sends a clear message, Madam Speaker: Republicans stand with  the men and women who keep America running. We stand with Americans for  common sense. I couldn't…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…take  something much larger. It is just the way the Medicare part A trust  fund works.\n\nIn 6\\1/2\\ years, the Social Security trust fund is empty. No one  stole your money. We just don't have enough workers. It was a Pay-As- You-Go system. It is math. The fact of the matter is that, yes, the  money has been loaned to the Treasury. Treasury actually pays…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…matters because Republicans will go around  all the time and say: Don't worry. All tax cuts pay for themselves.\n\nLet me be very clear. Not all tax cuts pay for themselves. They just  don't.\n\nI grew up a child of the eighties. I grew up on studying supply-side  economics. I believe in leaving money in the hands of the American  people to produce wealth. I…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…voted on and is  going to be approved because there is such wide bipartisan support, but  for my Democratic colleagues to say: Nope, we want to drag this out for  weeks, I just don't think it is the right thing to do. Clearly, they  disagree, but I don't think it is the right thing to do.                  30th Anniversary of Oklahoma City Bombing\n\nMr.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Thune", "party": "Republican", "sentence": "…have been accommodated every step of the way, up to and including long  sessions yesterday and late into the night last night.\n\nMr. President, I just have to say, frankly, I just don't get it. I  don't know what more they want. I don't know why you vote against  proceeding to a bill on the floor after you voted to refer that same  bill to the floor, as…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the East Room  of the White House--I was actually there when that happened--and they  never kept any of those commitments.\n\nSo no matter what, when it comes to China, they just don't keep their  word. They don't keep their word. And yet Tom Friedman's article  focuses on President Trump's reliability?\n\nAs Joe Biden would say, ``Come on, man.''\n\nThese…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…poor country. That effort should be shown. If it is shown, the  President has made it clear that these tariffs will immediately go  away.\n\nThis isn't a tariff that is just because you don't like someone. It  is a tariff that says this behavior, this leverage, is being used for  one purpose: to get you to live up to a standard that is in your own  best…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}]