[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…public-private partnerships that channel American  innovation to solve the world's toughest challenges.\n\nMr. Speaker, foreign assistance, which has long represented just  about 1 percent of our national budget, is not charity. It is strategy.\n\nDon't take my word for it. Military leaders from both parties have  warned us for years. If we fail to lead…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the disaster because there are hundreds of rural hospitals in this  country that are right now living on the brink of disaster. If Medicaid  reimbursements drop by just 5 or 10 percent, those rural hospitals are  out of business. The same can be said of thousands of drug treatment  centers in this country, addiction treatment centers. So you are  ultimately…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…pressing public health crises in America. In 2023, over  49,000 Americans died by suicide. Of those deaths, nearly 6 out of 10  involved a firearm.\n\nFirearms also account for just 5 percent of American suicide  attempts, but unfortunately, firearms account for over 50 percent of  the deaths.\n\nThis points to a disturbing trend that those who attempt suicide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695318/recognizing-suicide-prevention-month"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…protect the air that we breathe.\n\nH.J. Res. 60 would prevent the National Park Service from regulating  motor vehicle use in the Glen Canyon National Recreation Area, where  just 6 percent of the roads had safeguards put in place to restrict the  damage that off-road vehicles had caused. This was a narrowly focused  rule to target protections in sensitive…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the Affordable Care Act for 3 years.\n\nMy district is just over 17,000 square miles. It is mostly rural with  rural hospitals hanging on by a thread. Some of them have just 15  percent commercial payer mix. Without the Affordable Care Act  subsidies, we will have more uninsured people, and these hospitals  could go under.\n\nPrior to being in Congress,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…proposed wilderness and  other sensitive landscapes.\n\nThat is 94 percent of the roads in this Park Service unit open to  motor vehicles, including off-road vehicles, and  then just 6 percent where only street-legal vehicles are allowed. That  is a very reasonable tradeoff that protects the park for future  generations.\n\nIt is also worth noting that Congress…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…allow financial institutions to invest up to  15 percent of their capital and surplus in SBICs. Small business  investing rules cap these same investments far lower at just 5 percent  of capital and surplus.\n\nThe Investing in Main Street Act of 2025 simply amends this outdated  law to align these caps by allowing banks to invest a full 15 percent  in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…military. But it wasn't       always this way. When Charity Adams-Early joined the military       in 1942, women were restricted to certain occupations and       comprised just 1 percent of the military. Not only that, but       people were discriminatory to Black Americans, restricting       their education, housing, and neighborhoods. Even the       military…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…people with disabilities in the United States. In  my home State of Kentucky, approximately 18 percent of people have a  disability. Yet, people with disabilities make up just 6 percent of our  Nation's small business owners. We have to change that.\n\nFar too often, entrepreneurs with disabilities encounter significant  barriers, both physical and intangible,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…that  Democrats' extension of the enhanced tax credit subsidies would. The  Congressional Budget Office estimates this plan will lower premiums by  11 percent compared to just 5 percent from the Democratic subsidies.  These policies will also lower healthcare costs for all Americans, not  just the roughly 7 percent enrolled in the ObamaCare marketplace.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…government supervision of nonbank payment apps like Venmo and  PayPal by expanding the CFPB's authority. But these types of apps are  already regulated, and they accounted for just 1 percent of the CFPB's  consumer complaints in 2023. Why add another layer of bureaucracy?\n\nApparently, Democrats can't help but see innovation as an opportunity  for regulation.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…It is only the Democrat  Party's 2021 enhanced version that is expiring.\n\nThe worst aspect of those, in my opinion, is the fact that a person  used to be required to pay just 2 percent of their annual income toward  health insurance premiums. The taxpayer dollars paid the insurance  company the remainder of that. A person was only required to pay 2  percent.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…going to  tax the net earnings on their investments at 21 percent, which is equal  to the corporate tax rate.\n\nWhat did the Senate do? They reduced it to 8 percent, just under 8  percent.\n\nIt is about time that we get these universities to pay the same that  corporate America pays.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693219/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you want to do?\n\nThat is the reality. Just interest this year will be 3 percent, maybe  even higher, of GDP. When you see us talk about we want to get the debt  down to just 3 percent of GDP, that just covers our interest carry.\n\nI have a couple of these other charts I sort of want to walk through.\n\nMr. Speaker, may I inquire how much time I have remaining.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…population relies on ObamaCare  marketplace plans. This Chamber should be about helping 100 percent of  Americans, and lowering the cost of healthcare and premiums, not just 7  percent.\n\nMr. Speaker, it is shameful that Democrats are only focusing on 7  percent of the population while ignoring the millions of working  families who are struggling to afford…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. Speaker, when it comes to healthcare, Republicans are focused on  lowering costs and expanding choice for all Americans. That is 347  million people, not just 7 percent of the population, which is all you  are going to hear from the other side of the aisle, and that is all you  have been hearing from the other side of the aisle.\n\nMr. Speaker,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…right. Strength is back. America is back. It has resulted now in a  cease-fire deal between Iran and Israel.\n\nThe NATO countries are increasing their defense spending, not just 2  percent but 5 percent of GDP.\n\nThe President got in charge and got a Rwanda-Congo peace deal.\n\nThe Supreme Court ended nationwide injunctions. How about that? That  conservative…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}]