[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…districts. There are poor people, there are  struggling people everywhere in every district in every state who need  Medicaid, who need Medicare, who need Social Security.\n\nI just have to say: If Republicans are so enamored with this big,  beautiful, backstabbing bill and believe it to be the manna from  heaven, then they shouldn't be afraid to go into their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…something. This is how the art  of the steal works. The President, with his tariffs,  will continue--at one point it was going to be unimaginable, but he has  reduced it. Let's just say 10 percent. There is a 10 percent tariff.\n\nThis tariff is collected at the point of entry into the United States  of goods that an importer desires to purvey in this country.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I will just say if this administration was  keeping their promises, we would actually have a President, who, when  asked if it is his responsibility to uphold the Constitution, wouldn't…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690755/congratulations-to-marely-gutierrez"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…It is going to reverse the trend  where opioid use and overdose goes down. It is going to reverse it if  we don't have these programs. That is why they are successful.\n\nTo just say we are going to reauthorize the SUPPORT for Patients and  Communities Act, which is meaningless because they are eliminating the  programs, that is not the answer. The answer…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…drive the getaway car--that we should  be voting to take away healthcare from ordinary families to pay for  these tax breaks for millionaires and billionaires.\n\nBut let me just say right now, the Democrats refuse to be accomplices  to this healthcare crime of destroying Americans' lives and their  livelihoods and their health.\n\nThe consequences are real,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…potentially over 30 years, and so we are  taking healthcare for children and then burdening them with the  consequences of this terrible decision.\n\nAnd so I rise tonight just to say that America is better than this.  This is not who we are at our core. And the data demonstrates that the  people--the people at home, ordinary folks don't want this. This…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Are we living up to that when we are saying we are going to take away  healthcare from millions of Americans in order to have greater tax  cuts?\n\nYou see, people want to just say, ``Oh, it is a government program,''  as if that is a slur, when, really, it is something that we the people,  in order to create a more perfect Union, created as a lifeline…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Ms. SLOTKIN. Mr. President, I rise today in support of Senators  Schiff and Kaine's resolution regarding war powers.\n\nThis resolution would just say very simply that if the Trump  administration wants to be at war against a terrorist organization,  they should come to Congress, notify us, and seek our approval.\n\nCurrently,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…we do have more recent examples of courts rejecting the  Trump administration's attempts to strong-arm cities and States into  acting as Federal immigration agents.\n\nLet me just say this: These policies that my Republican colleagues  are determined to attack are not the reason for the chaos that the  American people have been watching in horror unfold…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…negotiations, that  supporting Ukraine at this moment--simply saying we have your back; we  are your backstop; we are supporting you--can't help but aid their  position.\n\nBut let me just say, what is most important about this conversation  is that we will continue together on both sides of the aisle, in a  bipartisan way, to support Ukraine. It isn't about their…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…intimidate you.\n\nThey want to make you decide that although you were granted this as a  right, they want to make you afraid to exercise the right. As I  conclude, I would just say this: On Flag Day, I would encourage  Americans of all kinds, find a peaceful assembly on June 14--on Flag  Day--and attend it and show that you are a brave and patriotic…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…bad and dangerous, prove it in court. Prove it. Just  simply prove it. It shouldn't be hard. That is how this works. Everyone  in this country understands that. You can't just say: Criminals don't  get due process when due process is how you determine who is a criminal  in the first place.\n\nI mean, in the case of one person they sent to El Salvador,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…colleagues to oppose this amendment, and I  reserve the balance of my time.\n\nMr. TAKANO. Mr. Chair, may I inquire as to how much time is  remaining.\n\nMr. TAKANO. Mr. Chair, let me just say that I don't understand why-- to acknowledge and to allow a flag to be displayed in a workstation or  to be flown during Pride month in certain areas--the other side  believes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…for yielding, and I  thank him for bringing attention to this important issue.\n\nI am going to talk about the State and local tax deduction in some  detail, but first let me just say generally that what we are talking  about is so important. We have so many of our friends on the other side  of the aisle who are constantly talking about how the government…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…hostilities between the United States and another actor nation-- Iran in this case--have to either be underway or they have to be  imminent. That has to be the case. You can't just say: I want to stop a  war that no one has contemplated and nothing is happening. So you have  to demonstrate imminence. You also have to show that there is no  existing congressional…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…amazing. It is. It is  fascinating to me. I love the governmental process. I have since I was  a kid, and it is just interesting to watch how all this goes.\n\nFirst, let me just say it. I would appreciate it if my colleagues  would not put words into my mouth. The gentleman said something along  the lines of that I didn't want to do refunds. I said nothing…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…consume.\n\nI have to figure out, do I sit here and just spend my time correcting  things that are mathematically not true or not in the design of what is  actually here or just over and over say how much I like working with  Mr. Beyer  because one day he will be the chair, and I will be in his position.\n\nLet's actually walk through some basic math together.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…time that no speech should be longer than 20  minutes, and unlike the Democrat leader, I am going to honor my  colleagues' time and be a little more brief than that.\n\nI just want to say something that many of us learned when we were  children. We were taught: It takes a lot longer to build a lie than to  tell the simple truth.\n\nMy friends and colleagues,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Mr. CRAMER. Mr. President, before I pay tribute to Pastor Bjorge, I  just want to say thank you to my colleagues who supported that  resolution that you just announced that passed. It is very meaningful  to North Dakota, and I express my appreciation for…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…justice would have been done.\n\nThis bill is a good first step. We need to do it. It is the right  thing.\n\nMadam Speaker, I encourage all of my colleagues to support it. Let me  just say, I hope we don't stop here. Let's put this on the President's  desk. Let's keep going and finish the job.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the Constitution doesn't let us give our power  away. There is something called the nondelegation clause, and it says  that we are not allowed to give power away. We can't just say: Here,  Mr. President, take it.\n\nIn this particular case, it is even worse. The rule of law--IEEPA is  the acronym for it--has never been used for tariffs before and doesn't…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, let me just say that the Democrats have  just used the filibuster for the fourth time this year. Why? Well, in  this case, no one really knows.\n\nThis is a bipartisan issue. It is a bipartisan…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent  of tax receipts go to just the interest. If interest rates go up 1  percent, it is 45 percent of all tax receipts of the United States in 9  years would go to just interest.\n\nI will say this, and I have said it how many times behind these  microphones and people go, David, that is interesting. Please never say  that again because I don't want to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Democratic leadership, we increased funding for  local and Federal law enforcement, including the very FBI that solves  crimes in our rural and Tribal communities.\n\nWe don't just say these things. We show up for law enforcement. We  stand with the Capitol Police who defended our democracy and our lives  on January 6. We honor their courage. We mourn those…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…serious about the problem, that is what we will do. But  I will tell you what we are not going to do: We are not succumbing no  matter how long it takes--if it is one day. Let's just say my Democrat  friends come back from Munich and they feel really good about  themselves because a bunch of European elites has told them all the  things they want to hear and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…statues.\n\nWhat I saw was prayer. What I saw was people coming together in  defense of their collective belief in God and their belief in this  country, but willing to not just say we need unity for the sake of it.\n\nI am tired of that. I am tired of this nonsense where they say,  ``Come together. We must unite. We need unity.'' Unity for what? Unity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…House, with or without our friends on the other side of the  aisle, but if we can't get a vote and passage in the Senate, it doesn't  get to the President's desk.\n\nI would just say this: What I think would be interesting to see, when  we talk about--look, quite honestly, it is a travesty to me that we  should have to pass such a bill that only American…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…get IDs. It is just too  hard. That is BS. They know it is BS. The American people know it is  BS. It is exactly why 85 percent of Americans say we need to do this.\n\nLet me just say that I come from a State that is the most unique  State in the country because we have been, for years, requiring proof  of citizenship when a person registers for a State…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…going to end this colloquy and reclaim my  time.\n\nMr. MAST. I note for the record, again, ample opportunities have been  given for my colleague, who represents New York, to just say 5,000  fentanyl-related deaths in New York is an emergency. Silence, crickets,  no response, because the death of 5,000 of his constituents apparently  means nothing to him.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…felt that we  needed, a limited government that is required?\n\nMost countries built on elections wind up collapsing, and they  collapsed because people go to the polls and just say: What can my  government do for me? I will quote John Kennedy here as far as what he  felt we needed in this country. He said: ``Ask not what your country  will do for you--ask…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}]