[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…``Governor of Canada''--it has had a catastrophic impact on the  tourism Vermont has depended on from our Canadian neighbors with whom  we have enormous respect.\n\nThat is not just true for Vermont. New Hampshire, Maine, Montana are  seeing an incredible drop in tourism that is related to this tariff  battle and the rhetoric associated with it.\n\nAlso, in…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…communities  that would, hopefully, together, try to put a downward pressure on  what, up until then, had been annual spiking rates of homicides and  mass shootings.\n\nIt is just true that, in this country, you are 10 times more likely  to be shot in your school, in your neighborhood, at a movie theater  than you are in any other high-income, developed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican on the Rules Committee voted against releasing the Epstein  files, every single one.\n\nWe heard last night that all Republicans want full transparency, but  that is just not true.\n\nMr. Speaker, let me read you a quote from the top Republican in this  country, President Donald J. Trump. This is what he says about the  Epstein files: ``It has all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that Iran, even after these strikes, still has  centrifuges and still has enriched uranium and still has scientists who  know how to put those things together, then it just is not true that  the program has been obliterated. That is a program that can be  reconstituted in a relatively short amount of time because, of course,  knowledge is not able to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…should cut these moneys.\n\nRemember, cut these moneys so that my colleagues on the other side of  the aisle can give a tax cut to their billionaire, Musk-like donors.  That is just not true. Republicans can't vote for a structure that  takes $880 billion out of the healthcare safety net and claim not to  have done it. Republican Members voted to cut Medicaid,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…intent on running the United States of America. But this White House,  under the plan that they have revealed today, is going to be running  the country of Venezuela. And it is just true that when we were  involved in the quagmires in Iraq and Afghanistan, it occupied an  enormous amount of time at that White House. The amount of time that  the President…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…enforcement and public safety. While he and his enablers  claim that they are after the ``worst of the worst'' or that they are  only going after people who are criminals, that is just not true.\n\nLast month, Federal agents detained this youngster, 5-year-old Liam  Conejo Ramos, and his father from their driveway in Minneapolis, MN.\n\nIs this a criminal? Is this…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…cronies like Russ Vought--say that  this bill targets government fraud, waste, and abuse--something that I  have spent my entire life fighting against--we know that it is just not  true.\n\nDon't forget, they just passed a bill that is going to add $3  trillion to the deficit. They don't care about balancing the budget or  limiting waste. They want to cut…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…New York's Ukrainian  community in Niagara Square, designated Ukraine Freedom Square, just  outside Buffalo City Hall days after Russia's invasion.\n\nWhat I said then is just as true today: The United States of America  must always stand with Ukraine against Russian aggression.\n\nBuffalo is known as the City of Good Neighbors, and that spirit has  been…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…all while  diminishing America's competitive leadership globally, and it will make  it harder for impacted developers and utilities to secure their  financing.\n\nThat is not just true for the now-canceled projects but also for any  future opportunities that depend on the stability of things like  government permits and regulatory structure, investments,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and Japan are asking for it, the  argument is, if you don't export any natural gas, the argument some  people seem to be making is the price would go down, but that is just  not true because the producers are going to produce to world price. A  real problem in price of natural gas is getting it distributed to where  it needs to go and that is pipelines.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…are being generous with other people's money.\n\nTo counter this myth that the Democrats are trying to push, that  illegal immigration does not cost taxpayer dollars--it is just not  true. This is why I want people to look closely at what Medicaid is.\n\nAgain, every Republican that I talk to--and I go across the country  to talk about this issue--wants to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Europe. In no world was this good for the American consumers or our  allies.\n\nMr. Speaker, I would like to say that Republicans and Democrats have  similar goals, but that is just not true. We had 4 years to study this.  We had 4 years of evidence on this. Democrats want to kill  hydrocarbons, plain and simple.\n\nRepublicans are moving to lower prices, and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…my time.\n\nMr. Speaker, I have to respond about the fact that we are denying new  mothers and prospective mothers the opportunity to vote with this  legislation. That is just not true. It is going to need to be refuted  over and over again.\n\nWhat we have done is accommodate not only prospective and new mothers  but we have also accommodated other Members…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…there is a lot of noise coming from the  other side claiming that House Republicans are cutting Medicaid with  our commonsense work requirements.\n\nLet me be clear: That is just not true.\n\nYou can't cut something from someone who was never or is no longer  eligible to receive it.\n\nAccording to the nonpartisan Congressional Budget Office, of the 7.8  million…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692933/medicaid-should-serve-the-truly-needy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…folks do. But our Democratic colleagues believe that  we are all cut out of the same cloth and that we are all the same when  it comes to a need for healthcare, and it is just not true.\n\nThis legislation that has been proposed is not by the Democrats, who  want more of the same--a broken system. The alternative that Senator  Crapo and Senator Cassidy…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…and I reserve  the balance of my time.\n\nMr. Speaker, I have said this again and again. The rhetoric from our  Democratic colleagues on the One Big Beautiful Bill Act is just not  true.\n\nIn fact, we are preserving benefits for those who need it most by  preventing people who are illegal and ineligible from accessing  Medicaid. We are also ensuring that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…requests for this legislation.\n\nMr. Speaker, I remind Members, again, that a lot of the accusations  that this will create other avenues for individuals to get firearms is  just not true. To be classified as a less-than-lethal device under this  bill, the device may not accept firearm ammunition. I don't know how  much clearer that can be.\n\nThere are no…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}]