[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…of  this disease. In 2021, I lost my dear mother, Nancy Gardner Sewell, to  pancreatic cancer.\n\nBy the time we caught it, the cancer had already spread. She passed  away just 8 weeks after her diagnosis. In an effort to turn my pain  into purpose, I have committed myself to doing everything I can to  prevent other families from enduring such a painful…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Ready-to-use therapeutic food is a nutrient-rich  peanut paste that delivers the fat, protein, and vitamins that starving  children need to survive. It can save a child's life in just 8 weeks.\n\nThe Edesia factory in Rhode Island has helped save 25 million lives  with this food, but that work is now in jeopardy because the  administration hasn't followed through…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…American servicemembers in the  vicinity? Why fly three B-52s from the United States to the region? Why  have B-1 supersonic bombers flown off the coast of Venezuela in just  the last few weeks for a so-called ``bomber attack demonstration''?\n\nThat is not my definition of the mission. That is what the Pentagon  called it. Bomber attack demonstrations for…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…responsible for implementing these programs. They have  fired experts, erased offices, and rescinded over a billion dollars  already allocated to State and local response. Just 2 weeks ago, they  passed the largest Medicaid cut in history out of this Chamber despite  the fact that Medicaid covers 40 percent of Americans addicted to  opioids.\n\nThis wasn't…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Jordan air bases have been particularly important for the  U.S. to conduct intelligence, surveillance, and target acquisition and  reconnaissance missions in Syria and Iraq.\n\nJust 2 weeks ago, our U.S. Central Commander traveled to Jordan,  where he met with the chairman of the Jordan Joint Chiefs of Staff and  key staff. They discussed the evolving security…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…careless, cowardly rollback  of hard-won protections carried out under false pretenses and driven by  an agenda that wants to take us back to 1964.\n\nIf that weren't enough, just weeks after the Trump administration  announced its plans to eliminate the Office of Federal Contract  Compliance Programs, the agency charged with enforcing  antidiscrimination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…going to be devastating to those  families.\n\nThe very fact that President Trump and the Republicans are only just  allowing a vote on continuing these critical tax credits just 2 weeks  before all these families have to make their decision--it is only 2  weeks to go, and then they have to send the check in to get the  coverage for January 1. So the Republicans…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…concerningly, we are starting to see the compounding effects of  the attacks on legal immigrants here, people here on student visas.\n\nMr. Speaker, you may recall that just a few weeks back, the Trump  administration announced that they would be rounding up a whole posse  of students who had minor run-ins with the law. In the University of  California…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Mr. LANDSMAN. Madam Speaker, I rise today on behalf of the girls and  women in my district who just lost access to their healthcare because  of this budget bill.\n\nJust weeks after this bill passed, two Planned Parenthood clinics in  southwest Ohio are closing. These are clinics thousands of girls and  women rely on for things like cancer screenings…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694049/planned-parenthood"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…DUCKWORTH. Mr. President, I call up my amendment No. 1274 and ask  that it be reported by number.\n\nMs. DUCKWORTH. Mr. President, what Trump and Musk have done to our  veterans in just 8 weeks since Trump has been back in office amounts to  a total betrayal. He has already fired more veterans than any other  President in modern history--6,000 and counting--for…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688892/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…poll has shown upwards of 90 percent of the  American people supporting a ban on Members trading stocks.\n\nThis is an issue that has been around for a while. Yet, in just the  last few weeks, we have achieved significant momentum. In the last 3  weeks, Minority Leader Hakeem Jeffries, the Democratic leader in the  House; President Trump; and today, the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today with my newborn, Sam, who is  just 4 weeks old.\n\nUnfortunately, I wasn't given the opportunity to vote remotely after  giving birth. Nevertheless, I wasn't going to let that stop me from  being here to represent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688112/disastrous-republican-budget"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Energy Secretary, if he is thinking about ignoring these commitments to  science or the Tri-Party Agreement, he needs to rethink that.\n\nThis couldn't come at a worse time. In just 6 weeks, for the first  time, the removal and treatment of radioactive waste that has been  stored in these tanks and in the ground for 80 years will begin to be  processed. This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…We have  seen them assault citizens. We have seen them assault elected  officials, including Members of Congress and my colleague from  California, Senator Alex Padilla. Just 2 weeks ago, he was assaulted,  tackled, handcuffed, and shoved to the ground for asking a question at  a press conference.\n\nThe idea that ICE is making our communities safer is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…State. What he failed to mention in his quest to  improve reliability of the grid is that several projects in his own  district were eliminated by the Trump administration just 5 weeks ago.  My colleague from Colorado, like virtually every single Member of the  Republican Conference, did nothing to stop it, nothing.\n\nBy the way, we are not talking about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…both of his  parents in the accident. In the wake of this tragedy, Maxim used his  love of skating to overcome this immense loss and now heads to the 2026  Olympic Games, just weeks away, to achieve his lifelong dream that he  shared with his parents. We will all be cheering him on.\n\nA year later, the memory of this night--the deadliest aviation  incident…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…families who have recently been subjected to violence and intimidation,  often fanned by the extremist rhetoric of elected officials who ought  to know better.\n\nIn fact, just 2 weeks ago, while ICE was serving a court-ordered  warrant in Carpinteria, a sitting Member of this House doxed an ICE  agent to a violent mob. That mob then took off after the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…took on in the last few years  because of the enhanced premium tax credit subsidies that were added in  2021. Those temporary tax gifts to insurance companies expire in just a  few weeks.\n\nNow, he knew that they would expire. As he told me in our  conversation we had this week, he said he knew they were temporary, but  now he is trying to figure out what…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…they had their electric buses, but they didn't tell  everybody they had to spend more money to add diesel-generated heaters  to those buses.\n\nMadam Speaker, in this town just 2 weeks ago, I spoke at an event,  and I condemned child slave labor in Congo. As I was walking out, a  gentleman from one of those mines said he disagreed with me.\n\nI said: What…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…have civilians been killed in Gaza? Because they  hide weapons in hospitals, in schools, in homes.\n\nHamas is the enemy, not our greatest ally, which is Israel. I was  just there 2 weeks ago. Two weeks ago, I was there. There is almost no  Israeli that hasn't seen a mom, a dad, a son, a grandson, granddaughter  that hasn't been either injured or killed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690859/gaza"}, {"senator": "John Thune", "party": "Republican", "sentence": "…were the supply chain disruptions;  natural disasters and drought; and things like bird flu, African swine  fever, and the New World screwworm that threaten livestock.\n\nJust 2 weeks ago, Republicans passed a reconciliation bill that  addresses many of the challenges head-on by bolstering programs that  farmers and  ranchers depend on. But as I said…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…moved forward,  and as this graph shows behind me, we are once again space-dominant. It  is again the great American comeback, and we are moving beyond it  today.\n\nIn just a few weeks, we will see the SpaceX Dragon making sure that  our men and women on the space station are returned back to Earth. More  and more companies are developing space technologies…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…is in the heart of the 12th District of Georgia in Bulloch County,  home to Georgia Southern University in Statesboro, Georgia, the largest  university in my district.\n\nJust a few weeks ago, I had the pleasure of visiting a family-owned  barbecue restaurant named Dolan's Bar-B-Q where I met the owner, Mary  Beth, and had a great conversation about her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694787/promises-made-promises-kept"}, {"senator": "John Thune", "party": "Republican", "sentence": "…be at a  time to be determined by the majority leader, in consultation with the  Democratic Leader, during Thursday's session of the Senate.\n\nMr. THUNE. Mr. President, just over 2 weeks ago, the Senate passed  the HALT Fentanyl Act with bipartisan support. As I said at the time,  this bill joins other efforts to combat the fentanyl crisis that is  taking…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…clock.\n\nThis is not a political statement. It is simply a matter of physics.  We don't need to imagine the consequences of retiring these baseload  energy resources. Spain, just a few weeks ago, experienced nationwide  blackouts, and their economy came to a grinding halt.\n\nSpain relied on wind and solar for 80 percent of its power, which is  ultimately what…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…clearly not what the delegation wanted. It is not what  most Alaskans wanted. And, as I explained when discussing the  administrative withdrawals in the Central Yukon plan just a few weeks  back, it violates multiple Alaska-specific statutes.\n\nI should add that this was just one plank in the Biden  administration's plan to shut down development in our petroleum…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Centers for  Medicare and Medicaid Services identified 2.8 million duplicate  enrollments across Medicaid and ObamaCare, which wastes an estimated  $14 billion annually.\n\nJust a few weeks ago, the Government Accountability Office released a  report highlighting likely significant fraud in the ObamaCare  Marketplace due to lack of proper verification. In…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…enforcement officials who recently carried out Operation  Midway Blitz.\n\nThis enforcement action led to the arrest of 223 illegal aliens, 146  of whom were truckdrivers. And just a few weeks ago, ICE announced the  arrest of a man from Uzbekistan with a Pennsylvania CDL who was allowed  in our country by the Biden administration even though he was wanted by…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…place. They  refurbished it, transforming it into the Fairbanks Jewish Center. The  original congregation stayed on rent-free until they found a new home,  a new church. Just a few weeks ago, five rabbis gathered in Fairbanks  for the first time in over 120 years and hosted this new synagogue, the  northernmost synagogue, I believe, in America, in Fairbanks.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…southern border.\n\nI want to remind people of how much the illegal drugs and human  trafficking have stopped on our southern border.\n\nI remind people of that because it was just a few weeks ago that  President Trump stood in this Chamber. He addressed the joint session  of Congress, and he said something that I think was the most important  thing he said…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}]