[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…our  country, and particularly to our children, to go nuclear on something  as significant as this and to do the bidding of the fossil fuel  industry is outrageous.\n\nAnd we just heard in response to my inquiry just now that the  Parliamentarian affirmed this, that these California waivers are not-- not--eligible for the expedited procedures that the CRA…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691448/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Mr. Speaker, we just heard all day from Republicans on the  other side of the aisle that the Tax Cuts and Jobs Act is going to lead  to helping small businesses and reducing the deficit. Yet, what…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…bill, and I am prepared to close.\n\nMr. Speaker, it is always a good thing when we have a Lucas bill, and  particularly when it is a bipartisan bill, and usually it is. You just  heard his remarks in this debate. He has really nailed this one.\n\nH.R. 1325 remains an important and necessary piece of legislation  that I am proud to support and urge my colleagues…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…605; that the  resolution be agreed to, the preamble be agreed to, and the motions to  reconsider be considered made and laid upon the table.\n\nMr. MARKEY. The objection we just heard to my resolution proves  exactly why this resolution that we should be debating is absolutely  necessary in order to ensure that President Trump does not, in fact,  nationalize--or…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…strong support  for S. 284, the Congressional Award Program Reauthorization Act.\n\nMr. Speaker, I am proud to co-lead it with my colleague,  Representative Hudson, whom you just heard from, and also Congressmen    Mike Levin and   John Rutherford.\n\nThis bill will reauthorize the Congressional Award program, which has  been responsible for printing and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Klobuchar for their strong  leadership on this.\n\nAs we speak, the internet is awash with real and fake nonconsensual  intimate imagery. Mr. Speaker, the consequences, as you just heard, are  devastating for every victim, their family, and their community. It  happens to men and boys, to women and girls. Most often, it happens to  women and girls.\n\nAs AI…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…resolution are waived.\n\nThat is part of expediting the process; part of the deal with it  being a very narrow process for only regulations and only in a short  time window.\n\nWe just heard the person sitting in that chair before this Presiding  Officer say that under the rule just created we are now going forward.  We just created a new rule through this parliamentary…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…way of knowing whether it will extend  beyond the end of the year, those subsidies that are so essential to  their affording healthcare.\n\nAnd our Republican colleagues--we just heard the Senator from Kansas  say there is no hurry. Well, Americans can't get sick on Donald Trump's  timetable. When people are told there is no hurry, if you get sick, for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…time, the bill being brought to the floor this  week would disenfranchise eligible citizens by imposing onerous  requirements that many could not meet.\n\nFor example, as you just heard, married women who have changed their  last names could not use their birth certificates with their maiden  names as proof of citizenship. Neither could those born to military…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…worth more than $5 billion.\n\nUnfortunately, there are many threats jeopardizing the future of the  Great Lakes and the region's way of life, including, as my colleagues  just heard described, the highly invasive sea lamprey, one of the most  disgusting things I have ever witnessed in my life.\n\nThe USGS Great Lakes Science Center is located in my district.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…leader in higher education.\n\nBeyond the classroom, she became a publisher and, later, owner of The  Grand Rapids Times, ensuring that the stories of Black residents were  not just heard but celebrated. She also cofounded the GIANT Awards, an  annual ceremony recognizing Black excellence in our community.\n\nHer contributions continue to inspire. While the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Commonwealth that we are,  the success that we are, without the growth of our immigrant  populations.\n\nI want to conclude by just saying, in being here for 13 years, I just  have heard too few words on this floor that talk about the  contributions that immigrants have made to this country during our  entire history. Immigration is the transfusion into…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…this body that the United States  must be a leader in the development and deployment of cutting-edge  technologies.\n\nMr. Speaker, I thank Representative Tom Kean, who we just heard from,  Representative Tim Walberg, and Representative Yvette Clarke for their  work on this legislation. They are my co-leads on this bill and are  also members of the 5G…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693508/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, it is hard to say where to start, but  perhaps I will simply augment what we just heard from my Democratic  colleagues, who gave example after example of the crazy, uncoordinated  attack on Americans that we are now seeing from the current  administration.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…be available.\n\nCertainly, in urban areas and suburban areas like mine, there is  going to be a major impact from that, and in red States and rural  districts as well.\n\nI just heard a report on the radio last week. It was talking about a  district in  a rural area where I think they said that 70 percent of their funding  comes through Medicaid in one…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker, they did. The DOGE team just announced millions of  illegals now have Social Security numbers. It is happening, and it ends  today when we vote on the SAVE Act.\n\nI have just heard my colleagues say it is already against the law. We  don't need this act, but let me tell you, Mr. Speaker, it is already  against the law for a minor to buy beer, but yet…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…about  $100 billion a year in lost payments.\n\nThe Republicans want to deal with that. How we deal with it is an  increase in funding over the next 10 years of 25 percent. We just heard  somebody say we are going to gut it. Only in Washington, D.C., would  someone say an increase in spending is a cut. That is the weirdness of  this place, but this is the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690836/increasing-medicaid-funding"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Well, first of all, Mr. Speaker, my Democratic  colleagues--maybe not all of them, but what I just heard--gave a  complete mischaracterization of the program integrity measures that  Republicans put in the big, beautiful bill. While the fraud, waste, and  abuse is on display…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699637/supporting-safety-net-services"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…position is  the $2,000 you get per child, which was the doubling of the child tax  credit in 2017, should go away and go back to the $1,000? Wow. I think  that is what I just heard.\n\nThose of us who have adopted kids, those who have children,  congratulations, your child tax credit is going to get cut in half.\n\nMr. SCHWEIKERT. Mr. Chairman, I would…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…happened? People came over and savagely--savagely--murdered  children, raped women, took hundreds of hostages, killed more Jews than  at any time since the Holocaust.\n\nWhat you just heard for the last 15 minutes could be summarized as  the absolute propaganda of Hamas. Let me just be clear. This war was  started by Hamas. It could end today by Hamas if they…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690859/gaza"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…history.\n\nMadam Speaker, I yield to the gentleman from Georgia  (Mr. Carter).\n\nMadam Speaker, I yield to the gentleman from Utah (Mr.  Kennedy).\n\nMadam Speaker, you have just heard a number of stories  from House Republicans about how the One Big Beautiful Bill Act will  benefit their constituents, but you don't have to take our word for it.  These…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…In addition, H.R. 2965 requires the SBA Office of Advocacy to report  to Congress on the total cost of all Federal regulations impacting  small businesses. Unlike what we just heard from the other side of the  aisle, to be clear, this bill does not prevent agencies from issuing  new regulations, but rather, it requires them to eliminate those that  are…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Mr. Speaker, my blood pressure is up right now. I cannot  believe what I just heard on the House floor, the ranking member of  this distinguished committee denouncing Trump but will not denounce  socialism on the House floor of the U.S. House of Representatives.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697153/denouncing-the-horrors-of-socialism"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, we just heard the gentleman  from Texas (Mr. Green) speak passionately on a number of topics.\n\nIt is his prerogative as an elected Member of Congress to speak from  this floor on any topic…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Speaker, you just heard right here on the  floor that those mean Republicans are cutting Medicaid.\n\nLet's set the record straight. As this graph shows, the Republican  instructions don't cut Medicaid,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690515/republicans-are-protecting-and-preserving-medicaid-for-the-truly-needy"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, tonight President Trump will take the  podium, and he will have a joint address to Congress, and, clearly, to  the Nation.\n\nI just heard the minority leader of the Senate come to the floor and  talk about President Trump's promises. Well, let me talk about those  promises--promises made, promises kept by President…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Federal law enforcement.\n\nThe Democratic mayor of Los Angeles said that for the riots to stop,  the Federal Government had to stop enforcing Federal immigration law.  You just heard the same sentiment expressed on this floor a few minutes  ago.\n\nThe Democratic Newsom administration has paid millions of taxpayer  dollars to one of the principal organizers…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…upon by our northern neighbor, Canada. Even Canada acknowledges  that they have this as a national emergency.\n\nMr. Speaker, there is a lot to correct from that diatribe I just  heard. I am going to start to go through some of that.\n\nNumber one, who will pay the price? That was a question begged by my  colleague. Who will pay the price? It is a very sad…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise today to call for  Congress to act with urgency to address the alarming news that we have  just heard from Las Vegas of the discovery of yet another illegal,  dangerous biolab run by Chinese nationals.\n\nIn 2023, when the secret lab in Reedley, California, came to light,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…a lot of words, a lot of  comments, a lot of inaccurate statements, and where I come from--could  we have order?\n\nMr. Speaker, I come from the Show Me State, and what we just heard  can be defined in one word, a bunch of hogwash is what we have heard  for 8 hours on that side of the building. I will tell you, for the 8  hours--could we have order?…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}]