[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…lose momentum. The weekend is hard. Maybe we are  going to get yelled at from the left; you are going to get yelled at  from the right; and we can't withstand that so we just have got to go  through with it. It is a damn shame.\n\nMaybe this exercise builds a little muscle memory for at least  exploring how to have a bipartisan negotiation. Maybe there…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, and finally, a very good day. I just got  in from Albany in New York State. It was a very good day for Upstate  New York. This morning, I was up in Albany to make a very exciting  announcement years in the making.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…and Chrysler. We didn't  hire anyone in the auto industry. We didn't want to have conflicts. We  brought together this amazing team. It didn't matter who voted for  what, we just got the best talent in and put forward an initiative, an  industrial initiative, the likes that this Nation had never seen.\n\nYes, Mr. Speaker, it was money, the taxpayer money…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…to do something so stupid before. So they called them out  for it for the first time because nobody had ever done such a thing  before.\n\nBut because of the politics, that just got shoved through here.  Because of the power of the fossil fuel industry, that just got shoved  through here.\n\nThis is part of a campaign of the Trump administration to pretend…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…wanted to mention a  very important safety issue on aviation.\n\nBut what I need to say now is really to the State of Washington and  to our National Weather Service people. I just got off the phone from  our National Weather Service Director for the Pacific Northwest, who  was telling me about the extremely dangerous events that are now taking  place in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…away. How would you have me answer that  question?\n\nI tried. I did my best to explain the psychology of folks I work with  who fear Trump more than they fear cancer. Mostly I just got sad  because this is a guy who said I want hope; all I have is reality. What  I want for hope is medicine, and all I could give him was political  science to give him some…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690445/nih-cuts-affecting-cancer-patients"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…standards.\n\nIt simply says that commissions must consider them.\n\nThis is basically a press release. That is what this bill is. We  could have spared everyone the time and just got on with it so that we  can actually get to the substance of addressing the inflation cost  crisis that Republicans have unleashed on Coloradans and on Americans  writ large,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697884/state-planning-for-reliability-and-affordability-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Khanna to release all of the damned files, not just the ones that the  Trump's DOJ allows to be released?\n\nWhy not speak out against the cushy deal that Ghislaine Maxwell just  got from Deputy Attorney General Todd Blanche to move to a cushy prison  instead of serving her time as one of Epstein's main co-conspirators  and groomers of young girls to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…than a decade. Millions  of Americans watched their premiums more than double overnight. A  family of four making $128,000 a year--teachers, nurses, small business  owners--just got slapped with an average $14,000-increase in their  silver plan premiums.\n\nAs the senior Democrat on the Health Subcommittee of the Committee on  Energy and Commerce, I have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…any violence. We had masked officers coming  into our neighborhoods.\n\nI bet President Trump would want to know what is going on on Main  Street. One of the constituents that just got picked up I talked about  a minute ago, Narciso Barranco. He has been in the U.S. for 25 years.  He is a gardener and a father of three marines. We make movies of  people…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…months in the hospital after surviving a flash  fire, and the investigators were fired in the middle of the  investigation.\n\nI come from a family of firefighters, one of whom just got diagnosed  with Parkinson's after spending months at the World Trade Center.\n\nThe fact of the matter is, on 9/11 my Republican colleagues will fall  all over themselves to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690904/protections-for-firefighters"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…below. That is the greenhouse effect. It just gets warmer and warmer  and warmer, which is why, by the way, the Senate used to adjourn in the  beginning of May because it just got too hot in rooms like this before  air-conditioning.\n\nWell, there is no air-conditioning for the planet. You have to engage  in a preventive strategy, lower the temperature…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…inflation is rocking along at 3\\1/2\\  percent.\n\nI thought we were going to be in this Chamber talking about  affordability.\n\nBy the way, my friends on the Republican side just got shellacked in  an election, from sea to shining sea, where the word is affordability.  They got shellacked on affordability.\n\nWhat did we do this week? Congressman Norman,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…driven by the creativity of our people. The U.S. Department  of Commerce used to care about those businesses, the small, creative  new launches, like Willy's Fresh Salsa, which just got into Winn-Dixie.  That was invented by a gentleman who came from Toledo. There is also  Gertie's Premium BBQ Sauce. That is a product on our shelves created  through that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…know what is going on with  them, and I don't know what is going on with the President of the  United States of America.\n\nHe has put us in a chaotic situation. For example, I just got word  that he has changed his mind about tariffs. We were all trying to  convince this administration that they should not be raising the  tariffs on all of these countries…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Epstein, emails obtained  by a congressional subpoena--that is right, it was a congressional  subpoena--by the House Oversight Committee, not the discharge petition  that just got voted on, but this is the Oversight Committee's  congressional subpoena--has brought to light that in 2019, Delegate  Stacey Plaskett coordinated her line of questioning with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…preliminary number is  around $1.7 trillion to $1.84 trillion, making it the single-biggest  reduction bill, I believe, in modern history--actually, in history at  all.\n\nSo, I just got you $1.8 trillion. We have also introduced a talent- based immigration bill. If you want to hit the GDP growth numbers that  we keep talking about, that the left has even…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…guy who put his name on the ballot;  some bureaucrat, or the guy who ran for the office and got elected by  we the people?\n\nThat is the fundamental question. Guess what? We just got two  decisions from the United States Supreme Court who seemed to reinforce  that fundamental principle that the guy who runs and heads the  executive branch makes the decision.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689717/no-rogue-rulings-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in the First Amendment does it say that.\n\nHow does a Nation conquer evil? How does a nation conquer Nazi  Germany, Imperial Japan, the Soviet Union? Was it all because we just  got together and decided to put together a military, or was there  something bigger? Was there something more important? Was there a  collective faith in the Almighty that bound…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Another thing I want to mention here is with regard to immigration.  President Trump is trying to enforce the law. I think one of the  difficult problems he has dealt with is we just got done with a  President who did all he could to ignore our immigration laws. As a  result, we took in about 10 million people here in the last 4 years,  and that is not something…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…budget.\n\nAmerica can't be the world's sugar daddy when we can't even afford  welfare for our own citizens.\n\nMany refugees are good people--frankly, some of the best Americans  just got here--but our welcome mat should not be a welfare check.  Anyone who sponsors immigrants or refugees should be responsible for  their welfare. Charity is when you give your…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699441/consolidated-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…shows how much came in and how much we spent. We  give you a 12-month window so it fixes ups and downs. We will also give  you the fiscal year as it sits.\n\nMr. Speaker, I just got my Daily Debt text message. We are borrowing  over $71,000 every second. That is the 12-month calculation. It makes  up all the highs and lows and averages out. You have got…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…like my hero who  inspired me to get involved in politics, Ronald Reagan, did back in the  day.\n\nI said that I want to be like that guy, and it was for a lot of  reasons. I just got back from the economic forum out there in  California and saw the museum. I was reminded of what a statesman  leader he was and how he was the right person to work with Tip…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…visited one of these mines, I met a union electrician, third- generation miner, who raised his hand and stated: Please don't take our  jobs away. I am working here, and my son just got hired here.\n\nThe passion he had for the industry and these jobs was incredible. He  and now his children work in that coal mine. That gentleman told me his  family's story…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Chairman, I might sound like a little bit of a broken  record here, but, unfortunately, the broken record of $37 trillion in  debt and climbing continues as well, so we have just got to keep at it.\n\nFirst, the Great Lakes Authority has only been authorized since 2022.  It still does not have a Federal co-chair, so nobody is in charge. It  has no website,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…during my ``Alaskan of the Week'' speech and just give a snapshot of  what is happening back home.\n\nIt is still pretty cold, still have a fair amount of snow. Anchorage  just got a bunch of snow that lasted a couple of days. The 53rd  Iditarod just concluded in Nome with a stunning first-time win by  Alaskan Jessie Holmes and his 10-dog sled team.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…we have  nobody to apologize to as we are not letting people into the country.  There are four times as many people being let into the country as when  I was a child.\n\nWe just got done with President Joe Biden, and, of course, we don't  keep track of the exact numbers, but he was allowing about 8 to 10  million people into the country. In addition to…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…together a bill that says: This will work. This will make things  better.\n\nMr. Speaker, here is a philosophical thought I want everyone to think  about. The United States just got downgraded by the third major credit  rating agency. Did you know there are 18 States that have a higher  credit rating than the United States Government right now? Eighteen…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…know  we are running deficits in the trillions, and we have piled up $36  trillion in debt. I want to help our national defense because it is  still a dangerous world.\n\nI just got back from Israel last week. We know how dangerous it is.  They know how dangerous this world is.\n\nThis bill is common sense, and it is step one of a three-part process  to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]