[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…products. About one in five jobs in Oregon depends on trade,  and the trade jobs often pay better.\n\nSpeaking with small businesses and workers all over Oregon--I did it  just last week--every single one warned of damage from tariffs, and  soon.\n\nBob's Red Mill, for example, sells delicious flour and grains, mostly  made from wheat and other crops in Oregon.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…$1,569 more in 2025 due to inflation during Trump's first  year back in office.\n\nYet, after running on lower prices, Trump now calls this  affordability crisis a hoax. Just last week, he said plainly: ``I don't  want to drive housing prices down. I want to drive housing prices up. .  . .''\n\nThat tells us exactly whom he is fighting for: Wall Street…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…debt  and unsustainable fiscal trajectory. Today, I am here to continue this  discussion and remind this body of the dangers we face if we do not  change course.\n\nIn fact, just last week, the Congressional Budget Office announced  that our Federal deficit this year alone has already surpassed $2  trillion. If that holds, it will be the third largest deficit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bring  forth bills that will do nothing to meaningfully address the issue of  affordability in this country. Don't be mistaken, they have no real  plans to address it.\n\nJust last week, President Trump called the affordability crisis a con  job crafted by the Democrats. Even FOX News reported that 76 percent of  Americans view the economy negatively.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…intimidation  factor has reached a point where people are worried about literally  going to church, going to work, taking their kids to school. It is a  genuine problem.\n\nJust last week, an individual took his child to daycare, left the  motor running in his car and took the little toddler into daycare. He  came out the door and was arrested and detained…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…attacks.  Attacks on our democracy, our communities, and our environment,  rollback protections for climate and clean energy, for our air, land,  water, and wildlife.\n\nHere just 1 week after the 55th anniversary of Earth Day, my  colleagues across the aisle are putting forth a set of resolutions to  gut protections for clean air and public lands across…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690326/one-hundred-days-of-chaos-dysfunction-and-attacks"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump had any shred of honesty and self-respect and self- insight, he would look into the camera tonight and say to the American  people: I have failed you.\n\nI mean, just last week, Donald Trump seriously suggested the one way  families can lower costs is for parents to buy their kids fewer toys.  What kind of Christmas is that? Donald Trump is like…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…nearly 839,000  people a year.\n\nA study from Yale and Penn found that Federal cuts from Medicaid and  the Affordable Care Act would lead to 51,000 deaths per year. And just  last week, I released data produced by the Sheps Center at the  University of North Carolina about how substantial cuts to Medicare and  Medicaid could force 338 hospitals across…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…is lying to the American people saying  that it is not allowed.\n\nPresident Trump found $40 billion in U.S. taxpayer dollars to send to  his political allies in Argentina just last week. But when it comes to  feeding our own--our own people here in the United States of America-- he refuses to act.\n\nBack home in New Mexico, one in five people rely on SNAP.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…also sharing  alarming allegations of the widespread culture of conspiracy and  incompetence and willful ignorance of science that is now defining  R.F.K.'s leadership. Just this week, 1,000--1,000--HHS workers demanded  he resign because of how his actions are compromising the health of our  Nation.\n\nAnd it is clear R.F.K., Jr., has no intention of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to discuss an  issue that affects men of all ages, races, and socioeconomic  backgrounds: prostate cancer.\n\nJust last week, I introduced a resolution designating September as  Prostate Cancer Awareness Month. As co-chair of the bipartisan Men's  Health Caucus, this issue is close to my heart.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…accountability.\n\nHowever, we have seen attack after attack, threats on the media and  communications companies, outlets replaced in the Pentagon, an order  attacking PBS and NPR just this very week, and an attempt to throw the  AP out of the White House for daring to tell the truth.\n\nThese attacks are not just an outrage, they are an attack on our  freedom, our…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690908/a-free-press-is-vital-to-democracy"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Just last week, we saw the House pass a Senate Republican bill  without the Senate Democratic bill that it had been paired with. Both  bills are bipartisan; both even have a budget score,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698420/unanimous-consent-requests-the-calendar"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…demanded every  Federal worker justify their job. He demanded five reasons they deserve  to keep it.\n\nLet's turn that around. Here are five things the world's richest man  did just last week:\n\nOne, DOGE deleted the five biggest spending cuts it bragged about  just last week, because nearly one-half of those savings don't exist.  The receipts didn't add up.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…imagining  this is their motivation because these agents are telling people this  is what is going on.\n\nI mean, this is the story of a Hmong woman that I met in Hmong  Village just last week who, in tears, is telling me that her son has  been detained. He has been gone for days and days and days, and she  doesn't know when she is going to get him back.\n\nWhere…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the only thing we needed all along  was a President who doesn't run from common sense and isn't afraid to  enforce the law. Thankfully, President Trump is not afraid.\n\nJust last week, Secretary of Homeland Security Kristi Noem announced  that the Department of Homeland Security, DHS, will resume construction  of President Trump's border wall. Border…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…communities I represent in Austin and San  Antonio and throughout Texas--purposely to then have organizations like  the Wren Collective, which is now known through reporting just this  week from the Law Enforcement Legal Defense Fund, putting out the known  networks where they are going in and telling these DAs and prosecutors  precisely what to do, precisely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Nation in gas prices. California leads the Nation  in electricity prices. California leads the Nation in housing prices.  California leads the Nation in debt and deficits. Just this week, we  learned that for the sixth straight year, California leads the Nation  in outbound U-Haul rentals. The greatest State in the country has  become the most popular State…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698654/california-is-the-most-popular-state-to-leave"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…years to come.                    Honoring Life of Alfred ``Al'' Magnatta\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Alfred  ``Al'' Magnatta, who passed away just a week before what would have  been his 101st birthday.\n\nAt a young age, Al answered the call to serve his country during  World War II, enlisting in the U.S. Air Force. Serving…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in.\n\nThat is with regard to a committee hearing we had this week on the  First Amendment and how it affects internet platforms, but it is really  a greater topic than just that.\n\nThis week, we had a hearing in the Judiciary Committee in which we  talked about restrictions on free speech in Europe. Usually, when I  think of Europe, I think of Europe as…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…investigation into the Jeffrey  Epstein and Ghislaine Maxwell files.\n\nThe Committee has already undertaken important steps in their  investigation into Jeffrey Epstein. Just this week, the committee met  with the victims of Jeffrey Epstein. They have already issued subpoenas  to the Department of Justice related to the Epstein records.\n\nFurther, they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "John James", "party": "Republican", "sentence": "…over 121 percent,  and since ObamaCare passed, healthcare spending has exploded another  60-plus percent. Even Bernie Sanders admits that the status quo isn't  working.\n\nJust last week Kelly from St. Clair Shores called my office. Her  family of four is staring at a $40,000 bill because of a medical  emergency under the so-called Affordable Care Act.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  other side of the aisle are all too happy to have district judges rig  the rules to stop the President of the United States from being able to  defend our country.\n\nJust last week, within close proximity to my house in Dripping  Springs, Texas, 47 individuals who are affiliated with the gang Tren de  Aragua were found by ICE. Right down the road…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dump product onto the global market, driving  the price down to make the economics such that nobody would invest in  that project.\n\nFortunately, that is being addressed. Just this week, the  administration announced something called the vault, which will be a  repository for critical minerals. It will be similar to our Strategic  Petroleum Reserve. We…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Panga boats, taking them out into the Pacific and trying to  be able to come around the maritime barrier and be able to drop off  somewhere around the California coast.\n\nJust this week, we had a smuggler that was smuggling folks in a Panga  boat just on that exact route that capsized in the Pacific, and  multiple people died. Our Coast Guard went and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…an attestation if you don't have the documentation.\n\nWe want to make sure that it is easy to vote and hard to cheat. We  could look at our committee hearing that we had just this week where we  brought in the secretary of state of Wyoming, which has strong election  integrity provisions. We asked the gentleman on the record, the  secretary of state.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Republican issue; this is an American issue.  That is why I raised hell when I heard that the Islamic Academy of  Alabama was looking to build a bigger campus in Hoover, AL, just last  week. I looked at their website. They openly admit that they teach the  Quran. The Quran teaches that it is righteous to kill anyone who is not  a Muslim. Think about that.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…aisle have repeated the phrase ``budgets are about priorities'' a  lot lately.\n\nMr. Speaker, do you know what really signals someone's priorities? It  is their actions.\n\nJust last week, we witnessed a group of elected officials storm an  ICE facility, demanding sympathy for illegal aliens who are violent  gang members, rapists, and murderers.\n\nMr. Speaker,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691318/elected-officials-storm-ice-facility"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…after they have been deported. They return  illegally and harm Americans.\n\nThis bill aims to preempt the harm Americans feel by committed  illegal immigrant criminals.\n\nJust this week, there was a release from the Department of Homeland  Security. A 34-year-old gang member  from Mexico had illegally entered the country 26 times. He has received  convictions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the age of 14, after previously being caught  and removed twice before.\n\nIn January, a 24-year-old Mexican national was charged with the  murder of his girlfriend in Utah just one week after being deported for  the second time.\n\nThese are not isolated cases. They are just a few recent examples  from my home State, and there are countless more heartbreaking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}]