[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a disgrace, and it does not  serve working people. It serves the GOP's donors. It is a scam, a  handout to the rich, paid for by nickel-and-diming moms and dads who  are just trying to get by.\n\nEven Elon Musk, one of Donald Trump's top advisers, called the  Republican bill a ``disgusting abomination.'' Let me repeat that, a  disgusting abomination.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…It is  simply because he didn't like the way their leader spoke to him. He put  tariffs on Switzerland.\n\nThat is not a strategy. That is impulse. That is a person who is just  trying to say that he is the king. Mr. Speaker, guess what. That  impulse, who is going to pay the price for it? Who is going to pay the  price for that impulse? I will tell my…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Prevention. This was  something the Biden administration set up to try to better implement  the Bipartisan Safer Communities Act. This wasn't a terribly political  office. It was just trying to coordinate all the work being done across  Agencies to reduce violence in our communities. Trump would have taken  this office in a different direction, but he didn't.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…with the short time left, I say that I came to the floor  to talk about the harm being caused by the Trump administration, the  corruption in crypto, and the harm to people just trying to live their  lives.\n\nTrump's regime is going after the supports that government provides  to help Americans live in safe homes, put food on the table, and take  care of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…detained and deported who were not convicted of any  crime.\n\nThey are deporting mothers and grandmothers, children with cancer,  and employees of American companies, people just trying to make a  living. They are not only deporting people who came here illegally.  They are going after legal green card holders and asylum-seekers,  locking them up with no…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…They punish Indiana.  They punish Illinois, America's manufacturing heartland. Tariffs punish  Missouri. They punish Wisconsin.\n\nThey punish every worker on the line who is just trying to build a  better life for themselves. The families and the workers who work in  these plants do hard work. They deserve to earn a fair wage with good  working conditions…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…sources that we need from wind and solar, from batteries, all-electric  vehicles--this incredible transformation that was taking place in our  country that they are now just trying to completely and totally kill.\n\nRepublicans' ``Big Ugly Bill,'' which eliminated programs working to  lower household costs and get clean energy built, is expected to cause…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…outrageous. It was  violent. It is a scary thing to see happen in the United States of  America.\n\nAlex Padilla is a great guy. He is thoughtful. He is passionate. He  is just trying to serve his constituents in the best way he knows how  by doing the thing that is in our Constitution--freedom of speech,  article I--by exercising his constitutional rights…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…bill would cost them more than $1.25 billion statewide.\n\nIf you have to pay to vote, that is called a poll tax, plain and  simple. It is also unnecessary red tape for people just trying to cast  a ballot.\n\nThis is a bill in search of a problem. We have enough trouble getting  American citizens to vote.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…seeing  their constituents make similar choices.\n\nLet me end with this. We have the power right now to give peace of  mind to working families that they won't go bankrupt just trying to  afford health insurance. We can make their lives a little easier. We  can help them sleep a little more soundly and breathe more easily  knowing that they can afford…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bipartisan standards.\n\nIn 2024 alone, energy and water conservation standards slashed $576  off Americans' utility bills while cutting our energy and water  consumption.\n\nI am just trying to point out, Mr. Speaker, that Republican  priorities are completely out of touch with the concerns of everyday  Americans. They are out of touch with the manufacturers…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…glad we are getting somewhere in this debate. The  gentleman concedes that it is within the discretion of the  administration to decide where to target resources.\n\nI was just trying to find out where the administration is this week  because we are getting conflicting accounts of whether or not they are  still targeting farmworkers. We are getting reports…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…payments for him and his wife will rise from $670 to $2,054. He said  this: ``Between the high deductible and $25,000 in premiums, this is 40  percent of our income. I am just trying to live a life here and be able  to go to the doctor when you need to go to the doctor.''\n\nHe ought to be able to do that. In fact, every American ought to be  able to do…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…the 0.1 percent above hardworking Americans.\n\nThe Republican budget would give $4.5 trillion to CEOs and big  corporations.\n\nWho pays for the tax cuts? American families just trying to make ends  meet.\n\nThe Republican budget cuts at least $880 billion from Medicaid. It  doesn't matter whether someone is a Democrat, a Republican, an  Independent, or…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688258/american-families-will-pay-for-republican-tax-cut"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…When, in fact, this is working and this methane fee is  actually getting the oil and gas industry to correct this problem and  recycle the methane and not waste it.\n\nWe are just trying to do what makes sense from every point of view  here. The Methane Emissions Reduction Program is a win-win for  everybody, and this resolution is a lose-lose for everybody,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…been doing the audit at the Pentagon, the unionized  auditors come and want to have meetings with me. They are concerned  that we are trying to get rid of their jobs. I am just trying to  protect the American taxpayers, but the technology already exists in  the private sector. It is time we adopt it.\n\nOn healthcare, I just want to give this as an example.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…his frustration was pretty clear. He is just looking for a plan  that he can afford. He is just looking for an option. He is not asking  for something unrealistic. He is just trying to figure out what to do.  He asked me the question: How did we get here? How did this happen?\n\nWell, let me just walk through that because the interesting thing  about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…individuals. This includes service workers relying on  tips as part of their wages, workers relying on overtime, senior  citizens relying on Social Security, and even residents just trying to  write off their charitable contributions.\n\nThey are all being targeted by the D.C. Council. Specifically, the  D.C. Council is opting out of the following tax provisions…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…won't be a question that a company  has to pay and give customers the refunds for games they couldn't  watch.\n\nWhether in their utility bills, their healthcare bills, or just  trying to watch a sports game, that is putting money back in people's  pockets when pressure is so high, and that matters.\n\nIn closing, there is so much power now in the voices…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economists. Yet, you already had the MedPAC saying it is  already 25 percent more expensive than was the original model.\n\nIt gives you a sense of we are making reforms, but we are just trying  to align the incentives. We have done some things to actually help the  insurers be able to have sort of automatic enrollment, but you can  choose to opt out for a longer…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…corporate structure. You always  have to be careful when you say: Why are corporate taxes down so much?  It is now because it flows through on the individual line. I am just  trying to make that point.\n\nTake a look at this. Here is Social Security and retirement taxes.  Well, that is FICA. Actually, you were getting $1.7 trillion last year.  This year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fraudulent math. Remember  demographics but we are not allowed to tell people that because it  means we as a society have to do hard things.\n\nI have this chart here. I was just trying to make a point how  Washington finances 366 days of spending in 2024. The top 20 percent of  earners covered 201 days. For the next core tile down, the next 20  percent…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…American homeland, protect the people of the United States  of America, and he has done a damn good job.\n\nMr. MAST. The President never explained it to me. Maybe he was just  trying to make room for Maduro and his wife.\n\nLet me answer some of the questions that my colleagues put up.\n\nWhy did President Trump take Maduro? It was to protect the homeland…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…new strain put on that system, which put millions of  lives at risk. Americans depend on them to keep our skies safe.  Families who rely on SNAP and WIC, parents who are just trying to feed  their kids, were left wondering how they would make it through another  week.\n\nAt the same time, our border agents and Coast Guard members continue  to serve this…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…truth that it is going up? We are begging  for crumbs to get $1.5 trillion in reductions over 10 years. We are  going to spend $86 trillion over the next 10 years. We are just trying  to save $1.5 trillion of that massive increase for crumbs to have $50  trillion of debt at the end of that rainbow.\n\nI hope we will come together. I hope we will unite…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bill  has been introduced. Yet, if you look at the total spend over the next  10 years, it is still $14.67 trillion as the baseline spending over the  next 10 years.\n\nWe are just trying to deal with what article after article has  basically said, that this is fraud. If anyone else has their phone in  their hand and wants to look up something, look up the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…who were  hurt who were in law enforcement.\n\nIllegal immigration is not a good thing. Yes, there are a few illegal  immigrants who came to this country who are illegal but just trying to  make their way but doing it the wrong way, but there are also real bad  folks who got in.\n\nThe simple truth is--let's get back to what happened--the man, the  individual…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…playing around here, but we  go home and talk to voters. They want things. They need our help.\n\nPlease understand this is a dangerous, dangerous game we are playing.\n\nI was just trying to make the point that if we do all these things  without financing, we are basically over 150 percent of debt to the  GDP.\n\nLet's actually do something difficult. The Treasury…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just in avoidance of we don't want to tell anyone, we are  going to try to do something that should not even be that hard.\n\nRemember $86 trillion in spending, the House was just trying to do 2,  and I thought 2 was absolutely anemic. We should have covered all 4,  $4.5 trillion.\n\nOne of the hardest votes I made in my decade-plus here was standing  right…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}]