[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…Waldo Emerson, the great  Massachusetts poet, said. That is what the Republicans are now trying  to loot on behalf of their billionaire buddies, because all the money  is just going to be shuffled off to billionaires.\n\nSo this is without question just a continuation of their efforts.  They tried to stop Medicare. They tried to stop Social Security. They…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…has failed women and girls who were raped and who were  abused and of the powerful people who never were held to account.\n\nWe are not, Mr. President, as you have asked us, just going to move  on. We will continue to pursue justice to the end.\n\nLet me tell you about this investigation, about the evidence that has  come in just in the last week from documents…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…into this war with zero thought to the  consequences. We are bombing Iran. Iran is bombing us. The risk of  miscalculation is massive, and the entire Republican Party is just  going along for the ride.\n\nStephen Miller, a top administration official, is on TV talking about  Donald Trump like he is Kim Jong-un. It is creepy.\n\nThe majority says they are…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…with the gavel, are you going to help  me?\n\nMake me drop my notes.\n\nI want the party in power to say: Yeah, I am going to help you. I am  going to prioritize you. I am just not going to prioritize you in March  of 2026 before my name is on the ballot, I am going to prioritize you  right now because American companies, American students, American  innovators,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…agents to abide by those same laws and rules because they fundamentally  lost the trust of the American people. They don't have it.\n\nSo we don't trust that the President is just going to learn his  lesson, slink out of Minneapolis, and not do this to another city. So  we need prevention. We need reform. We need to separate out the DHS  budget from the…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…health care that they  need to be better and to be productive and to silence those voices in  their head.\n\nThere are those people who think they are just bums and they are just  going to take that money and go buy crack or a bottle of wine, perhaps.\n\nLet me tell you why, Mr. Speaker. Consider this for a moment: Maybe,  just maybe, the only way they have…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…repeating--``There could be some legal risks introduced and  some bad legal precedent'' when using CRAs in this manner. Yet,  apparently, my friends across the aisle are just going to do it anyway.\n\nSgamma led the Western Energy Alliance, an oil and gas industry trade  association. She has testified for the House Committee on Natural  Resources majority…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…and climate impacts  of unfettered coal mining in the region. Importantly, the current RMP  was also developed after robust Tribal consultation and public input.  Are we just going to throw that all away?\n\nMr. Speaker, I strongly oppose H.J. Res. 130, which would repeal the  current balanced RMP for BLM's Buffalo Field Office in order to prop up  the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…economy and says: Stop. Enough.\n\nThe Dow tanked on Friday, dropping 700 points. Futures opened today  down 400 points. The warning lights are everywhere. Liberation day is  just going to worsen the situation that we are seeing, not only for  people who are in the stock market, which, you know, they are big boys  and girls. They can handle themselves. It…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that is going to happen.\n\nIt is unrealistic right now to talk about any kind of additional oil  or gas coming to the United States through a Canadian pipeline. That is  just not going to happen.\n\nWhat I think is really happening here is that there is going to be an  effort, because of the way the bill reads, to double, triple, or even  10 times the amount…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…tariff on and, on top of  that, an additional 20  percent, 30 percent, 40 percent, it is not going to do anything for the  person on Main Street with the small business. It is just going to make  it almost impossible for them to import those goods that they need to  sell in their stores on every Main Street in America. That is what they  are saying to us.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…continue to evolve, is $5.3  trillion in tax breaks for the wealthy. It is clearly the No. 1  priority for Republicans. Well, to do that, to pay for that, working  families are just going to have to work harder?\n\nThese same Republicans who want to give the tax breaks to the wealthy  are also the ones supposedly concerned about our Nation's growing  deficit.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689475/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…budget also cuts $230 billion from SNAP. Every year,  SNAP helps almost 43 million Americans, including over 1 million  veterans, put food on the table.\n\nRepublicans aren't just going to leave American veterans without  healthcare or make them go hungry. They also want to take a chain saw  to VA, attacking the very people who provide care to the veterans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…we are to  behaving like adults.\n\nI don't know who it is or what the dynamic was, but about an hour  ago, everybody just said: Nah, I don't care how close we are. We are  just going to do this because we are going to start to lose Members. We  are going to start to lose momentum. The weekend is hard. Maybe we are  going to get yelled at from the left;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Knowing where to start is the issue, not  is there a place to start, but knowing where to start is the issue.\n\nI will be introducing these Articles of Impeachment, and I am just  going to go straight to one of the articles or maybe the article. I  have options. I may delete some things when I introduce. I just want to  mention this option because it is…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…with this. As Speaker, I have the ability to talk  as long as I want, but I am not going to do that tonight. We are not  going to waste any more time of the people.\n\nI am just going to say this. I think that everybody needs to remember  this one simple thing: From the very beginning of this whole ordeal, on  the Republican side, we operated in good faith.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debt instead of longer-term  debt because it turns out there is not as big an appetite. We are in  this world where in 9  budget years, it will be $10 billion a day.\n\nI am just going to run through a number of these things fairly  quickly just to sort of get to the point. National health expenditures  as a percentage of GDP, this will make sense in a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…think new numbers came out today. They are  at about 2.7 percent. That means prices are still going up. Many of  them have come down. Prices are still going up; they are just not going  up as quickly as they were going up under President Biden, thanks to  the new economic policies adopted by the Trump administration and the  Republican Congress.\n\nOne…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bill a little while ago, where we stacked on top of  stacks.\n\nWhy is it so terrifying to the army of lobbyists, the people back  home who want more money to say, hey, we are just going to look at  everything because we found occasions where we are doing an  appropriations that there was an appropriation done 3 or 4 years ago,  and the money is still sitting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…cuts, and then they give these beautiful  speeches about defending the working class.\n\nThis is coming to us. This is part of the battle. Understand those  tax hikes aren't just going on rich people. Mr. Speaker, 62 percent of  the tax-paying population actually see their taxes go up. I am going to  show some distributional charts later.\n\nAfter 2017, remember…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…which I was on the committee and was one of the people who  helped author that, but they expire at the end of this year. They want  to play this game and say that we are just going to pretend that there  is no cost, that the law is not the law, that the policy is the law.  This is when you hear people say, current policy baseline, just do it.\n\nWe have…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…judge, jury, and sentencer for  your crime in the car. The next thing is going to be that we need to  hook this thing up to the government so we can dispatch the police.\n\nI am just going to tell you what is going to happen next. They are  going to be shutting your car off when they decide whatever they decide  from wherever they decide it.\n\nI don't know what…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699282/amendment-no-1-offered-by-mr-massie"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…incredible skill. And he brought the Scriptures to life. He was a  profound teacher. He was a solid doctor.\n\nAnd I remember, of all the many lessons I learned from him--and I am  just going to wrap up with this one story. And I remember it so well  because I remember reciting it back to him in a letter one time. In one  sermon, he said: We should all live with…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…industry, drugmakers spar over requirement to print  prescription forms.\n\nMr. Speaker, to show you how absurd the world has become, there was a  simple attempt to say: We are just going to put your prescriptions on  your phone so when you get them you can see all the side effects.\n\nMr. Speaker, do you know that all that paper that is printed? We had  lobbyists…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…hopefully able to take some comfort and solace in his memory as we  share this.\n\nWe have a lot of folks who want to share a message, and we are going  to kick it right off. I am just going to go around the room and start  calling on people as we move forward.\n\nWe are going to first hear, of course, from the California  delegation.\n\nMr. MOORE of Utah. Mr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…women went  to serve their country in Vietnam. When they got drafted, they would  say: Hey, it is my time. My dad fought in World War II. My uncle fought  in Korea. I am just going.\n\nSo they all went. And what happened--every Alaska Native had the  ability to get, under a 1906 law, a Native allotment. You could go and  say: Hey, I grew up in this area.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the last couple of days double-checking it.\n\nI am going to try to do something a little insane. I am going to walk  folks through the Social Security actuary report. We are just going to  do some of the most basic parts of it so folks understand what the  reality is.\n\nNumber two, I am going to walk through actually something that really  bothers me because…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Committee, so I am blessed. I have a freaky smart  staff.\n\nIn 2032, the trust funds are empty. In 2033, the first year where  they are completely empty, if you said that we are just going to pay  for everything out of the general fund, okay, we can do that.\n\nMy estimates come in at about $638 billion in 2033 just to make up  the shortfall of the Social Security…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…truth  about those mechanics.\n\nIs it appropriate to be engaged in stacking? This is something that  was appropriated in 2015. It has sat in the account, static, but we are  just going to stack on top of it. It is not about the belief that it is  good for the country, good for the economy, and good for this. It is  the budgetary discipline of: Are we going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Madam Speaker, as a mercy to the poor staff here, I  am not going to use the whole half an hour. I am just going to try to  run through a couple of concepts.\n\nI did a little tripping up of some details last week, where we were  trying to explain some of the things we see going on in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}]