[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…agencies, sidelining career professionals, and pushing  out civil servants not for failing to do their jobs, but for doing them  too well.\n\nI will talk about the waste piece for just a moment here, too. I know  they said he is out here trying to cut waste, fraud, and abuse, but we  know that is not right because one of the first things he did was fire  the investigators…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…from Illinois has returned to the floor. If he  would like to, I would be happy to entertain a question, should he have  one.\n\nMr. MERKLEY. I am going to interrupt you for just a moment because  the protocol team is not sure whether you asked me if I would yield for  a question.\n\nMr. MERKLEY. I will yield for a question. Thank you.\n\nMr. MERKLEY. I thank…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are currently at  risk. If things continue as they are in Texas, then we are likely to  lose a third or more of these 150 Members of Congress.\n\nLet's talk about Texas for just a moment. In Texas, we have evidence  and, Mr. Speaker, I include in the Record this letter from the  Department of Justice.                                         U.S. Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…I am particularly pleased to be here with my colleague and chair of  the HELP Committee Senator Cassidy, who has been instrumental in this  fight and who will speak in just a moment.\n\nTo our first responders, know that training and equipment are coming  to help make your job easier.\n\nTo our healthcare providers, know that resources are coming to help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…want to thank John Bonifaz. John  Bonifaz. John Bonifaz. Constitutional scholar, John Bonifaz.\n\nThere are many constitutional scholars in this country. Let me harken  back just a moment to make this point perspicuously clear.\n\nThere were many people who understood what invidious discrimination  was, known as segregation but, in fact, was racism. There…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…challenge of the erratic and illegal behavior he has been  exhibiting is that it really puts companies in a very difficult spot.  Companies have to make decisions not just moment to moment, as  apparently President Trump does, but over months and sometimes years,  especially if they are going to make major decisions about something  like investing to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…including orders from the  Supreme Court of the United States of America. He is defiant. You heard  him say now in two venues--I am going to speak about them briefly in  just a moment. He said in two venues that he is not going to honor the  necessity for a person to have what we call due process. In two venues,  he said it.\n\nNow, the President didn't…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…was adjacent to the Ninth  Congressional District. We will call it, for our purposes today, the  old 18th Congressional District, and you will understand better why in  just a moment, located adjacent to the Ninth Congressional District. In  fact, if you look north and south, the 18th was at the top, and the  Ninth was under the 18th. The Ninth Congressional…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…faster mergers. We  will have fewer and fewer banks that are bigger and bigger and, indeed,  too big to manage.\n\nLet me just say: When I said how much they had been fined just a  moment ago, Citigroup, one could think how could they be fined that  much money? How can they afford it? Where do you think they got that  money from? Where do you think that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…heard televised, he was there  minding his own business when he received messages, messages that were  intended for a select group of people, many of whom I will name in just  a moment.\n\nIn receiving these messages, he was made privy to information that  should not have been exposed to the public. In the opinion of many  experts, they should not have…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…a  principle of who we are in this country. It is those values that hold  this country together.\n\nThis bill is pushing corporations to create a loophole. I want to  take just a moment, ``voluntary for good causes'' is something we all  do in America, and we have the ability to do it now. This bill would  create more gray areas and, for those who want…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''\n\nMr. Speaker, I want to lock in for just a moment on that aspirational  objective, the pursuit of happiness. When it comes to everyday  Americans, this one big, ugly bill will hurt the quality of life of  hardworking American…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Lastly, if it is good enough  for the war room, isn't it good enough for the boardroom and classroom?\n\nMr. JACKSON of Illinois. Mr. Speaker, if I could jump in on that for  just a moment.\n\nThese are voluntary programs. These are aspirational programs, as you  have shared with me. There is no DEI law. No DEI law has been passed by  the Congress. How can…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this was published: ``In our Nation's 248-year  history, there has never been an individual who is a greater threat to  our Republic than Donald Trump.''\n\nLet me pause for just a moment. I would like to highlight this  language: `` . . . an individual''--one person--``who is a greater  threat to our Republic''--an important statement--``than Donald  Trump.''…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…am bringing before the Senate an  opportunity for us to take a stand, to take a stand against the  corruption of American foreign policy.\n\nThe Senate will take a vote in just a moment to deny the President  the ability to move forward with two arms sales--one to Qatar and one  to the United Arab Emirates.\n\nI believe that this Senate should join Republicans…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Spokane Police Department, who was named officer of the quarter, and to  shine the eastern Washington spotlight on her outstanding service.\n\nThis recognition is not just about one moment or one case. It  reflects a pattern of service, compassion, and integrity that defines  Officer Torres' work every single day. She embodies the values that  make eastern…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…carry out heroic acts  each and every day, and it is our responsibility to make sure that they  have the resources that they need to carry out their missions.\n\nI will take just a moment to thank my subcommittee staff who worked  tirelessly on this legislation: John Rayfield, Reed Linsk, Lindsay  Sakal, Spencer Thompson, Nicole Bredariol, as well as Matt…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…that has changed since January of this year. We  are seeing FEMA getting the job done in a lot of ways. I will talk  about what FEMA did with some of this other money in just a moment.\n\nHere is another example of some mismanagement by the previous  administration. Remember the so-called American Rescue Plan. Democrats  passed a  bill of $1.9 trillion…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…women, to  protect teenage girls, to protect young people online from  nonconsensual intimate images.\n\nWe saw both parties come together and pass landmark legislation, and  just a moment ago, 24 hours later, we saw the same thing happen.\n\nSo I thank my colleague from Nevada for moving for this to pass by  unanimous consent. And I want everyone to reflect…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…on the Capitol  lawn this week.\n\nMy simple request for my colleagues: April 19, it is a Saturday--when  it comes, at 9:02 central time, would you just pause with us for just a  moment and remember? Join us because we will absolutely never forget.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…to  confirm Casey Mulligan, the President's nominee to be the chief counsel  of the Office of Advocacy at the Small Business Administration.\n\nI will make that motion in just a moment, but first, let me explain  why I am doing this. This week is National Small Business Week, a week  to recognize the achievements of our Nation's entrepreneurs.\n\nAs chair…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…act that would  prevent any President from imposing tariffs on a U.S. ally or a free- trade agreement partner without congressional consent.\n\nI will make that motion in just a moment, but let me, first, just  explain what this is and why I am doing it.\n\nNext week, President Trump has announced plans to impose 25-percent  tariffs on products coming into…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…President, President Trump, is restoring common  sense by eliminating DEI, CRT, and all this stuff in our agencies and  our Pentagon, even this moment of reprieve is just that, a moment of  reprieve from the march of the Marxist, tyrannical ideology that is  deeply at odds with our founding principles and who we are as a Judeo- Christian nation and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the meantime, both the Tribal  government and the local government have agreed to these restrictions,  and they are incorporated into this act.\n\nMr. Speaker, I will take just a moment to tell you about the Shingle  Springs Band of Miwok Indians because it is a remarkable tale of  resilience, determination, and triumph.\n\nThe members of this Tribe are…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…pass it  today, in regular order in the process. We are just asking one thing;  that is, consent to be able to do it.\n\nI am planning to bring that request for consent in just a moment, but  I would like to be able to yield time to my colleague Senator Schatz  from Hawaii to be able to speak on this same issue because he has also  worked very hard on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. We are down to the wire here. In just a moment, the Senate  will vote on whether or not to keep the government open.\n\nRight here--24 pages. Not partisan. Not complicated. Simple.  Straightforward. Clean. Nonpartisan.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…human  missions to the Moon and Mars, asteroid mining, and future scientific  discoveries beyond our current cognitive capabilities.\n\nEach launch of a rocket booster is not just a moment of technological  achievement; it is a step closer to answering the big questions about  our place in the universe and the potential for future generations to  reach the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…great State of Texas.\n\nNow, I would like to take a moment to recognize the Medal of Honor  recipients here in the Gallery: LTC William Swenson and COL Paris  Davis.\n\nIn just a moment, I will propound a unanimous consent request to take  up and pass H.R. 695, the House-passed version of the Medal Act that  passed  the House 424 to 0. I urge my colleagues…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…children's health and gives a boost to our Nation's dairy farmers who  work hard every day to provide safe, nutritious products.\n\nMr. Speaker, National Dairy Month is not just a moment of  recognition. It is a call to action to stand with rural America, invest  in the next generation, and ensure our food policies are rooted in  science and not bureaucracy.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "John Thune", "party": "Republican", "sentence": "…leader-- because what he is saying about a Democrat plan that will lower  healthcare costs is a fantasy. It just is. It is a fantasy. I am going  to explain to you why, in just a moment. And it is not any less a  fantasy today than it was yesterday and than it was the day before  that. It is that. It is a fantasy.\n\nNow, interestingly enough, the Democrat…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}]