[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…find him more seats in Congress.\n\nAll this for what? So Donald Trump can enrich himself and his  billionaire allies while everyday, hardworking Americans pay the bill.\n\nI just have to ask, Madam Speaker: Where are the so-called  constitutional conservatives? Will even one of my colleagues on the  other side of the aisle find the courage to stand up? Have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…worst years for job  growth in decades. In fact, if you don't count COVID, the United States  created fewer jobs last year than any year since 2009. You don't need  data. Just ask anyone who has been looking for a job. They will tell  you no one is hiring.\n\nThis weak economy is a direct result of President Trump's policies:  the crazy tariffs that are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699065/2025-economic-report-and-manufacturing-jobs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…my few minutes to step back from the  dizzying torrent of news that we have been delivered, often  contradicting sources of news from the President and his advisers, and  just ask some basic questions about the wisdom of this extraordinary  military endeavor and the administration's future plans in Venezuela.\n\nI think the basic question that people…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…mine, in rural communities and minority communities. In  Michigan, we already know that certain communities are facing a  disproportionate burden from electricity generation.\n\nJust ask the residents of southwest Detroit and the Downriver region  in Michigan. They have felt the harm and seen the harm, and they lived  the experience of being next to DTE's…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Federal Agency, and we are in a  situation where I believe Trump is prepared to weaponize that  information against the American people in so many different ways.\n\nSo I would just ask: Did you hear my distress that Trump could use  this information to attack his opponent? Could he use this information  to disrupt the elections in '26 as a path to further…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President Trump  exceeded these authorities, as clearly defined by Congress, and the  Supreme Court, by a vote of 6 to 3, told him as much. He defied basic  economic sense. Just ask any American business or consumer who suffered  under this chaotic policy.\n\nLast year, the average American family paid more than $1,700 in  tariff costs. A tariff tax, as…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…First, your impassioned remarks are so meaningful. I  hope all of America is watching. If some people are not up at this  hour, watch it tomorrow. It is inspiring.\n\nAnd I would just ask my colleague a question. I was there. I spent 4  hours with John McCain before he voted. We talked and talked and talked  and went over the courage of his father and his grandfather…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…We have to  worry about our own districts. Isn't that what people say, ``What is  happening in your district?'' Worry about your own district.\n\nMs. KAMLAGER-DOVE. I would just ask that we get back to that.\n\nI am going to have to say this Democratic intraparty fighting is not  what any of us want, and it is not what the American people deserve. I  would…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696775/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…power to subsidize dirty, expensive fossil fuel, all at the cost of  American families who are struggling to afford their electricity bills.\n\nNow, if you don't believe me, just ask Secretary Chris Wright. At an  Energy and Commerce Committee hearing in June, he was blunt. The  Secretary said: ``I have never been for all of the above, and if I said  it…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Unfortunately, the amendment was  rejected.\n\nThere are Members and former Members of this body right here in  Congress who have been arrested and convicted of a DUI, and I would  just ask that the charity and the grace that we extend for second  chances to those people would extend also to those green card holders,  including those who have been here for decades.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…absenteeism in       school-age children, which is why it is so obscene that today       Republicans want to cut funding that would address air       pollution at schools. I would just ask the American people,       like, what part of addressing air pollution at schools is       controversial? I don't think there is anything controversial       about.\n\nAnd this…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…late, unless he moves quickly and changes dramatically.\n\nThe damage goes beyond food prices. Thanks to this President,  Americans are now confronting higher utility bills. Just ask them. On  the campaign trail, the President promised to slash electricity prices  in half. ``Drill, baby, drill'' will take care of everything. It ain't  working. On average,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…and we speak truth to power in this most  unprecedented time in our Nation's history: a time when we are fighting  for civil rights and justice, a time when we are fighting just to ask  for an opportunity, for a broader talent base, something we call  diversity, equity, and inclusion.\n\nPrograms like Medicaid and Medicare, Consumer Financial Protection…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…people in Boulder,  Colorado, commemorating the victims and celebrating Jewish culture and  people. The two Senators from Colorado were there. Mr. Neguse was  there. I would just ask if the gentleman who is introducing this  resolution to commemorate, ostensibly, the victims of Boulder was in  his neighboring district to be with the victims and the community.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…completely reckless policy enacted by  Governor Gavin Newsom that does not exist in any of the other 49 States  in our country.\n\nBecause of this reckless policy, Newsom has just had to ask the  legislature for a bailout of Medicaid, $2.8 billion, which the  legislature provided. Now, of course, what I am referring to is the  policy of providing free, full-scope,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…down to rationally and responsibly  negotiate other appropriations bills that we can bring, I hope, on a  bipartisan basis to this floor to keep the government open.\n\nI would just ask my friends to reflect on that. I hope some of you  feel the weight of that decision. I know you do. I hope you can vote to  keep the government open. There is no excuse to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…89.\n\nMr. GRIFFITH. Madam Speaker, I yield myself such time as I may  consume.\n\nWe keep hearing that it is not a rule and it is not a regulation and  that kind of stuff. I just ask if it is not a rule, does that mean it  is not enforceable, and does that mean it can be repealed by the next  administration with a click of the fingers? I don't know the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…violent murderers,  rapists, robbers, gang members, drug traffickers, and human  traffickers? It couldn't be more black and white, and it is so  disappointing.\n\nMr. PERRY. I just have to ask you in this colloquy, Representative  Roy from Texas: You say, ``the radical left,'' but I listened to you  rattle off the statements of elected officials.\n\nMr. PERRY.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…redistribute it  to whomever they choose.\n\nMillions of immigrants in this country fled their homelands to come  to the United States to escape socialism and communism. Mr. Speaker,  just ask your constituents from Russia, Poland, Albania, China, Korea,  Vietnam, Venezuela, or Cuba, where my mother fled in 1959 to escape the  very things that our new socialist…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Equally, Nicole helped organize a series of ``after-hours'' Capitol  tours and joined me in leading constituents on a unique historical look  of the hallowed halls of Congress--just ask her about the Senate  chandelier.\n\nLeveraging her naturally spirited personality and proven expertise as  a Parliamentary Intern in the Houses of the Oireachtas, Ireland,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688151/recognizing-nicole-schmitt"}]