[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and we know what this bill is. This is Jim  Crow 2.0. Republicans think that when fewer Americans vote, they win.  It is as simple as that.\n\nI am so sick of the other side just making things up. This widespread  voter fraud conspiracy is all part of the same election denialism that  goes right up to the Oval Office.\n\nThe other side has been making these…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…every  single month.\n\nThe President has also broken his promise many times over to the  farmers in Illinois. His tariffs have made farming in Illinois  unprofitable--not just by making the fertilizer, seeds, machinery, and  equipment more expensive but also by wrecking export markets like China  for years to come.\n\nI have met with these farmers throughout…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…may yield to him.\n\nMr. BLUMENTHAL. Mr. President, we are going to be joined by others of  my colleagues, but I want to follow Senator Whitehouse's very eloquent  remarks by just making a couple of quick points.\n\nYou know, tonight, the President is going to speak to Members of both  the House and the Senate, and he is going to make a lot of claims, many…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, across the country, Americans'  utilities bills are going up, and this administration's actions are  just making things worse, giving out favors to the fossil fuel  industry.\n\nLast week, employees of the Department of the Interior received a  memo, and basically what the memo said…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693909/utility-bills-are-going-up"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…tariffs. And, in retaliation,  President Trump decided everyday Americans and small businesses should  pay 10 percent more on imports from Canada.\n\nIt is very clear, Trump is just making all of this up. He is making  it up as he goes along.\n\nAnd, for Massachusetts, it is very important. Every fifth grader-- when I was in the fifth grade and all fifth graders…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…family that needs it. They are very proud of the  tax breaks by the trillions that they are giving to millionaires and  billionaires in our country.\n\nBut when it comes to just making sure people in our country, this  Christmas, don't see a dramatic spike in the price of healthcare for  them and their families, they are going: Sorry, I don't have any…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…off their healthcare, and it raises costs for everybody.\n\nOur Protecting Health Care and Lowering Costs Act reverses all of  that, and we should pass it today. We aren't just making a point. We  are fighting for the retired teacher from Mount Morris who needs  Medicaid because her insurance isn't cutting it. We are standing up for  the pregnant woman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…year and  got elected to the United States House of Representatives.\n\nDid I get that right, Mr. Speaker?\n\nHe got elected to the United States House of Representatives. I am  just making sure you are paying attention, Mr. Speaker. All good things  start in the United States House of Representatives, as far as we are  concerned.\n\nThen, he went over to the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…China PNTR. We fought  against those. We knew they wouldn't work, and they didn't. Now, we  have had about 10 years where we tried to rebuild our region, and now  this just as we are making progress. It is really disgusting.\n\nWho would even think about changing tariff laws through a tweet that  the President did at 2 a.m. in the middle of the night? That…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…disagree, they can bring in experts that say  the opposite. Of course, they don't want to do that because there  aren't any experts that are going to say the opposite. They are just  making this stuff up.\n\nToday's resolution, H.J. Res. 75, targets a recently finalized energy  conservation standard for commercial refrigerators and freezers. Again,  this isn't…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…people ought to be able to hear a  fair and full exchange of views in an active debate. I think that is  far more present when we actually have a colloquy as opposed to just  making speeches.\n\nI simply say that the question I was going to pose to the chairwoman  is that she has made clear that these three bills, the bill to give  more power to the Department…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…reforming Medicaid, which Congresswoman  Ocasio-Cortez wants us to reverse, we cut out the waste and the fraud.\n\nFor example, we found out that there are--no kidding, I am not just  making this up--we found out that there are 2.8 million people on  Medicaid who are double-dipping in America. They are either signing up  for Medicaid in Louisiana and Mississippi…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…concerned with their  next job and the next Presidential campaign they may be able to get on  than making sure this President is as successful as possible.\n\nSo I decided, by just making the decision not to run for reelection,  I can speak truth to a President that, I hope, goes down in history as  the most successful Republican President in the history…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…reconciliation piece of legislation. This discussion that has been very  prominent here in the beltway is the talk of reconciliation. To put it  in plain terms, this is just making sure that, at the end of this year,  American families don't pay a significant increase in taxes.\n\nIn 2017, there was major tax reform done, and I think if you were to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Ottumwa, the number one expense  Iowans are facing is housing. The American Dream of homeownership is  starting to slip away.\n\nIn Iowa, renters spend 40 percent of their income just making sure  they have a roof over their head, and the average home buyer is now in  their mid-forties.\n\nIt doesn't have to be like this. This bipartisan legislation, led  with…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699801/housing-for-the-21st-century-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…focused on outcomes, pushing to  pass the bills where we can, however we can, whether they start with an  ``H.R.'' or an ``S,'' not caring about who gets the credit but just  making sure we are advancing some laws here.\n\n2815, Cape Fox Land Entitlement Finalization Act of 2025 and H.R.  972, Sloan Canyon Conservation and Lateral Pipeline Act.\n\nMs. MURKOWSKI.…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700283/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…government. This immense purchasing power shapes the entire labor  market.\n\nWhen we embed unnecessary degree requirements into Federal  contracting solicitations, we are not just making a hiring decision; we  are sending a signal to the entire economy that a college diploma is a  prerequisite for economic opportunity.\n\nWith less than 40 percent of Americans…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700119/skills-based-federal-contracting-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…in my State of Alaska.  They are waiting on us to deliver these small legislative priorities  that will allow them to move forward, whether it is economic  development or just making sure that there is a level of equity and  fairness.\n\nSo I thank my colleagues, I thank the Energy Committee, as well as  the floor team, and my staff who helped us move…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…you  want to continue as pregnant in this school, we are going to support  you in that.\n\nTitle IX gives all of the information. We are not going to be  redundant. We are just making sure that you also include, young lady,  if you are pregnant and you want to continue in school, we are going to  do our best to help you and provide all the resources.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}]