[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Hadiya was a bright student  involved in marching band and volleyball. She was on top of the world  when she led her marching band in President Obama's second  inauguration. Just one week later, she was shot and killed in a park  in Chicago.\n\nHadiya should have turned 28 years old yesterday. Hadiya's friends  and family started the Wear Orange movement to…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…$1,569 more in 2025 due to inflation during Trump's first  year back in office.\n\nYet, after running on lower prices, Trump now calls this  affordability crisis a hoax. Just last week, he said plainly: ``I don't  want to drive housing prices down. I want to drive housing prices up. .  . .''\n\nThat tells us exactly whom he is fighting for: Wall Street…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…security.\n\nPresident Trump has fired tens of thousands of nonpartisan Federal  employees, all because they carry out a function that the President  simply doesn't like.\n\nAnd just this week--just this week--President Trump's Department of  the Interior fired hundreds of workers who protect the health and  safety of the Great Lakes, an economic and ecological…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…electricity prices. They can't afford to pay the bill.\n\nNow, the two bills that are on the floor today, in my opinion, will  only increase the average utility bill even further. Just last week,  the U.S. Energy Information Association found that natural gas prices  will rise by 16 percent in 2026, primarily due to increased LNG exports  amid flat production growth.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…support of  nitrogen suffocation--an untested and inhumane death penalty method-- which allowed Alabama to carry out the first execution in the world by  nitrogen gas.\n\nAnd just last week, in another case that Mr. LaCour argued, Alabama  executed Anthony Boyd by nitrogen suffocation. Mr. Boyd reportedly  ``convulse[d] and heave[d] for about 15 minutes before…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…accountability.\n\nHowever, we have seen attack after attack, threats on the media and  communications companies, outlets replaced in the Pentagon, an order  attacking PBS and NPR just this very week, and an attempt to throw the  AP out of the White House for daring to tell the truth.\n\nThese attacks are not just an outrage, they are an attack on our  freedom, our…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690908/a-free-press-is-vital-to-democracy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Donald Trump had any shred of honesty and self-respect and self- insight, he would look into the camera tonight and say to the American  people: I have failed you.\n\nI mean, just last week, Donald Trump seriously suggested the one way  families can lower costs is for parents to buy their kids fewer toys.  What kind of Christmas is that? Donald Trump is like…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…nearly 839,000  people a year.\n\nA study from Yale and Penn found that Federal cuts from Medicaid and  the Affordable Care Act would lead to 51,000 deaths per year. And just  last week, I released data produced by the Sheps Center at the  University of North Carolina about how substantial cuts to Medicare and  Medicaid could force 338 hospitals across…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…is lying to the American people saying  that it is not allowed.\n\nPresident Trump found $40 billion in U.S. taxpayer dollars to send to  his political allies in Argentina just last week. But when it comes to  feeding our own--our own people here in the United States of America-- he refuses to act.\n\nBack home in New Mexico, one in five people rely on SNAP.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, do you recall just a week and a half ago  when the President of the United States stood in front of the American  people and said that he conducted an unauthorized military invasion of  Venezuela…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699066/venezuela"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to discuss an  issue that affects men of all ages, races, and socioeconomic  backgrounds: prostate cancer.\n\nJust last week, I introduced a resolution designating September as  Prostate Cancer Awareness Month. As co-chair of the bipartisan Men's  Health Caucus, this issue is close to my heart.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695816/recognizing-prostate-cancer-awareness-month"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…programs that people across this  country use to advance their education and that would blow a hole  through the United States' deficit on a scale we have never seen  before?\n\nJust a week ago, Elon Musk was tweeting ``KILL the BILL,'' and in the  days after was posting incriminating tweets not only about the  President, but about the GOP and their ability…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…talk from their parents or heard the first  attack on their faith or their culture.\n\nThis rot--this un-American activity--has been in this country a long,  long time.\n\nJust the other week, I was sitting with a group of Virginians who  happened to be Muslim Americans. One of the individuals I have known a  long time, has been a community member and well-known…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…every one of these problems, and  every one of them was rejected, which brings me to a final point: Do  you know who really benefits from crypto? Corrupt politicians do.\n\nJust last week, the United Arab Emirates sent $2 billion to convicted  money launderer Changpeng Zhao, using coins issued by Donald Trump's  family. That is $2 billion in their bank account.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…imagining  this is their motivation because these agents are telling people this  is what is going on.\n\nI mean, this is the story of a Hmong woman that I met in Hmong  Village just last week who, in tears, is telling me that her son has  been detained. He has been gone for days and days and days, and she  doesn't know when she is going to get him back.\n\nWhere…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…vote in Congress. It was slick. It was well-shaped--except it was  dependent on one thing: GAO breaking its own legal opinion.\n\nI happened to call the leadership of GAO just last week and said: As  far as you know, has GAO ever--ever--declared something not a rule when  the Agency said it was a rule? And after a moment of silence, he  responded: As far…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  other side of the aisle are all too happy to have district judges rig  the rules to stop the President of the United States from being able to  defend our country.\n\nJust last week, within close proximity to my house in Dripping  Springs, Texas, 47 individuals who are affiliated with the gang Tren de  Aragua were found by ICE. Right down the road…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…their safety  first, their livelihoods first, and their families first.\n\nMy friends, we are still feeling the consequences of this failed  border policy in North Carolina. Just last week, this picture to my  right, the FBI in Charlotte--and I want to give a shout-out to the FBI  agents based out of Charlotte. They arrested an illegal immigrant who  had…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, it is great to be here in the people's  House once again.\n\nJust a week ago, when I was celebrating with friends the July Fourth  holiday, watching the fireworks go off and celebrating the freedoms we  enjoy, many people actually came up to…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Republican issue; this is an American issue.  That is why I raised hell when I heard that the Islamic Academy of  Alabama was looking to build a bigger campus in Hoover, AL, just last  week. I looked at their website. They openly admit that they teach the  Quran. The Quran teaches that it is righteous to kill anyone who is not  a Muslim. Think about that.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Nation in gas prices. California leads the Nation  in electricity prices. California leads the Nation in housing prices.  California leads the Nation in debt and deficits. Just this week, we  learned that for the sixth straight year, California leads the Nation  in outbound U-Haul rentals. The greatest State in the country has  become the most popular State…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698654/california-is-the-most-popular-state-to-leave"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…tragically fell victim to an online extortion scheme, showing my  community the dangers of predators targeting our kids online.\n\nI sat with his mom, his dad, and his brother just this last week. We  talked about the tragedy that happened in his life and their  determination to see that we move forward in this Congress, not only on  this bill but others to make…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…wildfires; and number 10, chaotic  elections.\n\nThe good news is we have made significant progress when it comes to  each of those 10 items.\n\nWhen it comes to EV mandates, just about a week and a half ago, the  Senate followed in the House's footsteps and passed my resolution to  overturn Gavin Newsom's ban on gas-powered vehicles.\n\nAny day now, President…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…police  officers run toward danger, putting themselves at risk to protect life  and property.\n\nTheir courage, selflessness, and dedication deserve our deepest  respect, not just this week, but every single day.\n\nLet us also remember, honor, and mourn the officers who made the  ultimate sacrifice in the line of duty. Their legacy lives on in the  lives they…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in.\n\nThat is with regard to a committee hearing we had this week on the  First Amendment and how it affects internet platforms, but it is really  a greater topic than just that.\n\nThis week, we had a hearing in the Judiciary Committee in which we  talked about restrictions on free speech in Europe. Usually, when I  think of Europe, I think of Europe as…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dump product onto the global market, driving  the price down to make the economics such that nobody would invest in  that project.\n\nFortunately, that is being addressed. Just this week, the  administration announced something called the vault, which will be a  repository for critical minerals. It will be similar to our Strategic  Petroleum Reserve. We…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…questions. It is to pose  challenges. It is to test the Cabinet of the President, to visit  Federal facilities, to ask questions that are sometimes uncomfortable  or unwelcome. Just this week, I was at three committee hearings and had  three members of the Cabinet in front of me. Did they want to answer my  questions? Probably not, but they did.\n\nIf a Senator…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…communities I represent in Austin and San  Antonio and throughout Texas--purposely to then have organizations like  the Wren Collective, which is now known through reporting just this  week from the Law Enforcement Legal Defense Fund, putting out the known  networks where they are going in and telling these DAs and prosecutors  precisely what to do, precisely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…investigation into the Jeffrey  Epstein and Ghislaine Maxwell files.\n\nThe Committee has already undertaken important steps in their  investigation into Jeffrey Epstein. Just this week, the committee met  with the victims of Jeffrey Epstein. They have already issued subpoenas  to the Department of Justice related to the Epstein records.\n\nFurther, they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…an attestation if you don't have the documentation.\n\nWe want to make sure that it is easy to vote and hard to cheat. We  could look at our committee hearing that we had just this week where we  brought in the secretary of state of Wyoming, which has strong election  integrity provisions. We asked the gentleman on the record, the  secretary of state.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}]