[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…met with radio silence.  Now Republicans are pushing him through, unbothered by Donald Trump's  complete disregard for the law that almost every one of them voted for  just a few years ago. How times change.\n\nLet me talk about Mr. Bell's supposed qualifications. Once in a  while, I get called a privacy hawk, and I never consider that an  insult. I have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…the Citizens  United decision came down. Just 2 years after that, during the next  Presidential election cycle, outside spending topped off at nearly $1.3  billion. And just 2 years ago, in 2024, it came close to $4.5 billion.  Those numbers are disgusting. The American people are sick and tired of  this, being bombarded with ads.\n\nBut it is not just…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…so  much worse.\n\nI want to highlight one example of when the appropriations process  worked how it should that is particularly relevant in this exact  moment.\n\nIt was just a few years ago, in fiscal year 2019, that the Labor- Health and Human Services bill--not the easiest bill--passed the Senate  and was signed into law prior to the start of the next…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…It was Russia's invasion that shattered Ukraine's peace, beginning  with the invasion and annexation of Crimea in 2014 and through the  full-scale invasion that began just over 3 years ago. Russian forces  are committing horrific and documented war crimes against Ukrainian  soldiers and innocent civilians. Senator Cassidy called it out for what  it was:…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688193/rapid-response-subgroup"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…National Coal Council. They even gave a tax  break to coal mining.\n\nIt is not just dangerous. It is expensive. Coal power is now 28  percent more expensive than it was just 4 years ago. In fact, it is  often cheaper to build an entirely new solar power plant than it is  just to keep a coal plant running. That is why nearly 800 coal power  plants have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695768/national-coal-council-reestablishment-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…assassination and saw President Johnson be sworn in under unprecedented  circumstances. It rushed George W. Bush back to Washington after the  Twin Towers were struck. And just 2 years ago, it flew President Joe  Biden to Europe for a secret trip to Ukraine during the war.\n\nWhen people see Air Force One on TV, when they see it land in other  countries--whether…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…This fund helps showcase the U.S. military in a positive light,  leading with our values and capabilities while strengthening  partnerships and alliances.\n\nFor example, just a few years ago, OHDACA provided critical  humanitarian assistance to Afghan Special Immigrant Visa applicants  after the collapse of the Afghan Government.\n\nCompared to the rest of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…current Secretary of State Marco Rubio.\n\nThen-Senator Rubio gave an important speech in the Senate to get the  Uyghur Forced Labor Protection Act over the finish line just a few  years ago in 2021. Yet, now, as Secretary, he has overseen drastic cuts  to religious freedom and human rights programming that helps the  Uyghurs.\n\nI hope that this bill augurs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Fund, a $10 million effort to support Latino leaders and  groups in Santa Clara and San Mateo Counties.\n\nAl and Carmen were married for 57 years before she passed away just a  few years ago in 2020. In the years after her passing, the Castellano  children were the driving force behind the foundation until its  operations concluded in 2023. The impact of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…imports.\n\nBut I don't think a tax is the right solution for those issues. In  fact, this is breaking the U.S.-Mexico-Canada Agreement that President  Trump negotiated just 6 years ago. And if we are going to break the  very deal we have negotiated--I think, one of the most important  achievements of the first Trump administration--why would people want…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…percent because  one of their provinces--just one--took out the Reagan ad.\n\nWho would make a deal with a person who acts like this, who ignores a  deal that was made just a few years ago and who constantly threatens to  annex their country?\n\nThat is what Donald Trump has done with Canada.\n\nThese tariffs are doing nothing to help Americans. They are unrelated…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…is consistently high crime rates and a staffing shortfall of about 800  officers that puts both police and residents at risk. I mean, I don't  know if people forget, just under 2 years ago, one of our own  colleagues was mugged at gunpoint several blocks from the Capitol. That  might not have happened if we weren't understaffed by about 800  officers…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692303/protecting-our-nations-capital-emergency-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I thank Mr. Griffith for yielding.\n\nMr. Speaker, it is a new day in America. I remind my friends that,  just 6 years ago, we had the greatest economy in our lifetimes, and we  achieved energy independence. That is what this day is about.\n\nThe days of weakness on the world stage and dependence…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688181/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…development of interstate pipelines currently faces significant  regulatory and statutory hurdles. In fact, in 2024, we produced less  than half the pipeline miles we built just 5 years ago.\n\nOur regulatory and statutory permitting process must both protect the  environment and reflect the urgency and importance of the projected  growth in natural gas demand.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…new  member of the Committee on Energy and Commerce, repeals this final  rule.\n\nNew standards for this equipment, which included a variety of  products, became effective just 3 years ago. Yet the Biden  administration moved ahead with implementing burdensome new standards.\n\nIn fact, these standards will require energy reductions up to 60  percent on top…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to what Putin says  but also watch what he does as he attempts to stall peace negotiations  while attempting to achieve his larger aims.\n\nPutin's invasion of Ukraine just over 3 years ago is an obvious  violation of another international agreement that Russia was a party  to--the 1994 Budapest Memorandum. Under this agreement, Ukraine  willingly gave…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Colorado and  Montana. That Chinese gear was clustered near sensitive military  assets, including Nebraska's Offutt Air Force Base and our nuclear  missile silos.\n\nThen, just 4 years ago, U.S. intelligence officials sounded the  alarm. Their investigations found that Huawei could secretly access  mobile phone networks around the world through backdoors,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…the Jewish people in concentration camps, gas chambers, and they tried  to extinguish an entire race of people--our Jewish brothers and  sisters--killing 6 million.\n\nJust a few years ago, the Jewish people got back to the numbers  before the war. Eighty years later, we are having a discussion about  what should we do, as civilized people, regarding Iran.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Fred Smith, Memphis acquired the NBA's Grizzlies in 2001  when he committed to purchasing the naming rights for the future home  of the basketball team, the FedExForum.\n\nJust 2 years ago, when The University of Memphis was ambitiously  pursuing stadium upgrades for the football team, Fred Smith and his  family committed $50 million to help the school achieve…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…persons who aided and abetted the Nazi's Holocaust?\n\nIf not, then why would they oppose extending the same sanctions to  the Nazi's would-be, modern-day successors who just 2 years ago  slaughtered more than 1,200 innocent civilians, including children,  infants, and the elderly because they were Jewish?\n\nMr. McCLINTOCK. First of all, I am not familiar…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…survive  this thing.\n\nUnder this House majority and administration, it is just no longer  the American way. We promised the American people energy dominance. We  had that just 6 years ago. Can you imagine? We were energy dominant. We  set the price of a barrel of oil just 6 years ago.\n\nWhat happened?\n\nThe bill before us today is a necessary, much-needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…not only imperative to our  district but to the Nation for so many different reasons.\n\nI think the chart behind me is really telling the story about America  today. Just a few short years ago, we ceded space dominance to other  nations. We actually had to get a ride to space from, of all people,  our former adversary, Russia. Here we are today, as you…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…is clear we must pass the SAVE Act and prevent noncitizen voting.\n\nThere have also been many other examples of noncitizens voting or  being  on States' voter rolls. Just a few years ago, Illinois removed almost  600 noncitizens from its voter rolls. In Pennsylvania almost 10,000  noncitizens were removed from their voter rolls. In Georgia an audit…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…true now then it will be true  in a very short time, that every child in America now has the ability  to get a richer and more immersive education than any child did just a  few years ago.\n\nI was part of an organization when I was a teacher that was aimed at  closing achievement gaps in America. The different opportunities that  are afforded to young…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…protecting our great Nation by investing in our military and  military families. We are preserving tax cuts that made the United  States economy the envy of the world just 8 years ago. We are reviving  our Nation's fiscal outlook by finally cutting wasteful spending and  unleashing our economy from harmful restraint--restore, protect,  preserve, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…include  delayed services, uncertainties for families and businesses, and eroded  trust in government.\n\nOur recent progress stands in sharp contrast to where we were just a  few years ago. This body had not passed a single government funding  bill in this Chamber before August, and that was since 2018. And that  failure was not accidental. Under the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]