[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…that does nothing for working families and everything for  the ultrarich.\n\nSenate Democrats are offering Republicans another chance to reverse  the devastating cuts they just passed--cuts that will close rural  hospitals and decimate Medicaid because Republicans have turned  healthcare into a privilege reserved only for the most wealthy in the  country.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of the  Armed Services Committee, and Senator Risch, our colleague, chairman of  the Foreign Relations Committee about timing.\n\nI want to talk about timing because we have just passed the third  year of this war. This moment is crucial.\n\nThank you to Senator Sanders, Senator Van Hollen, Senator Durbin-- soon we will hear from Senator Bennet. We have resolutions…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…laying out all week. We have a lot more work to do on DHS, and I will  have a lot more to say as those negotiations now continue.\n\nI want to focus right now on the 5 bills we just passed, which fund  95 percent of the remaining Federal budget. From the start of this  process, I made clear we needed to tear up Trump's budget and reassert  Congress' power…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "Mr. CLEAVER. Mr. Speaker, as I sat on the bed this morning, trying to  get up, I received a phone call to tell me that Congressman Bill Clay  had just passed. I sat there for a few minutes, feeling sad.\n\nThen it occurred to me that death is not the greatest loss in life.  The greatest loss in life is to die with a life not lived…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693814/moment-of-silence-for-congressman-william-clay"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Representative of California's 21st  Congressional District, I am here to share some good news for the  people of not only the Central Valley but across the country. The House  has just passed the Crime Victims Fund Stabilization Act, with strong  bipartisan support.\n\nAs one of the original founders of the bipartisan Congressional  Victims' Rights Caucus, this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699068/applauding-stabilizing-crime-victims-fund"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Sometimes  they get extended in short increments. Sometimes they move as a kind of  tax package. As a matter of fact, this was just extended in the  continuing resolution that we just passed and in previous funding bills  before that. I am so delighted to be here this evening to see that my  Republican colleagues are in the mood to extend current law.\n\nI will…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…cannot despair. Nothing less than people's lives depend  on us acting.\n\n2483 and the Senate proceed to its immediate consideration.\n\nMs. HASSAN. Mr. President, the Senate just passed a major bipartisan  package to reauthorize the SUPPORT Act, and it is headed to President  Trump's desk. Today is proof that despite our differences, bipartisan  progress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, House Republicans just passed their budget  plan, President Trump's big, beautiful bill, again. The first version  didn't cut enough from critical programs like Medicaid and SNAP. This  budget is a direct…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690060/republicans-budget-plan-passage"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…are struggling  with rising expenses, like healthcare, housing and utilities, and  groceries, yet they have representation that seems to reflect the very  wealthiest. We just passed a tax cut for the very wealthiest Americans  this last summer, and people don't understand why.\n\nIf you look back at what happened with Citizens United, you realize  that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "Mr. RUIZ. Mr. Speaker, Republicans just passed their big, ugly law  that rips Medicaid by nearly a trillion dollars, adds 15 million people  uninsured, and raises costs for everybody. Now, to add insult to  injury, they…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698369/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Speaker, for those who are expecting their Social  Security checks this month, turn them down if you think that is  socialism.\n\nMs. WATERS.\n\nMr. Speaker, House Republicans just passed a resolution that gives  Senators the right to sue their own government for up to $500,000.  Trump is suing the government also. The President of the United States,  who…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…administration froze a ton of funding that  Congress passed for summer school and afterschool programs. And again  with the ``Big Bad Bill'' that our Republican colleagues just passed,  President Trump signed into law a bill that gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare and food  assistance from millions of Americans,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…I am grateful for the unanimous, bipartisan support of the Senate  tonight in passing the Civil Rights Cold Case Records Collection  Reauthorization Act. The Senate has just passed this bill, which  Senator Cruz and I, again, have offered to continue this vital work  pursuing justice in civil rights cold cases.\n\nAs divided and bitter and hateful as…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698140/civil-rights-cold-case-records-collection-reauthorization-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…the so-called SAVE Act, an act of legislative voter  suppression that will make it much harder for most people to vote, the  cornerstone of our democracy.\n\nThis bill, which just passed the Republican House, is designed to  combat a nonexistent problem. Noncitizens are already not allowed to  vote under Federal law. Instances of fraudulent, noncitizen voting…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690056/opposing-legislative-voter-suppression"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, House Republicans just passed their budget  plan. Like many House Democrats, I am clear-eyed about this plan and  how it will affect families in Westchester and the Bronx. This budget  is a direct attack…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688018/fighting-for-fairness-and-opportunity-for-every-american"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…over time. It is a game changer and something we are  really excited about.\n\nMr. Speaker, we are voting on legislation this week to support  families and pregnant women. We just passed the Supporting Pregnant and  Parenting Women and Families Act, ensuring that young families have  access to prenatal vitamins, formula, and diapers. It also ensures that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the meantime, we have our bill that will lower premiums,  calculated by CBO, in the individual market by 11 percent, as opposed  to the 5 percent that would happen if we just passed the enhanced tax  credits. Not just the 7 percent in the ObamaCare marketplace will  benefit but all Americans will benefit from this bill.\n\nMr. Speaker, I again ask the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Mrs. KIGGANS of Virginia. Mr. Speaker, I rise today to recognize my  bill, the Care for Military Kids Act, that was included in the  appropriations package for 2026 that just passed the House.\n\nAs a proud Representative of Virginia's Second Congressional  District, home to one of the largest Active-Duty military populations  in the United States, advocating…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…modification.\n\nMr. SULLIVAN. Mr. President, I want to let people know back home that  means that that bill, the ARTIST bill that we have been trying to get  moved for a long time, just passed the U.S. Senate. So I want to thank  my colleague from California, my friend from California who has worked  with me, by the way, on one of the other bills that just passed.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Republicans passed  legislation which would have funded government through November 20.  Here we are on November 12, and we are basically where we would have  been had we just passed the bill that we passed in September.\n\nWhat did we get for all of that? What happened over all these days?  Well, my colleagues on the other side of the aisle were searching…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the end of the last Congress to take them up, so we are  where we are. But now these bills are going to be going to the  President for his signature.\n\nTwo of the bills we just passed are important for Alaska Natives, and  I am proud to have been able to work on these important measures. It  has been a multiyear effort to get them to the President's desk.…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…we are passing are making  the deficit less. Yet the deficit keeps getting worse.\n\nSo even when Congress passes a budget, they seem to immediately  renege on the deal they just passed. The numbers in the budget end up  not being of consequence because the spending goes on unabated.\n\nThis week, Congress will likely vote on locking in spending levels.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…Department of Homeland Security  bill. Ironically, because of the continuing resolution that we passed,  we are funding ICE with more money than we would have otherwise if we  just passed the regular Homeland Security bill because Republicans are  working on fiscal restraint.\n\nAlso ironically, they actually can't get at the Agency they are mad  at. ICE is…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…many of these catastrophic fires in addition  to several other policy failures.\n\nThe good news is that we are restoring common sense when it comes to  forest management. We just passed on a bipartisan basis a couple of  months ago the Fix Our Forests Act, which will streamline the sort of  environmental regulations that stop us from appropriately managing…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…statutorily codified the Alaska Native Vietnam- era Veterans Land Allotment Program in 2019. Nothing in this CRA  repeals those requirements under the 2019 law. In fact, the House just  passed a 5-year extension of this program in July. To suggest that we  are now somehow unsupportive of this program is ludicrous.\n\nCongress is using the CRA for this RMP because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Nobody gets to see what is going  on, and premiums have gone up 221 percent since ObamaCare passed.\n\nAnd remember Obama saying your premiums would go down by $2,500 if  you just passed his law?\n\nI just told you what happened with 18 of 24 for $100,000. Remember,  there are 20 million people on ObamaCare today receiving government  subsidies. When you take…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…that is given.\n\nMr. Speaker, I will make a few factual comments in response and also  provide some information relative to my colleague's previous comments.\n\nRepublicans just passed working families tax cuts, which gave  American families the largest tax cut in American history. Under the  bill, the typical family will get up to $10,900 in additional…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…thank the chair and vice chair of the  full Appropriations Committee, Senator Collins and Senator Murray. They  and their staff made the impossible real.\n\nThe bills that just passed through this body and headed now to the  House will save lives and change them--will fund hundreds of billions  of dollars of positive and valuable activity on behalf of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…special fuel  blends have caused costs to go up inordinately. This, by the way,  doesn't even factor in that we have two refineries that are about to  close. Fortunately, we just passed legislation here in Congress to  partially address this issue of the refineries. There is one study from  USC that says that by the end of next year, Californians could…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…start this, my speech will go a little less than 10 minutes, if  anybody is planning around it.\n\nMr. Speaker, I would like to talk a little bit about the big bill  that we just passed and some provisions that should be monitored as we  work our way not only through the big reconciliation bill but through  the appropriations bills, as well.\n\nFirst of all,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}]