[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…the 0.1 percent above hardworking Americans.\n\nThe Republican budget would give $4.5 trillion to CEOs and big  corporations.\n\nWho pays for the tax cuts? American families just trying to make ends  meet.\n\nThe Republican budget cuts at least $880 billion from Medicaid. It  doesn't matter whether someone is a Democrat, a Republican, an  Independent, or…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688258/american-families-will-pay-for-republican-tax-cut"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…are once again prioritizing culture wars  over working people and threatening the retirement savings of nurses,  teachers, police officers, and healthcare workers, who are just trying  to save for their future with peace of mind.\n\nThe bill before us today injects politics into investment decisions  that should be guided by sound financial judgment.\n\nLet…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…their own mind as to whether that is the right thing or the wrong  thing to do for this country.\n\nThe exercise that you are engaged in, Senator Booker, is a simple  one: just trying to make sure that all the facts are on the table.\n\nThat last segment you did on the impact on medical research should be  reason alone for folks to reconsider the path this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…It is  simply because he didn't like the way their leader spoke to him. He put  tariffs on Switzerland.\n\nThat is not a strategy. That is impulse. That is a person who is just  trying to say that he is the king. Mr. Speaker, guess what. That  impulse, who is going to pay the price for it? Who is going to pay the  price for that impulse? I will tell my…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…with the short time left, I say that I came to the floor  to talk about the harm being caused by the Trump administration, the  corruption in crypto, and the harm to people just trying to live their  lives.\n\nTrump's regime is going after the supports that government provides  to help Americans live in safe homes, put food on the table, and take  care of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…They punish Indiana.  They punish Illinois, America's manufacturing heartland. Tariffs punish  Missouri. They punish Wisconsin.\n\nThey punish every worker on the line who is just trying to build a  better life for themselves. The families and the workers who work in  these plants do hard work. They deserve to earn a fair wage with good  working conditions…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…sources that we need from wind and solar, from batteries, all-electric  vehicles--this incredible transformation that was taking place in our  country that they are now just trying to completely and totally kill.\n\nRepublicans' ``Big Ugly Bill,'' which eliminated programs working to  lower household costs and get clean energy built, is expected to cause…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…experience. Hard-working Americans are doing everything right. They are  working longer hours. They are budgeting carefully. They are raising  their families. And they are just trying to stay afloat, but they are  still falling behind. That is why we are here today.\n\nIn 2010, the Supreme Court handed down a decision that put a ``for  sale'' sign on our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…freezers, clothes washers, and  air-conditioners. This labeling fiasco, I just don't understand why you  think it is important for families to have less information just when  they are trying to figure out what appliance to buy.\n\nIn contrast, the Democrats, over the past few years, have really been  focused on lowering the cost of living and passed very…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…glad we are getting somewhere in this debate. The  gentleman concedes that it is within the discretion of the  administration to decide where to target resources.\n\nI was just trying to find out where the administration is this week  because we are getting conflicting accounts of whether or not they are  still targeting farmworkers. We are getting reports…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…This march is tough. The days are very long, and we were exhausted by  the end of it, but it is nothing compared to the struggle people in  poverty face every single day just trying to survive in the United  States of America, the richest country in the history of the world.\n\nMy great desire is to never again have to do this walk, not because  of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…When, in fact, this is working and this methane fee is  actually getting the oil and gas industry to correct this problem and  recycle the methane and not waste it.\n\nWe are just trying to do what makes sense from every point of view  here. The Methane Emissions Reduction Program is a win-win for  everybody, and this resolution is a lose-lose for everybody,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican. If we are not going to rely on the Congressional  Budget Office for analyses, who are we supposed to rely on? What,  Stephen Miller? I mean, who? I mean, I am just trying to figure out  who. Are we supposed to take your word for it or just take the  President's word for it? I mean, this is a guy who doesn't read  anything. He says he watches…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…payments for him and his wife will rise from $670 to $2,054. He said  this: ``Between the high deductible and $25,000 in premiums, this is 40  percent of our income. I am just trying to live a life here and be able  to go to the doctor when you need to go to the doctor.''\n\nHe ought to be able to do that. In fact, every American ought to be  able to do…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…track.  Instead, we are shut out. Everybody is shut out because they are all  too afraid of the guy in the White House.\n\nMr. Speaker, I am really at a loss for words. I am just trying to  contain myself because I have never heard such nonsense in my life. The  gentleman speaks about Thomas Jefferson. He is looking at us right up  here, and he is rolling…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…corporate structure. You always  have to be careful when you say: Why are corporate taxes down so much?  It is now because it flows through on the individual line. I am just  trying to make that point.\n\nTake a look at this. Here is Social Security and retirement taxes.  Well, that is FICA. Actually, you were getting $1.7 trillion last year.  This year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…his frustration was pretty clear. He is just looking for a plan  that he can afford. He is just looking for an option. He is not asking  for something unrealistic. He is just trying to figure out what to do.  He asked me the question: How did we get here? How did this happen?\n\nWell, let me just walk through that because the interesting thing  about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…individuals. This includes service workers relying on  tips as part of their wages, workers relying on overtime, senior  citizens relying on Social Security, and even residents just trying to  write off their charitable contributions.\n\nThey are all being targeted by the D.C. Council. Specifically, the  D.C. Council is opting out of the following tax provisions…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…won't be a question that a company  has to pay and give customers the refunds for games they couldn't  watch.\n\nWhether in their utility bills, their healthcare bills, or just  trying to watch a sports game, that is putting money back in people's  pockets when pressure is so high, and that matters.\n\nIn closing, there is so much power now in the voices…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this ain't a game because that $71,000 a second, we need to have  buyers of our bonds. We make our buyers of our bonds cranky. It gets  really expensive.\n\nThis chart here is just trying to make a point of what is going on in  our debt and deficits. Remember that discretionary spending, the blue  on the pie chart I just showed you, is flat. It is not growing.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…playing around here, but we  go home and talk to voters. They want things. They need our help.\n\nPlease understand this is a dangerous, dangerous game we are playing.\n\nI was just trying to make the point that if we do all these things  without financing, we are basically over 150 percent of debt to the  GDP.\n\nLet's actually do something difficult. The Treasury…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the excise tax. Then you have  to go back to the tax-exempt government agency, have them fill out  their paperwork, submit it over, and then turn back to refund it. We  are just trying to clean up the bureaucracies that are 100 years out of  date.\n\nIt is not that hard. Make up your mind. Do you want broader adoption  of nonlethal technology so our brothers…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…American homeland, protect the people of the United States  of America, and he has done a damn good job.\n\nMr. MAST. The President never explained it to me. Maybe he was just  trying to make room for Maduro and his wife.\n\nLet me answer some of the questions that my colleagues put up.\n\nWhy did President Trump take Maduro? It was to protect the homeland…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…new strain put on that system, which put millions of  lives at risk. Americans depend on them to keep our skies safe.  Families who rely on SNAP and WIC, parents who are just trying to feed  their kids, were left wondering how they would make it through another  week.\n\nAt the same time, our border agents and Coast Guard members continue  to serve this…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time as I may  consume.\n\nMadam Chairwoman, can you believe this? We broke our printer.  However, thank heaven we didn't break the markers.\n\nSo I thought actually just because we are trying to do fact-based,  the average family's taxes are going up at the end of this year $2,853,  and 62 percent of taxpayers will see hikes.\n\nI am sorry, we just didn't…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…truth that it is going up? We are begging  for crumbs to get $1.5 trillion in reductions over 10 years. We are  going to spend $86 trillion over the next 10 years. We are just trying  to save $1.5 trillion of that massive increase for crumbs to have $50  trillion of debt at the end of that rainbow.\n\nI hope we will come together. I hope we will unite…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and sisters live healthier when 31  percent of Medicare spending is diabetes--33 percent of all healthcare  overall is just diabetes.\n\nIs that Republican or Democrat? It is just trying to get your policy  alignment to the fact we are buried in debt and getting older as a  society. I think in a decade, 23 percent of our population is 65 and  up. We now…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…who were  hurt who were in law enforcement.\n\nIllegal immigration is not a good thing. Yes, there are a few illegal  immigrants who came to this country who are illegal but just trying to  make their way but doing it the wrong way, but there are also real bad  folks who got in.\n\nThe simple truth is--let's get back to what happened--the man, the  individual…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economists. Yet, you already had the MedPAC saying it is  already 25 percent more expensive than was the original model.\n\nIt gives you a sense of we are making reforms, but we are just trying  to align the incentives. We have done some things to actually help the  insurers be able to have sort of automatic enrollment, but you can  choose to opt out for a longer…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just in avoidance of we don't want to tell anyone, we are  going to try to do something that should not even be that hard.\n\nRemember $86 trillion in spending, the House was just trying to do 2,  and I thought 2 was absolutely anemic. We should have covered all 4,  $4.5 trillion.\n\nOne of the hardest votes I made in my decade-plus here was standing  right…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}]