[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…months, and then they are  still faced with delays, confusion, and overbroad regulation in the  process of returning to work.\n\nThis often leaves the folks who are tasked with keeping our skies  safe with an absolutely terrible choice, Mr. Speaker: Get help but put  your career and your paycheck on hold, or keep your career on track and  just hope you will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695007/mental-health-in-aviation-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…experiencing homelessness on any given night in this country.\n\nRents and home prices are surging, and families are being priced out  of their communities. Housing supply is not keeping up with demand. As  a result, more and more families are pushed out onto the streets or  forced to choose between paying rent or buying groceries.\n\nAcross the country, renters…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…show.\n\nThe CDC reviewed the evidence and found that sending kids to adult  prisons increases violence and does not reduce it. The National  Research Council concluded that keeping punishment in line with age is  the best way to prevent future offending. Every shred of research says  the same thing. Putting kids in adult prison makes us less safe, not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Ronnie opened his  own business, Hair Innovations, where he provides salon services and  keeps New Mexicans feeling like the best versions of themselves to this  very day.\n\nKeeping a small business open in today's economic environment is no  small feat, and Ronnie has endured many challenges along the way, such  as dealing with a recent car crash into…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…States of America. We are about  innovation. We are about modern technology. We are not about looking  backwards. If Republicans were serious about meeting energy demand and  keeping customer bills low, empowering artificial intelligence, then  they would look to real solutions, energy efficiency, virtual power  plants, grid-enhancing technologies, batteries,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…winnings. Accordingly, because that has been eliminated, gamblers now  will be required to pay taxes on money they haven't earned.\n\nMy FAIR BET Act would undo the Senate mistake by keeping the 100  percent loss policy in place. This will ensure that gamblers don't have  to pay taxes on phantom income and are not lured to offshore and  unregulated markets.\n\nMy…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693484/bringing-fairness-back-to-gaming-taxation"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…tough guy on the world stage.\n\nWhat I am troubled by is that a man who was never brave enough to  serve in uniform himself seems to care more about thumping his chest  than keeping our troops out of danger. What I am worried about is that  Donald Trump's obsession with making America great again is making  Americans less safe again.\n\nTwo months ago,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…at the  wheel, while they struggle to make ends meet, watch their power bills  go up every month, and have to start making impossible choices between  paying for medicine or keeping their lights on.\n\nSorry, folks, apparently Republicans in Washington don't have time  for any of that. They are focused on passing another appliance bill  instead--talk about…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…information it has accumulated on each American. Your data becomes  fully public and available to President Trump even as the Epstein files  remain fully buried.\n\nRepublicans are keeping the American people ignorant of what Trump is  doing with their private data: Ignorant of how he may use it against  his political enemies or his business competitors, ignorant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Medicaid Paperwork Red Tape\n\nMr. SUBRAMANYAM. Mr. Speaker, we keep hearing the same thing about  the big, ugly bill the President signed last week. We hear we are  keeping Medicaid for the people who need it and only kicking off able- bodied people. This is simply not true.\n\nThese cuts to people's benefits are a little sneaky. It is not a work…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in a vice grip-- Executive orders from the President on one end and dangerous  legislation from Congress on the other. They don't understand the  sacredness of elections and keeping them fair. The kind of legislation,  the kind of Executive orders which are so jaundiced, so slanted on the  side of one party, are the antithesis of democracy.\n\nOn the one…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…evidence-based measures. Simple but important  actions, such as staying physically active, maintaining a healthy diet,  protecting our skin from excessive sun exposure, and keeping up with  recommended screenings, can make a real difference in reducing risk.\n\nAt the same time, prevention must extend beyond individual choices.  Too many families face…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience. We are grateful for his leadership and commitment to  keeping our communities safe.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Nathan Whittington for his service to the  Jefferson…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…the price of groceries. Well, they might not  care about paying more, but seniors on fixed incomes do; parents trying  to feed their kids do; workers whose paychecks aren't keeping up do.  They are the ones being hurt by these reckless tariffs. So Donald Trump  may not care, but everyone else I know cares--and it matters.\n\nThat is why I introduced my…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Security and throw seniors, orphans, and those with disabilities  into poverty. All baby boomers will be 67 by 2031. So we are in the  peak period of retirement. I introduced the Keeping Our Field Offices  Open Act as an essential step to protecting Social Security benefits  for the 1 in 5 Americans who need these community offices. Field  offices serve as…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…fatigue''--promise fatigue. The  United States makes an agreement with China, and they never keep it-- never keep it. You know who has made an art form out of promise fatigue  and not keeping their promise? This guy, Xi Jinping. You remember this  in the Rose Garden with President Obama--in the Rose Garden 2015.  President Xi Jinping looked at Barack Obama, looked…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…informational services.\n\nThe goal is to foster improvements in police practices, training, and  education while increasing the public's understanding of the role  police play in keeping all of us safe.\n\nThe association made a great decision to select two great chiefs that  happened to be from my district for these leadership positions.\n\nChief Butler has been…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "James Risch", "party": "Republican", "sentence": "…be  reviewed. The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign Relations Committee.\n\nIn keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in the Record the notifications…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…anniversary of the East Palestine Fire Department, a pillar of our  beloved Ohio community since 1875. It is a privilege to honor these  firefighters who have dedicated themselves to keeping our village safe.\n\nFor 150 years, these brave men and women have put their lives on the  line, responding to countless emergencies with unwavering courage.  Beyond their role…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693528/congratulating-the-east-palestine-fire-department-for-150-years-of-service"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…State,  and Republicans won the majorities in both Houses--in the Senate and in  the House of Representatives. And passing the Big Beautiful Bill was an  important step in keeping our promises to the American people and  advancing President Trump's legislative agenda.\n\nBut there is more. In addition to extending President Trump's tax  cuts, a critical…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…men and women on the space station are returned back to Earth. More  and more companies are developing space technologies so we can have  satellites and space infrastructure, keeping ahead of our global  competitors.\n\nWe cannot be complacent. Just because we lead today does not mean it  is permanent. We must defend ourselves against China and Russia, which…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…village's name comes from  the Ottawa Native American Chief Tondoganie. When it was officially  incorporated in 1895, the town was an agricultural village, populated  by farmers. Keeping with the village's small town charm, the original  village hall built in 1898 is still used today. In 1900, The  Cincinnati, Hamilton & Dayton Railway depot was constructed,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…became Chairman of the  House Committee on Energy and Commerce in January of this year, Kaley  joined my team as the Press Assistant where she became a valuable team  member in keeping the American public updated on what our committee has  been doing to restore the American Dream.\n\nRecently, Kaley departed the House Committee on Energy and Commerce  to take…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…have used that veto.\n\nAs global natural gas demand is projected to continue to grow for  decades to come, investment in pipeline projects will be of utmost  importance for keeping prices low for our Nation and to keep it secure.\n\nIn the 1970s, when we had an oil embargo across this country when the  Arabs cut us off, we were told we had no energy in…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…circumstances and mutual  opinion will permit, but temporary, and liable to be from time to time  abandoned or varied, as experience and circumstances shall dictate;  constantly keeping in view, that it is folly in one nation to look for  disinterested favors from another--that it must pay with a portion of  it independence for whatever it may accept under…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "James Risch", "party": "Republican", "sentence": "…be  reviewed. The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign Relations Committee.\n\nIn keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in the Record the notifications…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…prices, as the Presiding Officer knows, impact everything  that a family does. It impacts everything in the country: the cost of  groceries, the cost of commuting to work, or keeping going a ranch or  family business. Energy prices affect all of it.\n\nAnd lower prices are happening because Republicans are successfully  changing the direction of the country.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…power.  This past weekend, I was able to meet with many of our first  responders: police, firefighters, dispatchers, and emergency medical  teams. They all answered the call, keeping our communities safe and our  roads open. Their bravery, professionalism, and dedication embody the  spirit of resilience and unity that defines northern Michigan.\n\nThe determination…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689858/congress-supports-northern-michigan-and-the-upper-peninsula"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…construction process, delivering environmental stewardship to  communities impacted by PFAS, and providing quality housing for our  servicemembers, this bill is essential for keeping trust with our  servicemembers and their families.\n\nThis bill is laser focused on the future to ensure our forces have  the training, maintenance, and equipment to deliver…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697789/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…struggling to pay for  every single day.\n\nCleaning up this mess has become our responsibility, the new  majority, the new administration that has committed itself to actually  keeping the promises from the campaign trail in 2024. Instead of  bending over backward to help people who are breaking the law, they  want to look at it and say: How about those…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}]