[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I can tell you exactly what is going on in  Louisville, Kentucky, right now. Grocery prices are up, and retirement  savings are in chaos.\n\nRepublicans could put an end to this crisis, but instead, they are  going to make things worse.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689901/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…would get hammered.\n\nIowa loses $4.1 billion. What did Senator Ernst from Iowa have to say  about it? She is not concerned. She says: ``Well, we all are going to  die.''\n\nKentucky loses about $12 billion. What does Senator Mitch McConnell  have to say about that? He says: ``They'll get over it.''\n\nWhat?\n\nAre you, the American people, going to just get…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…administration's view of the scope of Trump's mass pardons,  arguing that the relief should apply to separate criminal conduct  committed by Capitol rioter Dan Wilson, in Kentucky in 2023.\n\nU.S. District Judge Dabney L. Friedrich, a Trump appointee,  questioned a Justice Department attorney about the government's  shifting position on the scope of Trump's…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…this one big,  ugly bill, devastated by this one big, ugly bill.\n\nWe also heard, Mr. Speaker, from Timothy, who I believe may have  written to us from the Commonwealth of Kentucky. He says: ``My name is  Timothy, and for the past 5 years, I have worked at the Department of  Housing and Urban Development in field policy and management.''\n\nThe Department…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…education activist. While running a shoe store, she  also headed the board of a Jewish school, working tirelessly for its  success. In recent years, she has made her home in Kentucky, where she  became a matriarch for her entire community. Known for her kindness and  generosity, she volunteers her time and reaches out to all with warmth  and care. She…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696117/congratulating-geraldine-bubby-litvin-shaffer-on-her-100th-birthday"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to recognize David Neville,  owner of Capstone Farms in Kentucky, for receiving the prestigious 2026  Citizen Diplomat Award.\n\nOn 258 acres of land in Northern Kentucky, David has built not just a  farm, but a laboratory of ingenuity. Through…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…constituents they were  elected to represent, they are going to stand to lose a great deal. The  States with the highest spikes in energy prices are going to be South  Carolina, Kentucky, Oklahoma, Mississippi, and Louisiana under this  bill. We are taking out the alternatives that could have helped them  moderate the prices in those States.\n\nAnd the States…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Guthrie, having known him for a long  time, is he has always acted and led with civility, kindness, and  respect, going all the way back to the time in the State Senate in  Kentucky.\n\nI have never served a day of my life in the majority. It might go  without saying I was sort of hoping that Mr. Pallone would be the  chairman this year. But if the chairman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Topeka Police Department: Policy and Procedural Manual says       ``ECW is a less lethal force alternative.''\n\nRawlins County Sheriff's Office                                   KENTUCKY\n\nLouisville Police Department\n\nNewport Police Department\n\nAshland Police Department\n\nFort Wright Police Department                                  LOUISIANA\n\nNew Orleans…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…may  replace golf as the President's favorite pastime.\n\nOf course, while talking about Representative Massie, Trump had to  pat himself on the back for winning elections in Kentucky. He also  posted multiple times about the Nobel Peace Prize. That is what he  cares about, getting an award. It is all about him, not saving  healthcare, not ending hunger,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…center had given her the  wrong information. This misdiagnosis greatly increased her risk of  having pregnancy complications.\n\nMs. CHU. Mr. Speaker, I would like to talk about Kentucky, where a  postpartum nurse with 20 years of experience was motivated to volunteer  at a crisis pregnancy center. During her training, she learned that the  clinic was using…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, in 2012, the National Park Service conveyed this 3.62- acre parcel of land in Kentucky to the city of Paducah through the  Federal Lands to Parks Program.\n\nThis program allows States, counties, and local governments to  acquire surplus land for public recreational…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…we are offering this amendment.  Before yielding to the distinguished ranking member who has been a  leader in this regard, I want to quote my colleague  Tom Massie from  Kentucky, a Republican, who I think said it best. ``Why haven't we  voted on tariffs in the House of Representatives?'' This is a  Republican who said this. ``Because Speaker Johnson…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Chairman, I rise also in strong opposition to this  amendment.\n\nIn 2023, 12,429 people died in drunk driving crashes nationwide. In  Kentucky alone, 198 people were killed. In  Pennsylvania, 321 people lost their lives. These deaths were  preventable.\n\nAdvanced drunk and impaired driving prevention technology will…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…together on a bipartisan basis to pass this bill that will  do just that.\n\nMr. Speaker, I want to end by thanking the gentleman from Texas (Mr.  Luttrell) and the gentleman from Kentucky (Mr. McGarvey) for their  leadership on this important bill. I also thank the chair and ranking  member for their support, as well. I urge my colleagues to vote ``yes''  on…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696761/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…rise today to discuss the original  intent of the 2018 farm bill's Federal hemp legislation and the need to  restore it.\n\nEarlier this year, a report from the University of Kentucky found  that cannabis-related poisonings among Kentuckians under 18 rose by 43  percent between 2023 and 2024. As you can see here, emergency room  visits are rising steadily…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…25-percent tariff on this enormous  amount of goods. There are predictions that cars are going to cost  $10,000 more because the cars go in and out. We have cars made in  Kentucky, but some of the parts go to Mexico. Some of the cars go to  Mexico. Some go to Canada. They come back--a $10,000 increase. Do you  love the idea of tariffs? Is it such a…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Chair, it is Florida, Michigan, and New Jersey, but here are the  States that are in line, that say we  want to protect our own environment, too: Alaska, Arizona, Indiana,  Kentucky, Maryland, Minnesota, North Dakota, Oregon, and Virginia. They  are all in line to fight for their own State and protect the  environment in their own State.\n\nAs I wrap up,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…intelligence with Ukraine. Good for the President, and good for our  friends in the House and Senate.\n\nOur allies across the Atlantic are taking the lead now, as my  colleague from Kentucky just pointed out, in financing security  assistance for Ukraine. NATO allies are buying equipment from us in the  United States and giving it to Ukraine. I certainly applaud…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Madam Speaker, I thank Chair Comer, my good friend from  Kentucky, for yielding me time.\n\nMadam Speaker, I rise in support of my bill, H.R. 884, that would  prohibit individuals who are not citizens of the United States from  voting in elections…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…While some may masquerade as advocates for hemp farmers, even  sometimes threatening to hold up government funding over this issue, I  will continue to work on behalf of Kentucky's farmers while protecting  our children not only in my State but in yours as well. I would urge my  colleagues to do the same.                            3941, and I ask…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696662/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Emily Hale for her  service to the House Committee on Energy and Commerce.\n\nA Louisville, Kentucky native, Emily graduated with a Bachelors of  Arts in Political Science from the University of Kentucky in 2024.  During her time in college, Emily volunteered her time as…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…individual who lives on their  Social Security will have more money in their pocket because they won't  have to pay taxes on that--we exempt taxes--or the waitress in Glasgow,  Kentucky, who won't have to pay taxes on her tips; or the farmers in  Owensboro who will be able to pass their family land down to their  family because of the death tax exemption…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Kentucky. Mr. Speaker, I offer a privileged resolution  and ask for its immediate consideration.\n\nThe Clerk read the resolution as follows:                                H. Res. 874…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696746/expressing-the-profound-sorrow-of-the-house-of-representatives-on-the-death-of-the-honorable-richard-b-cheney"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Speaker, I rise today to recognize Frank Esten Cook  III and his service to his country. Frank was born in Washington, D.C.  on March 25, 1963, and passed away in Richmond, Kentucky on September  13, 2025. He was an avid outdoorsman, boater, and hunter.\n\nFrank was a U.S. Army veteran and served his country as a  commissioned officer. His first love, however,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Harrison, Wisconsin.\n\n(58) Hochatown, Oklahoma.\n\n(59) Green, Ohio.\n\n(60) Rochester, Wisconsin.\n\n(61) Quartzite Township, Minnesota.\n\n(62) Frederick, Colorado.\n\n(63) Camargo, Kentucky.\n\n(64) Wheatfield, New York.\n\n(65) Mauldin, South Carolina.\n\n(66) Josephine, Texas.\n\nMr. Speaker, the Postal Service structures the delivery of mail  around ZIP Codes, five-digit…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…make progress, continue to fight back, and will continue to save lives.\n\nMr. Chair, I again thank the chairman of the Committee on Energy and  Commerce, the gentleman from Kentucky (Mr. Guthrie), for his leadership  on this legislation. Let's fix it. Let's promote treatment before  tragedy, and stop the drug poisonings.\n\nMr. Chair, I thank the gentleman…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691887/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…rise today to recognize the  contributions of Mr. Charles ``Charlie'' Webb. Charlie graduated high  school in Colorado in May 1970 and in August 1970 reported to Fort  Knox, Kentucky. for Basic Training and Advanced Individual Training at  the Armor School. He was assigned to the 2nd Armored Cavalry Regiment  in January 1971 in Bind Lach serving as border…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…remember what the  Secretary said, he said he is for the best of the above. There are  areas where the Sun shines and the Sun shines bright, and it shines  bright on my old Kentucky home. There are areas for that. There are  areas where solar makes sense, where wind makes sense, and where fossil  fuels make sense.\n\nWhen he says best of the above, he doesn't…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I rise today in strong support of my bill,  H.R. 1276, to remove restrictions from a parcel of land in Paducah,  Kentucky.\n\nIt is an honor to serve the people of Paducah and McCracken County in  Congress. One of their community's most impactful institutions, the  Oscar Cross Boys & Girls Club…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}]