[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Eastern Pacific, striking boats in the Caribbean. Not a single  oversight hearing--not one. That is our responsibility, and we failed  it.\n\nAnd now we are failing on the third key provision, which is that it  is Congress that carries the responsibility for declaring war or  authorizing war, not the President.\n\nSo this week, due to the resolution being…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…capacity or funding to meet that obligation.\n\nLastly, we have to note that the Trump administration is in the  process of trying to abolish the Department of Education, with key  responsibilities being shifted to other agencies. We are left with a  chaotic patchwork of authority and no one apparently left to actually  administer the provisions of this…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…national strategy on spectrum and represent our country at the ITU  World Radio Conference and other technical conferences.\n\nThis is important because this technical work is key and underpins  our U.S. competitiveness and national security and paves the way for  new technologies to thrive through the reallocation of spectrum,  spectrum like 6G, and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…health providers leave the VA in droves.\n\nThis announcement by the VA Secretary makes clear that the VA,  essentially, is bleeding employees across the board. And the loss of  key people includes clinical staff: doctors, nurses. There are already  40,000 vacancies. How can the VA possibly recruit talented, skilled,  dedicated employees when they know…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…flippant, poisonous quip that we will have Greenland one way or  another. As a member of the Committee on Foreign Affairs, I have met  with the Prime Minister of Denmark and other key allies. They believe  in America's global leadership. They have fought and died alongside us  in Iraq and Afghanistan.\n\nNow, they fear our words. They plan for a future in which…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…louder voice when it comes to development of SEC regulations that  directly apply to them.\n\nDemocrats worked to secure important language, ensuring investor  protection remains a key focus of the bill. It balances the needs of  facilitating capital formation and, of course, protecting our small  businesses, which are so critical and are the lifeblood of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693959/small-entity-update-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…are toy manufacturers. They talk about what has happened to  their companies on the radio. They are concerned about what might  happen for them during the Christmas holidays, a key time of year for  their businesses.\n\nThe Trump administration didn't pay any attention to that. In fact,  he just moved forward with the tariffs that he put in place. He did…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…2021, and the acting Assistant Secretary for ACF  from February to May 2017.\n\nThrough her work overseeing a budget of more than $70 billion for  ACF, Ms. Barlow has played a key role supporting the programs and  services that provide critical assistance to vulnerable populations,  including Head Start and Child Care services for millions of children…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…gathering--to discuss the climate crisis. In the facility where we  were, the kind of main intersection where the two big aisleways crossed  was occupied by China, at one of the key corners, with a huge  delegation, a very big pavilion, lots of activity and crowding, and all  of the different countries that were there seeing the leadership of  China--our…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…in the Pacific Islands region. Much of the previous versions  of the BLUE Pacific Act has been enacted or implemented as a result of  our efforts in previous Congresses, but key provisions remain and are  included in this version, in addition to provisions from other  bipartisan U.S.-Pacific Islands bills introduced in the 118th Congress,  including…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…assisting  families in need.\n\nThe club is led by President Alan Gray, President-elect Anne Murphy,  Vice President Jeffrey Landsman, Immediate Past President George John,  and other key officers: Greg Arcaro, Christian Fassetta, Philippe  Charles, Matt Koppe, Alix Schnee, and many more.\n\nFrom the floor of the House of Representatives, we salute the Rotary…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…has framed its stance as       necessary for maintaining security along its border with       Libya.\n\nStill, Sahad argued that addressing runaway foreign       influence was key to unlocking progress on other fronts,       including reconciling the split nature of Libya's governance       and paving the way for U.S. investment in Libya's resource…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…actions of the U.S. Government impact the structure, operation,  efficiency, and security of U.S. supply chains, and the Office of the  U.S. Trade Representative (USTR) plays a key role in developing and  coordinating the implementation of those trade policies and actions.  USTR can provide valuable input to the Supply Chain Resilience Working  Group,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692998/promoting-resilient-supply-chains-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President's effort to  use trade policies to benefit his friends and himself at the expense of  American families.\n\nHe has used trade to prop up Argentina's President before a key  election because that country's President has said nice things about  President Trump, hardly the basis for a fundamental economic decision  affecting the life of every American.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…solution. These centers connect students to  local populations, which helps facilitate future engagement and boosts  care in our communities. That has been and will continue to be key as  we fight to ensure every Nevadan has access to the health care they  need.\n\nThe AHEC program has already trained millions of health care  professionals. Across our state,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689206/recognizing-national-area-health-education-centers-week"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…appreciate her passion on the issue.\n\nThe section 1115 waivers are important to the Medicaid program.  States are the laboratories for democracy. Section 1115 waivers provide  key State flexibility to test new authorities and ideas in the Medicaid  program.\n\nIn substance use disorder alone, 1115 waivers were pivotal in early  efforts to lift the IMD exclusion,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Speaker, I rise today in strong support of H.R. 3301, the ELEVATE  Act, and thank Congressman Nunn for his leadership on this forward- looking and bipartisan bill.\n\nOne of the key successes of the JOBS Act of 2012 was the creation of  emerging growth companies, or EGCs, small and midsized firms given  tailored disclosure requirements to encourage them…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692762/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Representative, support the availability       of critical goods from domestic manufacturers, domestic       enterprises, and manufacturing operations in countries that       are allies or key international partner nations.\n\n(6) Assist the Federal Government in preparing for and       responding to supply chain shocks to critical supply chains,       including by…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…respond to the immediate threat raised by Hamas' failure to       uphold the terms of the ceasefire. Forced to respond to a       resurgent Hamas, Israel must replenish stocks of key defense       articles to fight and destroy Hamas, maintain its Qualitative       Military Edge in the region, and continue to deter broader-      scale regional conflict.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…survivors of these appalling crimes.\n\nTo date, the Oversight Committee has released more than 65,000 pages  of documents, issued 13 subpoenas, and conducted interviews with two  key witnesses, both of whom were Republicans.\n\nThe Trump administration has provided us with Department of Justice  materials and access to suspicious activity reports. Unfortunately,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…that this bill does  not do that. The bill increases support for public safety and justice  through Indian Country and provides over $8 billion to the Indian  Health Service for key healthcare programs, prioritizing Federal  investment where it is needed.\n\nWe need to pass this bill that efficiently invests in our priorities,  supports the programs our communities…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…is tailored to the needs of rural America.\n\nAs someone who spent a lifetime in business, I know that getting the  correct information to the right people at the right time is key. This  bill will ensure disaster survivors in rural communities are not left  in the dark when they need help the most.\n\nI urge all my colleagues to vote for H.R. 804, and I…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…global competitiveness of the United States in attracting       foreign direct investment from responsible private-sector       entities based in trusted countries and addressing key       foreign trade barriers that firms in advanced technology       sectors face in the global digital economy.\n\n(b) Specific Matters To Be Included.--The review conducted…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…servicemembers suffer  from PTSD, and over 40 percent meet the criteria for alcohol use  disorder.\n\nMeanwhile, access to mental health support remains limited,  especially in key military regions. Recognizing the need to address  this reality is a step in the right direction, but we can and must do  more to equip our military personnel to continue being…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…investigations.\n\nOne particular accomplishment of note was his use of advanced  technology, complex search warrants, social media searches, and  multiple agency coordination to identify key suspects to bring a high- value theft ring spanning across northern California to justice.\n\nDetective Wolfe's commitment to his role and public safety is evident  by the various…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…strength, and moral clarity, and I urge my colleagues to  support it.\n\nMr. Chairman, while the FSGG bill contains many important provisions,  I would like to touch base on one key provision that is important to  the folks back in North Carolina.\n\nThis bill is about accountability, and nowhere is that clearer than  in how it addresses the United States…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…the  National Association of Home Builders, where he has been relentless in  advocating for policies that strengthen the construction workforce and  help make homeownership, a key tenet of the American Dream, possible.\n\nGenerous in sharing his time and talent, Carl served as president of  the Wichita Area Builders Association and the Kansas Building Industry…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688140/recognizing-carl-harris"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…their  specific process for finding potential foster families and recruiting  and retaining them in the foster care system.\n\nThe legislation also authorizes the evaluation of key data to ensure  we identify what efforts have been successful in expanding the  availability of foster families.\n\nI thank Representatives Feenstra and Boyle for introducing…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the Biden-Harris administration  threw open the Federal checkbook, funneling billions of taxpayer  dollars to private nonprofits like Family Endeavors Incorporated,  Southwest Key Programs, and Global Refuge. These NGOs didn't just  shelter illegal aliens. They pampered them.\n\nThose contracts paid for luxury hotel rooms, room service, 24-hour  snacks,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…tax forms filed for tax year 2023.       We assessed the reliability of all data sets by performing       electronic tests to determine the completeness and accuracy       of key fields. We also reviewed agency documentation and       interviewed knowledgeable agency officials about the       reliability of the data. Overall, we found that the data were…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]