[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "I hope my Republican colleagues are ready to explain why they gave  the ultrawealthy a $250,000 tax break--you heard that right, a $250,000  tax break--while gutting Medicaid--a gut punch to people who depend on  Medicaid to be able to get the care they need for themselves or for  their kids, maybe some other loved ones; the same Medicaid which helps  cover the births of nearly half of America's children.", "title": "-9999", "date": "2025-07-30"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "They all shared stories of their kids with special needs or that they  were simply allies.", "title": "Cuts to Medicare and Medicaid", "date": "2025-03-10"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Have you seen your kids or grandkids lately?", "title": "Disrupt Explicit Forged Images and Non-Consensual Edits Act of 2025", "date": "2026-01-13"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Speaker, today I rise to honor Beverly McNeff, the  co-founder of KidSingers, an after-school youth chorus program for kids  in Santa Ana.", "title": "Recognizing Diana Anahi Barrios", "date": "2025-06-05"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "Speaker, I rise today with great pride to  celebrate Burbank American Little League, a beloved youth organization  in my district which started in 1954 and currently serves 350 kids,  ages 4 through 16.", "title": "Congratulating Burbank American Little League", "date": null}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "When kids are starving,  their organs break down, and they cannot digest conventional food.", "title": "Lifesaving Food Aid", "date": null}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "If you cut Medicaid, public school kids with special needs won't get  the targeted resources that they need.", "title": "Medicaid Benefits All of Us", "date": "2025-05-14"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Speaker, today, thanks to the persistence of the American people,  because millions of constituents have called their Members of Congress,  shown up at townhalls, shown up and marched in the streets, because of  parents who spoke out for their kids, for doctors who spoke out for  their patients, neighbors who mobilized together, today, Congress has a  chance to vote for Americans' healthcare.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "They have two young  kids, and now they are being forced to rethink everything because this  administration--this administration--kicked them to the curb.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "For decades, families have been promised the right to send their kids  to good public schools, regardless of how much money they make or their  child's disability.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "I don't think your kids or mine would have touched it.", "title": "Usaid", "date": "2025-03-03"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "These are  young adults who, as kids, were on your Little League team or in your  Girl Scout troop.", "title": "Daca", "date": "2025-07-30"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Kids can't learn if they are hungry, if  they are homeless, or if they are sick.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Tips are how  Nevadans pay their rent, cover their groceries, take care of their  families, their kids.", "title": "No Tax on Tips Act", "date": "2025-05-20"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "They will take away basic food assistance from millions of  veterans, seniors, and kids.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "It is money we borrowed from countries like China to spend  that is a debt to our kids.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "They raised 2 kids and have 2 wonderful grandchildren.", "title": "Recognizing Congressional Patriot Award Recipient Thomas Mccall", "date": null}, {"senator": "John Kennedy", "party": "Republican", "sentence": "For kids in China who just got out of  college, their unemployment rate is 25 percent.", "title": "The Economy", "date": "2025-12-03"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "If you are forced  to work overtime and have to keep your kids in childcare, it is going  to cost you more.", "title": "Providing for Consideration of H.R. Protecting Prudent Investment of Retirement Savings Act; Providing for Consideration of H.R. Flexibility for Workers Education Act; Providing for Consideration of H.R. Empowering Employer Child and Elder Care Solutions Act; Providing for Consideration of H.R. Tipped Employee Protection Act; and Providing for Consideration of H.R. Save Local Business Act", "date": "2026-01-13"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "However, for able-bodied adults without kids, yes, you should try to  work, just like in the 1990s, just like under President Bill Clinton.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "This is a strong statement by the Congress in opposition to the  mutilation of kids.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Speaker, you have kids.", "title": "Debt, Deficits, and Demographics", "date": "2026-01-21"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "I represent hardworking Americans  playing by the rules, doing everything they can right--paying their  taxes, raising their kids, and taking care of their neighbors whose  lives were impacted substantially by Hurricane Helene that hit last  year.", "title": "Outrageous Government-Funded Incentives", "date": "2025-05-06"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "Pallone, and, especially, Chairwoman Dingell for their steadfast  advocacy for these kids.", "title": "Mikaela Naylon Give Kids A Chance Act", "date": "2025-12-01"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "I would hope you would realize by looking at  these facts that you should throw the DEI ideology being taught to our  college kids, and in some cases taught to our high school and middle  school kids, in the garbage.", "title": "Diversity, Equity, and Inclusion", "date": "2025-04-07"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "1069, the Promoting Responsible Oversight To Eliminate Communist  Teachings for Our Kids Act, in order to protect our kids and to protect  our country.", "title": "Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act", "date": "2025-12-04"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "This Act may be cited as the ``Whole Milk for Healthy Kids       Act of 2025''.", "title": "Whole Milk for Healthy Kids Act of 2025", "date": "2025-12-15"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "That is how you  give our kids and your retirement a future.", "title": "Math Always Wins", "date": "2025-06-10"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "It is rare that it is a stranger offense with little kids.", "title": "Crime Victims Fund Stabilization Act of 2025", "date": "2026-01-12"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "According to the nonpartisan Congressional Budget Office, of the 7.8  million people Democrats say would lose coverage, 4.8 million are able- bodied adults with no kids who could work, but don't.", "title": "Medicaid Should Serve the Truly Needy", "date": "2025-06-25"}]