[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…apparatus needs  bold and systemic change, and may that change be a system centered in  compassion, not cruelty; entrusted to competent officers, not  kidnapping traffickers and killer thugs, and bent toward justice, not  broken by ICE.\n\nMr. ESPAILLAT. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMr. ESPAILLAT.  Morrison).\n\nMr. ESPAILLAT.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…talk to the  Republicans in the Senate and tell them not to move forward on this  folly.\n\nRepublicans call their bill a tax break, but, in reality, it is a tax  hike and a job killer, except for China, where it is a job creator.  China wins; America loses.\n\nIn the coming days, Americans will take a look at the Republicans'  Big Beautiful Bill and discover…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…breath without being truly  free. I pray that the ongoing Nakba against the Palestinians will end  and one day they will be free.                      Sneaking In Nonprofit Killer Bill\n\nMs. TLAIB. Mr. Speaker, I want to talk about something that is  happening right here in our backyard in regard to the Congressional  Mamas Caucus.\n\nAs a mother, I am…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…senior Senator from Utah posted after the shootings  was reckless and beneath the dignity of his office. For a Senator to  fan the flames of division with falsities while the killer was still on  the loose is deeply irresponsible. He should take down his post  immediately and apologize to the families of the victims.\n\nAnd this isn't even about politics.…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…planning to propose to Sarah next  week in Israel.\n\nThey were cruelly taken from us far too soon at the beginning of  their lives. May their memory be a blessing, and may their killer be  brought to swift justice.\n\nIt is a tragedy that these innocent lives were cut short by hate, and  it continues to be a tragedy that these incidents continue to occur in…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…district,  was shot and killed in a Taco Bell drive-through. She was picking up  dinner for her family.\n\nWhy did Megan Keleman have to die that day? The system failed her.  The killer should have never had a gun.\n\nAgain, why did Megan Keleman have to die that day? She didn't.\n\nMaybe if there were less cowardly people in office, Megan would be  alive, living…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692027/observing-gun-violence-awareness-month"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…friends and family know that the Minnesota community is  here for them.\n\nFinally, I thank the men and women of law enforcement who worked  tirelessly to apprehend this deranged killer and bring the episode to a  close.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…remain with us today.\n\nI am also thankful to all of our brave law enforcement officers in  Minnesota, along with our Federal partners who were able to locate and  capture the killer, ending his brief reign of terror on our State.  Without their quick response, there may have been many more victims.  Thanks to their dedication and professionalism, justice…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, did you know that 1 in 50 Americans  is living with an unruptured brain aneurysm? It is a silent killer  hiding in plain sight. Most won't know it is there until it is too  late.\n\nToday, I rise in recognition of Brain Aneurysm Awareness Month and to  highlight the lifesaving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695612/recognizing-trinity-love-hoblit-foundation"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Hope, who then called 911.\n\nThankfully, Yvette Hoffman has been released from the hospital while  John remains in serious but stable condition. He remains in our  prayers.\n\nThe killer, still disguised as a law enforcement officer, then  stopped at the homes of two other Minnesota lawmakers, one whom was  fortunately not home, and the other who was perhaps…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Sarah's life back, but her death should not be meaningless, relegated  to headlines with no action. It is not too late to look back on the  flawed decisions that allowed her killer to enter the United States in  order to correct these mistakes and to prevent future harm.\n\nFurthermore, this crime at the hands of an Afghan national parolee  was not a one-off…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…call to  pray, a call to talk, and a call to engage.\n\nIn Kitara's own words:\n\nNo matter how many differences we have, we have one thing       in common, and that is the serial killer in our community       named fentanyl, and we can all rally behind that.\n\nMr. Speaker, let us join her in this fight in honor of Gabriel and so  many others and work together…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690498/recognizing-gabriels-challenge"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…this case.\n\nDespite knowing the danger the alleged murderer posed, for 40 hours,  officers across numerous departments and agencies worked tirelessly to  locate and stop the killer before he could strike again. Their courage  and professionalism prevented further loss of life, and they deserve  our deepest gratitude.\n\nWe stand with the people of Minnesota.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…ability to bring legislation  to the floor on election integrity and also to call out rogue judges,  and yet they chose at this point in time to tie this discharge petition  killer to this rule that would also permanently paint me and the  Members supporting it, and I would like to also share that I am one of  the most conservative Members of this body,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…came to Congress, I have worked nonstop to make this a  reality. Every year, I have introduced legislation to preserve stepped- up basis and to stop far-left Democrats' farm killer tax. For decades,  stepped-up basis has protected families from being forced to pay  capital gains taxes on inherited assets.\n\nPresident Biden tried his best to remove this…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…January, two college students in Illinois named Katie Abraham  and Chloe Polzin were killed in a hit-and-run crash involving an  illegal alien who was drunk driving. Their killer, an illegal alien  from Guatemala, was charged with leaving the scene of a crash resulting  in death, aggravated driving under the influence of alcohol, and  reckless homicide.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for Charlie and  his loved ones, so too do I pray for our country.\n\nWe are in a perilous moment. We don't yet have all the facts about  yesterday's horrifying events, and the killer remains at large. What we  do know is that political division has continued to deepen in this  country and that political violence is on the rise.\n\nWith a loss this profound,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…seen and unseen.\n\nToday, Vietnam veterans across my district and across the country are  still fighting. This time, the enemy isn't on a battlefield overseas.  It is a silent killer, bile duct cancer, caused by a parasite known as  the liver fluke.\n\nMultiple studies have confirmed what these veterans have suspected  for decades. Those who served in Vietnam…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…day out.  Imagine pulling a car over on the side of the road and not knowing if  it is just a lady or a man who had a little bit of a lead foot or  whether it is an escaped killer who is going to gun you down.\n\nThat is the danger that the men and women of law enforcement face  each and every day.\n\nIt is easy for us to come here to Washington, D.C., and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "John James", "party": "Republican", "sentence": "…it impossible for tens of thousands  of trucking companies to do business because they are unwieldy and  inconvenient.\n\nThis policy is unsustainable, unrealistic, and a job killer. Most  importantly, it will end lives. Telling the Michigan trucking industry  and all other industries that they are willing to move forward with  this policy is unacceptable.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]