[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Why are all the billionaires  getting together? They are getting together because they don't want to  pay more taxes. They want to get rid of employees who are providing all  kinds of services to the constituents of this country in order for the  richest people in the country to pay less taxes. Well, all of them run  companies that will directly benefit…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…why.''\n\nI thought about that lesson as I went to these townhall meetings. The  actions that are being taken by my Republican colleagues and this  administration are providing all kinds of opportunities for friction to  be created among us.\n\nProviding tax breaks to the wealthy while cutting billions of dollars  of lifesaving healthcare for millions of Americans…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…people, the ``other.'' His efforts to round  up thousands and thousands of people he views as ``the other'' on  spurious charges and without due process are sweeping up all kinds of  people, including children, and they are hurting our country, hurting  our economy, and hurting my Commonwealth.\n\nI would like to start with what the President has said.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…those tax cuts for  the very wealthy--those permanent tax cuts--they had to cut healthcare  in America. They had to, in order to make the math work.\n\nBut we know that those kinds of cuts could potentially shutter  hospitals, particularly in the rural parts of my State. Community  health centers could close. Every hospital I have talked to is talking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and scrutiny.\n\nI think we also share a respect for Sam Brown's service to our  Nation. As a veteran--as a decorated veteran--who has earned  appreciation for his service, the kinds of qualifications he brings to  this office are impressive. But this nominee was advanced out of  committee by a 10-to-9 vote. So it is clear he does not have unanimous  support.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…purpose of the  Insurrection Act, and the modern-day realities of law enforcement.  Those realities are that police forces are the ones equipped and  trained to contain the kinds of potential threats in cities or towns or  States that purportedly Donald Trump wants to use the military to  quell.\n\nWell, the simple fact is, on the streets in those neighborhoods,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…bank, or other Federal institutions. A wholesale CBDC  is not available to the public but only to the banks and other  financial institutions. This bill would ban both of these kinds of  CBDCs.\n\nMr. Speaker, when Republicans raise concerns about CBDCs, they are  talking about retail CBDCs, but because they are so averse to knowledge  and averse to studying…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…couldn't  give me a straight answer, couldn't answer that question. He couldn't  tell me if he agreed with Donald Trump. He wouldn't say who won  Minnesota. He went through all kinds of contortions to avoid answering  the question.\n\nI mean, this is a simple question. That is shocking, Mr. Speaker. I  mean, you guys want America to trust you to write our…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…weekends, and he would leave  my rubber boots there to make sure I put them on because we were going  to go clean the barn.\n\nWe raised cattle. We raised sheep. We raised all kinds of animals.  After those animals eat, they make something. Some of us use it to  fertilize our land; some people call it manure. I won't refer to it as  the language that I…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…State. Out of that concern was born the first serious  program to require manufacturers to build cleaner cars and help control  air pollution. The auto industry had to build two kinds of cars--one  that would be for sale in the other 49 States and one that would meet  the stiff antipollution standards required in California.\n\nWe had other concerns in California,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…saying: Hey, we  can work this out at the State level.\n\nThe gentleman referred to California. There are States that are  regulating in the field as they regulate lots of different kinds of  medical treatments and procedures. Suddenly, we are going to turn the  United States Congress into a super-medical licensing board for the  entire country?\n\nThis is why…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…come home and wonder what will  happen in the event of a healthcare emergency--not even an emergency.  What will happen in the event of the flu, COVID, or any of the other  kinds of healthcare challenges that may arise?\n\nSo the net result here in human terms is couples forgoing children,  grandparents losing independence, people seeing preventable deaths,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…this product is  sent here as an AGOA trade preference product. Our trade laws should be  clear and not put our workers at a disadvantage by forcing them to  compete with these kinds of practices.\n\nAGOA cannot undo the immense harm that President Trump has already  inflicted, but if properly structured, it can strengthen democratic  rights and environmental…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…believe. PEPFAR was established by  President George W. Bush and has saved more than 26 million lives,  while slowing the spread of HIV/AIDS around the world. Cutting these  kinds of funds is another death sentence for children and women who  depend upon lifesaving medication that costs us just pennies.\n\nIt cuts $1.3 billion from humanitarian assistance,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692526/rescissions-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…tariffs should be struck down. We  should go back to basics, which is that when we deal with tax policy,  it is the power of Congress that prevails in terms of making those  kinds of decisions.\n\nThe harm that has been done to the economy, the middle class, and  working families because of the Trump tariffs, which, again, were just  unilaterally and indiscriminately…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…party. Audio or video data of  personally identifiable or confidential information could be stolen  and/or used without the owner's knowledge. That could lead to scams or  other kinds of harms.\n\nPeople need to know all the functionalities of their appliances  before bringing them home. This bill makes that possible.\n\nMr. Speaker, I thank my colleague, Representative…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, this bill is really simple. Don't spend money on stupid  things, and don't subsidize biased media.\n\nThere are all kinds of media that are biased. They can take care of  themselves. MSNBC proves that every single day.\n\nThink about the statement just made about NPR. Uri Berliner, an  award-winning…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692525/rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…are all  sympathetic to, moms and babies and new dads, there are already  discussions underway for expanding that. Now that this has started to  be discussed, there are all kinds of discussions around Capitol Hill  about other things that should be granted the ability to vote by proxy.\n\nMr. Speaker, I believe that if Members agree with me that  Representatives…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…around the world.\n\nHowever, because this proposal would seize liquid assets, would  demand 5 percent of an individual's net worth even though they are  assessing assets of all kinds, what that would mean for a startup that  has a very high paper value--based simply upon the way that startups  receive their valuation, for example, based upon a multiple…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…are risking their lives in the freezing cold to enforce  our laws, rather than the ones who are hell-bent on breaking it.\n\nI care about the people who are trying to get these kinds of monsters  who rape and murder our daughters out of our country, rather than the  ones who want to put their bodies on the line to keep them here.\n\nI care about the thousands…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "French Hill", "party": "Republican", "sentence": "…facilitate payments  and serve a large numbers of users.\n\nHowever, these products are not the same. They serve different  models, operate under different rules, and pose different kinds of  consumer risks.\n\nThis kind of regulatory overreach is bad enough on its own, but what  makes this rule especially concerning is the process by which it was  created. The…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…because they have got a digital ID. When  you look at the state of privacy and the amount of data the government  has on you, they know who you are, they can have access to all kinds of  information. Even the private sector has a lot of information.\n\nIf you look at what is being done today to aggregate that data, it is  not formally being done to establish…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…the Democratic side.\n\nMr. Speaker, I say, moving forward, while I am grateful for the  desire and the belief to tackle anti-Semitism, there is a time and a  place for those kinds of arguments. This was not one.\n\nI thank my colleagues for the resolution and letting us focus on the  importance of celebrating achievements that I was not aware of. I will…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…do you determine whether it is a rule or not? What is a  rule? What is not a rule? Because a lot of times, Agencies put out  guidance or they put out orders. They put out all kinds of things. The  Congressional Review Act is very specific. It says that you can only  take action on this when it is actually a rule.\n\nWell, there are two different ways that…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…process instead of enhancing their own  products and services.\n\nThe Democratic-led OCC rule was driven more by a progressive ideology  against mergers in all sectors of all kinds in the economy rather than  sound, rational policymaking. In fact, the Biden-Harris OCC did not  even coordinate with the other banking regulators, such as the Federal  Reserve…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the concern  about whether or not we are considering amendments when we don't have  the time to look at the amendment.\n\nI would also note that when we are talking about these kinds of  people, I went through a list of folks whom President Biden had  commuted.\n\nHere is another one. A Lubbock man, granted clemency by Biden, was  arrested. The sheriff was…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…sheriff, this Member of Congress, and what they do day in and day out.  That is what this resolution was about.\n\nThe other side, they want to come here and start talking about all  kinds of things I didn't intend to. You heard my opening statement. You  heard the gentleman's opening statement. However, the other side wants  to go start attacking things.\n\nOkay,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Artificial  Intelligence, and  the Internet and with the ranking member of the full committee here  today, it is our obligation to fine-tune the law so that, in fact,  these kinds of injustices don't happen. We are here today to fine-tune  the law to protect the Constitution and the intent of Congress for more  than 225 years.\n\nMr. ISSA. Mr. Speaker,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…U.S. Senate, puts  something out like this, it does have an effect on the parties that are  sitting at the table. And you don't really get to a resolution by  prodding on these kinds of things. You talk about what it takes to stop  the fighting, not what it took to get into it, not the actions that  were taken during the fighting. But if you want to stop…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…district in the  United States. The only singular district that has a larger big water  shoreline is Alaska, but that is all saltwater. That is the difference.  We catch different kinds of fish in those two different kinds of  waters.\n\nWhat we have in Michigan surrounding the lower peninsula and capping  the northern border of the upper peninsula before it…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693964/recognizing-the-achievements-of-the-alpena-community-college-remotely-operated-vehicle-team"}]