[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…than 100 days.\n\nRight now, Republican Senators are at a crossroads. Will they vote to  stop Trump's chaotic tariffs and save our economy, or will they  continue bending the knee to Donald Trump? That is the vote that we are  forcing tonight.\n\nWhen he ran for office, Donald Trump promised, over and over and  over, that he would lower costs on day one.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…corporate handout, this time to the biggest technical oligarchs  in the world. These folks have shown that if a person has enough money  and if they are willing to bend the knee, they can pretty much get  anything they want these days under MAGA Republican governance.\n\nEvery time we have tried to add protections and regulations to their  platforms that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…has directed. He is  picking winners and losers by withholding Federal grant funding for  programs like disaster relief and medical research unless people  basically bend a knee to his draconian demands.\n\nHe is picking winners and losers by firing nonpartisan experts in  programs that he doesn't like, and he is replacing them with people  whose only…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…they are trying to understand where they are  going to get affordable insurance.\n\nI heard from a woman in Spokane, she has a chronic lung disease and  recently fractured her knee. Her premium has gone from $723 per month  to $2,180 per month. Her only option, a plan with less coverage, has a  lower premium, but makes her liable for 30 percent of all…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Well, there is a reason why he is not consulting. It is because there  are too many pusillanimous politicians in Congress, people who have  decided that they will bend the knee and kiss the ring. There are  people who are afraid to speak not only truth to power but truth about  power as well. If you won't speak truth to power, I guess it is  farfetched…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…leadership shows courage. Real leadership shows  compassion. Real leadership shows commitment, working with Congress as  a separate and coequal branch of government, not to bend the knee to  some extreme agenda, which is what, Mr. Speaker, my House Republican  colleagues are doing by supporting this one big, ugly bill. Real  leadership requires working with…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…immediate loyalty test the  President of the United States has put forward. The President said: It  is a loyalty test. I want you to do this because I want you to bend the  knee to me.\n\nThat is not the responsibility of a Senator of the United States of  America, to bend the knee to the executive branch. The Constitution  gives us the responsibility…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in Oregon cyclone fence cages, wired  cages.\n\nI stopped in front of one of them, and it had a group of boys, lined  up from the smallest to the tallest. The smallest was just knee high to  the grasshopper, as we would say, just a little tyke, maybe 4 years  old.\n\nI see these kids looking out across the warehouse because in other  cages inside that warehouse…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…unlawful behavior, law firms like Perkins Coie,  Jenner & Block, Susman Godfrey, and WilmerHale; but a raft of other law  firms, like Paul, Weiss, Skadden, and Latham, bent the knee and laid  down because they were too afraid of this administration destroying  their businesses.\n\nI mean, here are a number of big, bad, powerful, wealthy law firms  that can't…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…immigrant  communities to score cheap political points, forcing the SBA to close  or relocate offices in cities like Los Angeles, my home, simply because  we refuse to bend a knee to the President and to MAGA Republicans'  anti-immigrant agenda, which is about retaliation, not good governance.\n\nImmigrants start businesses, and do you know what? They hire…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691941/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…want to clarify something for some of my  colleagues and for leaders across this country because there seems to  be some confusion. There is a big difference between taking a knee and  bending a knee.\n\nTaking a knee shows that you can hold many truths at once, you can  love our country and believe that there is still more work to do. It  shows that you…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689224/repealing-green-subsidies"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…government, there is tyranny. When       the government fears [its] people, there is liberty.\n\nWhat is so disturbing when you see a Member of this body thrown to  the floor, a knee on his shoulder, arms being wrenched behind him after  he has identified himself as a U.S. Senator is literally what Alex  Padilla said.\n\nI am going to pull from what I know…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…intimidation is in place, some of them turn to that as an  alternative, but a public broadcasting station cannot do that and  maintain its credibility. It can't go hat in hand and bent knee to  this administration or to any administration and maintain its  credibility when it comes to news.\n\nSo they have a terrible challenge that they face. I want to help them…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…country micromanaging academic departments at major  universities to ensure that academic work aligns with the regime.\n\nNow, having successfully forced Columbia to bend the knee and quell  dissent on their campus, Trump is targeting other universities. Some of  them will sign similar agreements giving President Trump power over  those campuses. But,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Constitution, some of our most elite and  powerful individuals and institutions are  failing to defend our democracy. Some of our Nation's most powerful law  firms have bent the knee. Some of our finest universities are buckling.  Some of our most powerful CEOs have capitulated. Some of our largest  media companies are simply surrendering.\n\nIf those with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…MRIs, X-rays, ultrasounds, and CTs there  are. We have some numbers that look like it could be as much as $25 to  $35 billion a year.\n\nDo something crazy. When you get your knee MRI, Mr. Speaker, put the  data, the images on this so when you go to the next doctor a week  later, it is right there: Doctor, let me hand it to you. Not get  another scan.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…just in Medicare, duplicative MRI scans, PET scans, X-rays, and  ultrasounds could be as much as $25 billion a year, duplicative scans.  Mr. Speaker, what if you have your knee scanned and attached it to this  thing so it is portable with you? That is one-quarter trillion dollars  over 10 years. Is that a cut? No. It is just a simple use of almost…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…they want to wipe you off the planet. And if  you are a Muslim and you don't agree with them, which most don't, they  want to take over the entire faith and make you bend a knee to their  view. These people are religious fanatics.\n\nWhat is this all about? Religion. Do you want any of these people to  have a nuclear weapon? I don't. They are religious…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…need your help. We need your intervention.\n\nI am always proud of a group of students at a high school football  game that finish the game or that start the game just taking a knee to  be able to pray for each other, pray for safety, and then go out and  hit each other as hard as they possibly can on the football field. But  it is always fun for me to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…projecting American weakness to the world. Under the  previous administration, America turned away from policies that had our  adversaries quaking in their boots and instead bent a knee to the axis  of evil. Make no mistake, China, Russia, and Iran are exerting  influence across the globe that is causing harm and posing major  threats to both the United States…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…That is why I get so irritated--``irritated'' is the wrong word-- angry when I find out that people take advantage of the American  people's generosity. It makes me want to knee someone in the groin. It  just makes me furious, and I think the American taxpayers feel the same  way.\n\nWhat I am about to tell you, Mr. President--let me apologize in  advance--is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…in the Marine Corps to serve  his country. During his second deployment to Afghanistan, he was  gravely injured by an improvised explosive device, losing both legs  above the knee.\n\nDespite these injuries, Josh returned home to continue to serve,  founding Angel Peak Adaptive Sports with his wife, Samantha, to help  other wounded veterans and athletes…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}]