[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…who, when asked: Well, when we give these literacy tests, how will we  know if we don't explicitly say that it is on the basis of race?\n\nThose delegates had an answer. They knew it would be up to the person  implementing the literacy test, just like with my great-grandfather, to  determine whether the questions were right or wrong and if they  answered…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…series of questions: Give us the  evidence that these boats were actually carrying narcotics. Give us the  legal rationale for striking them without coming to Congress. If you  knew where they were enough to strike them, you could have interdicted  them. Why did you choose to strike them and not interdict them? We hear  that drugs are now at the bottom…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…numbers. They are children, they are families,  they are grandparents, people with disabilities, your neighbors, your  friends, and probably you at some point.\n\nRepublicans knew the consequences. There was no mystery here. They  knew the data. They chose cruelty. These cuts are cruel, and they are  stupid. They are dumb because we all know that preventing…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…manufacturers didn't want this. They largely  rejected this move by President Trump  and didn't produce showerheads that exceeded the limit that existed.  That was because they knew that consumers value money-saving and water  conservation showerheads that are good for both their wallets and the  environment.\n\nEnergy and water conservation standards, Mr.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Madam Speaker, for decades, Jeffrey Epstein's  abuse was an open secret powerful people knew. Agencies knew. Some in  government knew. Yet, year after year, he continued to operate in  trafficking, exploiting, and destroying the lives of children and young  women.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…hospital near Buffalo, and then, because she saw the  dedication of those VA workers, she became an employee. She worked  really hard. She was dedicated to the veterans. She knew she could  probably make more money in another job. But she got home one Friday  night and saw on her computer ``You are RIF'd''--which means you are  fired--with no reason…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…delayed  retirement processing at OPM, at Federal agencies, and at payroll  providers across the government. These delays are not isolated. They  are systemic.\n\nThe administration knew these retirements were coming. It was part of  the DOGE plan, but once again, the administration was not prepared for  what came next. As a result, Federal retirees faced delayed…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699549/restoring-retirement-processing-for-federal-workers"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…The CIA has reportedly warned about G42's working closely with  blacklisted firms like Huawei that are tied to the Chinese military.\n\nNow, President Trump is denying that he knew anything about the  secret deal. Oh, please. President Trump's own son signed the deal for  half a billion dollars. An initial payment of $187 million was  reportedly directed…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Garcia, a  DACA recipient in our community and to tell you little bit of his great  story.\n\nCarlo was brought to the United States as a child. In his early life,  even then he knew he would have to fight and work hard to achieve the  American Dream. He worked as a janitor to help to support his mother  and his young siblings while he continued to work…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…in the room and have more voices heard too. There could have been a  robust, healthy, political, and democratic negotiation. But, no, Big  Oil chose not to do that because it knew it had a fast lane through  this body.\n\nThey had another alternative, which is to amend the Clean Air Act or  the Congressional Review Act to solve this problem. You could amend…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…and families are supported and protected--with no  exceptions.\n\nMelissa was the best of Minnesota. She cared about others, treated  everyone with dignity and respect, and she knew how to listen and lead,  As a public servant and as Speaker of the House, she left Minnesota  better than she found it. I will miss her dearly.\n\nAs we mourn the loss of Melissa…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…that has not gone away. I suppose the White  House and my Republican colleagues were hoping that it would, but it is  worse now than it was even then.\n\nIn fact, the Republicans knew this problem was coming all the way  back on January 20 when Mr. Trump first took office. To much fanfare,  they began moving forward with his legislative agenda, the big,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate Eagan Police  Chief Roger New on his retirement after thirty-one years with the  police force. From a young age, Chief New knew he wanted to be in law  enforcement. After graduating with a social science degree from  Concordia College he joined the Eagan Police Department as a Community  Service Officer…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…who will dearly miss him.\n\nCorey touched countless lives with his kindness, faith, and joyful  spirit. He leaves behind a legacy of love that will be remembered by  all who knew him.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…is what we saw with the growth of ISIS and the regrowth  and reconstitution of the Taliban.\n\nAnd in the long run, the country essentially just decides to wait you  out. They knew in Afghanistan we were going to tire at some point and  leave. So will the kleptocrats in Venezuela. They will play ball with  us, but at some point the warships are going to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…driving an electric  car. I thought you guys were really conservative.\n\nIs this where your heads are at? Sticking Nazi things on people's  windshields? There is no way they knew it  was my wife's car. She just has a little BASIS sticker, which is a  charter school my kids go to.\n\nThis is really the quality of conversation discourse of communication…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…who is  charged with a crime or convicted with a crime. And if you don't turn  them over, you would face punishment. That will stop illegal sanctuary  city policy. If people knew they would go to jail for breaking Federal  law, I think they would stop.\n\nYou have had weeks, and we are not even debating. You are never going  to change. If you want to have…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country, especially for students in  underserved communities.\n\nThe bill is so bad and disgraceful that almost 20 Democrats just  didn't even vote at all. They abstained. They knew it was terrible, but  they didn't want to go against their party, the Governor, or special  interests. They simply abstained from the vote.\n\nThis is a measure that absolutely…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…that role. I  will miss his service there.\n\nI will also miss the man that he was. He was an incredibly decent  man, a man of exceptionally high moral character. Everyone that knew  Doug would remark on his authenticity. When you met Doug, what you saw  is what you got. He was a man of deep kindness, never had a cruel or  unkind word for anyone in the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698729/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…depiction of an       identifiable individual who is not a minor if--\n\n``(i) the intimate visual depiction was obtained or created       under circumstances in which the person knew or reasonably       should have known the identifiable individual had a       reasonable expectation of privacy;\n\n``(ii) what is depicted was not voluntarily exposed by the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…ObamaCare. Let's remember the  original name that Democrats gave that bill when they created it. They  called it the Affordable Care Act. Only Democrats voted for it.  Republicans knew it was going to be anything but affordable. It was  going to interfere with the doctor-patient relationship. Unfortunately,  it has done that.\n\nIf we want to talk about affordable,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…certain activities, business activities, or  recreational activities to just see who would come in and ask for their  papers.\n\nRepresentative Roy, I am proud to report what I knew inherently that  that is all a lie. That is all propaganda meant to scare people and  meant to stop law enforcement from doing its job.\n\nI am so disgusted by the names that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…note, Juli Spitzer was truly one of a kind with a  personality as big as all outdoors.\n\nShe will be dearly missed by her husband, Hort; her friends; her  community; and all who knew her.\n\nWe take comfort in knowing that her legacy will be remembered for  generations by Wyomingites.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…any collective bargaining agreement signed before March 26,  2025.\n\nAfter Democrats lost the 2024 elections, the Biden administration  hurried to ink multiyear deals that they knew they would never have to  enforce, deliberately tying the hands of their successors and rewarding  union leadership on their way out.\n\nOne example is especially egregious: the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…granddaughter, Diana Del.\n\nTo his church and to his church family at First Baptist of Boulougne;  his brothers and sisters; and his many friends, nieces, nephews, and  neighbors who knew him, Carrol was the kind of man whose legacy is  etched not in headlines but in the lives he lifted.\n\nMr. Speaker, we say goodbye to a veteran, a man of character, a  family…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…on  the Athens community, with thousands praying for him following the  accident.\n\nMr. Speaker, our hearts ache for this loss. I pray for the  Whittenburg family and all who knew him. May God's perfect plan bring  them comfort.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…through our big one. This is an occasion where I promise  you that there is so much money involved. There is a reason other  Members of Congress have been unwilling to do what we knew was a  problem.\n\nA few weeks ago, I came here with the MedPAC reports. I don't know if  anyone ever bothers to read them, but you go through there, and it  should light your…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…district that had  been devastated by wildfires. I walked with him and looked at the  devastation, the despair of people losing their lives and everything  they had, and Doug knew them by name.\n\nHe cared. He cared about every Member of this institution, but, more  importantly, he cared about the people he represented. He cared about  their life, their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698739/9999"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…who  was from Ghana, wasn't even Coptic by birth. ISIS gave him a choice to  walk away or die. He chose to stand with his brothers, knowing exactly  what it would cost him. He knew it was better to die free than to live  under tyranny.\n\nThat is faith, Mr. Speaker. That is true freedom. For 45 days, ISIS  beat, starved, and tortured these men. They were…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688172/meaning-of-religious-freedom"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…LAWLER. Mr. Speaker, I rise today to honor the life of Layla  Elizabeth So, a remarkable young lady from Pearl River, New York, whose  kindness and creativity touched everyone who knew her. Layla passed  away on August 7, 2024, after a heroic 2-year battle with cancer.\n\nLayla grew up in Pearl River, New York. She attended Lincoln Avenue  Elementary, Pearl…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}]