[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…type of Trump coin-- cryptocoin--that is inducing these corrupt practices. It is called a  stablecoin. And a company associated with the United Arab Emirates  said: You know, we are going to buy $2 billion of your coins. And guess  what. You get to keep the value of everything earned on that $2 billion  deposit.\n\nEven at 4 percent, that is $80 million…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…some of them are  Republican districts.\n\nI think we all want to know, Black Americans, White Americans, Asian  Americans, and Latino Americans, all Americans want to know: Are you  going to cut their Medicaid? Are you going to cut their Social  Security?\n\nMr. Speaker, 140,000 children under the age of 19 and 40,000 seniors  over the age of 65 in my district…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…now don't even know if this country is for them.\n\nNews flash, all of these young people who I have been talking to are  U.S. citizens, American-born, who don't even know if there is going to  be a country left, who don't even know if there will be educational  institutions left because this proposal includes $330 billion in cuts  that will impact Pell…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…down in Texas put out  publicly that he is now going to launch a campaign against domestic  terrorist organizations in his own State. So it has begun.\n\nMeanwhile, we know what is going on in some of our American cities.  Trump  said that he would invoke, potentially, the Insurrection Act of 1807.  He has made more than 800 of our military generals fly…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…issue--when we  have these townhalls, we write down the questions that are asked. The  No. 1 issue is Medicaid because the people that have loved ones who are  on the program know it is going to be cut, know that they have nowhere  else to turn. That is why they are there at 8 o'clock or 9 o'clock at  night with their children when their children should be…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…those savings  either into tax cuts for the rich--I say ``either'' because they are  going to be putting them into tax cuts for the rich, but those tax  cuts, as we know, are still going to blow massive trillion-dollar holes  in our deficits.\n\nThey are trying to gut Medicaid and Medicare programs on which nearly  a third of our country rely, all to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…on the other side of the aisle so that they find it impossible to  muster the courage to speak out when they see something wrong and hear  something wrong and, you know, everything going against their morals-- they know it is wrong, but yet they can't speak out--they are  victims of this reign of terror, although I don't absolve them of  responsibility…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…and jovial the next. They are sleeping under the overpasses with  everything they own in a grocery cart. It is not enough to say: ``Get a  job, you bum.''\n\nWe don't know what they are going through. These are someone's  children, many of whom have suffered some catastrophic breakdown that  causes them to hear voices and to do things that they wouldn't…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…this.\n\nAnd frankly, to Americans back home, it is not a Democratic or a  Republican issue. The only thing they care about is getting those costs  lower. And they want to know who is going to step up and bring premiums  down. Who is going to lower costs?\n\nSenate Democrats say in one voice to Americans: We hear you. We have  a plan to bring your premiums…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…teens. However, if they  want to do the big fixes they have been talking about with respect to  healthcare, they are not going to be able to do it in 9 days.\n\nNow, I know they are going to try and do something to save face, but  at the end of the day, the extension is really the only realistic way  we have to go here.\n\nI have to say this: If they don't…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…said: Unfortunately, there is a political difference here. I won't  go into details. It will sound too partisan. But there are some Members  of the Senate, who, frankly, know you are going to have to pay twice as  much and really don't want to see changes made--let it go forward.\n\nI think that is unfair to her. I could give you her name, but I am  not going…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…State to be able to  comply with all these new rules and regulations, like, immediately?\n\nThis is about sowing chaos and confusion. My friends on the other  side know they are probably going to lose the next election, and they  are going to lose big. Rather than live up to the reality or respect  the voters, they are going to try to make up some conspiracy…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…even at low levels of exposure.\n\nWhile Americans struggle with the high cost of living and watch this  billionaire boondoggle bill try to get through the House, just know  what else is going on at the same time.\n\nThey are gutting the Clean Air Act, the bipartisan piece of  legislation that has stood us well for years and years. No Congress has  ever stripped…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…were building and, therefore, it was easier to sell to Congress  that one way to get more apartments online is to have these  ridiculously overgenerous credits.\n\nI don't know if I am going to have much of an impact. One of my goals  is I would like to have the credits renamed. Instead of the low-income  housing tax credits, name them the big banks, big…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…you just can't do this just  because you feel guilty--just because you feel guilty because the  United Kingdom at one time owned other countries.\n\nNow, look, I don't know what is going to happen. President Trump-- thank you, President Trump, for objecting to this. But I don't know  what is going to happen if Prime Minister Starmer, who is polling right…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…intelligence and the data centers to support it are going  to require a boatload of additional power. While we don't know the  exact amount of electricity we need, we know it is going to be a lot  more than we have today because our country is facing increased  electricity demand for the first time in 10 years. The appetite of AI  and data centers is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…taken away from her  because people were purposely put on the street who are dangerous.  There is no other way to look at that. That is literally what happened.\n\nI know that there is going to be a lot more conversation and speeches  about Charlie coming up, but I will close with this. In a 1981 speech,  which is hard to believe was almost 45 years ago,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…just say thank you Pastor Bjorge for making me  better.  Thank you for your ministry. Thank you for your testimony and witness.  I just wish his family well and just know that I am going to miss him.  I am going to miss him but grateful that I knew him.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is actually in the Constitution is actually number 5 in the spending  stack.\n\nYour government is functionally an insurance company with an Army.  You laugh, but you know you are going to quote that later.\n\nLet's actually sort of take a look. This is net receipts by category,  2024 compared to 2025. Hopefully, this will make sense. I am going to  put…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Afghanistan ends up in the hands of the Taliban.\n\nMr. Speaker, they will hate us for free. We do not need to give them  hard-earned American tax dollars. It is time we know what is going on  and implement a strategy to make sure this aid goes to those who need  it.\n\nI also thank my colleagues on the other side of the aisle for working  with us closely…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…they are going to object.\n\nWhy? I am really looking forward to hearing from my good friend from  New Mexico on why they are going to object, but I am pretty sure I know  why. He is going to tell me: Hey, we want to move more bills.\n\nWell, wait. You guys just told me 2 weeks ago: Pair the Gallego bill  with the Alaska Native Vietnam vet bill, and we…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, let's go back to the year 1919. We  had just 48 States. World War I had just ended but we called it the  Great War because we didn't know there was going to be another. Charlie  Chaplin had just released a short silent film called ``Sunnyside,''  before talking pictures would be all the rage. In this very Chamber,  the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…headed: If Congress does what it always does, Democrats are going to  put up a bill, and it is going to fail. They are going to put up a  bill, and they are going to know it is going to fail. The Republicans  will put up a bill, and it will fail, and everyone will know that that  bill will fail too.\n\nThen premiums will rise on January 1, 2026. The…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…discourage marriage as well.\n\nJust yesterday, I heard of another couple. They just had their second  child, but they weren't getting married. I didn't dig into it, but I  know what is going on when you have people like that not getting  married. They realize they don't want to lose their benefits.\n\nNow, the fact that all of these government programs are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "James Risch", "party": "Republican", "sentence": "…strides in that regard.\n\nAnd to my good friend Senator Sanders, this is not helpful to the  activities that are going on to try to get this resolved. You may think  you know what is going on, but I can guarantee with absolute certainty,  you do not know what is going on as far as the negotiations are  concerned to get this over with. What you are looking…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…down 2  years ago or 3 years ago. Why not? It was because Canada didn't have  the pressure put on them to do so. That is not a coincidence.\n\nMr. Speaker, again, do you know who is going to pay the price for  taking the pressure off of Canada? It is going to be  the constituents of my colleague, where 5,000 people a year die from  fentanyl overdose. If…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}]