[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…because of the free lunch program.\n\nI know that people might be distracted by the Qatar gift, the $400  million flying palace. Let's hope there are no bugs in it. I don't  know. I know people want to be distracted by all the other things that  seem to be coming out of the administration, but I don't want us to be  distracted by that.\n\nI want us to be talking…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…focused on that emergency will give him a chance  to pay those oil executives CEOs back.\n\nNow, this order is not a serious attempt at lowering anyone's energy  costs. And you know how I know this? Because a true strategy to lower  people's costs would include clean energy sources like wind and solar,  which this order deliberately excludes.\n\nSo what does this…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…toward the east coast. The funny thing  about those little pieces of soot created in fuel-burning powerplants  is they have no respect for State boundaries, none.\n\nI don't know why. You know, we have in Connecticut--as Rhode Island  and Massachusetts do--strong laws that protect our air and water. And  those pieces of soot, the nitrogen, the other pollutants…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…food stamps, loving that life, going to  the store, buying fancy stuff. It is $6 a day. The average nutritional  assistance amount per person per day is 6 bucks. I don't know if you  know this, but we have subsidized food in the U.S. Senate, not because  the government is paying for it but because all of the restaurants that  operate here don't have to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…within 60  days of this passage will lose the entire tax credit.\n\nThat is getting rid of the tax credit. No project can start in 60  days. That is  not how it works. They know that. They know that the clean energy tax  credits are popular. They know that the clean energy tax credits will  reduce costs for American families.\n\nSo instead of saying, ``Kill it…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…cure  for breast cancer. We have amazing scientists in this country who have  been researching this, and they are at the point of clinical trials.\n\nMr. Speaker, I don't know if you know anyone in your family who is a  survivor of breast cancer or any other kind of cancer. Oftentimes, when  you go in and the surgeon puts you under to take it out, they…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…know what the irony here is? President Trump could  actually be the person who does good in this. He can still change his  mind.\n\nSpeaker Johnson is a true Christian. I know him. I know his family.  He is a good Christian man. He can be for bringing justice. I really  don't understand why we are fighting over this. Why don't we do  something good for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694883/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…visits shortly. The  headline of People's Daily in Mandarin reads: Peace in Our time.\n\nThose are the unavoidable broader stakes of betraying Ukraine today.  I know my Republican colleagues know this. I know this because I have  heard them say it repeatedly over 3 years. I have heard them say it in  committee. I have heard them say it on this floor. I…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…favorable way to some,  obviously, but that is what it is there for.\n\nI beg you, Mr. President, that you would not dishonor the judiciary  in this country.\n\nHere is what I know: I know that you have the ability to say to a  judge: You have issued your court order, now let me see you enforce it.  That is my Justice Department--not Al Green's, the President's--that…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…You cannot take on some of the  world's biggest companies--the pharmaceutical companies--with bandaids  and a skeleton crew. That is not going to work. I think we all know  that. We all know this is really hard work.\n\nOn top of this, the firings threaten healthcare for the 170 million  Americans who get coverage through Medicare, Medicaid--which is so…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…funding away from our  public schools and using it to make investments in private schools.  Mrs. McMahon and others have tried to sell this as ``school choice,''  but we know--we know--that it is basically a voucher program that will  ultimately give private schools the ability to hand pick students and  close their doors to everyone else. Private schools…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…hold the gavels here. And, yes,  the Republicans control the White House; they control the Senate; they  control the House of Representatives and the American people know that  and they know who is at fault for where we stand right now; that we are  about 3 hours away from a government shutdown.\n\nThis is something that I take personally as someone who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…just  the individuals. We know there is real-life impact, and we see it. We  hear it in our offices. We are getting those calls. We are meeting with  individuals. We know them. We know them. They are our neighbors. They  are our friends. We know them when we are home.\n\nHere is what people forget, though. I know in Nevada we already don't  have enough…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…have continued to go up.\n\nNow, here is the beauty of the conversation we are having and why we  should be passing the temporary one to let us go back to work, and I  know this because I know his heart and I know your heart. There are  evidence-based, bipartisan amendments to that HALT Act that are widely  supported. My colleague's partner Senator from…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the opportunity to be here and be here with  my friend. Hopefully, we are going to be able to work on a lot of  issues because we do care about the cost of electricity. I know they  know we care about the cost of electricity.\n\nIf the Keystone pipeline is not going to happen, which by  Presidential fiat didn't happen, we have to worry about future  situations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…member and I, and our committee,  have chosen to come to this House floor to talk about some specific  housing measures. I want to make sure that the American people know  that we know that the supply of housing has to be financed. Some 60  percent of that is done by our local community banks and credit unions  spread across this country.\n\nDe  La Cruz),…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…somebody making $60,000 a year, not the billionaire.  If you say ``billionaire'' enough, maybe that shift worker won't know  what you are doing, but Mr. Speaker, they do know. They do know what is  about to happen because everybody is watching this vote. That is a good  thing because that shift worker deserves the extra money back.\n\nIt might not seem like…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…every 12 or 13 years.  These days families get new appliances about every 8 or 9 years. Maybe  it is because they are not as efficient as they used to be. I don't  know.\n\nHowever, I do know on one washer-dryer standard, according to the  data--I believe this was DOE data--there was a 46-year payback on a  device that was expected to last or be expected…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Mamdani were to be the President of the United  States, I assure you that there is no way that Mamdani is going to  receive Trump at the White House, period.\n\nHow do I know that? Because I know exactly how they operate.  Democracy is just a tool to get to power, period. People who love  freedom, we are just useful fools to be used in order to get to the…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…helping the  rich people. Or one of my favorite is they were arguing during the  budget vote-arama, as it was called, that this was going to affect  Social Security.\n\nThey know and we know that the law prevents Social Security from  being even included in these discussions. So how could it possibly be  true? It can't be true.\n\nSo we have to get this bill…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…behalf of our Nation at  home and abroad in defense of democracy--millions who have said: I will  risk it all so that my children and the children of others I don't know  and will never know may live free.\n\nFrom the very first shots at Lexington and Concord to the fields of  Gettysburg and Vicksburg, to the beaches of Normandy and Iwo Jima, to  the sands…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…should be a part of  NATO, he should talk to people like me who have an election certificate  and a vote in the U.S. Senate, because I know what he either doesn't  know or he should know, and if he did know, I can't imagine why he  would make the comments that he did the other night in a television  interview.\n\nLet me give you some facts about Denmark,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…things.\n\nIt gives me no joy to say this, but I was wrong. I don't know. As bad  as this multiple-vehicle pileup looks from the outside, you ought to  see it from the inside. I know you know what I am talking about, Mr.  President. The Republicans have voted 14 times to come out of the  shutdown. My Democrat friends have voted 14 times to stay shut down. I…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…for what he is doing.\n\nHowever, to see how the people in the Middle East and others around  the world who are there have respect for our President is refreshing,  to know that they know he is going to do what he says he is going to  do.\n\nHe is a strong leader. He is one who is willing to sit down and talk  to anyone. He is not afraid to sit down and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…not  where I come from, not in Missouri. People believe in common sense.  They don't think you should get to break the law like that and get away  with it.\n\nSo I don't know when--you know, I guess we will be back here in a  week or something, but the reality is not going to change no matter how  much Chuck Schumer tries to villainize ICE agents. No matter…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]