[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Mr.  Isaacman will bring a steady hand and clear vision to NASA.\n\nI hope we can partner together, all of us, to achieve this incredible  thing for the American people. I know it is time for us to return to  the Moon, and there is much at stake with international competition.\n\nI hope my colleagues will join me in supporting Mr. Isaacman on the  floor.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…aisle are writing countless letters right now to the Secretary of  Homeland Security demanding information so that we can do our job. That  is transparency.\n\nI don't know when the last time was that my colleagues were at the  border. I was just in San Ysidro a couple weeks ago. I can tell you I  went to the secondary inspection. Fentanyl is still coming…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…everyone, but when the fraudsters themselves claim to have the  fix, the American people see right through it.\n\nYet, DOGE's end does not mark the end of our work. We know that the  time to organize is now, that we must stay focused and resist the  barrage of distractions designed to sap our resolve, that we must  continue to mobilize like our democracy…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697304/ode-to-doge"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…research and  development. You can't have incredible manufacturing and incredible  innovation without scientific research and development.\n\nIt is about problem-solving. I know this from my time in the Obama  administration. I know this from my time working in a scientific  research lab. That innovation takes place on the shop floor and in the  heart of Michigan's…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…were outflanked by  the forces of violence that came down on us on that day.\n\nThat is the kind of bravery that we should be at least acknowledging,  if not praising. I know at the time we thanked them for saving our  lives, and people did die that day. Again, there were more than 140  officers who were wounded and brutalized and injured, and many  still…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…themselves, afraid to use the  law to protect themselves. What makes their clients think that those  law firms that bent a knee to Trump will represent their interests? I  don't know. Only time will tell what happens to those firms that  capitulated.\n\nIn the first Trump administration, law firms were part of the huge  effort by the legal community to challenge…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…issues that are facing our  Nation. We know that we have to work together to address the Affordable  Care Act and that the system needs to continue to have updates.\n\nWe know that in this time period since 2010, the uninsured rate in  the United States was a staggering 18.2 percent. After the enactment of  the ACA, which significantly expanded coverage, around…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…built into  your machine, then that is going to cost more, and it is unnecessary.  We are making everything more complicated.\n\nMr. Speaker, you will be surprised to know that at one time in my  life I was a Virginia certified pool operator. That is why I brought  this over. I keep this on my desk. When the baby pool pump--that would  qualify as one…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…be considered  made and laid upon the table.\n\nMr. LEE. Mr. President, I appreciate the kind words from my friend  and colleague the distinguished Senator from Oregon.\n\nI know my time is short, but I need to respond to a couple of points.  First, the bills to which my Democratic colleagues are referring have  been cleared. They have been cleared through…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…tax increases on American history would have  happened on January 1 of this year had we not completed that, and we  got it done 6 months prior to that crisis. I don't know the last time I  looked at Congress and found something done that far ahead of schedule.  It is usually the last minute.\n\nThat matters because that was a reality. That is what we knew…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…there was DNA testing. It was ended during the Biden administration.  They said it took too much time. I inquired about the amount of time.  It took 45 minutes.\n\nWhat we know from the time we did DNA testing, 30 percent of the  children that were DNA tested by border agents shared no relation to  the illegal aliens who were falsely--falsely--representing…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…of time back home hearing about the importance  of these tax cuts and how they have benefited not just Texas families  but small businesses throughout the State.\n\nI know most of the time when we think about job creators, we think  about Fortune 500 companies, but the fact is, in Texas and across the  Nation, it is our small businesses that are the primary…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…doesn't happen to other  families like theirs. We are all praying for that dear family.\n\nMr. Speaker, the heart-wrenching stories we have heard tell us all we  need to know. It is time to send the TAKE IT DOWN Act to the  President's desk so we can give survivors and law enforcement the tools  they need to combat this crisis. I urge my colleagues to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…in the supply, but overall, it is basic economics. That is  how it works.\n\nMr. Speaker, also, you can call what President Biden did a pause as  opposed to a ban, but I know from the time he implemented the pause or  ban until President Trump came into office, you couldn't ship natural  gas. Either pause it or ban it, I think that is saying the same thing.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Trump showed in actions, not words, that he was  determined to remove a drug lord, and that is what Nicolas Maduro was,  from power.\n\nThe President doesn't have to let us know every time they go and  arrest somebody who has broken the law. That is exactly what happened  here.\n\nNow I want to talk about illiteracy. My friend, the chairman, talked  about…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the Federal Government and encourage  them to get out and work and do something with their hands and be  blessed by it and to restore the dignity of work.\n\nMr. Speaker, I know my time is up. God bless rural America, and God  bless west Texas.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…during the entire Vietnam war. If that is not an  attack on us, I don't know. If that is not a terrorist organization  that is truly poisoning our streets, then I don't know.\n\nDuring the time that the junior Senator from California sat on Intel,  not one time did he ever ask for the release of the same videos from  the Obama administration that killed 3,700…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…never ever seen a Member of the House, by the direction of the  Speaker, escorted from the premises by the Sergeant at Arms. That is a  first.\n\nMaybe, Mr. Speaker, you know of the last time it happened. It has  been a long time.\n\nI am very disappointed and ashamed of the fact, and this is not  personal to Mr. Green, who is a very amiable fellow, but we…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…with politics. Nothing. Nothing I am talking  about has to do with politics. This has to do with kids. Yet the  Senator from Vermont wants to make it about politics. You know, this  time of the year at Christmas we talk about grinches, all the time,  right? They go in, and they steal the kids' gifts. By the end of the  show, their hearts grow bigger and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}]