[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…student working on complex scientific issues involving PFAS, toxic  chemicals that are all around us.\n\nAs the only Latino Member with a STEM background in Congress, I know  how important it is to encourage our students and young professionals  to pursue careers in STEM.\n\nFiring our future STEM workforce just as they are getting started in  their careers…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…climate change, the risks associated with those disasters continue to  rise.\n\nUnfortunately, we don't have to look any further than recent floods  and devastating storms to know how important the Coast Guard can be in  responding to these emergencies and disasters, but they need their  partners at FEMA and NOAA.\n\nI strongly support this bill and the great…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…tragedy that we had suffered. That money, those funds, were allocated  from the Crime Victims Fund.\n\nSo, once again, having actually lived through this experience, I know  how important it is to make sure that we pass this legislation.\n\nIt says that our first thought is to bind the wounds of the injured,  the helpless, and the innocent.\n\nWe owe it to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…donated from a foreign country.''\n\nI have never heard a constituent tell me when I have asked them what  the most important thing is for them right now: ``Do you know what the  most important thing is for me? It is for Kristi Noem to get $50  million more in the budget. By the way, cut my Medicaid, groceries, and  SNAP benefits because what I really…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…foundation of the  American Dream.\n\nAs a product of California public schools myself, the father of three  young kids in California public schools, and a former educator, I know  how important public education is for economic advancement.\n\nDedicated teachers like Tracy who go the extra mile for their  students are the key to a good public education.\n\nI congratulate…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690842/teacher-appreciation-week"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…League Baseball for their continued investment in Alabama's Seventh  Congressional District. We look forward to welcoming them back to the  Magic City. Of course, we know how important baseball has been not only  to the African-American community but to the American community writ  large.\n\nWe are excited to welcome Major League Baseball back to Birmingham,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…SCHOLTEN. Mr. Speaker, I thank the chairman and ranking member  for hearing my bill today. It is such a critical piece of legislation.\n\nThose of us from Great Lakes States know how important it is to  connect our young people back to the water that surrounds them, to  nature, and to get off their phones and into the great outdoors.\n\nI rise today in support…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…telling these stories? These are  stories that I am sure people in your district and your colleagues have  heard also.\n\nWell, we come tonight because we want America to know how important  our work is, but more importantly, we want America to know that  Democrats are standing up for them. We are united in this single cause  because it is our top priority.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…saw when we  had the January 29 DCA air collision.\n\nSo I hope that my colleagues here will help us make changes to this  section of the Defense Authorization Act. We know how important this  is, the Flight 5342 passenger families, the Lilley family, along with  myself and Senator Cruz, have been trying to sound the alarm bells  around the Capitol in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…shows that the majority of  parents across the country support the Department of Education, and  that is especially true with parents of students with disabilities.  They know how important that is. I tell you: Over my years and decades  as an education advocate, I have never had anyone say to me: We need  less money for IDEA.\n\nIt is always: Please fully…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…further, that 700,000 children have been seized. None  of this can stand.\n\nAs someone who has traveled over a dozen times to Ukraine in order to  investigate war crimes, I know how important it is that we make a stand  now, not later. We must uphold our American values by seeking peace in  the region and demanding the immediate return of Ukraine's missing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691141/peace-talks-with-ukraine"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…everyone's  personal data and information.\n\nI would hope that one Republican--perhaps you, Mr. Speaker--will  stand up and speak out against this outrage, because you know how  important Social Security is to your district and how many recipients  you have and how much money comes into your district on a monthly  basis.\n\nImagine, that hasn't been altered…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…of  don't think it is fair if we just get one Republican bill over the goal  line.\n\nSo he and I talked on the floor and said: Let us work with you, Dan,  because we know this is important to you. We know this is important to  your heroic constituents. Let us work with you. If you pair this with a  Democrat bill that is important, we will work to pass…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…These preventable incidents occur  when the tie-downs on the awning unexpectedly release, causing the  awning to strike the consumer.\n\nComing from the State of Florida, I know how important this is, and I  know how popular awnings are, but they have to be safe for consumers.  Consumers should not have to fear that their awning might suddenly  spring open…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…are also a critical national security point for military  training with the Gulf Test Range. Anybody that has done testing, if  you have served along the Panhandle, you know how important the  military training is on the testing there for the Gulf Test Range. This  range is an essential part of the Department of War's military training  and is supported…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698295/9999"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…health benefits and the nutrients that whole milk provides due to out- of-date regulations that limit the type of milk that students can drink  at lunch.\n\nAs a doctor, I know how important a diet that includes whole milk is  to ensure that our Nation's kids have the building blocks to build  strong bones, strong muscles, and strong brains.\n\nEven the CDC…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…friend, the  distinguished chairman, for yielding and for the job he is doing as  chairman of the House Committee on Veterans' Affairs. I once served in  that position. I know how important it is to defend our veterans so  vigorously. I thank the chairman for that leadership. I thank the  ranking member as well for his support of this important piece of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. KILEY of California. Mr. Speaker, I have the honor of chairing  the subcommittee that has jurisdiction over all of K-12 education, and  I wanted to let folks know about a very important hearing that we are  having next Tuesday at 10:15 a.m. eastern time on artificial  intelligence and its uses in education.\n\nNow, some folks might hear the topic…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…amendment increases the investment in wireless drone  charging. This keeps our unmanned aircraft operational longer and  reduces the need for a long-term resupply.\n\nWe know this is important. As we see in Ukraine today, this is not  the fight of the future. This is the fight of today, and the U.S. gets  to be a leader in our ability to help present this.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}]