[{"senator": "John Larson", "party": "Democrat", "sentence": "…recipients  in your own district. Is there not one Republican who will stand up and  say: We need a hearing. We demand to know where this information is. We  want to know why they need this information.\n\nI think you know why. It is because they want to privatize Social  Security. They are dissembling Social Security from within.\n\nDemocrats are aware…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…with devastating cuts to federal programs like Medicaid.\n\nAngelica's activism reminds us how much our immigrants contribute to  our communities and shape the change they know we need.\n\nOn behalf of Illinois' 3rd Congressional District, it is my great  honor to congratulate Angelica Garcia Santos for her activism,  leadership, and advocacy.\n\nThank you,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…speak, members of that workforce, the National Cemetery  Administration, have been fired or are being fired or will be fired.  Resources may be strangled. We deserve to know--we need to know--to  honor our veterans. That is the information we are demanding from this  Secretary of the VA.\n\nI respect the assurances that Sam Brown will do his job. But…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…what are we doing here?\n\nI am a member of the Committee on Homeland Security, and under the  Biden administration, I pushed for more resources to secure the border.  I know that we need to enforce immigration laws, but not like this.\n\nThey are sending masked agents into American neighborhoods. They are  beating people in the streets. They are breaking…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699355/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…out-of-pocket       services and relies on the public school system to provide       speech, occupational, and behavioral services.\n\nPlease advocate for my child. I don't even know how to. I       need you to do this for them.\n\nBonamici).\n\nMrs. HAYES. Mr. Speaker, I thank Representative Brown. I think she  knows I will always fight for RJ and all the kids like him.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…families across the country, and I know many  of us in this Chamber, especially those on the left, have always said  housing is a human right.\n\nTo address this crisis, we know that we need action at every level of  government, but many local communities need additional assistance and  capacity. That is why I am so incredibly grateful that the House passed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699987/housing-is-a-human-right"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…employer provided healthcare, and  through the Affordable Care Act exchanges. It is called Marketplace  Virginia in my State.\n\nThe more people have insurance, the more we know when they need care  they can get it and not go bankrupt. More importantly, they can get  primary care and preventative care so that when they get sick--because  they will--they don't…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…overrule what it ruled back then.\n\nThe second idea was to do a balanced budget amendment. But the  Republican chair of Appropriations stood up and said: Do you know what,  sometimes you need to spend more because of conflict; sometimes you  need to spend more because of recession. And so, no, we shouldn't have  a formalistic formula. And he refused…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Area, we have a collegial conversation and we can go to those  refineries. I would particularly like to take him to the ones that have  invested on the transition because we know we need a transition for  those of us who want to go to as near-zero emissions as possible, and  we are succeeding.\n\nI will remind my colleagues, too, across the aisle that the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…families. It would  invest, in total, $852 billion in our national defense--expanding  shipyards, expanding munition production, creating stockpiles of  critical weapons that we know we need for the future, investing in  cutting-edge technologies--and would reject some of the Trump budget  cuts in aid to Ukraine, to Taiwan, and to our Baltic allies, who are…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…help the good folks of Wyoming  to have a livelihood and to not only keep prices down, but keep good- paying jobs across this country that are in the energy industry. We  know that we need more energy going forward. We need more electrons on  the grid. We need a larger grid. We need to all work together to do  those things, but if this resource management…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…permitting reform. We seem to make good forward progress and then take  a few steps back. But we need that to build out the infrastructure that  this country needs.\n\nWe know we all need to tackle the affordability issues that impact  all of us, whether they relate to the costs of goods or housing.\n\nThere is a lot that we have to do here, but there is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…room can be expensive.\n\nWe can make this work for the American family as opposed to the  American family working to get the insurance company to approve the  care they know they need. My plan does not take away coverage. It  doesn't touch the original ObamaCare tax credits. The patients need a  solution that reduces their costs of being insured, not…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…That is the only choice.\n\nEurope can't do it. We know what happens if you overregulate and  don't produce the energy. That is a good example right there from  Europe.\n\nWe know we need the power or we are going to lose the great battle of  our time of who is going to control AI and supercomputing, eventually  quantum computing.\n\nThe very first thing we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…States.\n\nAs the father of four young boys, I know firsthand that those closest  to educating my children--the teachers, administrators, and special  aides--are the ones who know what they need to get ahead academically  and succeed.\n\nData shows that our current educational system is failing our  students. Our outcomes are not where they need to be. Reading…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the point in time  that an individual registers to vote.\n\nWe should also be showing voter ID when we go to vote. This is a  commonsense principle. The American people know that they need to show  photo identification when they board an airplane, open a bank account,  or buy a six-pack of beer.\n\nI am often reminded of a debate we had at committee, and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}]