[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…What was the problem?\n\nThe problem in 1974 was this: A President began war without telling  Congress. In 1974, we were in the midst of the Vietnam war. Congress  did know that, and Congress had passed some legislation at least  appropriating funds for it and somewhat authorizing it during the  Johnson administration. Congress knew about the war in Vietnam.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…is basic checks and balances.\n\nTrump is imprisoning these people under the Alien Enemies Act. He is  using a war power. We are not at war. Everyone here should know that.  After all, Congress--we--have to vote to declare war.\n\nI remember every war vote we have taken in my time here in Congress,  and I can tell you there has never been a vote on this…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and fester?\n\nBecause here is the bottom line: Article I, section 8 says that ``the  Congress shall have [the] Power . . . To declare War.''\n\nAnd every American should know that Congress is not giving up on its  most basic constitutional right to debate and determine whether U.S.  forces undertake further operations--offensive operations--against the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…money that has been congressionally mandated to fund essential  services.\n\nIt really is weighing on the entire economy. More importantly, people  back home want to know what the Congress is going to do about it, and  it is just silence from my friends on the other side of the aisle.\n\nLet's talk about how ridiculous this is to target labeling on energy-…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…colleague, Congressman  David Valadao. This  happens to be the district that has the highest concentration of  Medicaid recipients in this country.\n\nLaura, I don't know what your Congress Member is going to do. Every  single House Democrat is fighting hard to protect your Medicaid. We  value you, and we are working hard to defend it.\n\nJacki is from…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…has passed.\n\nVirginia's Law will change that because justice for victims of abuse  should not have an expiration date.\n\nCongress should pass this law immediately. We know when Congress has  the will, it can pass legislation with lightning speed. We passed the  Epstein Files Transparency Act through both Chambers in a day. There is  no reason to delay…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Republicans certainly must know that they don't have the votes to  amend the Clean Air Act under regular order. If they did, they would  choose that path. They also know that Congress doesn't have the  authority to amend the Clean Air Act through the Congressional Review  Act.\n\nDon't just take my word for it; they heard it from the independent,  nonpartisan…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…it.\n\nOregon workers and businesses deserve better. They deserve policies  that strengthen industries instead of pulling the rug out from under  them. They deserve to know that Congress is standing with the workers  to keep our communities running.\n\nToday is the day that we remember the Constitution. The Constitution  has directed that Congress should…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695603/devastating-harm-caused-by-trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…how we can put a stop to Trump's disastrous  tariffs which are a tax on the American people and which raise the  price of absolutely everything we buy.\n\nThey want to know what Congress is doing to lower their skyrocketing  healthcare premiums. They want to know why Congress is asleep at the  wheel, while they struggle to make ends meet, watch their…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…program for the elderly. Since its inception in 1935, it  has never missed a payment.\n\nIt is, for capitalism and entrepreneurialism, our safety net. Yet,  Mr. Speaker, as you know, Congress has not acted on enhancing Social  Security in more than 50 years. Richard Nixon was the President of the  United States the last time Congress, whose responsibility it…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…are going to fight  together to restore the funding. I will continue to call out these  inhumane and lawless actions.\n\nIt is very important for the American people to know this Congress  and this Chamber authorized the funding for Job Corps. The President of  the United States does not have the authority to snap his fingers and  cut the funding.\n\nThe…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…we had hoped would be passed last December but  for Elon Musk.\n\nThis bill is important. I know that back in Asbury Park, in  particular, they will be very happy to know that our Congress is paying  so much attention to American music tourism.\n\nMr. Speaker, I ask for support on both sides of the aisle for the  legislation, and I yield back the balance…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Nation's number one antipoverty program for the elderly and the number  one antipoverty program for children. That program is Social Security.\n\nYet, Mr. Speaker, as you know, Congress has not addressed or enhanced  Social Security in more than 54 years. Richard Nixon was President of  the United States the last time that Congress enhanced Social Security.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…problem.\n\nNext week, Mr. Speaker, I am going to come back, and we are just  going to walk through the opportunity of how we preserve these programs  using a calculator. I know Congress is often a math-free zone, but  let's give it a try.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nI thank my friend from New Jersey for this excellent bill. I know  that Congress has consensus on it, and I hope that in this Congress it  becomes law. I have spent a good part of my career both in commercial  banking, investment management, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Act of 2025, a bill that I am honored to both lead and  author that was created out of a vast network of partnership on both  sides of the aisle.\n\nMr. Speaker, as you know, this Congress cemented the United States as  the crypto capital of the world. The leadership of Members of this  Chamber on both sides took meaningful steps to lay a foundation for…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…young girls and young athletes out there,  including my own.\n\nMr. Speaker, I encourage Lauren to keep running hard, keep working,  keep inspiring, keep winning, and know that we in Congress have her  back.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692397/recognizing-lauren-matthew-of-west-valley-high-school-state-champion"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…secret that Congress lacks the fortitude to stand up for its  prerogatives, and this is bipartisan. Presidents in both parties  routinely exceed their power because they know that Congress has  weakened itself to such an extent that it cannot challenge and will not  challenge Executive overreach.\n\nCongress delegates its legislative authority to the President…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]