[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…stories of Delaware's silent  heroes, everyday individuals who answered the call to serve our Nation.\n\nThis past school year, Ms. Green and her students chose to research  two Korean war veterans. They researched the lives that these veterans  led before their service, the communities they returned to, and the  legacies they left behind not only as servicemembers…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694007/recognizing-emily-green"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…unity.\n\nMr. Kim's passion for youth development and multicultural outreach  has helped foster deeper understanding across communities, and his role  in bringing the 23rd Annual Korean American National Sports Festival to  North Texas underscores his commitment to cultural celebration and  civic engagement.\n\nWe honor Mr. Kim for his service, his vision, and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692616/regognizing-jaehyung-kim"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…cryptocurrencies to funnel resources  toward violent operations against innocent civilians as was exposed in  the investigation following the violent October 7 attacks on Israel.\n\nNorth Korean hackers, operating as arms of the regime, have stolen  billions of dollars in cryptocurrency through cyberattacks, laundering  those funds to bankroll their illegal weapons…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…only technical mastery  but the values of perseverance and discipline that he instills.\n\nMr. Bang's contributions extend beyond the dojang. His support for  the 23rd Annual Korean American National Sports Festival exemplifies  his broader mission to highlight cultural pride and build community.\n\nFor his tireless dedication to sport, culture, and the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692604/recognizing-jounghun-bang"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…year's Boots on the Ground  Alliance's Veteran of the Year, an honor his life and service  absolutely merit.\n\nBorn and raised in Whittier, Mauro was inspired by his uncle, a  Korean War veteran, to continue his family's proud tradition of  military service. Answering the call of duty, he enlisted in the United  States Army in November 1966 and served with…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…weapons and  logistical stocks are perilously diminished. Their closest ally in the  war--Iran--is weaker than it has been in decades due to Israeli and  U.S. actions. North Korean soldiers, sent to reinforce flagging Russian  forces, are suffering severe casualty rates. Russia has been ousted  from Syria, and its Wagner mercenaries in Africa are struggling…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise today to recognize Korean- American Day, a day to commemorate the first wave of Korean immigrants  to the United States and honor the generations who have followed.\n\nMr. Speaker, I am proud to represent…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Washington state's tribes and environment are  stronger because of Billy's decades of advocacy and leadership.\n\nBilly was also a veteran of the Marine Corps and served during the  Korean War. It is fitting that a Navy ship will now bear his name. The  USNS Billy Frank Jr. will offer salvage, rescue, ocean-going towing and  other support capabilities for U.S.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689283/christening-of-the-usns-billy-frank-jr"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…of Trump's weakness, of his drive toward tyranny. Trump doesn't  want a country of engaged, informed Americans. He prefers those who  salute on command, like for his North Korean-style, taxpayer-funded,  wasteful $45 million birthday bash this Saturday.\n\nReject these dangerous DOGE cuts and defend the right of the American  people to know.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692535/rescissions-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Like us, the people of South Korea have witnessed the mortal danger  to democracy posed by lies, by corruption, and by illegal actions  directed by those at the very top.\n\nThe Korean people responded with courage and defended their democracy  through peaceful civil disobedience, through lawful impeachment, and,  now, through a free and fair election.\n\nThey…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691847/south-korea-election"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…civilian--noted war correspondent  Ernie Pyle. Since then, it has become the final resting place for an  estimated 53,000 veterans from World War I, the Second World War, the  Korean War, the Vietnam War and the War on Terror.\n\nSadly, we have begun to run out of room to bury our Nation's heroes  at the National Memorial Cemetery of the Pacific. It became…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…philosophical dimensions  of the sport.\n\nBy nurturing discipline and pride within a diverse community, Mr.  Choi has built a lasting legacy. His work during the 23rd Annual Korean  American National Sports Festival is a testament to his enduring  commitment to cultural celebration and civic unity.\n\nWe commend Mr. Choi for using sport as a bridge across…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692596/recognizing-myoungsub-choi"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Congressional Women's  Softball teammate, Julie Fedorchak, to honor Commander Delbert Austin  Olson.\n\nHe is a hometown hero of Casselton, North Dakota, who served in World  War II, the Korean war, and the Vietnam war as a member of the United  States Navy. As part of Observation Squadron 67, while descending into  a target area in Laos during the Vietnam war, his…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697597/commander-delbert-austin-olson-post-office"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…memory will live on in her family.                 Honoring the Life and Legacy of Howard Koch\n\nMr. CORREA. Mr. Speaker, I rise today to honor the legacy of World  War II and Korean war veteran Howard Koch.\n\nDuring World War II, Howard served in the Army's elite 10th Mountain  Division, America's only mountain and winter warfare fighting unit.\n\nThis unit,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Bill Restoration Act.\n\nWe didn't stop with World War II. Just 2 years after Truman issued  his executive order, we began to desegregate the Armed Forces. There we  were in the Korean war, and we put Truman's executive order into action  and was greeted with resistance.\n\nTruman's 1948 executive order inspired many Black men to join,  believing the military…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…memorials here  in Washington, D.C., you have got the World War II Memorial, which is a  tremendous testament to our country coming together to overcome evil.  You have got the Korean War Memorial. For those of you who have been  there, the darkness of that memorial is evident in the expressions on  the faces of those soldiers there at the Korean War Memorial.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veteran's legacy.\n\nVeterans eligible for the VA pension must be at least 65 years old  and meet the annual net worth limit.\n\nA great portion of eligible veterans served in the Korean war,  Vietnam war, and Gulf war. This legislation would close the loophole  and prevent VA bureaucracy from being forced to take back benefits  delivered to the veteran who…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…MOORE of Utah. Mr. Speaker, this is going to be a special hour,  thanks to the gentleman from California.\n\nMr. MOORE of Utah. (English translation of the statements made in  Korean is as follows:)\n\nYoung Oak Kim Sister\n\nThank you!\n\nYou did well!\n\nYou did well!\n\nGim Yeong-ok uiwon-nim\n\nGamsahamnida\n\nSugohasyeosseumnida\n\nSugohasyeosseumnida Take that, Doug.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…remember most is how he  lived big in the small moments with warmth, attention to detail, and  genuine kindness.\n\nDoug was the only Member of Congress who ever called me by my Korean  name, Kim Young Oak. He didn't have to remember it. He never needed to  do that, but that small, thoughtful gesture meant the world to me and  spoke volumes about who Doug…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698709/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Commander Delbert Austin  Olson.\n\nCommander Olson, as my colleagues mentioned, answered the call of  duty not once, not twice, but across three major conflicts: World War  II, the Korean war, and the Vietnam war.\n\nIn Vietnam, he served with distinction, participating in some of the  most dangerous missions of the war. He flew low over Ho Chi Minh Trail  to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697599/commander-delbert-austin-olson-post-office"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…borough manager and head of maintenance and  permitting.\n\nJust 2 years after graduating from McConnellsburg High School, Jack  was drafted in 1953 and served our country in the Korean war.\n\nWhen Jack was asked about his military service, he shared that he  learned to depend on others and not to take anything for granted. Jack  continued by encouraging others…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Marine Aircraft Group 29.\n\nIn 2013, Timothy reported to 2nd Battalion, 9th Marines, where he  deployed to Okinawa, Japan, and participated in Exercise Forest Light  and the Korean Marine Exchange Program--strengthening joint  capabilities and international cooperation.\n\nFollowing this assignment, Timothy transitioned to Tampa, Florida,  where he served…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…across our Nation.\n\nThe Foundation carries forward the extraordinary legacy of Dr. Philip  Jaisohn. He was a visionary leader, physician, journalist, educator,  and the first Korean-born naturalized citizen of the United States. Dr.  Jaisohn dedicated his life to strengthening democracy, expanding  opportunity, and advancing the ideals of freedom and human…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, it is such an honor to stand here to strongly  support H. Con. Res. 58.\n\nAs a Korean American who grew up in the aftermath of the Korean war,  I have witnessed the horrors of socialism firsthand. I always say, if  you want to see the difference between socialism…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Islands and New  Guinea. After the war, he went on to Baylor University, joined the Air  Force ROTC, and later served as a transport officer in Busan, South  Korea, during the Korean conflict.\n\nMost men would have considered that a full measure of service, but  two decades later, during the Vietnam era, Floyd once again put on the  uniform, this time in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Mr. BENTZ. Mr. Speaker, I rise today to recognize the Korean and  Vietnam War veterans from Oregon's Second Congressional District who,  are visiting their memorials and the WWII Memorial, because of the  efforts of the Honor Flight…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…shipmates.\n\nHis service did not end with World War II. Dick continued to serve  during the early Cold War and later enlisted in the United States  Marine Corps. During the Korean war, he served with distinction as a  helicopter mechanic and crew chief, eventually earning the rank of  staff sergeant.\n\nAfter leaving the military, Dick Burbine remained…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Minnesota, on turning 100 years old last Friday, May 30.\n\nLawrence was born in Fergus Falls and grew up during the drought in  the 1930s. He was one of the first drafted for the Korean war, serving  13 years. When he returned, he went to work for a lumber company and  only quit chopping wood a couple of years ago.\n\nToday, Lawrence is an avid dancer who goes…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "French Hill", "party": "Republican", "sentence": "…people of New York have been heard. They  have spoken.\n\nWe think about having government-controlled grocery stores, instead  of relying on entrepreneurial immigrant families or Korean families  with the beautiful bodegas and flower shops around the city. They are  now somehow doing an inadequate job. The mayor proposes that the  government step into those…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "French Hill", "party": "Republican", "sentence": "…rights, no freedom, and driving cars from the 1940s and  1950s; or Xinjiang, China, where the Uyghurs are imprisoned and  enslaved to labor; or certainly no modest case, the Korean Peninsula,  North Korea, where people are in darkness for 12 months a year and  where people are stunted by malnutrition and oppression and live in  darkness, literally and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}]