[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employers to deduct them as a cost of doing business and offering tax  preferences for certain child and dependent care assistance.\n\nThis bill would change the Fair Labor Standards Act to exclude the  value of these services from the regular rate used to calculate  overtime.\n\nDespite its name, the bill does not require employers to provide any  child…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…have got, and they do mandatory overtime, so they are  working an additional 15, 20, 30 hours per week, then they have got to  pay them time-and-a-half under the Fair Labor Standards Act.\n\nTherefore, the prices go up now because they are not able to find  enough workers to satisfy the demand. Their choice at that point is to  either pay the farmers less…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…workers' wages.\n\nThis bill, H.R. 2262, would relieve employers of the obligation to  pay employees for training outside of their regular working hours.\n\nUnder the Fair Labor Standards Act, employees must be compensated for  employer-mandated education and training outside the regular work  hours. Essentially, the FLSA protects workers from being compelled…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…discussing one of several bills that House Republicans  claim will benefit workers but ultimately falls short of what workers  need.\n\nH.R. 2312 would redefine the Fair Labor Standards Act, the FLSA, to  make workers more vulnerable to wage theft and give employers an excuse  not to pay workers what they are otherwise owed.\n\nUnder present law, the FLSA…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Competitive Integrated Employment Act, which was  recently reintroduced by Congressmen  Bobby Scott and Pete Sessions.\n\nThis bill is a long, overdue modernization of the Fair Labor  Standards  Act of 1938. In it, section 14(c) permitted people with disabilities to  be paid less than Federal minimum wage with little hope of advancement.\n\nToday, those employed…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…when families did not use  daycare services for their little ones and elderly parents lived with  their adult children until death.\n\nThe current mandates of the Fair Labor Standards Act related to  dependent care drive up costs for businesses through unreasonable pay  calculations.\n\nThese expensive requirements naturally remove the incentive for many…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Protection Act. This important bill will help codify changes  we are making in Congress to help tip the scales in favor of our  service workers and waitresses.\n\nCurrent Fair Labor Standards Act rules define tipped work as someone  who customarily and regularly receives more than $30 a month in tips.  It also considers a standard known as the 80/20 rule, which…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, Pursuant to House Resolution 988, I call up  the bill (H.R. 2270) to amend the Fair Labor Standards Act of 1938 to  exclude child and dependent care services and payments from the rate  used to compute overtime compensation, and ask for its immediate  consideration in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…(3) one motion to recommit.\n\nSec. 2.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 2262) to amend       the Fair Labor Standards Act of 1938 to exclude certain       activities from hours worked, and for other       purposes. All points of order against consideration of the       bill are waived.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, pursuant to House Resolution 988, I call up  the bill (H.R. 2312) to amend the Fair Labor Standards Act of 1938 to  revise the definition of the term ``tipped employee'', and for other  purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…on very thin margins. The tip credit system is the  foundation on which these small businesses operate.\n\nThe tip credit, or the tipped wage, has been part of the Fair Labor  Standards Act for decades. It allows employers to pay tipped workers a  base wage with tips--handsome tips, in many cases--making up the rest  of those workers' earnings.\n\nThis system…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}]