[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…by accident.\n\nVerification will be at the heart of any future arms control effort,  and this is where America's scientific enterprise plays a critical  role. Our national laboratories provide the technical backbone for  verification, monitoring, and treaty compliance, and they are essential  to maintaining U.S. leadership in this area.\n\nAs co-chair of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…international  scientific collaboration allowed us to better understand each other and  the universe that we are embedded in.\n\nCERN already partners with several of our national laboratories,  including Argonne National Lab and Fermi National Lab in the 11th  District of Illinois that I represent.\n\nIn particular, this bill will allow for closer collaboration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…economy and a sledgehammer to the working  families who depend upon these programs like Medicaid and a  sledgehammer to our universities and medical schools and research  laboratories, which have made us the premier center for research  innovation and healthcare in the world. And with these sledgehammer  blows, I don't think we can maintain that status.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…well.\n\nSo when President Trump and Elon Musk come after this funding and  come after these public servants, they aren't just coming after  scientists in classrooms and laboratories; the impact will spread far  beyond those institutions. When they come after the NIH, they are  coming after patients with terminal illnesses, who are right now being  turned…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…decades to  come. As part of that, in 1976, construction began on a 5-megawatt  thermal solar test facility at the Energy Research and Development  Administration's Sandia Laboratories in Albuquerque, NM. Before it was  even complete, the facility became the largest operational solar  installation in the world. This solar test facility was just one small…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…biodetection capabilities  within DHS by requiring the Secretary to assess how the Department can  leverage the research and development of the Department of Energy's  national laboratories.\n\nBiological threats, including deadly pathogens and bioterrorism  agents, represent a constant and emerging danger to the public health  and security of our Nation. However,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688729/dhs-biodetection-improvement-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…to a serious  and growing public safety and public health concern that I think  requires congressional action. It is the operation of illegal and  unregulated biological laboratories that we see in communities  throughout our country.\n\nI urge my colleagues to join me in supporting legislation that I have  introduced from the House committee recommendations.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…two agencies. This joint  agency effort would expand opportunities for small businesses to  participate in research and development opportunities at DOE and its  national laboratories.\n\nIt is in our economic and national security interests for the United  States to remain a leader in R&D and technological advancement. In  order to maximize our impact,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise as a Ph.D. physicist in Congress, who  spent most of his career in the national laboratories of the Department  of Energy, to share the story of a research engineer at a national lab  who was recently fired without cause by President Trump and Elon Musk.\n\nThis engineer's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688240/fired-by-president-trump"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…the country club.\n\nThat is not what it is like. It is different from place to place.\n\nWe set up these different State and city governments throughout our  country to be laboratories of democracy, to run their States and their  cities the way they see fit, to tax them as they see fit, and the one  way that they used the Federal income tax code to move…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…could save lives and preserve American leadership in technology  and innovation. Unfortunately, the Trump administration forced them out  of their jobs and out of their laboratories.\n\nI had a chance to meet with many of these individuals over the last  few months. We had a job fair in my district not that long ago, and a  couple of people came through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…for their leaders to do the  things that are necessary to lower everyday costs so that they can  better their conditions and plan effectively. Their schools--our  greatest laboratories for economic development and individual  advancement--are being targeted.\n\nThe repercussions of eliminating the Department of Education would  perpetuate cycles of economic…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…be, well, certainly that  isn't direct; but it is. It is the foundation upon which that research  is being used by multiple researchers. It is the hospitals and it is  the laboratories.\n\nI would draw the attention of the House to beware of this proposal  that is actually being implemented now to reduce the total research  money that is available for the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…clinical  trials that are underway. You can't just stop medical research like it  is a faucet.\n\nOnce halted, the research, the data, the clinical trials, the  patients, the laboratories, the equipment, all that led to innovation-- will be lost. You think you just turn that back on? You know, these  kinds of ideas sound great, but they are not well thought…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…certainly stop wasting  money on it.\n\nAnother place where we were always in strong agreement was how we  should be strengthening the nonproliferation efforts at our national  laboratories.\n\nOur national labs create an underlying foundation for all of our  nuclear security efforts including the nonproliferation and national  security priorities that we are…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…thousands of insect traps all along the southern border.  Tens of thousands of flies from traps in all locations have been  submitted to our National Veterinary Services Laboratories for  identification, thankfully with zero New World screwworm detections so  far.\n\nIn Texas, the USDA examines all wildlife for signs of an infection.  To date, more than…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Challenge is hosted by the Interaction of Ionizing  Radiation with Matter University Research Alliance (IIRM-URA), which is  a collaborative partnership between universities, laboratories, and  industrial companies. Funded by the Defense Threat Reduction Agency,  the IIRM-URA's primary concern is to mitigate threats against weapons  of mass destruction. The…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…they certainly become  passionate about it. I greatly appreciate her passion on the issue.\n\nThe section 1115 waivers are important to the Medicaid program.  States are the laboratories for democracy. Section 1115 waivers provide  key State flexibility to test new authorities and ideas in the Medicaid  program.\n\nIn substance use disorder alone, 1115 waivers…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Navy and  proudly served during the Korean war. He was awarded the Bronze Star  after more than 30 years of service. Returning home, Tony worked at  Bear Mountain, Lederle Laboratories, and New York Telephone/Verizon,  retiring after 30 years of professional service.\n\nTony also gave back to his community as a volunteer firefighter with  the Haverstraw…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…or agreement, as the case may be, shall require the use of a       competitive, merit-reviewed process, which considers       applications from Federal agencies, National Laboratories,       institutions of higher education, non-profit institutions,       and other appropriate entities.\n\n(c) Coordination.--In carrying out the activities under       subsection…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…term ``covered entity'' means any       licensed provider of health care services (including licensed       health care practitioners, hospitals, nursing facilities,       laboratories, intermediate care facilities, psychiatric       residential treatment facilities, institutions for       individuals with intellectual or developmental disabilities,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…order to support       community-based learning.\n\n(9) Providing hands-on training and research opportunities       for mathematics and statistics educators at Federal       laboratories, institutions of higher education, or in       industry.\n\n(10) Developing mechanisms for partnerships between       educators and employers to help educators and students…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Such memorandum       or agreement shall require the use of a competitive, merit-      reviewed process, which considers applications from Federal       agencies, National Laboratories, institutions of higher       education, nonprofit institutions, and other appropriate       entities.\n\n(c) Coordination.--In carrying out the activities under       subsection…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…enter a memorandum  of understanding to help unify and streamline research efforts between  the national labs and American small businesses. Currently, the 17  national laboratories across the United States provide the government  with some of its most cutting-edge research.\n\nAt the same time, our Nation's small businesses contribute  extensively to…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…scale.\n\n(3) Promote collaboration and data and information sharing       between the Department of Energy, National Aeronautics and       Space Administration, the National Laboratories, and other       appropriate entities by providing the necessary access and       secure data and information transfer capabilities.\n\n(4) Support the Administration's access…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…behind the counter. We made  it harder for people to pilfer Sudafed and go out and cook up their own  meth. We knew that that was going to cut down the number of clandestine  laboratories, but it wasn't going to decrease the demand; it was just  going to increase the demand for meth to come across the southern  border, and that is what happened. They created…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…introduced, along with Representatives Costa and Valadao,  to find any other such labs that exist across the country and assure  that they are shut down.\n\nThe Preventing Illegal Laboratories and Protecting Public Health Act  would address gaps in Federal law outlined in this Congressional  report.\n\nSpecifically, it would require distributors of highly pathogenic…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…continued success of space missions.\n\nUtah State University boasts one of the longest histories of  connections to space technologies with the establishment of Electro- Dynamics Laboratories in 1959. It would later join forces with the  University of Utah's Upper Air Research Laboratory to form the Logan- based Space Dynamics Laboratory in the early 1980s.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…collaboration with the Secretary of Transportation, the       Administrator of General Services, industry partners,       institutions of higher education, and National Laboratories,       shall support demonstrations of advanced production of low-      emissions cement, concrete, and asphalt that uses either--\n\n``(A) a single technology or practice;…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…ranchers, energy producers, and Main Street that  might otherwise have been overlooked by larger institutions. We have  also seen how the dual banking system permits States, as laboratories  of democracy, to thoughtfully integrate new products and services into  our banking system.\n\nWyoming and other States were the first to provide legal clarity for  digital…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]