[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…discussing one of several bills that House Republicans  claim will benefit workers but ultimately falls short of what workers  need.\n\nH.R. 2312 would redefine the Fair Labor Standards Act, the FLSA, to  make workers more vulnerable to wage theft and give employers an excuse  not to pay workers what they are otherwise owed.\n\nUnder present law, the FLSA…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…allowing  employers to deduct them as a cost of doing business and offering tax  preferences for certain child and dependent care assistance.\n\nThis bill would change the Fair Labor Standards Act to exclude the  value of these services from the regular rate used to calculate  overtime.\n\nDespite its name, the bill does not require employers to provide any  child…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…waste. Across the country, there were thousands of  clean energy projects planned, underway, or just finished that would  have benefited from the IRA incentives tied to good labor standards.\n\nTo get the full tax credit, these projects needed to meet wage and  apprenticeship requirements. This was a huge chance to raise pay and  improve job quality for clean…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695602/devastating-harm-caused-by-trump-administration"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…workers' wages.\n\nThis bill, H.R. 2262, would relieve employers of the obligation to  pay employees for training outside of their regular working hours.\n\nUnder the Fair Labor Standards Act, employees must be compensated for  employer-mandated education and training outside the regular work  hours. Essentially, the FLSA protects workers from being compelled…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…they have got, and they do mandatory overtime, so they are  working an additional 15, 20, 30 hours per week, then they have got to  pay them time-and-a-half under the Fair Labor Standards Act.\n\nTherefore, the prices go up now because they are not able to find  enough workers to satisfy the demand. Their choice at that point is to  either pay the farmers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Competitive Integrated Employment Act, which was  recently reintroduced by Congressmen  Bobby Scott and Pete Sessions.\n\nThis bill is a long, overdue modernization of the Fair Labor  Standards  Act of 1938. In it, section 14(c) permitted people with disabilities to  be paid less than Federal minimum wage with little hope of advancement.\n\nToday, those employed…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…values, as well  as economic prosperity. Eligibility under AGOA is directly tied to the  progress by these developing African countries on market reform, rule  of law, labor standards, and human rights.\n\nThe conditionality of this trade preference program harnesses trade  as a catalyst for reform, not just revenue. Unfortunately, the AGOA  program expired…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…pay for their soaring energy bills  and force us to utilize more natural gas and energy produced by foreign  adversarial nations  who have far inferior environmental and labor standards.\n\nA natural gas tax is a completely misguided tax on the working  American people that will hurt their bottom line and benefit Vladimir  Putin. I urge my colleagues to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…on very thin margins. The tip credit system is the  foundation on which these small businesses operate.\n\nThe tip credit, or the tipped wage, has been part of the Fair Labor  Standards Act for decades. It allows employers to pay tipped workers a  base wage with tips--handsome tips, in many cases--making up the rest  of those workers' earnings.\n\nThis…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…ensuring that foreign  competitors play by the rules. For too long, American workers were  undercut by countries exploiting loopholes, manipulating markets, and  ignoring labor standards. Under Mr. Kimmitt's leadership, we will have  an Under Secretary committed to using every tool available to level the  playing field and bring justice to American workers.…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, pursuant to House Resolution 988, I call up  the bill (H.R. 2312) to amend the Fair Labor Standards Act of 1938 to  revise the definition of the term ``tipped employee'', and for other  purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…(3) one motion to recommit.\n\nSec. 2.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 2262) to amend       the Fair Labor Standards Act of 1938 to exclude certain       activities from hours worked, and for other       purposes. All points of order against consideration of the       bill are waived.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Party-controlled mines in  places like Congo, where 15 of the 19 industrial mines are owned by the  Chinese Communist Party. These mines have zero environmental standards,  zero labor standards, and they use child slave labor.\n\nThanks to the Biden administration's refusal to support responsible,  domestic mining, their de facto EV mandate will only increase our…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to--\n\n``(I) housing assisted under this subtitle; or\n\n``(II) housing assisted under section 42 of the Internal       Revenue Code of 1986.\n\n``(B) Application of labor standards.--The labor standards       and requirements set forth in section 110 of the Housing and       Community Development Act of 1974 (42 U.S.C. 5310) shall       apply to any infrastructure…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…been the position of our country for far too long.\n\nMr. Speaker, instead of not in our backyard, it is much better in our  backyard because we have better labor standards, better environmental  standards, and better health and safety standards.\n\nGod has blessed our country with these deposits of minerals really  from sea to shining sea. We just need to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, Pursuant to House Resolution 988, I call up  the bill (H.R. 2270) to amend the Fair Labor Standards Act of 1938 to  exclude child and dependent care services and payments from the rate  used to compute overtime compensation, and ask for its immediate  consideration in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Protection Act. This important bill will help codify changes  we are making in Congress to help tip the scales in favor of our  service workers and waitresses.\n\nCurrent Fair Labor Standards Act rules define tipped work as someone  who customarily and regularly receives more than $30 a month in tips.  It also considers a standard known as the 80/20 rule, which…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698966/tipped-employee-protection-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…manufacturing home, and reducing       our reliance on foreign sources.\n\nCurrently, critical minerals come from countries with the       loosest, most egregious environmental and labor standards in       the world--countries like Argentina, Chile, China, and the       Democratic Republic of Congo. Today nearly 40% of the world's       copper is mined in Chile…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…other adversarial nations.\n\nMinnesota has been mining for 145 years. We know how to do it. Mr.  Speaker, it is better in our backyard where our environmental and our  labor standards are met or exceeded and our State permitting is met or  exceeded.\n\nMr. STAUBER. Mr. Speaker, I said it: Would it surprise you that the  Representative from the district…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…then when families did not use  daycare services for their little ones and elderly parents lived with  their adult children until death.\n\nThe current mandates of the Fair Labor Standards Act related to  dependent care drive up costs for businesses through unreasonable pay  calculations.\n\nThese expensive requirements naturally remove the incentive for many…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…future. Nobody does it better than the United States.\n\nI implore my colleagues: Where is the world currently mining for  critical minerals that have better labor standards or environmental  standards than us?\n\nMr. Speaker, nothing in this bill green-lights any mining project  without necessary scrutiny. Nothing in this bill allows for a project  to bypass…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}]