[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…Department of Education is the only  Department equipped to be charged with the education of all students,  including students with disabilities, not HHS, not the Department of  Labor, not the Department of Justice.\n\nCreating more hoops for schools to jump through and shattering known  systems and protocol will, at the end of the day, hurt the students…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…workers organize. We know that when they organize, they  will have higher pay, better benefits, and safer workplaces.\n\nThe PRO Act will be the most significant upgrade in U.S. labor law in  over 80 years. For too long, workers have suffered from antiunion  attacks and toothless labor laws that have undermined their right to  work safely and be paid fairly.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698950/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…countries where they are traditionally denied access to  education because the funding was frozen. We don't know how many  organizations working to stop sex trafficking, child labor, and gang  violence are no longer functioning because the funding was cut off. We  don't know how many deminers we have trained and equipped to locate and  destroy unexploded…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…first political act I took was when I was a junior  in high school and I read an article in the evening paper--back when  there was often a business paper in the morning and a labor paper in  the evening--in the Oregon Journal. The article said that Vice  President Agnew had been convicted of bribery, convicted of taking  $100,000, the article said, and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…executive order that strips  away collective bargaining rights for Federal workers.\n\nThe foundation of the economic strength of Indiana's First  Congressional District is our labor workforce. It is only because of  the ability to collectively bargain and form unions that workers in our  Nation were able to make progress and have fair wages, safe working…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689606/protecting-federal-employee-unions"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the bipartisan Critical  Materials TRACE Act to improve supply chain visibility. Transparency  can help drive responsible sourcing and innovation and reduce  environmental, labor, and human rights abuses, ultimately making our  supply chains more secure.\n\nThese are areas where bipartisan agreement is indeed possible, but  H.R. 4090 is not that answer.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…receiving       stolen property, fraud, and false statements. For many of       those cases, the misconduct was not in dispute; and in nearly       40 percent of the reinstatements, labor arbitrators applied       their own, often conflicting, interpretations of procedural       requirements and ordered reinstatement without even       considering the merits…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Speaker, I include in the Record links to letters in opposition  to H.R. 2988: One led by the Americans for Financial Reform and signed  by dozens of organizations representing labor, civil rights,  environmental, and other relevant policy issues; another from the AFL- CIO; a letter from SIRES; another letter signed by the National  Employment Law Project,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…understanding the healthcare needs of the citizens of the  Third Congressional District.\n\nIt is, Mr. Speaker, the only IV maternity care hospital in central  Ohio. It includes 16 labor and delivery rooms and 51 NICU rooms. It is  in partnership with Nationwide Children's Hospital. We salute Columbus  because it is stronger and healthier because of this investment.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698915/congratulating-dr-john-j-warner"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…and alarmed by this  administration's dangerous efforts to politicize our central bank.\n\nInterest rate decisions directly impact American households through  inflation, the labor market, savings, and household costs. It is  imperative that these decisions be driven by economic data and  evidence, not partisan pressure.\n\nI ask my colleagues to stand…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699024/recognizing-jerome-powell"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…example of when the appropriations process  worked how it should that is particularly relevant in this exact  moment.\n\nIt was just a few years ago, in fiscal year 2019, that the Labor- Health and Human Services bill--not the easiest bill--passed the Senate  and was signed into law prior to the start of the next fiscal year. At  that time, the chairman of…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…SCOTT of Virginia. Mr. Speaker, I thank the gentlewoman for  yielding, and I thank her for organizing this Special Order so we can  discuss the actions of the Department of Labor.\n\nRight now, the Trump administration and congressional Republicans are  starting to implement an aggressive deregulatory agenda that harms  workers. Trump's deregulatory agenda…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…their own incomes, and their own hopes, eaten way . . .\n\n``No longer will this Nation refuse the hand of justice to those who  have given a lifetime of service and wisdom and labor to the progress  of this progressive country.''\n\nMedicare and Medicaid benefit older Americans right now, people who  have given a lifetime of service and wisdom and labor…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…gap in the economy. Haitian TPS holders       comprise a large portion of essential work in healthcare,       education, and other critical sectors. The loss of their       labor would harm not only individual families, but also       employers, local economies, and public services that rely on       their contributions.\n\nIn light of these realities,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…their attacks  on the working class, the middle class, and vulnerable Americans.\n\nLast night, Republicans on the Appropriations Committee forced  through their reckless 2026 Labor, Health and Human Services, and  Education, and Related Agencies funding bill that assaults public  health, slashes medical research, eliminates funding for reproductive  health,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…generates significant revenue, it is not a major       source of employment. Compared to sectors like manufacturing,       agriculture, or services, mining has a much lower labor       multiplier. Modern operations are highly mechanized, relying       more on advanced technology and machinery than on large       workforces. The jobs that are created…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…definition of small entity established by       the Commission to reflect the change in the Consumer Price       Index for All Urban Consumers published by the Bureau of       Labor Statistics of the Department of Labor.\n\nMr. Speaker, I rise in strong support of this bill, H.R. 3382, the  Small Entity Update Act.\n\nSmall businesses are the backbone of this…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and Human       Services, the Department of Homeland Security, the Department       of Housing and Urban Development, the Department of the       Interior, the Department of Labor, the Department of       Transportation, the Department of the Treasury, the Commodity       Futures Trading Commission, the Consumer Product Safety       Commission, the Equal…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…were designed  on four or five workers.\n\nRemember that Social Security and Medicare are pay as you go. We had  a benefit of building reserves when the baby boomers were in the labor  force. They ultimately were designed as pay as you go.\n\nI have been in a 50-50 district for years. The political consultants  lose their minds. They tell me I am not allowed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…example,  municipalities have struggled to find accountants to conduct their  annual audits.\n\nRecent trends suggest this shortage will continue. According to the  Bureau of Labor Statistics, about 124,000 job openings for accountants  and auditors are projected each year, on average, over the next decade.  At the same time, fewer students are pursuing…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…in 1942. During those formative  years she became an extraordinary cook, an immaculate homemaker, and a  steadfast caretaker to her family.\n\nAfter contributing to the wartime labor force in Cincinnati, Ohio,  she enlisted in the Women Accepted for Volunteer Emergency Service in  early 1945 and trained in New York. She served with the U.S. Navy Nurse…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Senate passed five of the  remaining six appropriations bills: Defense appropriations;  Transportation, Housing and Urban Development; Financial Services and  General Government; Labor-Health and Human Services; Education; and  National Security and Department of State--in all, five appropriations  bills that fund all of those various programs and Agencies.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…have experienced  throughout private industry. As a one-time board member for the  Pennsylvania Workforce Development Board and as Republican chair of the  Pennsylvania House Labor and Industry  Committee, I got to see how innovative ideas like these can improve  workplaces. Gaining experience and making contacts across departments  can enhance the efficiency…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…since then when families did not use  daycare services for their little ones and elderly parents lived with  their adult children until death.\n\nThe current mandates of the Fair Labor Standards Act related to  dependent care drive up costs for businesses through unreasonable pay  calculations.\n\nThese expensive requirements naturally remove the incentive…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…himself and Ms. Murkowski):\n\nS. 3707. A bill to provide for a wage differential program to support  new nursing school faculty members; to the Committee on Health,  Education, Labor, and Pensions.                                  S. 3707\n\nBe it enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Party-controlled mines in  places like Congo, where 15 of the 19 industrial mines are owned by the  Chinese Communist Party. These mines have zero environmental standards,  zero labor standards, and they use child slave labor.\n\nThanks to the Biden administration's refusal to support responsible,  domestic mining, their de facto EV mandate will only increase…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…companies from Alaska's fishing, tourism, forestry, mining,       and oil and gas industries and includes Alaska Native       corporations, local communities, organized labor, and       industry support firms. RDC's purpose is to encourage a       strong, diversified private sector in Alaska and expand the       state's economic base through the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…work. Seems like a reasonable requirement  to me.\n\nThere is just no reason for taxpayers to continue to pick up the tab  for able-bodied Americans who choose not to enter the labor force.\n\nAnd the truth is, we need them in the workforce. We need more people  in the workforce, which is one of the issues I hear people talk about  as I travel my State and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…sample. Think  about that. That is 58 percent of those funds were either unsupported  or not properly documented.\n\nThere was an example where one contractor billed $9 million for labor  and could only support or back up $1.5 million of it. Another was  reimbursed twice for the same $40,000. Some grantees couldn't even  prove they delivered services. FEMA…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…manufacturing home, and reducing       our reliance on foreign sources.\n\nCurrently, critical minerals come from countries with the       loosest, most egregious environmental and labor standards in       the world--countries like Argentina, Chile, China, and the       Democratic Republic of Congo. Today nearly 40% of the world's       copper is mined in Chile…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]