[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…This hurts all of us--our patients, our       hospital system, and, of course, our impacted colleagues and       their families.\n\nIn addition to the impact on the healthcare labor force,       there are many additional health impacts that are expected to       come because of TPS termination for Haitians. Many Haitian       TPS-holders express a fear for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…and resolve. He is respected by colleagues, union members, and public  officials alike. His legacy includes not only stronger institutions but  a more empowered, united labor force in Missouri and beyond.\n\nMr. Speaker, I ask my colleagues to join me today in recognizing and  thanking Mr. Reginald L. Thomas for his years of extraordinary service  to…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…I am delighted to  celebrate this impactful organization's 50 years of service to the  State of Wisconsin.\n\nFounded in 1975, WRTP BIG STEP was determined to improve the labor  force through its efforts in reshaping apprenticeships. The  organization envisioned an environment that intertwined diversity,  resilience, and creativity to produce an incredible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…private-  sector businesses and tailor curricula to the needs of the community.\n\nAt a time when newly graduated students are seeing higher  unemployment rates than the broader labor force, small businesses that  rely on certain skills are still unable to find qualified workers. By  directing small business development centers and women's business  centers…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691730/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in the United States for an average of 26 years--that is right, 26  years on average. Ninety-one percent of DACA recipients in Connecticut  participate in the Connecticut labor force.\n\nMr. President, 92 percent of DACA recipients have a high school  diploma, and 81 percent have some college education. In Connecticut, 30  percent of DACA recipients are…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…the language they speak, and where they come from. Families  are being separated, children are traumatized, and communities live in  fear. These actions are weakening our labor force, shrinking our tax  base, and threatening industries that rely on a stable workforce.\n\nMembers of Congress should not be targeted with CS gas, shoved, or  have false charges…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…work. Seems like a reasonable requirement  to me.\n\nThere is just no reason for taxpayers to continue to pick up the tab  for able-bodied Americans who choose not to enter the labor force.\n\nAnd the truth is, we need them in the workforce. We need more people  in the workforce, which is one of the issues I hear people talk about  as I travel my State and around…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…1942. During those formative  years she became an extraordinary cook, an immaculate homemaker, and a  steadfast caretaker to her family.\n\nAfter contributing to the wartime labor force in Cincinnati, Ohio,  she enlisted in the Women Accepted for Volunteer Emergency Service in  early 1945 and trained in New York. She served with the U.S. Navy Nurse  Corps…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…self-deportation. There are things going on, we don't have  enough data to completely understand it, but my problem is: I don't  actually have enough folks for the civilian labor force.\n\nLook, something funky happened in this morning's unemployment numbers  where there was a good pop in jobs, maybe almost 2, 2\\1/2\\ times what  many of the economists expected,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of our brothers and sisters are choosing to take retirement at age  62, when for years we have been looking at there are, like, 7 million  prime-age males missing from the labor force.\n\nThat was actually one of the controversies when we were trying to do  some of the reforms in Medicaid, saying that should we ask folks to at  least look at participating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these numbers may be  much worse than we expected because it turns out people actually are  taking retirement earlier than we expected, meaning the participation  in the labor force is actually starting to get soft on the high-skill  populations, higher income population.\n\nActually we had a debate on this one about how upset this would make  people.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…at some of the data of the  7 million prime-age males who are missing in America, we have a data  set that says about one-half of that population may be missing from the  labor force. They are missing from the American labor force not because  of drugs and not because of video games but because of health, because  of obesity.\n\nAre we allowed to talk…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…designed  on four or five workers.\n\nRemember that Social Security and Medicare are pay as you go. We had  a benefit of building reserves when the baby boomers were in the labor  force. They ultimately were designed as pay as you go.\n\nI have been in a 50-50 district for years. The political consultants  lose their minds. They tell me I am not allowed to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…benefits is vital to attracting and retaining  talent and ensuring American businesses remain competitive at home and  abroad.\n\nFor our economy, the stakes could not be higher. Labor force  participation, particularly among women, continues to be constrained by  caregiving responsibilities. When caregivers are sidelined, we lose  talent, experience, and economic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…had this irony happening where we have  really actually stable and much broader economic growth than we  expected. We are actually seeing some odd things.\n\nActually, the labor force participation is pretty flat. We had a  small tick up in some of the last unemployment data. Also, if you look  at this chart here, we are trying to explain the difference.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and something happened either through court  or action here. They started rolling them back.\n\nIf I say right now there are 7 million males of prime age missing  from the labor force, Mr. Speaker, if I come to you and say we want tax  receipts to grow, that means we need participation in the economy.\n\nIf anyone wants to geek out, probably about 5 years…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…get an incredible deal. Yay.\n\nWhat would be the actual cost of healthcare? What would be the health  statistics of our brothers and sisters? What would the effect be on  labor force participation, family formation, and all the other crazy  things we have seen in this data? What would it look like 1 year from  now, 2 years from now, or 3 years from now?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the  reconciliation budget: incentives to invest in America, to build new  plants of equipment, for working people to have some things to actually  draw them back into the labor force, no tax on tips, no tax on  overtime, some of these things.\n\nIf you actually look at one of the reasons those things are in there,  and we are actually starting to see some…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}]