[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…which causes  90 percent of cervical cancer cases.\n\nThe volunteer nurse quit. She filed whistleblower complaints with the  State, but nothing was ever done, highlighting the lack of  accountability at the centers.\n\nMs. CHU. Mr. Speaker, let me say, there is a comprehensive study by  the Alliance for Women's Rights and Gender Equality that studied 607…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…dollars,  Mr. Speaker, let's be honest, to the richest people in our Nation, like  Elon Musk and all of President Trump's friends, and let children and  seniors die from the lack of healthcare coverage.\n\nAs the chair of the Congressional Mamas' Caucus, I need to bring this  to light because this is important when we talk about Medicaid.\n\nMr. Speaker,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…malevolently bringing out onto the floor--we are not simply undoing a  regulation; we are pulling the plug on progress in our country; we are  abandoning millions of students who lack the internet access needed to  complete their homework, to attend class, to reach their full  potential.\n\nThis repeal will widen educational disparities in our country, it…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…holds a lease there.\n\nEven during President Trump's first term, no oil and gas company kept  their leases. In fact, a recent report from Taxpayers for Common Sense  outlined the lack of economic viability for any oil and gas development  there, citing astronomically high costs in this remote region.\n\nLet me be clear. House Republicans' actions today will…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…discussion these days about what the threats to our democracy are or  the fact that our democracy is threatened. I don't think there is a  greater threat to our democracy than the lack of economic mobility we  have, than the fact that too many families in Colorado and across this  country feel like their kids are not going to live a life as good as  the life…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…people. COVID  made it very difficult for our young people. The pressures of life make  it very difficult for people. Our poor economy makes it difficult for  people, and a lack of effective healthcare makes it difficult for  people.\n\nLet's do better. Let's do better together. We are working across the  aisle because we realize that together we can…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…program for seniors in the  Health and Human Services appropriations bill, Republicans are ignoring  the real increase in food costs that Americans are experiencing due to  a lack of action by the administration to lower costs.\n\nWith all of this talk of Republicans making food access harder and  harder for millions and millions of Americans, what did…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…colleagues in both the House and the Senate to ask the courts to  enforce the emoluments clause, and we won in district court. Our case  failed in the court of appeals because of lack of standing; that is to  say, we lacked authorization, specific permission from the House or the  Senate to go forward.\n\nThere were 214 other Members of Congress who joined…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…the  United States, about 60 million people live in rural areas.\n\nWhen I travel around Wisconsin, I hear about several challenges that  our rural communities face, from the lack of high-speed broadband to  ensuring businesses have enough workers to thrive. But the No. 1  challenge that I hear about, time and again, is about rural access to  healthcare.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…earning higher GPAs than non-parenting students, parenting       college students are less likely to graduate. This is not due       to personal failing, but rather a lack of institutional       support and recognition of the unique barriers to college       completion for parenting students. Pregnant and parenting       students often experience…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Pacific Islands region, has prioritized the  region's need to build trade capacity and infrastructure and has  specifically advocated for preferential trade agreements given its lack  of competitiveness due to its small national markets, isolation from  the global market, and high cost of operating and land and labor  constraints. The PIF has encouraged…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…dark.\n\nTo my Republican colleagues, I know many of you share concerns about  endless American wars. I know many of you have questioned open-ended  military commitments that lack clear strategic objectives. You have  consistently opposed Executive overreach by previous Presidents in the  manner of war.\n\nThese SOUTHCOM operations look like the beginning…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Government, but the vast  amount of wreckage that he did during his time with DOGE is something  that we are going to have to analyze and understand because there has  been a complete lack of oversight from Congress, including from the  Oversight Committee that I sit on, over these past few months.\n\nThere had been reports that Elon Musk and DOGE were given complete…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that. But there is a significant  actor here, and that is the Netanyahu government. When they bar aid  trucks from going in, that leads to hunger, starvation, malnutrition,  and lack of medicine for people who desperately need it.\n\nI do want to thank folks who are continuing their efforts to do  anything they can to help feed these starving kids in Gaza--the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. That is right, Mr. Speaker. There is a lack of urgency,  and we need to move with urgency because a nuclear war cannot be won  and would have catastrophic human consequences.\n\nOne warhead--one--has the power to wipe out…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694114/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…going to  rip up the speech that I had written, but I am not going to give that  speech.\n\nI have to talk about the opposition party, and I have to talk about  their complete lack of interaction with the blue-collar Joe Bag of  Donuts, which is Youngstown and Akron and Canton and Cleveland and  Pittsburgh. These are working people that they have forgotten.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…not easy to find. They are not consistently posted on  agency websites.\n\nThis inconsistency burdens regulated entities, and it especially  burdens small businesses who often lack the resources to hire  compliance experts. The problem is so bad that agency guidance  documents are known as regulatory dark matter.\n\nFor a brief time, the first Trump administration…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…dealing with  its ramifications. Small businesses, on the other hand,  including businesses in rural communities like my home district in  central and eastern Montana, often lack the resources and information  needed to facilitate technology adoption.\n\nFor example, according to a 2025 report from the U.S. Chamber of  Commerce, 59 percent of small businesses…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…this Chamber that  reflect poorly on us reflect poorly on every single one of us.\n\nI would say to you, Mr. Speaker, that this is truly a wake-up call  for this Chamber. The lack of decorum has reached a new high when the  President of the United States cannot even come into our Chamber,  invited, and complete his speech without the interaction that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…yield myself such time as I may consume.\n\nMr. Chair, I rise today in support of my amendment to H.R. 3898, the  PERMIT Act, that offers a solution to compensatory mitigation.\n\nA lack of wetland mitigation credits is holding back residential  housing construction, and the available credits are increasingly  expensive.\n\nThese costs are passed down to the consumer,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…operations, reduce costs, and boost productivity for small businesses.  For many small businesses across the country, adopting these tools  remains out of reach because they lack the staff, the expertise, or the  capital to do so.\n\nMadam Speaker, the AI for Main Street Act helps address this  challenge by directing the SBA's Small Business Development…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…homes from squatters while  they are away on Active Duty. Under current law, servicemembers are not  clearly protected under various State adverse possession laws. Due to  this lack of protection, a squatter might be able to move in and make a  claim to that servicemember's home when that servicemember is deployed.\n\nThis is outrageous. We must ensure that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695471/servicemember-residence-protection-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…approaches, and different systems. Believe  it or not, they are still trading old, outdated, mostly static PDFs.\n\nPerhaps not surprisingly, this creates confusion, delay, and a lack  of transparency for project developers, for communities, for the  public, and for our own Federal agencies. Sometimes they don't even  know with specificity what is going on…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…are a natural hazard that cost the United States Government  approximately $300 million per year and pose a serious threat to public  safety.\n\nSinkholes occur when there is a lack of proper external surface  drainage so when a heavy rainstorm comes through and the ground cannot  drain the water properly a void may form underground. From that point  on,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…introduced the House  companion, H.J. Res. 92.\n\nToday, we have the opportunity to prevent future administrations from  issuing arbitrary rules on mergers and acquisitions that lack robust  cost-benefit analysis and would make it significantly harder for  financial institutions to grow and compete.\n\nBanks in the great Commonwealth of Kentucky and throughout…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…murdering POWs. We have to stand on the right side  of this issue. We are on the side of freedom.\n\nIt is not conservative to appease Putin, nor is it conservative to  have a lack of moral clarity of who is at fault in this war. It is not  a conservative position to embrace isolationism.\n\nMr. Chairman, I stand with two-thirds of America, and I oppose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…pay more  on interest than we do on our national defense, to the tune of over  $880 billion in interest.\n\nUnfortunately, many Members of Congress have demonstrated a complete  lack of fiscal discipline and will try to spoil a strong bill that  President Trump himself has endorsed.\n\nThis budget resolution enables us to reach over $4.5 trillion in tax  cuts…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John James", "party": "Republican", "sentence": "…resolution of disapproval to overturn the Biden administration's  California Advanced Clean Trucks rule.\n\nMr. Chairman, I am kind of disappointed but not surprised at my  colleagues' lack of understanding for exactly what we are trying to do  here. I would expect bad-faith negotiations here and elsewhere. Let me  highlight a couple of points that we have heard…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…understand. But for the American people, when you see someone from the  Democratic Party behind a microphone saying, they cut spending. It is  this off of the base of this. It is the lack of understanding.\n\nOne of the points that you keep trying to make over and over again  is, was it the Democrats' plan that they wanted to raise taxes on  everyone? Because that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…paid a fee to craigslist who never rejected or removed any       posts.\n\nAlthough the Court explained that ``some of her allegations       demonstrate craigslist's appalling lack of diligence in       preventing trafficking, not a single one establishes that       craigslist created or developed the trafficking content.''       After an extensive legal…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}]