[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…country, which until now I thought was a noncontroversial  and bipartisan idea.\n\nMr. AUSTIN SCOTT of Georgia.  Foxx), the Chairwoman of the Rules  Committee and the toughest lady in Congress.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW.  1600, the Crimea  Annexation Non-Recognition Act; H.R. 1601, the Defending Ukraine's  Territorial Integrity Act; and H.R. 670, the Lady Liberty Act, bills  originally introduced by Representative Connolly of Virginia, for the  purposes of adding cosponsors and requesting reprintings pursuant to  clause 7 of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698676/permission-for-member-to-be-considered-as-first-sponsor-of-hr-hr-and-hr-670"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…their own  citizens. Despots try to control the economy. Despots arrest their own  citizens, including children, in the middle of the night.\n\nLet me just say that the young lady talked about working hard, and  socialism, you know, robs families of what they have worked hard for  and what they have earned. Well, I want to ask you: What is this  administration…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…hope she felt loving all of us here.\n\nFinally, in the Wizard of Oz, a film my grandmother loved       (which may have something to do with the name of the leading       lady), a love she also passed on to our entire family, the       titular wizard also shares some wisdom about love and       affection.\n\nAs the Tin Man asks him for a heart, the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…outside Chicago where the small towns and the rural areas are located.  I know what public broadcasting means to those areas. I heard firsthand  an example of what it means.\n\nA lady named Heather Norman, who is with the public broadcasting  coalition in Illinois, joined me at a press conference, on Friday, in  front of the public radio station in the city…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…stage IV  cancer, pulling women by their hair down the street, and now just  murdering citizens in daylight. We have an unqualified, masked militia  eager to escalate.\n\nOne lady who I met recently in San Jose asked me: We have only been  through 1 year of this. How will we survive 4 years?\n\nWe won't. Not until we do the right thing. No other policy…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699568/no-funding-for-ice"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…nice gesture.\n\nA nice gesture is when somebody says, ``Good morning. Have a nice  day.'' That is a nice gesture.\n\nA nice gesture is when a gentleman pulls a chair out for a lady to  sit down. That is a nice gesture.\n\nTo take a $400 million airplane from Qatar as the plane of the United  States of America's President is cheap, demeaning, and harmful…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691019/nice-graft"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…make it illegal for foreigners to  donate to Presidential campaigns or inaugural funds.\n\nAfter the election and just before his inauguration, President Trump  and the First Lady, Melania Trump, kicked off his Presidency with the  launch of their own meme coins, which have reportedly lost the  investors, who trusted their President, $2 billion.\n\nGuess…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Mr. Speaker, I rise today to share the heartbreaking  and inspiring story of the Santa Clarita Lady Flyers, a 12-under hockey  team that plays in my district.\n\nWhile on the way to the Western Girls Hockey League playoffs, a  snowplow collided head-on with one of their team…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700079/santa-clarita-lady-flyers-tragedy"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…The first undergraduate class arrived in the fall of 2005, officially  marking the campus's opening. In 2009, UC Merced celebrated its first  full graduating class with First Lady Michelle Obama delivering the  commencement address. The University received its initial regional  accreditation from WSCUC in 2011, and in 2015, UC Merced is the  youngest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…causes such as voting rights, civic engagement, and  youth development. Mrs. Pough is truly an example of a life lived  fully. She has been blessed to break bread with First Lady Michelle  Obama and to cast her vote for Harold Washington, Chicago's first Black  mayor and for Barack Obama, Americas first Black President-- achievements she believed she…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, this morning I am honored to have my dear  friend, Father Jonathan Slavinskas, pastor of St. Bernard's Church of  Our Lady of Providence Parish in my hometown of Worcester,  Massachusetts, give today's opening prayer.\n\nFather Jonathan, as he is known by his parishioners, is a true force  of good…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700103/welcoming-reverend-jonathan-slavinskas"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…States to  be held accountable for his actions in narcotics terrorism.\n\nThis is not a new issue to me. In 2018, I took a trip to Caracas and  met with President Maduro, his First Lady, and members of his  administration. It was clear to me that Venezuela was in trouble. You  could see it on the streets. People were literally starving, and  hospitals were…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to recognize the South El  Monte High School Lady Eagles volleyball team on their first-ever CIF  Southern Section Division 9 championship.\n\nIn a hard-fought match, the Lady Eagles fell behind two sets to one  before rallying…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…recognize and salute the dynamic  faith community of Bethesda Baptist Church in New Rochelle as they  welcome their new pastor, Reverend Horace Sanders, Jr., and his wife,  Lady Katrina Sanders, to the pulpit. Bethesda Baptist will be  celebrating this month over installation weekend, highlighted by a  congregational celebration gala on Friday night,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…school, we are going to support  you in that.\n\nTitle IX gives all of the information. We are not going to be  redundant. We are just making sure that you also include, young lady,  if you are pregnant and you want to continue in school, we are going to  do our best to help you and provide all the resources. I just wish we  could catch hold of this.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…balance of my time.\n\nMr. Speaker, I thank the President of the United States for shedding  light on this particular bill at the state of the Union. I thank our  great First Lady as well for her support on this particular bill.\n\nI thank Representatives Dean and Dingell, and, of course,  Representative Salazar who was also the main sponsor of the bill…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…place of hope,  healing, and community for thousands of families on the Mississippi  Gulf Coast.\n\nUnder the steadfast leadership of Bishop Jason Johnson and his wife,  First Lady Kim Johnson, Abundant Life has grown into a vibrant  congregation committed to spreading the Gospel of Christ and uplifting  those in need.\n\nFrom youth outreach to disaster…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…offer a special congratulations to the Northwest Florida  State College women's basketball team.\n\nOn April 1, 2025--actually the same day that I was sworn into  office--the Lady Raiders took on Alabama's Shelton State Buccaneers,  and took home their third national championship in 5 years, with a  final score of 62-53. Their overall record this season…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…good government oversight all of my career in the Senate.\n\nSecond, the Times said I called the raid at Mar-a-Lago, where the FBI  reportedly searched the rooms of the First Lady and Barron Trump, a  miscarriage of justice. Of course, when the Times said that, they  didn't include my full tweet. They left out the beginning of the  sentence where I said:…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…me say, should be looked at. Now, to my  horror, who has come to light that should be looked at, what was their  involvement? Was there some involvement then? She is a good lady from  the Virgin Islands. Where did Jeffrey Epstein live? In the Virgin  Islands. He was a constituent in 2019. Was she a friend in 2007 during  her service to the DOJ, which…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…this selection marks the pinnacle of their  work. Their family-run operation represents the excellence and  tradition that define Michigan's growers and exemplifies the First  Lady's Christmas theme: Home is where the heart is.\n\nMr. Speaker, I am grateful to honor this achievement and celebrate  the role Michigan will play in bringing Christmas spirit…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697288/recognizing-korsons-tree-farms"}, {"senator": "John Rose", "party": "Republican", "sentence": "…drastic, punitive, and harmful to banks and credit unions. It also  stands to harm the very people it purports to protect.\n\nMr. Speaker, I share with you today a story of a lady in one of the  towns in my district, Lafayette, who said to me fairly recently:  ``Please don't take away my overdraft protection.''\n\nIf the Consumer Financial Protection Bureau…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689836/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…building a foundation of a legacy that his  children will carry forward.\n\nJaime's success was never about business. It was about service.  Together with Patricia, he served Our Lady of Guadalupe Church,  teaching pre-marriage classes. In 1995, they became ordained family  life ministers.\n\nJaime volunteered in Millard Public Schools as a translator, mentor,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Celebrating Lord Botetourt High School's 2025 VHSL Title Victory\n\nMr. CLINE. Mr. Speaker, I rise today to recognize the exceptional  achievements of Lord Botetourt High School Lady Cavaliers basketball  team, who were recently crowned the 2025 Class 3A State champions.\n\nThe Lady Cavaliers capped an extraordinary 26-3 season by toppling  previously undefeated…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Division VI State Basketball Playoffs, the Columbus Grove Bulldogs  overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Columbus Grove Lady Bulldogs  defeated the Rootstown Rovers to win their first state basketball  championship. The members of this very special team have shown that  their sport requires an individual…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690078/recognizing-columbus-grove-high-school-winning-the-division-vi-state-girls-basketball"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…there by themselves. I  wasn't armed. Imagine doing that for a living day in and day out.  Imagine pulling a car over on the side of the road and not knowing if  it is just a lady or a man who had a little bit of a lead foot or  whether it is an escaped killer who is going to gun you down.\n\nThat is the danger that the men and women of law enforcement…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…think about what we were talking about a few days ago back in North  Carolina--my colleagues Mr. Knott and Mr. Harris are here--with the  senseless murder of the young Ukrainian lady on the light-rail line. It  turns out, by the way, that she and her family lived in my district.  Then, of course, there is also the senseless murder yesterday, the  assassination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Thanksgiving. David has worked on bringing together many of the  spiritual groups and civic organizations within the community to help  hurricane victims. Thanks to these efforts, Our Lady Queen of Peace  served 12,000 families during the six weeks after the hurricanes. David  still works with Fresh Start for Pasco, Endeavors, and Pinellas  Emergency Operations…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690173/recognizing-david-cruz"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the Hillsboro High  School Lady Indians softball team.\n\nThe Lady Indians had a historic season this year that saw them  achieve over 20 wins and secure the Division 4 regional championship  for the first time…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693117/recognizing-hillsboro-high-school-lady-indians"}]