[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Petroleum Institute. He  is someone who has voted against bills like the SAVE Act, which  endangers the voting rights of women in our country. He is someone who  voted against the Laken Riley Act, which allows the persecution and  racial profiling of Latinos by ICE agents. He is someone who voted  against the recent Republican continuing resolution, which…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…murderers, sex offenders, drug traffickers, child abusers,  gun criminals, gang members threatening our communities, killing our  citizens like Jocelyn Nungaray or Rachel Moran, Laken Riley?\n\nFor the other 30 percent, they are illegal aliens who broke our  immigration laws. They literally broke our laws.\n\nI know that the gentleman from Louisiana feels so…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the last administration, the Biden  administration was completely what I would call willfully blind to the  threat posed by people coming unvetted across our borders.\n\nFrom Laken Riley, to Kayla Hamilton, to Jocelyn Nungaray, the victims  of illegal aliens are numerous and must not be forgotten. What makes  these tragedies so heartbreaking is the knowledge…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…done in 4 years?\n\nMr. Speaker, I have only got 60 seconds, but let's break it all down:  border closed; mass deportation of illegal immigrants; fentanyl  smuggling dropping; Laken Riley Act signed into law; inflation cooling;  egg prices down; gas prices falling; astronauts back home; 11 American  hostages freed; reducing the Federal bureaucracy, saving…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…immigrants were apprehended in one day. It is  amazing. Deploying common sense and actually enforcing the law goes a  long way.\n\nHouse Republicans passed legislation like the Laken Riley Act and the  Violence Against Women by Illegal Aliens Act that protect American  citizens. That is what Americans overwhelmingly voted for in this past  election, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…kick, a really difficult thing for them to kick.\n\nWe heard people being talked about here on the Senate floor. I want  to mention a few names that no Democrat will ever utter: Laken Riley,  Rachel Morin, Jocelyn Nungaray, Kayla Hamilton. These are American  daughters, American sisters who were murdered by illegal aliens.\n\nBy the way, Laken Riley's murderer…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to stand up and use the legislation that we did pass  in January to enable suit against the Federal Government when they  failed to secure the border that we included in the Laken Riley Act  because States can no longer be beholden to a Federal Government that  refuses to secure the border.\n\nWe have a reprieve under President Trump. That reprieve will…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…different than mine. Mine  focused purely on anti-Semitism here in the world, but he brings up a  valid point, not only for Jews but for many innocent victims, whether  it was Laken Riley or whether it was the women who were raped, the  women and men who were killed, those who were beaten, or those who were  hurt who were in law enforcement.\n\nIllegal immigration…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to codify this into law. I do not like ruling by executive  order all the time. This is stuff we need to codify.\n\nI hope that we can learn from the good experience with the Laken  Riley Act and how our functioning Republic is supposed to work to get a  piece of legislation done. This one had good, strong bipartisan  support. The President signed it.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…attempted to enter the country and gang  members from MS-13 and Tren de Aragua invaded the interior of the U.S.\n\nSome of these monsters took the lives of innocent Americans, like  Laken Riley and Jocelyn Nungaray. While President Biden barely  expressed empathy for the lives he put at risk, President Trump took  action, deporting these violent criminals and…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…222, the SAVE Act; hold rogue activist judges  accountable, H.R. 1526; bring transparency to institutes of higher  education, H.R. 1048; make changes to our border with the Laken Riley  Act and the HALT Fentanyl Act; and to repeal the Biden-era harmful  environmental regulations by passing what we call Congressional Review  Acts to undo the damage of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…licenses, in-State college tuition, and free healthcare. For  illegal aliens, the U.S. has been an all-you-can-eat buffet. However,  the American taxpayer and innocent women like Laken Riley, Jocelyn  Nungaray, and Rachel Morin have paid the full price of the left's open- border agenda.\n\nIt is time to turn off the faucet permanently. American taxpayers  shouldn't…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…was ambushed,  raped, and murdered by an illegal alien on a hiking trail in Maryland  in 2023.\n\nIf this was about justice, their hearts would have broken for the  family of Laken Riley, a 22-year-old nursing student in Georgia who was  brutally murdered while out for a jog nearly 2 years ago this day,  beaten and strangled to death by a Venezuelan illegal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…diseases.\n\nRepublicans are also making our communities safer. We began this year  by passing a bill from Senator Britt and from Senator Ted Budd of North  Carolina. It is called the Laken Riley Act. It was the first bill that  we passed this year and the first bill that President Trump signed into  law. It mandates the detention of illegal immigrant criminals.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…terrorist networks. Some are given safe haven by  foreign governments. Others, like Tren de Aragua, take orders from  Nicolas Maduro. Americans have paid the price for it.\n\nLaken Riley, a 22-year-old nursing student, was murdered in Georgia  by a confirmed member of Tren de Aragua. Claretha Daniels and Justin  Lawless were executed outside of their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…13-year  Mesa Police Department veteran, who was struck by a previously  convicted illegal alien who was drunk when he struck Brandon.\n\nSomewhat probably most infamously, we have Laken Hope Riley. Riley  was a 22-year-old nursing student who attended Augusta University. She  was killed by a Tren de Aragua gang member illegally paroled into the  country under…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]