[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black officer to earn the rank of lieutenant general, Gregg       didn't just climb the ranks, he fundamentally redefined what       was possible.\n\nIn the unforgiving landscape of 1940's America, Gregg's       early military career could have been defined by the       limitations others sought to impose. During the Vietnam War,       his innovative…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…where iconic species like wolves, polar  bears, and caribou roam. Beluga and bowhead whales shelter in its  coastal waters. Millions of migratory birds rely on this intact  landscape and the critical waters and wetlands that are the NPR-A.\n\nThe legislation before us today would withdraw a smart and well- thought-out plan to balance conservation and development…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, for years, we have watched dangerous  conspiracies like Pizzagate and QAnon shape our political landscape.  They helped fuel the rise of President Trump and were built on baseless  claims about secret pedophile rings, while the real documented case of  child sex trafficking involving…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696814/epstein-files-transparency-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and\n\nWhereas, on this occasion of its demisemiseptcentennial, we celebrate  Defiance College's enduring legacy, its significant contributions to  the educational and civic landscape, and its bright future in the years  ahead;\n\nNow, therefore, I, Congresswoman Marcy Kaptur, proudly recognize and  commend Defiance College on its 175th anniversary. May…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…central bank digital currency (CBDC). This bill  would stifle innovation at the Federal Reserve as they research and  develop ways to meet the evolving money and payments landscape, keeping  the U.S. behind the starting line as other countries race ahead and  compete to develop and implement CBDCs. As much of our transactions  have moved away from using…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…themselves, and they want to keep it that way. Surely,  anyone who represents a rural district in this Congress can appreciate  that.\n\nI encourage my colleagues to look at this landscape and examine these  bills and their impacts before voting, to see the value of the Arctic  and its worth to all Americans, not to simply brush this off as a  party-line vote.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…by  America's enemies rather than allowing the Department of Defense to  counter the threat, allowing extremism and propaganda to proliferate  across the internet and media landscape.\n\nThe bill continues House Republicans' attacks on the right of women  to seek an abortion and the rights of minorities to be protected from  discrimination, while destroying…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…term, given sky-high tariffs levied by the U.S. against       Chinese goods--and in particular EVs manufactured in China.\n\nIt is a reminder of how divergent the automotive landscape,       and the consumer experience, have become between China and       the U.S., the world's two biggest economies and auto markets.\n\nChinese electric cars are an exceedingly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…HOYLE of Oregon. Mr. Speaker, I rise today in support of H.R.  249, a bill that would ensure that the name of Congressman Bill  Pascrell, Jr., will forever be etched into the landscape of the city  that he so passionately served.\n\nThis legislation would rename two beloved landmarks within Paterson  Great Falls National Historical Park, the Scenic Overlook…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691126/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mrs. DINGELL. Mr. Speaker, I rise today in strong support of S. 2878.\n\nThe Great Lakes aren't just a part of Michigan and the heartland's  landscape. They are part of our economy, our identity, and our  heritage. They are more than 20 percent of the world's freshwater and  must be protected.\n\nThey provide drinking water…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…role model, investing in the growth and advancement of future legal  professionals. Her influence extends far beyond the courtroom, leaving  an enduring mark on the legal landscape through her advocacy, guidance,  and commitment to ensuring equal access to justice for all.\n\nThe decision by the Black Women Lawyers Association to formally  change its…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…contracts with SDBs and businesses owned by women and minorities is  essential to bridging the gap between what current statistics show and  a more inclusive advertising landscape. This bill would help achieve  this goal while also promoting transparency and encouraging federal  agencies to strive to reach minorities, who often receive the news from…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, in the ever-changing landscape of community  media, I am pleased to salute the 17th anniversary of the launch of  Scarsdale10583, the online source for local news and information in the  village of Scarsdale…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Madam Speaker, Chaco Canyon is sacred ground. It is  the ancestral homeland and living landscape to both Pueblo and Dine  people. It is a World Heritage Site, a place of ancient ruins, kivas,  and sacred lands as far as the eye can see. It is a place that is a  mere…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697106/chaco-canyon-is-not-for-sale"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…are our dairy farmers. It is a hard, hard job, but it is  one where families have done it from generation to generation.\n\nThere is enormous pride in being custodians of the landscape and  caring for the animals and the herd, and in providing nutritious milk  for the community. And there is a lot of pressure on our farmers. This  whole milk bill is an…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…first to not only volunteer, but to take  initiative when he sees a community need. He spends many hours  volunteering on the weekends maintaining cemeteries and managing the  landscape downtown and has also spent many hours assisting with  hurricane disaster relief. He enjoys helping others and can't say no  when asked for help.\n\nDelman's story reflects…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…weekend and issues that the minority party  has brought up.\n\nThe first issue I bring up is that regarding DEI. DEI or Affirmative  Action has been a big part of America's landscape over the last 60  years, and it is not something that is going to go away overnight.\n\nPresident Trump can do what he can to wipe out this odious  philosophy, but nevertheless…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…ARTIFICIAL INTELLIGENCE APPLICATIONS FOR                     TERRORIST ACTIVITY.\n\nIt is the sense of Congress that--\n\n(1) the heightened terrorism threat landscape and the       increasing utilization of generative artificial intelligence       by foreign terrorist organizations represent a national       security threat, and the challenges…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Wyoming's outstanding small businesses during this Small  Business Week.\n\nLike Wyoming's diverse topography, from pastures to sagebrush to  majestic mountains, our small business landscape boasts a robust  variety of services and industries. We have small businesses catering  to the oil and gas industry and mining and energy, and we have boutique  shops that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…directly by clarifying the legal  status of digital assets and establishing well-defined regulatory  responsibilities between the SEC and CFTC, creating a more predictable  landscape for market participants while preserving critical investor  protections and maintaining the integrity of U.S. financial markets.\n\nThis legislation reasserts the role of Congress…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…recreation predates the  recreation area's establishment and has allowed visitors for  generations to explore some of the most remote and beautiful stretches  of this remarkable landscape.\n\nConsistent with this history, the National Park Service issued a rule  in 2021 that expanded the permissible uses of off-road vehicles  throughout Glen Canyon, but groups…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…unforgettable victory solidified the Nation's legacy of excellence both  on the ice and on the global stage. We owe these men a debt of  gratitude for transforming and shaping the landscape of American hockey  over the past four decades.\n\nI thank Congressman Stauber for his leadership and his speech. It was  very good. I thank all of my colleagues in advance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Over 40 years covering the Nebraska-Iowa area, Rob became a trusted,  reliable voice for generations of Nebraskans. After 33 years at KETV,  Rob's impact on our state's media landscape is nothing short of  significant.\n\nThe breadth of Rob's career was reaffirmed when he recently accepted  the Nebraska Broadcasters Association's award for Best Election…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699390/recognizing-rob-mccartneys-outstanding-ketv-career"}, {"senator": "French Hill", "party": "Republican", "sentence": "…career.\n\nAs a former president of the Arkansas Bar Association and member of  the  American College of Trial Lawyers, John Gill has left an indelible mark  on our State's legal landscape over his six-decade career.\n\nFrom serving as a delegate to the 1969 Arkansas Constitutional  Convention and shaping the Arkansas Supreme Court's Rules of Civil  Procedure,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Regrettably, housing production is not keeping pace with       demand. Among the significant headwinds facing the home       building industry is an unpredictable regulatory landscape       that adds costs and reduces the availability of buildable       lots--making housing more unattainable. This legislation       respects environmental protections and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…down after you  swallow it. This is how I talk to medical students--because of peptic  ulcer disease.\n\nAnd there came along a medicine called cimetidine. It just changed  the landscape. And we went from a surgery being most common to one  which was rarely performed in 6 months. Cimetidine, which is now called  Tagamet, which is now sold over the counter--just…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691544/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…economic history. As the county grew rapidly in the  latter half of the 20th century, particularly with the development of  new communities like Spring Hill, the business landscape became  increasingly diverse and fragmented. In a decisive moment of unity and  forward-thinking, leaders Morris Porton, Steve Emerson, and Vince Vanni  worked to consolidate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…business.\n\nWe desperately want to create good, strong, predictable tax policy so  that our companies and our families can continue to thrive and continue  to understand what their landscape is for them to compete and go and  create more job growth and actually go and create more revenue for our  Nation to become a wealthier nation. This is a priority for  Republicans.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "French Hill", "party": "Republican", "sentence": "…enduring features, including cabins, trails, and the historic  Mather Lodge. For a century, families have enjoyed its scenic  overlooks, hiking trails, Cedar Falls, and the landscape.\n\nMr. Speaker, I congratulate Petit Jean State Park on its centennial  and its enhancement of the beauty of the Natural State. I thank the  many State park rangers and related…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN.  350, a bill to direct the Secretary of Agriculture  to select and implement landscape-scale forest restoration projects, to  assist communities in increasing their resilience to wildfire, and for  other purposes, and be referred to the Committee on Agriculture,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693756/discharge-and-referral-s-350"}]