[{"senator": "Al Green", "party": "Democrat", "sentence": "This is their land, their home.", "title": "Dark Days", "date": null}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "I promise, if you go to your community and ask them about this dirty  water permit bill that you guys are pushing for, as well as what was  passed with the energy bills, overwhelmingly, across party lines, they  will tell you to protect our land, our soil, our water, our  environment, and our health.", "title": "Promoting Efficient Review for Modern Infrastructure Today Act", "date": "2025-12-11"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "It provides a stable and predictable framework to guide  and balance the multiple uses of our public lands and resources based  on the needs of today and into the future.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "During Europe's largest land war since World War II, the strategy saves  its harshest criticisms for our allies rather than Russia, with war  criminal Putin, who started the war.", "title": "National Insecurity Strategy", "date": "2025-12-11"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "In fact, the Arctic Refuge is home to hundreds of iconic wildlife  species, including 200 species of birds that have called this landscape  home since long before humans stepped on this continent.", "title": "-9999", "date": "2025-12-03"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "In the Western District of Virginia--which covers more of Virginia's  land mass but a smaller portion of the Virginia population--Senator  Merkley, we had a process like you do in Oregon, and Senator Warner and  I recommended two candidates to the White House, and one was a  gentleman named Todd Gilbert.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "They are about acknowledging the  labor, land, and lives stolen, and beginning to repair what has been  broken.", "title": "Violations of Rights By Ice", "date": "2025-06-12"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "We now face one of the most important tests of our democracy in over  150 years: Whether the Federal Government will blatantly steal the  assets of an independent sovereign nation, who is our ally, for no  legitimate reason other than lust for land.", "title": "Greenland", "date": "2026-01-13"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "A decade ago,  Burma's military junta engaged in a violent persecution of the Rohingya  minority, forcing 1.5 million people to flee to Bangladesh and  Thailand.", "title": "Burma", "date": "2025-12-10"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "The only way this  cease-fire will succeed is if it is the beginning of a relentless,  tireless process that aims to get us to the two-state solution--two  states for two peoples; a safe and democratic Jewish state of Israel  alongside a sovereign state for the Palestinians that are indigenous to  the land where they now live as envisioned in the President's 20-point  plan and has been U.S.", "title": "Gaza Cease-Fire", "date": "2025-10-23"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Under federal law and presidential executive orders (EOs), the CFA  has review authority for federal property in D.C., certain military  property, certain coins and medals, D.C.-owned parks and buildings and  certain private land in D.C.", "title": "Introduction of the Commission of Fine Arts District of Columbia Residency Act", "date": "2025-08-12"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "He has even threatened to forcibly annex Greenland from our ally  Denmark.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Both of these countries were founded by Europeans who landed on a  large land mass, took control from the Natives with their superior  arms, and developed a cowboy culture at the heart of their national  ethos.", "title": "Gun Violence Tragedies", "date": "2025-12-17"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "It was noticed under the Federal Land Policy and Management  Act.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "When people see Air Force One on TV, when they see it land in other  countries--whether in London or Tokyo or Brazil--they immediately know  that America has arrived.", "title": "Qatar", "date": "2025-05-12"}, {"senator": "French Hill", "party": "Republican", "sentence": "Jack  Kennedy famously called out their unwillingness to pay for their own  defense stating how wrong it was to let the Europeans live off the fat  of the land in American economic and military security.", "title": "Greater Sanction Pressure on Russia", "date": null}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "It was a transformational experience that we will keep with us for  the rest of our lives, and it was, in large part, thanks to Father  Kelly's leadership, faith, and commitment to helping others experience  the power and the history of the Holy Land.", "title": "Welcoming Reverend Eamon Kelly", "date": "2025-11-20"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "80) providing for       congressional disapproval under chapter 8 of title 5, United       States Code, of the rule submitted by the Bureau of Land       Management relating to ``National Petroleum Reserve in Alaska       Integrated Activity Plan Record of Decision''.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "This legislation addresses legal uncertainties surrounding the  University of Utah's use of land initially conveyed to the school by  the Bureau of Land Management back in 1968.", "title": "University of Utah Research Park Act", "date": "2025-12-15"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "President, I rise in support of the resolution that  Senator Cramer and I introduced to overturn the Bureau of Land  Management resource management plan for North Dakota.", "title": "National Defense Authorization Act for Fiscal Year 2026", "date": "2025-10-08"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Alaska Native people used to have a right, starting in 1906, for a  Native allotment; that is, 160 acres of land that if they can prove  this is where their family raised them and hunted and fished, they  could get that allotment--160 acres.", "title": "National Defense Authorization Act for Fiscal Year 2026", "date": "2025-10-08"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "It states very  clearly: ``Congress shall have the power to declare war, grant letters  of marque and reprisal, and make rules concerning captures on land and  water.''\n\nYet, the key thing is that Congress shall have power, not abdicating  our roles and responsibilities and not continuing endless wars that  spend trillions of dollars and thousands of American lives.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "It could save $2.3 billion, with a b, annually by reducing flood damage  and improving over 6,000 acres of coastal marsh and land to help  mitigate storm surges.", "title": "Providing for Consideration of H.R. Saving Homeowners From Overregulation with Exceptional Rinsing Act; Providing for Consideration of H.R. Affordable Housing Over Mandating Efficiency Standards Act; and Providing for Consideration of H.R. Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-07"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "2389) to take certain land in the State of Washington into trust  for the benefit of the Quinault Indian Nation, and for other purposes.", "title": "Quinault Indian Nation Land Transfer Act", "date": "2025-12-09"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "What we can do is  ensure that their courage and their service and their legacies are  recognized by the highest office of our land, the Office of President.", "title": "Medal of Sacrifice Act of 2025", "date": "2026-02-02"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Additional Pribilof Island transition completion actions.", "title": "Coast Guard Authorization Act of 2025", "date": "2025-07-23"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "For generations, Arkansas counties with large swaths of Federal  forest land have received a share of Federal timber harvest revenue on  Federal land.", "title": "Secure Rural Schools Reauthorization Act of 2025", "date": "2025-12-09"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "For years, rural communities with large amounts of Federal land faced  a structural disadvantage.", "title": "Taking An Important Step for Rural America", "date": "2025-06-10"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "As a fourth-generation rice farmer, he was the true  embodiment of the steward of the land and a great steward of common  sense, too, I might add.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Again, the ACA has been the rule of the land for 15 years now.", "title": "-9999", "date": "2025-10-02"}]