[{"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "Though we sit on opposite sides of the political aisle, recently we all came together to respond to this sudden, unprecedented health and economic crisis, approving the largest economic recovery package in American history."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "\"This is the largest economic recovery bill ever passed by Congress, and it's necessary."}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "If you  do not and you want to end America's largest economic self-sabotage  ever, then vote against this rule and stand up for the American people."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "In his first public appearance in Kentucky since mid-March, Senator McConnell also discussed his legislation, the CARES Act, which became the largest economic rescue package in American history."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in American history, and led it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "These federal funds were made available by the Coronavirus Aid, Relief and Economic Security (CARES) Act--the largest economic rescue package in history--which Senator McConnell introduced and shepherded to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "The bipartisan CARES Act, introduced by Senator McConnell, became the largest economic rescue package in American history."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in American history, and led it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in history, and shepherded it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in American history, and led it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in history, and led it to enactment in about a week."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "As the state's second largest economic sector, and the breadbasket for the entire eastern seaboard in the winter months, Florida's agriculture industry is vitally important for economic and food security for the state, region, and nation."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "As Senate Majority Leader, I was proud to advance Kentucky's priorities in our bold rescue package, and I will continue helping our families and communities make it through this crisis.\" \n\nSenator McConnell introduced the CARES Act, which became the largest economic rescue package in American history, and led it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "The CARES Act, which became the largest economic rescue package in American history, is making an $11 billion impact on Kentucky."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "The vitality of Florida's largest economic sector, tourism, is dependent upon pristine water conditions."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in American history, and led it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senator McConnell introduced the CARES Act, which became the largest economic rescue package in history, and led it to enactment in about a week."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "The federal funding was made available by the Coronavirus Aid, Relief, and Economic Security (CARES) Act, the largest economic rescue package in history that Senator McConnell introduced and led to enactment in about a week."}]