[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Beautiful Bill. As everyone watching can tell,  things haven't gone according to plan. The bill has been bucking under  its own weight, the delays have piled up, and it is obvious large  chunks of the Republican conference don't like their own bill.\n\nBut, of course, we are hearing that Republicans may still try to  bring this legislation to the floor as soon…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…of the worst cancer-causing toxic air pollutants to avoid Clean  Air Act requirements that protect the air that we breathe.\n\nIt would eliminate a 2024 EPA rule that ensures large industrial  facilities like chemical plants and oil refineries control their  hazardous air pollution. Hazardous air pollutants are known or  suspected to cause cancer, birth…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…35 years of supporting the U.S.- Japanese relationship.\n\nThroughout her career, Makiko served more than 90,000 Japanese  nationals in the Los Angeles area, and she played a large role in the  Consulate's emergency response to the 1994 Northridge earthquake and  again during the attacks of 9/11 on our country.\n\nI thank my good friend and neighbor, Makiko.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690737/recognizing-makiko-shirai"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…area, including  Republican County Executive Steve Neuhaus, a U.S. Naval Reserve  officer, and State and local officials on both sides of the aisle.\n\nThe mission to warehouse large numbers of humans is the exact  opposite of what the President and DHS Secretary  Kristi Noem constantly proclaim: to root out the most dangerous thugs  and criminals. In fact,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…what East Palestinian residents have asked us to do for over 3 years.  Press conferences do not replace legislation, and communities cannot  rebuild on empty words.\n\nMeanwhile, large corporations continue to resist stronger national  safety rules and real accountability, while pursuing massive corporate  expansion and relying on congressional inaction to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…reflecting  and virtuous mind and exhibit the continuance of the Union as a primary  object of patriotic desire. Is there a doubt whether a common  government can embrace so large a sphere? Let experience solve it. To  listen to mere speculation in such a case were criminal. We are  authorized to hope that a proper organization of the whole, with the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…reflecting and virtuous mind and exhibit the continuance of the Union  as a primary object of patriotic desire. Is there a doubt whether a  common government can embrace so large a sphere? Let experience solve  it. To listen to mere speculation in such a case were criminal. We are  authorized to hope that a proper organization of the whole, with the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…owner in my district owns several coffee shops and  worries about her employees being able to afford healthcare. She feels  responsible for her employees, but healthcare is a large expense for a  small business. The ACA premium tax credits provide affordable care to  her employees, allowing her coffee shop and her employees to thrive.\n\nAnother small business…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…doing,  in reality, is giving billionaires the national credit card and telling  them to go hog wild, racking up $14 trillion in national debt over the  next 10 years so that large corporations can pay less in taxes. That  doesn't lower costs for middle-class families in this country.\n\nIf this were a bill that we were talking about that would lower taxes…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689918/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…what the policy is this week, or at least  today, with respect to agriculture in California or any other State.\n\nPresident Trump heard from the Secretary of Agriculture and large  agrarian interests saying that his immigration policies were destroying  agriculture in America by getting rid of tens of thousands or hundreds  of thousands of people who…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…seniors and those with       disabilities, not just healthcare for the poor. Additionally,       nearly 50 percent of all Medicaid enrollees are children.\n\nGiven some of the large numbers coming out of Washington,       we are concerned that there is no practical way to       accommodate some of the proposed massive reductions and still       provide…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…the costume lab at the theater department, and my  grandfather was a scientist. He was a biochemist who spent four decades  unlocking the key to how our metabolism works--in large part thanks to  funding from the National Institutes of Health. My grandfather and his  colleagues pioneered breakthroughs that impacted biochemistry around  the world, leading…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…United States has a moral obligation  to use its power to end this tragedy. A critical step is demanding the  U.N. Relief and Works Agency is immediately reinstated in Gaza for  large-scale aid delivery.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694108/ongoing-massacre-in-gaza"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…season of the Baldwin Park Braves.\n\nAfter enduring a five-game losing streak, the Braves turned their  season around with determination and teamwork and ultimately secured an  at-large bid into Division 11 playoffs.\n\nIn the playoffs, the Braves became a different team and dominated  their way to the CIF Division 11 championship game.\n\nThis was the first CIF…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Operations  Commander Admiral Frank Bradley, and retired U.S. Southern Commander  Admiral Alvin Holsey.\n\nBeyond these strikes, the Trump administration has spent months  conducting a large-scale military buildup in the Caribbean but has  completely failed to explain the rationale to Congress. A military  posture that includes a carrier strike group is wildly…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…resources abound.\n\nIsn't it ironic that the resource management plans for the three  States that we are talking about are Alaska, Montana, and North Dakota,  States with very large landmasses, with abundant resources, and not a  lot of people? That is the definition of rural America.\n\nThe previous administration was attacking rural America, and they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…getting in through Buffalo and  other borders into the United States.\n\nAlthough the gentleman from New York is from a fairly populous State,  he is not from a State without a large rural border, one that you can  simply walk across with impunity normally, which has been used to  smuggle drugs successfully.\n\nThe point I make here today--and I thank the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…House the joint resolution (S.J.       Res. 18) disapproving the rule submitted by the Bureau of       Consumer Financial Protection relating to ``Overdraft       Lending: Very Large Financial Institutions''. All points of       order against consideration of the joint resolution are       waived. The joint resolution shall be considered as read. All…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…already in the hole.\n\nBy 2035, the United States will be spending more on interest per year  than all Federal programs, aside from Social Security. Right now,  Federal debt is so large that 40 percent of all personal income taxes  go to paying interest on the Federal debt. Think about that. We have  over a trillion dollars a year in interest.\n\nSpending drives…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…weapons. It indicated that the arms had       been intended to be smuggled into Lebanon.\n\nAccording to Israel, the Radwan force had in recent years       planned to carry out a large-scale invasion of northern       Israel, but was forced to shelve the scheme after Hamas       attacked southern Israel from Gaza on October 7, 2023,       plunging the region…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…beauty industry--especially  through her professionalism, attention to detail, and passion for her  craft. Her salon attracts clients from diverse backgrounds, notably the  large Eastern European community in Bucks County. Through her ability  to blend American and Eastern European techniques with ever-changing  trends, her business serves as a true…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the United States House of Representatives. They exemplify  how American innovation can serve as a solution to the issues that are  facing our communities and the Nation at large.\n\nTherefore, on behalf of the United States House of Representatives, I  am honored to recognize JB, JT, and ECO-CLEAN Solutions for reaching  this significant milestone and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…traveling in Iowa, Mr. Van Orden's combat training kicked in to  help save an 11-year-old boy. He and his wife, Sara, were on Interstate  35 outside of Osceola when they heard a large boom. A minivan had  collided with a semitruck attempting to reenter the interstate. They  immediately turned around and rushed to the scene.\n\nUpon arrival, Mr. Van Orden found…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695712/recognizing-derrick-van-orden"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…dominant force back then,  Pinal County's economy has exponentially grown and expanded over time,  but agriculture remains a significant part of the county's economy,  while large-scale farming operations and ag research also prevail.\n\nPinal County has experienced significant population growth in recent  decades, becoming one of the fastest-growing counties…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…position was compromised by local goat  herders. Faced with a difficult ethical decision, the SEALs let the  herders go. Within hours, they were surrounded and ambushed by a large  force of Taliban fighters.\n\nDespite being heavily outnumbered and outgunned, the SEALs fought  valiantly. Michael Murphy, despite being shot, moved into the open to  get clear…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Burger has served roughly 200,000  perfectly seasoned patties to long lines of locals and travelers since  2019.\n\nNFA Burger's recognition was earned without flashy branding and large  investors. This emphasized the quality, consistency, and community  support of a small business operating in a humble setting.\n\nThis commendation serves as a reminder that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I met with a lot of angry constituents over  the last 2 weeks. They are angry about how expensive America has  become. They are angry, in large part, because they realize one simple  truth: The Somali pirates are not in the Horn of Africa anymore. They  are right here in our country, and their captain is Tim Walz.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…gas.\n\nUnder the landmark 1980 Alaska National Interest Lands Conservation  Act, ANILCA, the Range was expanded to its present size of 19.3 million  acres--an area nearly as large as South Carolina--and renamed the  Arctic National Wildlife Refuge. Section 1002 of ANILCA directed the  Department of the Interior to study the oil and gas potential of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…his loved ones, so too do I pray for our country.\n\nWe are in a perilous moment. We don't yet have all the facts about  yesterday's horrifying events, and the killer remains at large. What we  do know is that political division has continued to deepen in this  country and that political violence is on the rise.\n\nWith a loss this profound, with evil this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the Department of       Energy Research and Innovation Act (42 U.S.C. 18644);\n\n(C) modeling and simulation, machine learning, artificial       intelligence, data assimilation, large-scale data analytics,       predictive analysis, and advanced computational, storage, and       networking capabilities in order to optimize algorithms for       purposes related…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}]