[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "His tariffs have hit  families with the largest tax hike in half a century."}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "The Trump tariffs represent the largest tax hike in American history."}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "has had the largest tax increase as a percent  of GDP since 1993 because of tariffs."}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "The majority has hit the American people with the largest tax  increase on the middle class in at least 50 years."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "It would also have been the largest tax increase in  American history."}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Just a few days ago here in this Chamber, House Republicans voted to  deliver the largest tax cut in American history."}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "When you look at the actual tax cut package to those folks who are  hardest hit with high food prices, rent prices, and gas prices and are  now, finally, getting relief, let alone families who are enjoying the  largest tax cut in American history with this package, it is smart  policy to reward those families that make America work every single day  and to recognize that sometimes the government has left them behind and  that we need to step up and help those folks most in need."}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Speaker, I am proud of the work our Republican  majorities are putting in to deliver American families the largest tax  cut in American history."}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Again, the largest tax increases on American history would have  happened on January 1 of this year had we not completed that, and we  got it done 6 months prior to that crisis."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "We can continue down our current fiscally  unsustainable path where we have waiting lists for Medicaid,  insufficient border security resources, and are facing the largest tax  hike in American history, or we can change course."}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Congress passed the largest tax cut in American history,  delivering relief directly to families and workers."}, {"senator": "Brian Babin", "party": "Republican", "sentence": "It prevents the  single largest tax increase in American history and refocuses safety  net programs for those who truly need them, not the ones shamming."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Every single Democrat voted for  the largest tax increase in American history."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "These tax cuts  delivered historic growth for the economy, and if we fail to extend  them, families and businesses will face the largest tax hike in  history."}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "This bill, now law, allows Hoosiers to avoid perhaps  the largest tax hike in our history."}, {"senator": "Jason Smith", "party": "Republican", "sentence": "This is the largest tax cut for working families, farmers, and small  businesses in U.S."}]