[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…readers with  disabilities. This Center has touched the lives of over 750 children  and adults across our state. Today and every day, we thank this  institution for its lasting impact on our West Michigan community.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…innovative teaching strategies,  unwavering commitment to student success, and active pursuit of  professional growth. Through her commitment to education, Edie has left  a lasting impact on both her students and colleagues.\n\nEdie's service and devotion to Spotsylvania County Public Schools is  truly deserving of this recognition. I am honored to congratulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…from Saint Mary's College of California. She  also earned a School Management Certificate from UCLA.\n\nIn addition to her district leadership, Parvin Ahmadi has made a  lasting impact at the state level. As President of the Association of  California School Administrators (ACSA), she represented more than  18,000 administrators serving six million students.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Affairs Coordinator for New York  State Senator Jeremy Cooney, she has dedicated her career to amplifying  underrepresented voices and advancing policies that create a lasting  impact. Whether championing local initiatives or supporting statewide  policy efforts, she brings passion and dedication to every role she  undertakes.\n\nRose is known for her…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Association of Government Accountants, and the  National Academy of Public Administration. Earlier this year, he was  inducted into the Government Hall of Fame for his lasting impact on  accountability, fiscal responsibility, and public trust in government.\n\nAs Gene's term as Comptroller General concludes, his legacy at GAO  and in public service is…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…am  grateful Chicago is home to such a treasured American franchise that  reminds us of the promise of America.\n\nCongratulations to McDonald's on 70 years of leaving a lasting  impact.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Beyond that, Woodgrove High School was recognized in Virginia for its  growing attention to environmental awareness and stewardship. The  students' efforts have made a lasting impact on the school and  community.\n\nI extend a special thank-you to the students, teachers, and parents  for their expertise and guidance along the way. The Woodgrove High…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…through leadership and mentorship       programs, internships, and scholarships deserve the highest       commendation. Over the past decade APAPA-SOC has       made a lasting impact on our community and uplifted many       young leaders across the country and in California's Eighth       Congressional District. APAPA's work is making great strides…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694253/congratulating-the-asian-pacific-islander-american-public-affairs-solano-county-chapter-ahead-of-their-10th-anniversary"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…congratulating several remarkable Girl Scouts from Girl Scouts of  Eastern Missouri for demonstrating extraordinary leadership, refreshing  creativity, and a commitment to making a lasting impact by earning the  most prestigious award in Girl Scouting, the Gold Award.\n\nGold Award Girl Scouts are trailblazers who address the most pressing  issues facing their communities…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694102/recognizing-gold-award-girl-scouts-from-eastern-missouri"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…unrest, she ensured that the  Guard remained a trusted force for stability and service in our  Colorado communities.\n\nMajor General Clellan's remarkable career has had a lasting impact  and has inspired generations of service members, particularly women  pursuing leadership roles in uniform. Her service reflects the very  best of our military.\n\nIn recognition…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…with great pride and admiration that I recognize Jason Barber  this Hispanic American Heritage Month. His advocacy continues to uplift  and enrich our community, leaving a lasting impact for generations to  come.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Brigade in Sloan,  Nevada. Colonel Dinh's leadership positively impacted the lives of  countless servicemembers.\n\nI am certain that his dedication and achievement will have a lasting  impact on the Army's ability to fight and win our Nation's wars.\n\nUpon retirement, Colonel Dinh is recognized for his distinguished  service and exemplary performance of duty,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…reforms to the National Labor Regulation Act, aligning Missouri's  agenda with national priorities.\n\nMr. Thomas' service is not only defined by awards and titles, but by  the lasting impact of his work. He forged partnerships between unions  and civic groups and strengthened the role of labor in addressing  housing, healthcare, and education challenges. Additionally,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…invaluable to the college.\n\nKathleen's widespread involvement demonstrates her enthusiasm for  public education systems in the Inland Empire. Her hard work has left a  lasting impact on many, as seen by her recognition as Chaffey College's  2002 Alumni of the Year, and with Chaffey College being named a top-10  finalist for the 2017 Aspen Prize for…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…is with great pride that I honor JoAnne Meade Young as a 2025  Woman of the Year for her exceptional leadership, her steadfast  advocacy for educational equity, and her lasting impact on the Santa  Barbara community. Her work has enriched generations of students and  continues to strengthen the Central Coast.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…service to the  State of Nebraska. I wish him, Joni, and his entire family all the best  in the years ahead and congratulate him on a career defined by respect,  service, and lasting impact.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699724/recognizing-and-thanking-judge-james-worden-upon-his-retirement"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Security to come to the  same conclusion. Democracy in Burma needs America's help.\n\nMr. Speaker, I urge all of my colleagues to support this bipartisan  bill that will have a lasting impact.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Gray, who has been named the Cass  City Junior Citizen of the Year for 2025. Kacee exemplifies the values  of hard work, dedication, and service, making a profound and lasting  impact on Cass City and beyond.\n\nA soon-to-be graduate, Kacee plans to attend Alma College to pursue a  Bachelor's Degree in Business, with the goal of becoming an insurance…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…She is deeply passionate about mentoring  youth in agriculture and remains active in Farm Bureau leadership.  Through her advocacy and hand-on mentorship, Reba has made a lasting  impact on the next generation, including her four grandsons--Mayland,  Myles, Waylon, and Warren--who are already learning the values of hard  work, stewardship, and service…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…distinction, each Scout identified a specific  issue close to their hearts and utilized teamwork and collaboration to  effect positive change in their community, leaving a lasting impact.\n\nCarolyn Koch, a graduate of Blanchester High School, created a Build  Community Through Theater program to engage youth and help them develop  confidence. Promoting drama…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690079/congratulating-girl-scouts-of-western-ohio-on-gold-award"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…important  that we pick servant leaders who are committed to our Founding ideals  and to protecting the role of the judiciary.\n\nThese are lifetime appointments. He will have a lasting impact on  both Montana and the Nation.\n\nI have no hesitation when I say Bill is the top choice to serve as  Montana's next Federal judge. I have seen his commitment to our State…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696331/nomination-of-william-w-mercer"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…baseball, and as the National Honor Society and One Act Play adviser.\n\nAs the LPGE director recently noted, Dave's positive presence and  willingness to serve have made a lasting impact on generations of  students and staff. He is a reminder that the success of our school  depends not just on what happens in the classroom but on the selfless  dedication…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…particularly extend my sympathies to my House colleagues  representing the Minnesota delegation. We mourn the loss of Melissa and  Mark Hortman, remembering their lives and the lasting impact they had  on the State they loved so deeply.\n\nWe send warm wishes of recovery to John and Yvette Hoffman, who have  displayed true courage through this nightmare.\n\nMy prayers…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Mr. Speaker, I rise today to honor the well- deserved retirement of Dr. Tom Johnson, a dedicated leader and public  servant who has made a lasting impact on Lamar State College Orange and  the community of Southeast Texas.\n\nFor seven years, Dr. Johnson has led Lamar State College Orange with  passion, determination, and…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…let up.\n\nI also want to give a special shout-out to three players from the  Millcreek area--Luke Owen, Jack Evan, and Malakai Philip--whose efforts  on the court made a lasting impact.\n\nTheir hard work, and the hard work of the entire team, has brought  pride to their school and to our entire community.\n\nCongratulations again to the Titans on an outstanding…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690115/recognizing-the-olympus-high-school-titans"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…nickname ``The Fongressman.''\n\nOver the years, I was fortunate to be mentored by Doug. He was a  great role model and friend. His guidance, leadership, and example left  a lasting impact on me and on so many others who had the honor of  working with him.\n\nDoug will be remembered for his deep love for his family, his faith  and core principles, his unwavering…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698728/9999"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…I rise to recognize the  outstanding contributions, hard work, and legacy of Colonel Richard  Tucker. His dedicated service to Alabama and the United States has made  a lasting impact on the lives of many.\n\nColonel Richard Tucker is a graduate of the United States Military  Academy in West Point, New York, where he was commissioned in 1998. Mr.  Tucker…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…30 years of faithful and honorable service, Timothy retired  from the United States Marine Corps. His experience, professionalism,  and devotion to country have left a lasting impact on the lives of  countless Americans. His legacy is one of sacrifice, integrity, and  duty, and we offer our deepest gratitude for his outstanding service to  the United…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has demonstrated an ongoing  commitment to service, fellowship, and leadership. Their contributions  are an indelible part of the Grass Valley community and have made a  lasting impact on our region.\n\nTherefore, on behalf of California's Third Congressional District and  the United States House of Representatives, I am pleased to recognize  the Rotary…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…exemplified integrity, approachability, and a deep  respect for local government's role in serving the public.\n\nAfter years of dedicated service, Mayor Keller leaves a lasting  impact on the borough and the people he served. His commitment to  community engagement and civic responsibility stands as an example of  how local leadership plays a vital role…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}]