[{"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…who  crossed the Edmund Pettus Bridge in Selma, arm-in-arm with 600, 700  activists and driven by a conviction to secure the right to vote. I  rise thinking about how 60 years later, we are seeing attempts to pull  our country back in time, to bring us back to an era of barriers at the  ballot box and restrictions on registration.\n\nMr. Speaker, as I rise…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688732/9999"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…1965 annual meeting, the LHSAA denied St. Augustine's  membership request but amended its constitution to allow LHSAA and  LIALO schools to compete against each other.\n\nA year later, Rummel, Shaw and Cor Jesu were admitted by a two-thirds  vote of LHSAA principals; St. Aug was not. Although the local Catholic  school principals voted to admit the school…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…all starts happening now.\n\nSo when we are told, why are we forcing the issue now? it is because  now is when the issue is upon us. When we are told, why don't we  negotiate later? my question is: Why aren't we negotiating now? Why  would we believe when we are told that you will negotiate later on this  when you won't negotiate now on this? Now when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…closed.\n\nAnd in 1989, a heart surgeon and coin collector from       California arrived in New York to be honored by the society       for his beneficence, only to be arrested--and later       convicted--instead. During his occasional visits, the good       doctor had been pocketing rarities worth about $1 million: a       gold coin of the Roman Emperor Hadrian…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Institutes       of Health. I told my dad I would work there one day. He said       no, that place was for doctors and scientists. I knew I would       find a way.\n\nMany years later, I did. In March 2008, I began my journey       at NIH, working with several institutes until I found my home       at the National Institute of Neurological Disorders and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…fled by Navy Ship to escape communist rule, and on May 15, he  arrived at the Guam Orote Point Refugee Camp where he volunteered as a  physician at the Army hospital. A month later, he served at Camp  Pendleton and eventually settled in Gardena, California.\n\nIn 1976, he passed the Educational Commission for Foreign Medical  Graduates. Before his eager…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…improvement through  advanced studies in school administration at both Auburn and Tuskegee  Universities. He served as a teacher and principal at Susie E. Allen  Elementary School and later became the Director of Community Education  for the Phenix City Public Schools, overseeing Head Start and Adult  Education Programs.\n\nIn addition to his contributions to education,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…or the right of the people peaceably to assemble.''\n\nI read these words today, the very first of the Articles of our Bill  of Rights, the First Amendment, because 250 years later, our President  does not seem to recognize them.\n\nWe were born from assembly. We live by free speech and a free press.  These are the core tenets of our United States. Yet,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…summer and fall, when Republicans told us that this  wasn't the right time to negotiate these subsidies over the shutdown,  they said: Don't worry. That doesn't expire until later in the year. We  are working on a plan.\n\nLater is here. What does this Republican plan do to extend the ACA  subsidies? It does nothing. It does absolutely nothing. This is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698373/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…in Massachusetts alone have now dropped coverage, meaning they  have no insurance at all.\n\nRepublicans don't have a plan to replace ObamaCare. They never have.  Fifteen years later, I am starting to think that they never will.\n\nNow, another thing that Donald Trump promised: no corruption and full  transparency. Remember that promise? Seriously, how much…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…about the  threat that the Trump administration poses to Social Security.\n\nIn February, Elon Musk called the program the biggest Ponzi scheme of  all time. Then a few weeks later, he referred to Social Security as the  big one to eliminate\n\nThese are not empty comments. They are real threats. Under this  administration, we are seeing mass firings at…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691162/threats-to-social-security"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…break down.\n\nHow can we be assured that these bipartisan agreements are being made  in good faith if Republicans are just going to turn their backs on them  just a few months later? How can we be sure that the funding laws we  pass will help all of our communities succeed if our Republican  colleagues will simply let President Trump pick who wins and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…President Trump summoned FBI Director James Comey to a one-      on-one dinner in the White House in which, according to       Comey, the president asked for a pledge of loyalty. He later       reportedly pressured Comey to drop investigations into his       recently departed national security director, Michael Flynn,       pressed Director of National Intelligence…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Trotter Wagstaff\n\nMr. LATIMER. Mr. Speaker, every now and then, there are people born  who personify the essence of love in action. On November 2, 1946, Lynne  Louise Trotter, later Lynne Louise Trotter Wagstaff, was born in  Harlem, New York. She was one of those people.\n\nLynne attended St. Catherine of Siena and graduated from St. Pascal  Baylon High…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…my oath  of office into this body. My children stood with me. My then 13-year- old son, who was very excited, impressed some people with his dance  moves.\n\nLess than a week later, my son, Jackson, showed up at school to find  out one of his classmates was dead. He had killed himself accidentally  using a loaded gun as a prop to film a music video. My…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…SANCTIONS WITH RESPECT TO FORCED ORGAN                     HARVESTING OR TRAFFICKING IN PERSONS FOR                     PURPOSES OF THE REMOVAL OF ORGANS.\n\n(a) List Required.--Not later than 180 days after the date       of the enactment of this Act, the President shall submit to       the appropriate committees of Congress a list of each person       that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…required under paragraph (1)(A)''.\n\n(b) Guidance.--The Secretary of Health and Human Services,       acting through the Commissioner of Food and Drugs, shall--\n\n(1) not later than 12 months after the date of enactment of       this Act, issue draft guidance on the implementation of the       amendments made by subsection (a); and\n\n(2) not later…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…`rural area' has the meaning       given such term in section 343(a) of the Consolidated Farm       and Rural Development Act (7 U.S.C. 1991(a)).\n\n``(b) Establishment.--Not later than 180 days after the       date of the enactment of this section, the Secretary shall       establish a program of research, development, demonstration,       and commercial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…submits to       the Secretary an offer to acquire the property described in       subsection (b) for market value, as determined by such       appraisal, the Secretary shall, not later than 180 days after       receiving such offer, convey to Tony's Wabeno Redi-Mix, LLC       all right, title, and interest of the United States,       including mineral rights,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…girls, to protect young people online from  nonconsensual intimate images.\n\nWe saw both parties come together and pass landmark legislation, and  just a moment ago, 24 hours later, we saw the same thing happen.\n\nSo I thank my colleague from Nevada for moving for this to pass by  unanimous consent. And I want everyone to reflect on what you just saw…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…to attend the Naval Academy and become a pilot at just 8  years old. He fulfilled that vow after graduating from Annapolis in  1951 and earned his wings in Pensacola 2 years later.\n\nHe flew combat missions in Korea, survived nuclear weapons testing in  the Pacific, participated in Cold War operations during the Taiwan  Strait crisis, and then played…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…RESTORATION PROGRAM.\n\nSection 4(e)(3) of the Pittman-Robertson Wildlife       Restoration Act (16 U.S.C. 669c(e)(3)) is amended--\n\n(1) by inserting ``, not later than 180 days after the date       on which the State submitted the comprehensive plan,'' after       ``, the Secretary'';\n\n(2) by striking ``, as redesignated'';\n\n(3) by striking…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697624/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…the Commission prior to public filing, provided that the       initial confidential submission and all amendments thereto       shall be publicly filed with the Commission not later than--\n\n``(A) in the case of an initial public offering, 10 days       before the effective date of such registration statement;\n\n``(B) in the case of an initial registration…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…service took him to eight  ground and airborne units across Europe, Asia, the Mediterranean, and  the Middle East, as well as two units within the continental United  States. He later became a platform instructor, training airmen entering  the airborne reconnaissance career field. During his distinguished  military career, Tom was awarded the Meritorious…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Augusta University and had a  distinguished career in hospitality and real estate. He worked at  Augusta National Golf Club, Sea Island Company, and Brunswick Country  Club. Joe later became a top producing realtor, specializing in luxury  properties.\n\nA devoted church leader, Joe served as an elder and deacon,  supporting organizations like Manna House…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…County Magistrate's Office--Bexar County is where San  Antonio is--issued a protective order against Poulos with instructions  not to contact the family members. Three days later and less than 24  hours before the January 22 shooting of seven San Antonio cops, Poulos  violated his protective order by visiting a prohibited residence and  threatening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…between  deficits and taxes, but deficits and taxes are two sides of the same  coin. To spend a dollar, Mr. Speaker, you must either tax it now or  borrow it now and tax it later. Taxes and deficits are both driven by  spending.\n\nThis bill rescinds some of the most stupid spending in the entire  Federal Government. These are the kindest cuts of all:…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693724/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…regarding each sensitive       government mission within Class B airspace operated during       such month.\n\n(2) Rulemaking and administrative action.--\n\n(A) In general.--Not later than 1 year after the date of       enactment of this section, the Administrator shall--\n\n(i) issue or revise regulations to update section 91.225(f)       of title 14, Code…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…the spread of repressive ideology.\n\nIn 1987, President Reagan famously called on Secretary Gorbachev to  ``tear down this wall'' at the Brandenburg Gate. A few short years  later, the Berlin Wall fell, the Soviet Union collapsed, and democracy  gained ground across the globe.\n\nIn the years that followed, democracy and Western values flourished,  but…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…their concerns, and we are addressing them yet again this week.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on the previous  question, ``yes'' on the rule, and then, later, ``yes'' on the bills  that will be presented as a result of this rule.\n\nThe material previously referred to by Mr. Neguse is as follows:       An Amendment to H. Res. 242…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]