[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…commercial remote sensing space  systems. Since that time, the commercial remote sensing industry has  changed quite dramatically.\n\nToday, companies from across the world are launching commercial  remote sensing systems and selling the data. We must ensure that the  United States remains at the forefront of this industry, especially as  the Chinese Communist…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…and chief  in 2022.\n\nChief Carlson additionally served as the director of the city's  Office of Emergency Management from 2015 to 2022. His leadership was  instrumental in launching the police department's community resource  and crime prevention division and its social media and emergency  communications systems.\n\nDeeply respected in the community by…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697972/recognizing-police-chief-denton-carlson"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…independent,  pursuing justice without fear or favor, but under this administration,  it has become an instrument of Presidential revenge, a sword and shield  for the President launching investigations of critics and dropping  cases against allies.\n\nHis Justice Department--and I say ``his'' because it no longer  represents the public or justice but is run…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…their disability, deserves a shot at  participating in our economy and getting that shot at the American  Dream. Whether it is getting a job in a local small business or  launching their own startup, this bill directs the SBA and the National  Council on Disability to collaborate on ways to help individuals with  disabilities do just that.\n\nBy passing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…first year in office followed a familiar       script. Like Alberto Fujimori, Hugo Chavez, and Recep Tayyip       Erdogan, America's new president began his tenure by       launching blistering rhetorical attacks on his opponents. He       called the media the ``enemy of the American people,''       questioned judges' legitimacy, and threatened to cut…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the United States  hooked on expensive oil and gas and dependent on OPEC and other foreign  actors with interests opposed to our own; and while he is doing that,  China is launching into a new age of relatively cheap energy that will  power their data centers and their infrastructure.\n\nRhode Islanders deserve infrastructure that creates good jobs;  provides…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Speaker, I rise today to sound an alarm on  a crisis threatening America's future. I am talking about the Trump  brain drain.\n\nDonald Trump and Republicans in this House are launching a full scale  assault on our Nation's ability to think, learn, and to innovate.\n\nLet's look at the facts. Trump's budget cuts funding for the National  Science Foundation,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…out  the red carpet for Putin, has only made the war worse. Ever since  President Trump has tried to blame the war on Zelenskyy and Ukraine,  Putin has ramped up the war, launching more aggressive attacks than he  ever has in the 3\\1/2\\ years of the war, and most recently, sending  drones over Poland, as well.\n\nWeakness invites aggression, and I know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…local man who was among the several dozen men who       joined Brown, would recount decades later.\n\nAs many as 60 men gathered in the Providence harbor that       evening, launching boats and muffling their oars to quietly       row out to the Gaspee under cover of darkness. As they       approached the ship, a confrontation began--with one of the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…responsibility.\n\nThese actions certainly do not sound like mere drug enforcement  against organized criminals--not even close. These are actions you take  before you consider launching a major military operation against  another country, and that authority--the Constitution is clear--must  come from Congress.\n\nNobody here denies the Maduro regime is horrific…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…President Trump changes his tariff policy  more than most people change their socks. One day he is picking fights  with Canada and Mexico, our friends, and the next day he is launching a  global trade war. Today, he is pausing tariffs on some countries while  also increasing them on China. What our farmers, ranchers, and  producers need is certainty.\n\nI…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…and community empowerment.\n\nAnita's visionary leadership at UJA-Federation transformed the  landscape of aging and disability services in New York. She was  instrumental in launching the state's first programs for Naturally  Occurring Retirement Communities, helping thousands of seniors age with  dignity in the communities they helped build. She led one…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…neighborhood.\n\nWith no interest in democracy, he has made clear that this is a war  for oil and that he will work with any pawn that will get it to him,  even those who are launching a new wave of repression in Venezuela.\n\nColombia, Mexico, Greenland--he is handing Putin a gift by dividing  NATO. Our allies had to meet yesterday to defend Denmark on Greenland…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698602/war-for-oil"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, launching a criminal investigation to  coerce the Federal Reserve is a dangerous crossing of the Rubicon--even  for Donald Trump, who has crossed many Rubicons already, to his  detriment…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to talk about bipartisanship, he should focus on keeping his side  of the street clean first, because Donald Trump and Russell Vought have  made clear they want to continue launching partisan broadsides that  will inflict deep harm on the American people, raising costs,  unleashing chaos, inviting even deeper corruption across the Federal  Government.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693852/appropriations"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Security. It lifts burdens off the backs of working parents,  retirees, and disabled veterans.\n\nThe truth is, Mr. Speaker, whatever name you choose, this bill will,  and is, launching the golden age of America because, as Shakespeare  reminded us, it is not the name that defines the value. It is the  action the bill takes, and this bill, by any name, is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…rises 716 feet into the Florida sky. For  almost 60 years, it has stood as a symbol of American space ambition.\n\nThis is where the mighty Saturn V rockets were assembled, launching  Apollo astronauts toward the Moon. It is where three decades of the  space shuttle fleet took shape, and that legacy continues today, where  work is being done to prepare…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689663/recognizing-extraordinary-work-of-kennedy-space-center"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Gabriel, with comprehensive treatment and community support.\n\nGabriel's remarkable mother, Kitara Johnson-Jones, has turned her  immense heartbreak into a call for action, launching Gabriel's  Challenge, a community response to fentanyl, starting on Mother's Day  and extending to Father's Day.\n\nShe is rallying the community to identify the gaps in support…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690498/recognizing-gabriels-challenge"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…finals last month.\n\nSelected from over 1,000 entries from across the Nation, the students  qualified as national finalists after designing, building, flight  testing, and launching their rocket under highly specified requirements  to target an impressive 790 feet and land while keeping the rocket's  payload intact.\n\nOn May 16, I was delighted to welcome…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692513/recognizing-the-accomplishments-of-4-h-students-from-fillmore-county-nebraska"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…pathways to brighter, more stable  futures.\n\nThis anniversary is not just a reflection on the past but a  celebration of what is to come.\n\nAs part of this milestone, ACCAP is launching a monthlong  celebration, including the placement of donation boxes throughout  Armstrong County. This is a wonderful opportunity for all of us to give  back and to ensure…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…months. This sort of hate is completely unacceptable in our  society, and, of course, we all know it needs to stop.\n\nI commend FBI Director Patel for quickly responding and launching a  full investigation into this targeted attack. I trust that the FBI and  law enforcement will do their job and swiftly find justice for these  victims.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691714/boulder-colorado-attack"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the end of this year  after an exceptional career of over 35 years in the fire service.\n\nIn 1991, Chief Estes graduated at the top of his class from the Butte  Fire Academy, launching him into a long and successful career. He began  working as a firefighter at a station in San Diego County.\n\nMr. Speaker, 4 years later, he joined the CAL FIRE helicopter…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…reserves, real redemption rights, and smart risk  management.\n\nFinally, the Anti-CBDC Surveillance State Act is about protecting  liberty. It blocks the Federal Government from launching a central bank  digital currency that could be used to track or control how law-abiding  citizens spend their dollars.\n\nTogether, with these three bills, this is a big step…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…including:  Jawonio, People to People, and The ARC Rockland Foundation.\n\nDuring his tenure, he modernized county services by developing a  cutting-edge computer imaging system, launching a 24-7 online records  portal, and introducing e-filing and e-recording services that improved  efficiency and accessibility for residents. His work ensured that  government…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697700/paul-piperato-post-office-building"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…get the  financing they needed to put this project together and lead the  technological development we need to go to Mars in the future. Despite  their small size, they are launching  their satellite this year, a testament to the power of American  ingenuity.\n\nThese public-private partnerships are key. It is not just a  government program. Companies like…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…to hold this role. For nearly three decades,  she worked tirelessly to strengthen economic growth, support local  businesses, and champion the people of Marion County. From launching  the Business Retention and Expansion Program to the Best of Red Rock  Awards and the Red Rock StartUP! pitch contest, Carla's leadership left  a lasting mark.\n\nWhat stands…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…to improve public safety, infrastructure, and city personnel.\n\nMayor Stimpson has also championed long-term improvements, including  modernizing the city's zoning code and launching a nationally  recognized urban blight reduction program. As a founding member and  chairman of the Alabama Big 10 Mayor Association, his influence extends  beyond Mobile,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696270/recognizing-the-accomplishments-of-mayor-william-s-sandy-stimpson"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…of veterans now, not 5 or 10 years from now.\n\nThat means identifying the clinical infrastructure needed to deliver  these treatments, training and certifying providers, and launching  pilot programs to bring these therapies from the lab into real world  care settings. Again, we can't wait 5 or 10 years while veterans  continue to suffer.\n\nEvery day we…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…refugees and migrants.  Release political prisoners. Expel the Iranians, the Cubans, the  Islamic terrorists, like Hezbollah operatives, who have turned  Venezuela into a launching pad for regional instability and threats to  America's interests.\n\nIt will be a difficult road. Our best source of leverage, though,  over the interim authorities is the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…assigned to Member, Committee,  Leadership, and House Officer organizations, enhancing the orientation  program and professional development offerings for the Aides, and  launching the program's social media presence and dynamic website.\n\nMac's impact on the program is best seen in the lives and careers of  the many Aides who came through during his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}]