[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, 3 years ago this week, Russia launched an  unprovoked invasion on Ukraine. We are entering the fourth year of war  in Ukraine and 11 years of war on Ukraine since the invasion in Crimea  and the Donbas.\n\nIn the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…concerns  about crypto because he saw it as a way to pad his pockets.\n\nDuring the campaign trail, Trump ramped up his crypto involvement. In  September 2024, he and his family launched World Liberty Financial, a  crypto trading platform. Days before the Inauguration, Trump launched  his memecoin which he later used to offer access to the White House to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…stripping a million Federal workers from their collective bargaining  rights, rights they have had since 1962.\n\nWe have seen this in my home State. In 2011, Governor Scott Walker  launched one of the most aggressive attacks on workers' rights,  stripping collective bargaining rights.\n\nWhat happened? Our School of Education had a two-thirds drop in  people applying…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697978/protect-americas-workforce-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…fourth year, is intensifying to the highest levels of the war,  despite all of the oily, phony, happy talk coming from Vladimir Putin  about seeking peace.\n\nOn Saturday, Russia launched the largest drone assault of the war,  with 805 drones and 13 cruise missiles, killing 5 people and hitting  the Cabinet of Ministers of Ukraine. The Tuesday before, a glide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…now regularly occurring.'' Dr. Atul       Gawande, former Assistant Administrator for Global Health,       USAID                                 Tuberculosis\n\n``USAID [had] launched a trial of a four-dose pill that       could prevent tuberculosis in exposed individuals and       dramatically reduce cases. This intervention is at risk from       funding…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…evolving economy. This  movement featured professional educators and engaged families and  communities. It was about general knowledge and practical application.\n\nThis movement launched the United States as a world economic power.  It was essential to our national defense, and it created the conditions  for the success of the largest expansion of postsecondary…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…lead the southern campaign in the South, which caused Lord Cornwallis  to write home to his wife to say:\n\nThat damn Greene is more dangerous than Washington.\n\nSo the Gaspee launched that spirit of resentment that led to a  General Greene more dangerous than Washington, a Rhode Islander.\n\nThe story of that day is fairly simple. On July 9, 1772, another…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…condition, that there are U.S. Forces in violation of  the War Powers Resolution, or is it a hypothetical future?''\n\nCongressman   Tom McClintock said: ``If the President launched an  unprovoked attack on Venezuela . . . without congressional declaration,  we should have this debate. Until then, I think Democrats would do well  not to cry wolf on such…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…House Republicans just wasted another week  in Washington with no legislation to show for it that would address our  shrinking economy or rising cost of living.\n\nInstead, they launched a series of attacks on a national park, an  endangered species, and the ability of states to set strong standards  to protect the air that we breathe.\n\nH.J. Res. 60 would…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…initiative. She was instrumental in another grant for the  Arts Community to host 2 Art Corners, where local artists participate  and are paid. Under her watch, the MCHCC launched Vamanos Magazine  which showcased Merced's agricultural landscape, small businesses, and  local activities.\n\nIn 2022 and 2023, Ms. Fragoso's work allowed the MCHCC to partner…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…makes that clear today.                            Operation Midway Blitz\n\nMr. President, on an unrelated topic, this coming weekend will mark 2  months since President Trump launched his so-called Operation Midway  Blitz in my home State of Illinois. The Presiding Officer will remember  what it is all about. The President was sending in ICE agents dressed…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…perform. These venues  attract millions of people from around the country and the world who  want to see their favorite artists or visit the place where famous  musicians have launched their careers, all of which contribute  significantly to our local communities.\n\nMusic and musical venues are very important to my district in New  Jersey. Asbury Park has…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…colleagues to talk  about the upcoming vote on S.J. Res. 84, the use of the Congressional  Review Act to strike down a recent regulatory attack on the Affordable  Care Act launched by the Trump administration.\n\nI think my colleagues have done a pretty good job of explaining what  is at stake. Even the Trump administration's own experts at CMS, the  Centers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Bible School and Theological Seminary, earning both a  Bachelor's in Ministry and a Master's in Theology.\n\nOverseer Carter began his ministry through the power of music. He  launched his career as a DJ in Brooklyn, New York, gaining recognition  as one of the best in the United States. His musical journey included  working at WJIZ, where he earned the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…workers alike.\n\nWe saw the promise of good-paying jobs in offshore wind manufacturing  at our ports. Yet, instead of stability, this administration issued  stop-work orders and launched sham investigations that have chilled the  industry.\n\nSome manufacturing projects are pressing forward; but others have  been forced to walk away, robbing our region of jobs,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…its allies do not have any control over the  Lebanese state is just categorically false. Hezbollah and other terror  groups that operate freely throughout the country have launched  countless attacks on our ally Israel.\n\nIn the past year alone, Hezbollah has indiscriminately launched  nearly 2,000 missiles into Israeli territory, attempting to replicate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…suffered as a nation  under the Biden administration's disastrous energy policies that put  our energy security and the security of our allies at serious risk.\n\nThe White House launched a whole-of-government assault on American  energy production: slow-rolling permits; killing infrastructure  projects, like pipelines; and, most importantly, pandering to radical…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…increasing cultural and religious oppression of the Muslim       population residing in the XUAR.\n\n(8) Following unrest in the region, in 2014, Chinese       authorities launched their ``Strike Hard against Violent       Extremism'' campaign, in which dubious allegations of       widespread extremist activity were used as justification for       gross…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…two decades, the United States commercial  space sector has experienced significant growth and maturity.\n\nThe Commercial Satellite Data Acquisition pilot program that NASA  launched in 2017 is one example of how the agency has embraced this  evolution.\n\nBy enabling the continued acquisition of commercial satellite data,  the ASCEND Act will complement…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of their time--earning a reputation for building the  ``Cadillac of Firetrucks.''\n\nThough Young Fire closed in 1991, Dick's passion for innovation never  waned. In 1993, he launched the Performance Advantage Company in  Lancaster, which continues to design and distribute tool and equipment  mounting solutions for the fire service, military, and other…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to Arkansas to serve in the Arkansas Department of  Veterans Affairs and then as a director of the Arkansas Game and Fish  Commission. Under his leadership, the commission launched its strategic  5-year plan and Austin was instrumental in conservation projects that  will benefit hunters, anglers, and conservationists for generations to  come.\n\nI thank…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…under a category called  the Best Children's Hospitals ranking.\n\nStead Family Children's Hospital has appeared in rankings every year  since the U.S. News and World Report launched these indexes in 2007.  These rankings reflect more than numbers; they represent the hospital's  commitment to high-quality, compassionate, and innovative care.\n\nStead is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696467/recognizing-stead-family-childrens-hospital"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…sanctuary policies. Colorado  has become a haven for illegal immigration. In one tragic case that we  all now know about this week, an illegal immigrant who overstayed his  visa launched Molotov cocktails at innocent Boulder residents in what  was a hateful, racial attack, despite the State knowing that that  person was already illegally in our country. The…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…After his service, Richard earned an Associate's Degree in  Engineering from Valparaiso Institute, using that knowledge to become a  manufacturer's representative. In 1961, he launched his own business-- Data Electronics--which grew across five states and demonstrated his  entrepreneurial drive and success in the field.\n\nIn the years that followed, Richard…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…applications, raising costs and potentially limiting  access to capital.\n\nTo ensure we are hearing directly from those affected, the Small  Business Administration has also now launched recently a red tape  hotline, giving small business owners and manufacturers a direct  channel to report excessive or unworkable Federal regulation so we can  act on them.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Annex Item No. vii\n\n(vii) Sensitivity of Technology:\n\n1. The AIM-120D-3 series Advanced Medium Range Air-to-Air       Missile (AMRAAM) is a supersonic, air-launched, aerial       intercept, guided missile featuring digital technology and       microminiature solid-state electronics. AMRAAM capabilities       include look-down/shoot-down,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…that founding document proclaiming our unalienable  rights and self-evident truths: equality, life, liberty, and the  pursuit of happiness.\n\nThe Declaration of Independence launched the American experiment that  continues from one generation to the next. This experiment is unique in  the 6,000-year history of humans.\n\nEarlier this week, the Washington…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…happen by accident. It happened because American workers,  American innovators, and American energy producers were finally  unleashed.\n\nUnder the previous administration, we launched an indefensible freeze  on LNG export permits, a politically motivated blockade that put our  economy at risk, undermined jobs, and was just simply wrong for global  security.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Communist Party, practically giving away a port on the Black Sea that  should be for the people of Georgia.\n\nThey are also subservient to the regime in Tehran, who we know  launched attacks against Israel just yesterday; and war criminal Putin,  who seeks to indeed make the people of Georgia subservient.\n\nThe Georgian people are among the bravest and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, when Iran's proxies launched a full- scale war on Israel, October 7, 2023, President Biden pledged an  unwavering commitment to Israel's security. That was the right message  in the moment.\n\nBut as I…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]