[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Officer, USAID,       retired; Bennett Freeman, Former Deputy Assistant Secretary       of State; Susan Kosinski Fritz, Senior Foreign Service       Officer, USAID, retired; Laurie Fulton, Former US Ambassador       to Denmark; Julie Furuta-Toy, US Ambassador, retired;       Rosemary Gallant, Senior Foreign Commercial Officer, retired;       Melvin Gamble,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…important provisions  which we could all be proud of.\n\nI thank the Appropriations Committee staff in particular: Matt Smith,  Erin Kolodjeski, Philip Tizzani, Ed Etzkorn, and Laurie Mignone, who  worked tirelessly to produce this legislation.\n\nI thank our counterparts in the majority, led by my friend, Chairman  Cole, and the subcommittee chairs,   David…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Nicholas Greene, Mariah Greenlee,       Haley Griffiths, Maddisen Grimm, Khenadi Grubb, Andrew       Guernsey, Ella Gunn, Caroline Hamilton, Hannah Hancock,       Wesley Harkins, Laurie Harris, Austin Harrison, Grace       Harrison, Michael Hart, Daniel Hartl, John Hatfield, Wesley       Helms, Holly Hendrix, Bridget Henne, Bryson Henriott, Nicole       Herman,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Christmas, when people have to figure out how big that new check is  that they have to write to get the coverage which they need.\n\nI will just tell you one final story, which is Laurie. She is from  Truro. The premium for her and her husband is  going from $6,000 a year up to $26,000 a year. And Laurie and her  husband can't get coverage through an employer…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…community, academic excellence, and commitment to fostering  intellectual curiosity and character in young people.\n\nSolebury School was founded in 1925 by four visionary educators,  Laurie Erskine, Julian Lathrop, Robert Shaw, and Arthur ``Doc''  Washburn, who shared a dream of creating a new kind of educational  environment. As the school's first headmaster,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Laurie Swink has made to our community through her  work with Selah Freedom. Laurie's passion, tireless efforts, and  unwavering commitment to fighting human trafficking have not…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "Mr. KELLY of Pennsylvania. Mr. Speaker, I rise today to recognize and  honor Phil and Laurie Davis for their extraordinary service to the  veteran community of Crawford County and the Commonwealth of  Pennsylvania.\n\nPhil Davis proudly served in the United States Army…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697105/recognizing-phil-and-laurie-davis-as-a-community-champion-in-pennsylvania-16"}]