[{"senator": "Al Green", "party": "Democrat", "sentence": "…arrest and trial  after they made a video encouraging U.S. servicemembers and members of  the intelligence community to refrain from following orders if they  broke the law.''\n\nWhat does that mean if they broke the law? Well, it means this: If  the President gives you an unlawful order, you are not to follow that  order. That is what it means. By the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…the taking of this money.\n\nMeanwhile, Democrats have been listening to our constituents and  hosting townhalls--even in Republican-led States--and fighting back  against a law that does nothing for working families and everything for  the ultrarich.\n\nSenate Democrats are offering Republicans another chance to reverse  the devastating cuts they just passed--cuts…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…non-citizens to vote in federal elections in the       District. In fact, federal law has prohibited non-citizens       from voting in federal elections since 1996. Our local law       cannot and does not attempt to change that.\n\nFinally, we oppose H.R. 2056, which attempts to negate       provisions in local District law governing how MPD and other       District…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…leasing or procuring  electric, hybrid, biofuel-capable, or hydrogen fuel cell vehicles when  reasonably comparable on cost to an internal combustion engine. The  current law does not mandate buying a non-ICE vehicle. It just  establishes a preference when all else is equal.\n\nAlso, Mr. Chairman, it has many exemptions that prevent impacts to  readiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…taxpayers  better understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing. The law  does not specify how the IRS must describe the math error or require  the IRS to inform taxpayers that they have 60 days to request that the  math error assessment be reversed.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…An invasion: a significant military force coming across to attack us.\n\nThey are well-understood terms. Even with that title 10, I am very  nervous because even though the law does not say to give deference to  the President in title 10, two of the judges said you should give  deference to the President, which I find absurd because what it means  is…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…elections--namely, for Mayor, members of the city council, the State  Board of Education, attorney general, advisory neighborhood  commissioner, and ballot measures.\n\nThe D.C. law does not allow noncitizens to vote in Federal elections,  which is a crime under Federal law.\n\nRegardless of your views on the merits of noncitizen voting for local  elections,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…are already subject to Federal consumer  financial protection laws, but Consumer Financial Protection Bureau  supervision is a key tool to ensure that Big Tech follows the law and  does not misuse consumer data and that consumers are not being scammed,  defrauded, or unlawfully debanked.\n\nThis rule allows the Consumer Financial Protection Bureau to also…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…but, amazingly, alleges no misconduct.  It does not allege a violation of the Constitution. It does not allege  the violation of a Federal law or a State law or a local law. It does  not even allege a violation of the ethics rules of the House of  Representatives. Yet, they want to censure her and throw her off of her  committee--this, a distinguished…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…businesses.\n\nCurrently, the SEC small business advocate reports on small  businesses that are minority owned or women owned or in disaster- stricken areas. Yet, at present, the law does not report on businesses  in rural areas. The bill simply adds rural businesses to the list  covered by the entities of the small business advocate and the entities  that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…enforcement both by       deterring abuses of power and demonstrating that law       enforcement is not above the law. Holding police officers       accountable for violating the law does not lead to an       increase in crime in fact, D.C. saw a 30-year low in violent       crime in 2024, after the CPJRAA was enacted. Between 2010 and       2020, Washington,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…under this law. In my view, Trump's actions clearly go beyond what the  law allows, which is why Senators Shaheen, Kaine, and I have offered a  bill to make it clear that this law does not allow the President to  issue tariffs.\n\nMembers can vote today to repeal the so-called emergency Trump  declared and end the harmful global tariffs.\n\nNow, I am going to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…ended the use of affirmative action in  college and university admissions. Justice Jackson issued a strong  compelling dissent, and she wrote:\n\n[D]eeming race irrelevant in law does not make it so in       life.\n\nShe continued:\n\nAnd having so detached itself from this country's actual       past and present experiences, the Court has now been lured…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…if you look back over your shoulder, you  see there, carved into the facade of the U.S. Supreme Court, the four  words: ``Equal Justice Under Law.''\n\nEqual justice under law, what does that mean to us who grow up in  America? It means that nobody is above the law--not a politician, not a  celebrity, not a billionaire, no one.\n\nNow, we certainly know that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…non-citizens to vote in federal elections in the       District. In fact, federal law has prohibited non-citizens       from voting in federal elections since 1996. Our local law       cannot and does not attempt to change that.\n\nFinally, we oppose H.R. 2056, which attempts to negate       provisions in local District law governing how MPD and other       District…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…and legal status verification, making  sure loans go to lawful citizens is just common sense.\n\nLender concerns related to nationality discrimination are  nonsensical. This law does not prohibit lending based on nationality  but rather on legal residency or status.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge all Members to vote  ``yes'' on this commonsense…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Unfortunately, the implementation of this law has been bogged down by  bureaucratic red tape. Despite the plain wording of the law, the Bureau  of Land Management has asserted that the law does not apply to third  parties, only to the right-of-way holders of record.\n\nAs such, H.R. 331 amends the Aquifer Recharge Flexibility Act to  further clarify that an existing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691131/conveyance-for-aquifer-recharge-purposes"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…for VA life insurance programs to keep them in line  with the average cost-of-living changes.\n\nThe maximum coverage of these programs is provided by law and under  current law does not automatically adjust for changes in cost of  living. Any increases in the maximum coverage for these programs  require congressional action.\n\nWe must ensure that we have…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…all crash deaths in this  country. On average, drunk driving killed roughly 11,000 people in the  United States every year between 2012 and 2022. Yet, current  immigration law does not make aliens inadmissible or removable if they  drive drunk and recklessly break our laws.\n\nMy colleagues across the aisle will undoubtedly argue that this bill  is unnecessary…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…under the authority of this       section, such information shall be provided in a form that is       consistent with applicable privacy protections under Federal       law and does not jeopardize the confidentiality of victims.\n\n``(f) Continuity of Data and Reporting.--In carrying out       this section, the Commandant shall ensure the continuity of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…raise is that  Thrush, Feuer, and Goldman did something unforgivable. That  unforgivable thing was their article essentially accusing my  whistleblowers of violating the law. It does so, in part, by citing a  complaint filed by J.P. Cooney and Molly Gaston. These were two of Jack  Smith's partisan prosecutors--prosecutors with a mission to put  President…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…taxpayer  before obtaining a supervisor's approval. Moreover, they can shop  around for any other employee at the agency that they wish to seek  permission from since current law does not require approval from a  direct supervisor.\n\nThese loopholes undermine the no-signature, no-penalty principle.  Representative Grothman's bill received unanimous support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…VA  periodically reviews fiduciary activities to ensure that fiduciaries  are not misusing a veteran's VA benefits.\n\nWhen a fiduciary misuses a veteran's benefit, current law does not  allow the veteran to be made financially whole until after the VA  determines whether the misuse was the result of VA negligence.\n\nThese determinations of negligence…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of possessing machineguns. That sounds like that is  being made up as humor.\n\nIn 1934, we passed a law in our country saying you can't own  machineguns. It is an American law. Does anybody in their right mind-- does any sane individual who can read in our country--believe that it  applies to the security forces of a foreign dictator or a foreign  President;…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]