[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…like Brown v. Board of Education, Obergefell v. Hodges, and  Roe v. Wade have been instrumental in ensuring that all communities  have equality and protection under the law.\n\nMr. Speaker, these are dangerous times. The chapters of history have  told us time and time again that when fascism sticks its ugly head out  the window, it is the courts that they…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689393/protecting-the-legal-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Still I rise, Mr. Speaker, in mourning for the  lives that have been lost at the hands and the color of law.\n\nMr. Speaker, Mr. Pretti and Ms. Good should not have lost their lives  as they did. Yes, I stand for impeachment of Ms. Noem, the Secretary,  but that is not enough. I believe that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699601/mourning-the-lost-lives-in-minnesota"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…independent verification of conformity is ultimately       required. Most important is the increased safety that will       accrue to consumers when this legislation becomes law.\n\nMr. Speaker, we appreciate the opportunity to provide       feedback on this important issue. Should you have any       questions, please don't hesitate to contact me.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the  history of this country, having been convicted 34 times. They cannot  say one word about what is wrong and about what he is doing and how he  has no respect for the law.\n\nMr. Speaker, I call on the Republicans: Why don't you prove who you  say you are instead of being afraid of the President of the United  States, who you think will primary you? Why…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…majority's choice to  perpetuate cutting veterans' pensions. I believe that we should include  this item in any negotiations with the Senate before this bill becomes  law.\n\nMr. Speaker, I ask all my colleagues to join me in passing H.R. 877,  the Deliver for Veterans Act, and I yield back the balance of my time.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689674/deliver-for-veterans-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…to exempt materials like lumber from Trump's tariffs or why aren't we  negotiating the ROAD to Housing Act so that it can be included in NDAA  and quickly passed into law?\n\nMr. Speaker, the invitation to my colleagues on the other side of the  aisle is open. Join us in finally taking steps to address the rising  costs of housing. The American public…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…rule of law. This bill is not  intended to curtail rogue judges from issuing rogue rulings. It is  intended to enable a rogue administration to continue to violate the  law.\n\nMr. Speaker, I urge all Members to oppose this legislation.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689714/no-rogue-rulings-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…would not protect citizens from deportation. We are talking about  citizens.\n\nMr. TAKANO. Mr. Speaker, I thank Representative Ramirez for standing  up for the rule of law.\n\nMr. Speaker, I thank the gentleman from Louisiana for his  principled remarks about the importance of the rule of law in our  country and his enunciating that political dissent in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…issue and hope that we  can get all of our colleagues on board later today with a strong vote  in passing this legislation over to the Senate and seeing it signed  into law.\n\nMr. Speaker, this is the right thing to do by our veterans and by our  Medal of Honor recipients, and I urge all of my colleagues to support  this legislation.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…continuing resolution, offered by Representative Subramanyam, which  would strike the corrupt giveaway out of the text of this bill so that  it does not make it into law.\n\nMr. Speaker, this is a massive payday for Republicans. It would allow  eight Republican Senators to shovel millions--millions--of dollars into  their own wallets. I am talking about…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…across the State line, let us also reject any attempt to crown  a new monarch, whether with a golden crown or a gilded office, because  in this country no one is above the law.\n\nMr. Speaker, I wish a happy Separation Day to Delaware.                       Recognizing Gabriella Bourantas\n\nMs. McBRIDE. Mr. Speaker, I rise to recognize two extraordinary young…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…I strongly oppose this undemocratic,  paternalistic bill, which would repeal a law enacted by the locally  elected District of Columbia Government and impose a new law on D.C.\n\nMr. Speaker, I include in the Record a letter from every member of  D.C.'s local elected legislature, the council, opposing this bill.                            Council of the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…what is really going on in America today. They are  dismantling the priorities of the people as passed through the people's  House and through the Senate and signed into law.\n\nMr. Speaker, I urge my colleagues to join us in actually standing up  for law enforcement, for the police, and for community safety. I would  invite them to join us in actually standing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…majority's choice  to perpetuate cutting veterans' pensions, and I believe that we should  include this item in any negotiations with the Senate before this bill  becomes law.\n\nMr. Speaker, with those concerns in mind, I support this legislation  and ask my colleagues to do the same.\n\nMr. TAKANO.  Budzinski), the ranking member of the Subcommittee on  Technology…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689677/clear-communication-for-veterans-claims-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…appropriate to rely on this offset. I believe it would be prudent to  discuss with the Senate whether a more appropriate offset can be  identified before this bill becomes law.\n\nMr. Speaker, with those caveats I have identified, I support this  legislation, and I ask my colleagues to do the same.\n\nMr. TAKANO. Mr. Speaker, I have no additional speakers, and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…pro-illegal immigration policies by showing these cities that the SBA  is serious and is going to move its offices if sanctuary cities do not  start following Federal law.\n\nMr. Speaker, we are here to further the great work that is being done  by our communities to put a stop to the terrible overdose and substance  abuse issues in this country through…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…first place. Do you know what, Mr.  Speaker? He would not have been if it weren't for the Biden  administration's open-border policy and refusal to simply follow the  law.\n\nMr. Speaker, this is not compassion. This is not justice. This is  chaos, engineered and endorsed by some on the other side. I do hope  those on the other side who disagree with…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…my colleagues, I agree that we would not have a nation  without those we entrust in uniform, whether they serve in the  military, as first responders, or as law enforcement officers.\n\nMr. Speaker, these men and women aren't honorable because of the  badge they wear. They make the badge honorable because of the lives  they live.\n\nEvery time I return to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…other side of the aisle in this very  debate that it is already illegal to cast a ballot when you are not  eligible to vote. It is already illegal. We don't need another law.\n\nMr. Speaker, it is already illegal for a minor to purchase alcohol.  Yet the clerk says: Please show me your ID.\n\nAmerica is hungry for fair elections. I don't think it is too much…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…explaining  what led to the events that occurred last month in Los Angeles, which  explains that Federal agents were conducting immigration enforcement,  according to the law.\n\nMr. Speaker, protecting public safety should not be controversial.  This resolution is very simple. It recognizes a right to assemble and  protest peacefully, and it condemns unequivocally…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…want to do, Mr. Speaker, is allow noncitizens to  vote across the country.\n\nThe arguments that are being made fail on the merits when you  recognize that, in fact, the law, Mr. Speaker, today, allows  noncitizens who simply resided in the Nation's Capital for 30 days to  be eligible to vote. Again, individuals working at embassies across  this city are…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…thousands of kids  around the country who are fighting the same fight.\n\nThis is a very important bill, and I want to get it to the Senate as  soon as possible so it can become law.\n\nMr. Speaker, I encourage my colleagues to support this bill.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…House  Republicans are charging forward and standing up for hardworking  families and vulnerable Americans.\n\nThe legislation before us is common sense, pro-law enforcement, and  necessary.\n\nMr. Speaker, I look forward to the consideration of these important  pieces of legislation. I urge the passage of this rule, and I reserve  the balance of my time.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…from  the truth.\n\nThis is the bill for national security. This is the bill that  President Trump signed into executive order. Today is the day that we  codify this into law.\n\nMr. Speaker, I urge all my colleagues today to have a ``yes'' vote.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}]