[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Citizenship and Assimilation Grant Program.\n\nThe Immigration and Nationality Act established USCIS to administer  immigration benefits and citizenship programs. USCIS oversees lawful  immigration into the United States and provides services, including  determining eligibility for citizenship, verifying employment  eligibility, administering humanitarian…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Mr. Speaker, 5 years ago, our Nation witnessed an unthinkable assault  on American democracy when a violent crowd breached the U.S. Capitol  with one purpose: to overturn a lawful election and hold onto power by  force.\n\nLaw enforcement officers stood between that mob and the Constitution.  More than 140 brave officers were injured, and several lost…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698551/january-6-attack"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Attorney General from the State of Texas had a retort. He  refuted what the Justice Department said. He said: No, our lines were  drawn for partisan advantage.\n\nThat is lawful. If you draw the lines with race in mind, then that is  unlawful. We can't draw lines to prevent people from acquiring a  representation based upon race. We can't do that.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…unable to meet       the requirements under such section 312(a) due to disability.\n\n(4) Application fee.--\n\n(A) In general.--The Secretary may require aliens applying       for lawful permanent resident status under this section to       pay a reasonable fee that is commensurate with the cost of       processing the application.\n\n(B) Exemption.--An applicant…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…administration offered military honors for Ashli  Babbitt. Ashli Babbitt was not a hero; she was part of the violent mob  that tried to overturn our democracy. She ignored repeated lawful  orders from Capitol Police. She pushed to the front of the crowd. She  helped to smash a window into the Speaker's Lobby and attempted to  force her way through a barricaded…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…office, President Trump has fired over 20 IGs  across the government. The majority of these IG firings took place in  the first week President Trump took office and violated lawful removal  procedures as they came with no warning or rationale.\n\nIn fact, the Trump administration has kept more than three in four  presidentially appointed inspector general…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…out of ICE themselves, the  Department of Homeland Security.\n\nBut through their indiscriminate raids, this administration is  arresting not just undocumented immigrants but lawful permanent  residents as well. There are U.S. citizens who have been arrested and  detained, even veterans. Think about that: individuals who have served  our country, prepared…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…misdemeanor DUI subject to the extremely  serious punishment of deportation. It is simply not an appropriate  response.\n\nThe bill also applies to all immigrants, including lawful permanent  residents, people who Republican colleagues across the aisle have  claimed to like, the ones that they said came here the right way. It  gives no recognition whatsoever…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…President Trump demands blind loyalty from them.\n\nThe fact is, we already have a trade agreement with Canada. President  Trump negotiated it, and this body ratified it. There is a lawful  review process that goes into effect next year to find ways to improve  it.\n\nThat is how responsible governments handle trade disputes, by  following the law, not through…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…congressional authorization. It must stop today.\n\nIf the Trump administration believes military force against Venezuela  is necessary, the Constitution provides a clear and lawful path  forward: go to Congress and make the case to the American people. If  President Trump cannot make that case, then he has no business  launching military strikes, killing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Democratic colleagues and  I have asked that the legal documents justifying these operations be  declassified and shared with the public.\n\nThese are fundamental questions that any lawful military operation  should be able to answer clearly and definitively. These are not  courtesy requests; they are statutory requirements under multiple laws,  including the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…have complied with the requirements       placed upon them. The termination of TPS is not simply the       expiration of a benefit, it is stripping individuals of their       lawful status and forcibly rendering them undocumented.       People who have been authorized to work, pay taxes,       contribute to Social Security, and build their lives legally…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…not because I agree with the  affected individuals or sanction acts for which they are accused, but  because if we wish to live in a democratic society, we  must defend the lawful rights of all, including those whose actions  make them subject to the American justice system. The actions taken by  the administration to arrest, detain, or deport without…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…by illegal actions  directed by those at the very top.\n\nThe Korean people responded with courage and defended their democracy  through peaceful civil disobedience, through lawful impeachment, and,  now, through a free and fair election.\n\nThey have shown strength, unity, and a dedication to the rule of law  in a way that the rest of the world could do…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691847/south-korea-election"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Islands, and without  even going to the Ethics Committee, much less a court, they want to  arraign her on some charges based on a newspaper article that she did  something lawful. However ill-advised it may have been, she took a  phone call from one of her constituents.\n\nMr. Speaker, I don't think it is the position of the very  distinguished gentleman…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…elections, period. We should not allow illegal  immigrants to vote in our elections. This is a direct assault on the  value of American citizenship, and it undermines the voices of lawful  voters.\n\nWorse, it is part of a broader effort by the left to chip away at  Congress' constitutional authority over our Nation's Capital. The  Constitution is clear: Congress…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…is no  different.\n\nU.S. taxpayer dollars back the SBA lending programs, and adding  additional assurances, like age and legal status verification, making  sure loans go to lawful citizens is just common sense.\n\nLender concerns related to nationality discrimination are  nonsensical. This law does not prohibit lending based on nationality  but rather…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…rely on to  make  long-term investments in wireless innovation. Companies, investors, and  consumers need confidence that once they have secured spectrum rights  through a lawful process, those licenses and spectrum access frameworks  will be honored. To do otherwise puts future participation and  investment at risk.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694109/federal-communications-commission"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…going to help codify the  work that the Small Business Administration is doing to ensure that  businesses receiving Federal benefits are 100 percent owned by U.S.  citizens or lawful permanent residents and businesses that employ  illegal immigrants are ineligible for these funds. This is part of our  ongoing effort to stop subsidizing previous open-border…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…nationwide injunction using deeply flawed legal grounds against the  administration's birthright citizenship order.\n\nMonths later, Judge James Boasberg attempted to halt the lawful  deportation of violent Tren de Aragua gang members, even ordering a  removal flight to turn around in midair. These are not isolated  incidences. The D.C. Federal courts have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699053/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…or       education purpose;\n\n``(IV) in the reporting of unlawful content or unsolicited       or unwelcome conduct or in pursuance of a legal,       professional, or other lawful obligation; or\n\n``(V) to seek support or help with respect to the receipt       of an unsolicited intimate visual depiction;\n\n``(iii) a disclosure reasonably intended to assist…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…many of these crashes  have been caused by illegal aliens who jeopardize the safety of law- abiding Americans. They have killed or severely maimed U.S. citizens  and other lawful residents, depriving families of their loved ones and  causing untold human misery. Some of these aliens have driven with  expired licenses, suspended licenses, or no license…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…ensure innocent civilians are not  harmed. The Armed Services Committee is notified of every strike and  has been briefed on this operation several times. These strikes are  lawful under U.S. law and international law, and all actions are in  compliance with the law of armed conflict.\n\nMost importantly, these strikes have dramatically reduced drug  smuggling…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…agents there? ICE has nothing to do with it. It is  because ICE is spending so much time pulling nonviolent, noncriminal  immigrants out of court, where they are going through a lawful process  to come in here, so that they can be removed in expedited removal; so  that they can have their asylum claims, a lawful pathway, voided; and  so they can be kicked…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise today to express my strong support  for H.J. Res. 142, which provides for necessary and lawful  congressional oversight of the District of Columbia.\n\nThis legislation rightly exercises Congress' clear constitutional  authority to intervene in the District's affairs when…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…analysis by  government legal departments and attorneys who have studied this issue.  Unanimously, they have concluded that the action taken by President  Trump is absolutely lawful.\n\nAs Commander in Chief, if the President sees a group of terrorists  planning to harm America or our allies, he has the right--not only the  right but the duty--to do something…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…important privileges of American  citizenship. That privilege must be safeguarded. Allowing individuals  to vote without verifying their identity diminishes the voices of  lawful voters and opens the door to illegal immigrants influencing our  elections. That is unacceptable.\n\nIllegal immigrants are here in this country. They came in by over the  millions…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…identifies to       be permitting ``anarchy, violence, or destruction.''                  Returning Illegals Over Turmoil (RIOT) Act\n\nMakes any illegal immigrant, DACA recipient, or lawful       permanent resident who is arrested and convicted of       assaulting a police officer or member of the military and/or       vandalism or destruction of public property…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…and  understand directions clearly and safely.\n\nIn addition, I cosponsored Senator Moody's Safer Truckers Act, which  restricts the issuance of CDLs to only U.S. citizens, lawful permanent  residents, and individuals who are authorized for employment by U.S.  Citizenship and Immigration services.\n\nThese are commonsense reforms to restore integrity,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…paragraphs:\n\n``(10) United Nations General Assembly Resolution 2758       (XXVI) established the representatives of the Government of       the People's Republic of China as the only lawful       representatives of China to the United Nations. The       resolution did not address the issue of representation of       Taiwan and its people in the United Nations…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}]