[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…paychecks--and you can hear it already--instead of my Republican  colleagues having to defend the Department of Homeland Security with  what is happening across the country with these lawless, reckless, out- of-control agencies marauding over our cities and towns and striking  people where they work and where they live.\n\nInstead of increasing funding for the National…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today with urgency and outrage.\n\nThe Trump regime, with its lawless and cruel immigration agents, has  become a source of nightmares for children.\n\nPeople are living in hiding, fearful, as these agents are kidnapping,  assaulting, and murdering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699670/horrific-ice-abuses"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…a young woman who leaves behind her  community and an orphaned child.\n\nThis is not our country. Shame on you. To those of you who are  continuing to provide cover for this lawless, unconstitutional,  abusive, and violent administration, shame on you.\n\nI will be joining to file Articles of Impeachment against Secretary  Noem. Enough is enough.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698708/enough-is-enough"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the fiscal year, with  no path forward to prevent a shutdown and Congress's authority being  attacked by unchecked Office of Management and Budget Director Russ  Vought and a lawless Administration.\n\nSince taking office, the Trump Administration has stolen resources,  appropriated by this committee, for programs and services across the  federal government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…one in America is safe from ICE today.  Joe Rogan said that ICE agents are acting as ``villains,'' stripping  away freedoms from Americans. This agency has gone rogue. It is  lawless, and it needs to be reined in.\n\nThe ICE agents who pepper sprayed an elderly couple in Minnesota need  to be arrested and prosecuted. The ICE agents who dragged out a  disabled…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699073/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Presidency,  acted in a manner grossly incompatible with self-governance and the  rule of law, and has committed high crimes and misdemeanors in  attempting to establish himself as a lawless tyrant to the manifest  injury of the people of the United States.\n\nWherefore, Donald John Trump, by such conduct, has demonstrated that  he is unfit to govern a nation by…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…concluded that he had to  have five more seats for the Republican side in Congress, five more  seats to hold on to power, five more seats to continue to be the  reckless, ruthless, lawless President that he is, five more seats.  Because if he loses the House, he loses his ability to do many of the  things that the House can constrain him and prevent him from…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…their First Amendment  rights; to care about the 4 million Americans who are losing their  insurance, as we speak, because this administration has chosen to put  money into a lawless immigration enforcement operation instead of  protecting people's healthcare.\n\nThat is what is happening in America today. Four million people are  losing their healthcare…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…protesters, the hurt and harm of this hostile White House is felt by us  all.\n\nThis has nothing to do with law and order. That is laughable coming  from the most godless, lawless Oval Office occupant in our history.\n\nThis has everything to do with power and control: deploying the  National Guard without a Governor's approval and taking unwarranted…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is not where the person stands in times of  comfort and convenience, but, rather, where do you stand in times of  challenge--challenge, when you have a reckless, ruthless, lawless  President who is breaching the Constitution, who is doing things that  we never expected to see in our lifetimes. Where do you stand when you  have a President who is doing…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…policies are and what sanctuary policies are not.\n\nNow, as I was listening to my colleague, he has tried to paint a  picture of sanctuary States or sanctuary cities as nothing but lawless,  and I get that it is maybe a favorite sound bite for rightwing media,  but the fact of the matter is it is not true.\n\nSanctuary policies do not mean that there are no laws…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…but claims to not have enough money to fund American  healthcare.\n\nMr. Speaker, the American people want to know why the President and  Vice President are giving cover for lawless shootings by Federal agents  while using political excuses to withhold funding for our communities,  for public safety, housing, childcare, and food.\n\nMr. Speaker, the American…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698893/holding-president-trump-accountable"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…and that not all of us  in this Chamber will turn our backs on them. We are going to fight  together to restore the funding. I will continue to call out these  inhumane and lawless actions.\n\nIt is very important for the American people to know this Congress  and this Chamber authorized the funding for Job Corps. The President of  the United States does…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…country.\n\nHow did Ed Martin, President Trump's pick for one of the most  important jobs in the American criminal justice system, react to all  the extraordinary statements and the lawless actions of Mr. Hale- Cusanelli? He invited him to go on his podcast multiple times to spout  his fascist propaganda. He presented him with an award before a big  audience.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…getting away with it.\n\nNow, this self-anointed fourth branch of government, DOGE, which I  think is getting run out of town right now because of its rank  incompetence and lawless assaults on the privacy data of hundreds of  millions of Americans and its unlawful summary mass firings of  professional civil servants like air traffic controllers, food…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Americans have paid the price for it.\n\nLaken Riley, a 22-year-old nursing student, was murdered in Georgia  by a confirmed member of Tren de Aragua. Claretha Daniels and Justin  Lawless were executed outside of their Bronx apartment by six Tren de  Aragua terrorists. These were neighbors of my ranking member.\n\nMr. Speaker, a 74-year-old American rancher was…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our communities to get overrun with forced  Marxist, DEI, and critical race theory ideology that undermines the  very fabric of our community.\n\nNever again will we allow the lawless and dangerous criminals to be  on the streets because a faraway judge or bureaucrat getting paid off  by an NGO says so.\n\nNever again. Never again.\n\nThis moment of reprieve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…my good friend  Congressman Finstad.\n\nMr. Speaker, this is not about a culture war in America. This is  about putting American small business owners first, while ensuring  lawless sanctuary cities do not reap the benefits of hosting SBA  offices.\n\nIt is pretty simple. This is all about protecting America's small  businesses and making sure that Federal…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that ``has no business in our communities'' and ``must be abolished,''  and accused ICE of ``terrorizing our communities.''\n\nRepresentative April McClain Delaney called ICE ``lawless.''\n\nRepresentative Alexandria Ocasio-Cortez called ICE ``an anticivilian  force'' and said they ``should not exist.''\n\nRepresentative Rashida Tlaib said ICE is ``terrorizing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…not the time to play defense or seek some kind of negotiated  surrender; it is time to go on offense.\n\nWe have two goals: Deliver mass deportations and crush the violent,  lawless campaign of leftwing sabotage that stands in our way.\n\nThat is why I am introducing the Protect America Act. This bill does  four things:\n\nFirst, it doubles the criminal penalty…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Unity under a Constitution, under a flag, and under God,  yes. In defense of a country with shared values, yes. Not unity for the  sake of it, not turning the other cheek to a lawless bunch of  organizations designed to take down and destroy our way of life and our  country, to undermine our faith, undermine our country, undermine our  freedoms, because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}]