[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…northwest  Ohio, Mr. Steve Martin, for his selfless dedication to our community.  Steve creates community.\n\nSince April of last year, Steve has volunteered with I Want to Mow  Your Lawn, a nonprofit providing free lawn care to elderly individuals,  veterans, people with disabilities, and families in need.\n\nThrough his hard work and generosity, Steve has completed…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…year. In return, Trump has done all he can to  support Musk's business ventures, awarding billions in potential  contracts to Tesla and SpaceX. Trump even turned the White House lawn  into a Tesla showroom to try to boost Tesla sales.\n\nCommerce Secretary Howard Lutnick, whose investment firm owns  hundreds of millions in Tesla stock, went on national TV…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689221/pure-bait-and-switch"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…cumulatively, they will boil and destroy our  democracy.\n\nThe President has turned the Oval Office into an auction house. He  has put a ``for sale'' sign on the White House lawn. Influence and  power are the way to a quick profit, whether it is crypto or pardons or  many of the other perks of office. He is using it for his own personal  ends and weaponizing…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…whom lost their lives. They paraded Confederate  and Nazi symbols through these Halls, as the whip observed as well.  They erected gallows. They erected gallows on the Capitol lawn to hang  the Republican Vice President of the United States, and so stated.\n\nUnlike the past few months, the National Guard was nowhere to be  found. Donald Trump had every…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, President Trump is engaged in massive  corruption. There is a ``government for sale'' sign flashing its lights  on the lawn of the White House. He is selling access and influence  through two types of cryptocoins: a meme coin which is a digital  baseball card, and he invited the 220 people who gave…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…term.\n\nIt is also good news for all of the White House employees who helped  set  up that shameless display where Trump and his White House essentially  turned the White House lawn into a Tesla dealership, promoting Tesla.\n\nWhere is the rule of law? Where is the concern for enforcement of the  rule of law? I know a lot of my colleagues on the other side…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…batteries that took them longer distances without having to  recharge.\n\nI am kind of surprised that the President of the United States isn't  having a showroom on the White House lawn for all electric vehicles,  not just for Elon Musk's Tesla. Why not provide that kind of boost and  elevation for electric vehicles generally? And the car manufacturers  would…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…impose tariffs. It does not belong to President  Trump, no matter how many crazy rants he tweets out in the middle of  the night.\n\nYet Republicans continue to fold like cheap lawn chairs by refusing  to allow a vote on Trump's tariffs. Instead of standing up for their  constituents, they are acting as a cut-and-paste for Trump.\n\nWhy? It is because they…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699901/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…uncertainty. Even  Trump's fans sometimes grimace at his plans to remake the world  economy, worried about higher costs in a politically competitive area  still scattered with lawn signs that read: `Trump Low Prices Kamala  High Prices.' ''\n\nHe had these signs all over America, promising low prices.\n\n``Almost two-thirds of Americans disapprove of Trump's…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…have been in Congress for over 20 years, and I have never seen such  cowardice from my colleagues across the aisle. Time and time again, we  see Republicans fold like cheap lawn chairs.\n\nSenator Murkowski said it was a bad bill. Then why the hell would she  vote for it?\n\nI am here to stand up against a bill that kicks 17 million Americans  off of their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693180/one-big-beautiful-bill-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…going to  translate into increased costs.\n\nThis isn't partisan. This isn't Democrat-Republican. This is math.  And no matter how much the President wants to strut on the South Lawn-- and I am glad to see at least the South Lawn was being used for an  announcement today as opposed to another day of a Tesla show lot--who  is going to bear the brunt of this?…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the offices consider appropriate.\n\n(c) Duties of Architect.--The Architect of the Capitol       shall--\n\n(1) prepare the Time Capsule to be sealed and buried on the       West Lawn of the Capitol, at a location specified by the       Architect, on or before July 4th, 2026, at a time which would       permit individuals attending this event to also attend…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…employees--I think a little bit under  that; it might be 76,000--in the Department of Defense who are non- uniformed. I assume most of these employees are not people who cut the  lawn or something. Most of these employees are in an office, and at  least Elon Musk seemed to point out that a lot of them might not be  working that hard.\n\nUnder the defense authorization,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Building are being       restored.                            Rooftop Garden Terrace\n\nThe term ``garden terrace'' in the 2021 submission refers       to the ground-level front lawn, which serves as the roof of       the parking structure beneath. Vegetated (green) roofs are       commonly used for stormwater management, building efficiency,       and roof…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…people  would remember the lives that were lost, those who survived, and those  who were changed forever.\n\nThat is our hope. That is why that tree was planted on the Capitol  lawn this week.\n\nMy simple request for my colleagues: April 19, it is a Saturday--when  it comes, at 9:02 central time, would you just pause with us for just a  moment and remember?…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…of hard work, service, and community.  George and Joanna Katergaris along with their children, Mina and Mike,  are the longtime owners of the Wagon Wheel Restaurant in Fort Lawn,  South Carolina.\n\nFor nearly five decades, the Wagon Wheel has been a cornerstone of  the community and a gathering place for generations of families all  across Chester County.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…lived  out in every act of service.\n\nFrom the shipyards of Pascagoula to the halls of the Jackson County  Board of Supervisors, from coaching little league to mowing the church  lawn even after his diagnosis--Peter gave his time, his energy, and his  heart to others.\n\nHe was a faithful member of Escatawpa Assembly of God, a friend to  the forgotten, and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691931/special-recognition-of-the-life-of-ae-peter-pierce"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to succeed in a capitalist society is to figure out what  somebody else needs and how to get it for them better than they can get  it for themselves. It might be mowing their lawn. It might be doing  brain surgery on their child. We have to help our neighbor somehow.\n\nIt is true if I take $1 from Peter and give it to Paul, Paul is $1  richer and Peter…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697154/denouncing-the-horrors-of-socialism"}]