[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…cited vague, nonspecific national security concerns as  justification for this antiworker, anti-ratepayer, and antigrowth  decree.\n\nLuckily, Mr. Speaker, we have a government of laws. Yesterday, U.S.  District Court Judge Royce Lamberth here in Washington struck down this  frivolous decree so that crane operators, laborers, and electricians  can get back…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…about the features of digital currency.\n\nLet's talk about the EU. It is widely acknowledged that the EU has  one of the most stringent data protection regimes and protection laws  on the planet. They have strict data protections, number one, on the  GDPR, so EU citizens have access to control of their personal data.  They have the right to be forgotten,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693737/anti-cbdc-surveillance-state-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…dismantling of  Federal agencies, and attacks on our communities that, indeed, he does  not know what his constitutional duties are.\n\nI have to say, Mr. Speaker, we are a nation of laws, a nation  governed by a Constitution of the people and by the people. Donald  Trump and his administration are not above the law. We will hold them  to account, and that is…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690721/holding-this-administration-to-account"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…looks like for  bipartisanship, and I hope we are able to do more of this going  forward.\n\nMr. Speaker, I rise today for the sake of an effective criminal  justice system. The laws within our criminal code, as has been  expressed before, have become outdated and a highway to  overcriminalization. We have so many unlawful acts within our criminal  code…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…wasn't meant to be, despite what  President Trump may wish.\n\nSecond, we need to end the roving patrols. ICE does not have free  will to do as they please. This is a nation of laws, guided by the  Constitution that everyone, including ICE, must abide by. This means  Federal immigration officials must stop racial profiling and random  arrests.\n\nYou have…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Venezuela's future is decided by  Venezuelans.\n\nOur future is also in balance. Mr. Speaker, we are not a nihilist  nation. Mr. Speaker, we are a nation of values, principles, and laws.  We must act as one.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…process.\n\nAmericans sent us here to represent them and to act in their best  interest. That is why our Constitution gives Congress--not the  President--the sole power to make laws, including the power of the  purse. And that is why lawmakers routinely come together to decide, on  a bipartisan basis, how to allocate Federal funding in a way that best…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…It forces  costly delays for their friends in the oil industry because, regardless  of whether this survey work is completed beforehand, companies still  have to comply with laws that protect shipwrecks and mitigate impacts  to sites that were once above water and home to indigenous peoples.\n\nThe rule actually promotes efficiency, something Republicans…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…poverty, of  hatred, of war, he began to see how deeply ingrained in American  culture racism really was.\n\nHe began to see that the systemic racism couldn't just be overcome  with laws. I think for many African Americans today that is the  heartbreak that we face. When Dr. King spoke at the march on  Washington, he said that in many ways the marchers had come…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…All workers deserve to be paid fairly, earn good benefits, and come  home safely at the end of the day. If we truly want to prioritize  workers, then we  must strengthen the laws, including regulations that protect workers'  health and safety on the job and that empower workers' ability to form  unions and bargain for their rights.\n\nThe Trump administration,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…that  was used to seeing our freedoms ever expanding. We saw walls coming  down. We saw new democracies being born. We came to think that somehow  this was inevitable like the laws of nature; that it was the moral arc  of the universe always bending toward justice, only to see that it was  not bending toward justice.\n\nAnd to see this now at home; to see,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…enhance their military capabilities. We know these controls were  working because both nations have worked vigorously to try to  circumvent our restrictions.\n\nRight now, our laws do not explicitly cover the remote access of  technologies via network connections, including the internet or cloud  computing services.\n\nH.R. 2683 would close this gap by giving…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…New York. They have worked so hard, and they are so proud of their  accomplishments. In the face of unspeakable loss, they worked  relentlessly to change America's aviation laws to prevent a tragedy  like that that happened to their families.\n\nToday, the 1,500-hour rule is the gold standard for pilot training.  So affirming the 1,500-hour rule should…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693275/nomination-of-bryan-bedford"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…SNAP. The majority of people on  SNAP are children, are senior citizens, are people who are disabled. We  don't expect them to work, unless you want to repeal the child labor  laws, unless you want to send grandma back to the factory. That is the  overwhelming majority of people who are on the program.\n\nOf those who are able-bodied and expected to work,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…sovereign Tribal nations across the United States. Since this great  Nation's founding, the United States has signed hundreds of treaties  with Tribal nations and passed hundreds of laws reaffirming Tribal  sovereignty, self-determination, and U.S. commitments to indigenous  communities.\n\nHowever, over the last month, we have seen and heard from Tribes all…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…2189, which includes the  Innovate Less Lethal to De-Escalate Tax Modernization Act, led by  Congressman   David Schweikert.\n\nThis legislation shines a bright light on how our laws actually work  in the real world, where outdated policy can get in the way of safer  outcomes. At the end of the day, this is about encouraging tools that  help de-escalate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…of Maryland. Mr. Speaker, the average American already  thinks that you actually have to be a U.S. citizen to vote in a Federal  election. The fact of the matter is that our laws have loopholes. You  don't actually have to be a U.S. citizen in some States or don't have  to prove that you are a U.S. citizen to vote.\n\nNow, the straw man is presented that…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689429/laws-have-loopholes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…I move to suspend the rules and  pass the bill (H.R. 1764) to accord securities issued by the  International Development Association the same exemption from the  securities laws that applies to the securities of other multilateral  development banks in which the United States is a member, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…believe what we  want, where we can think what we want, and where we can say what we  want for the most part.\n\nMr. Speaker, when it comes to setting up a country and a system of  laws, they must bind us together. They must bind us together as a  community, the kind of community that could pull people from the four  corners of a country to sit in foxholes…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…GROTHMAN. Mr. Speaker, I attended a hearing today in the  Judiciary Committee. There was some confusion in the committee about  what we should be doing to enforce our immigration laws and who is at  fault for the mess we have in Minneapolis.\n\nThere are some people who are apparently under the impression we  should only enforce our immigration laws if the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698706/fixing-the-immigration-crisis"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…as members of the Board, the Chairman shall give priority to       individuals with three or more years of legal professional       experience in areas that pertain to the laws administered by       the Secretary.''.\n\nMr. BOST.  659.\n\nMr. BOST. Madam Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, I rise today in support of H.R.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699210/veterans-law-judge-experience-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…expedite or facilitate--their chances of being passed if we surgically  stitch them together in one bill.\n\nThere are a number of reasons for this, including the fact that the  laws of gravity don't always operate the same way here as they do on  the other side of the Capitol. Sometimes a bill that can move through  over here without a single objection…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…amend title 38, United States Code, to direct the  Secretary of Veterans Affairs to provide for electronic communication  relating to educational assistance benefits under the laws administered  by the Secretary, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…rules and pass the  bill (H.R. 3394) to amend the Securities Act of 1933 to codify certain  qualifications of individuals as accredited investors for purposes of  the securities laws, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3394\n\nBe it enacted by the Senate and House of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…in crime  rates which are impacting the life and safety of all Coloradans.  Colorado now ranks second in the Nation as the most dangerous State.  Without Colorado's sanctuary laws, this attack might have been  prevented.\n\nMr. Speaker, I urge my colleagues to stand in defense of American  values and join me in passing this resolution, which is focused…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…illicit fentanyl into our country is by changing one part of fentanyl's  chemical structure to create fentanyl analogues. The cartels did this  in an attempt to evade our criminal laws.\n\nRight now, fentanyl analogues are considered schedule I substances,  but only because of a series of temporary scheduling orders, and that  order is now set to expire on September…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…development of critical  pipeline infrastructure.\n\nI want to be clear: My bill would continue the safeguards of the  environment. We have some of the strongest environmental laws on the  planet. This legislation protects those laws while expediting critical  energy infrastructure.\n\nWe want to fuel our Nation forward. If we want to lower costs for  consumers,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…if this rule goes into effect that it  can potentially bring about a criminal charge and even perhaps criminal  punishment. I don't think the CFPB looked at all the criminal laws of  the States, but having practiced for many years in the criminal courts  of the Commonwealth of Virginia and having discussed it with the  patrons of the bill, the same is…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…in peace.                        Less Regulation, More Freedom\n\nMr. MANN. Mr. Speaker, every year, small businesses spend nearly  $15,000 per employee to comply with Federal laws. American companies  spend over $3 trillion a year on compliance.\n\nI am sure this is not a shock to anyone in this Chamber, but we know  that some of that cost gets passed on…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…has no  treaties with the Federal Government, no reservation land, and no  common language.\n\nAs Members of Congress, one of our most solemn responsibilities is to  ensure that laws are applied fairly, objectively, and consistently.\n\nFor over 40 years, the Department of the Interior through the Office  of Federal Acknowledgement has carried out a rigorous…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}]