[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…amicus brief against this executive order when it  was challenged in court. This attempt has been successfully halted.\n\nIn February, over a dozen religious organizations filed a lawsuit.  These organizations sued the Department of Homeland Security after the  administration rescinded guidance that would prevent immigration  enforcement in sensitive locations,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…loopholes and required more than  200 additional health plans to comply with the parity law, providing  critical protections to 120,000 consumers.\n\nHowever, in response to a recent lawsuit, the Trump administration  released an announcement that it no longer plans to enforce the 2024  regulations to protect individuals with mental health conditions and  substance…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…abuses of our past  because they don't want us to identify the abuses in our present.\n\nThe panels at the President's house must go back. The city of  Philadelphia has filed a lawsuit, and I am working with Congressmen  Evans and Boyle, my colleagues in the Philadelphia delegation, to  demand their return. However, that is not all that needs to happen.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…liberal agenda including DEI, open borders,       anti-gun hysteria, and transgender procedures forced on       children. I also filed the landmark Texas v. Pennsylvania       lawsuit and have vigorously defended one of the most       comprehensive election integrity bills anywhere in the       country. Nothing is more important to me or the office I am…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Twenty-Third       Amendment, prior to the Amendment's repeal.\n\nOpponents also argue that Congress should not grant the       District statehood because it will lead to a lawsuit. But any       court challenge will be without merit, and indeed likely will       be dismissed as presenting a political question. We       respectfully submit that Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…day now.  That same day, in Little Village, ICE arrested William Gimenez, a day  laborer, as he walked into a barber shop with his wife. William was a  lead plaintiff in a lawsuit against Home Depot and local police for  abuse. ICE retaliated.\n\nWe all saw the Cicero case: children were left crying on the side of  an industrial road after the parents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President Trump.\n\nI will highlight two examples of President Trump's reckless actions  in my home State of Rhode Island. Right now, the Rhode Island AFL-CIO  is leading a critical lawsuit against President Trump's cancelation of  the $7 billion Solar for All Program, which was designed to help low-  and middle-income families install solar panels on their homes,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…should be  IMPEACHED!!!''\n\nAnother U.S. District Chief Judge has reported receiving increased  numbers of violent threats, particularly after he began hearing  arguments in a lawsuit against the Trump administration.\n\nIn 2025, roughly a third the federal judiciary has been flooded with  threats, with data showing that these threats spike each time Trump…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…thousands or millions of people could be harmed by these illegal or  unconstitutional government policies.\n\nJust look at Donald Trump's attempt to end birthright citizenship. In  a lawsuit brought in my home State of Washington, a Reagan-appointed  Federal judge--not a Democratic-appointed Federal judge, a Reagan- appointed Federal judge--ruled that the order…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689715/no-rogue-rulings-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…the last week from documents produced by the Epstein  estate, including over 1,600 mentions of you, Mr. President. There are  emails, court documents, and statements about a lawsuit by a woman  accusing Donald Trump of rape at Jeffrey Epstein's house, whether it  happened or not. There is a sexual assault suit against Epstein in  which Donald Trump appears…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…something  he did with CBS. You see that here he was threatening libel law  changes. And while he didn't do that, apparently, what he did in the  most recent year was to do a lawsuit, a $10 billion lawsuit against the  Wall Street Journal because he didn't like something that they said. He  also attacked, of course, ``60 Minutes'' over how they edited…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…denied.\n\nClaudette Colvin, not only did she go to jail and suffer the same  indignation and humiliation as the Honorable Rosa Parks, but she did  something else. She filed a lawsuit. She was a plaintiff in the lawsuit  Browder v. Gayle.\n\nThis is the lawsuit that brought the Montgomery bus boycott to a  legal end because it was under the pen of the Honorable…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Twenty-Third Amendment, prior to       the Amendment's repeal.\n\nOpponents also argue that Congress should not grant the       District statehood because it will lead to a lawsuit. But any       court challenge will be without merit, and indeed likely will       be dismissed as presenting a political question. We       respectfully submit that Congress…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…servicewomen go through enough. We shouldn't be inviting even more  harassment. We don't need this amendment opening up the Pentagon and  the entire U.S. Government to a massive lawsuit.\n\nThis isn't good policy. This doesn't protect women.\n\nMs. JACOBS. Mr. Chair, I yield 2 minutes to the gentlewoman from New  Mexico (Ms. Leger Fernandez).\n\nMs. LEGER FERNANDEZ.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…(``LCR'') advocates for       communities of color and immigrants through legal action,       education, and economic empowerment. On March 3, 2025, LCR       fIled a federal lawsuit to block the termination of Temporary       Protected Status (``TPS'') for Haitian and Venezuelan       immigrants. The lawsuit was brought on behalf of three       immigrant…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…funding for the  California high-speed rail disaster. Yet, no sooner had the  announcement been made than the Governor of California ran to court to  file his latest frivolous lawsuit.\n\nI say ``his latest'' because it was just a couple of weeks ago that  Governor Newsom was unanimously defeated before the Ninth Circuit Court  of Appeals on his National…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693872/ending-waste-of-taxpayer-dollars-in-california"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Dakotans saw the Biden administration's plan for  exactly what it was. It was a backdoor attempt to shut down fossil  fuels in our State. That is why our State immediately filed a lawsuit  against the previous administration.\n\nAs our filing made clear: ``The amended RMP is not only unlawful and  unwise but it is also emblematic of everything that was wrong…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…in the One Big Beautiful Bill Act, as well as to urge that  the DOJ adopt this position in all litigation concerning this matter.\n\nUnfortunately, the DOJ's recent brief in a lawsuit involving NFA  registration defends the draconian NFA firearm registration and ignores  congressional intent.\n\nFirst and foremost, the legal argument to defend and keep the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, this resolution concerns a lawsuit filed in  the Oregon Supreme Court against Senator Wyden. That suit was brought  by an individual, Desmond Bellard, who is representing himself without  the assistance of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690107/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…States and the UK built one of  the most important military bases in all of human history on Diego  Garcia.\n\nWhy am I telling you this? Well, a few years ago, Mauritius filed a  lawsuit with the International Court of Justice.\n\nThe International Court of Justice, as you know, Mr. President, is  part of the United Nations, and I don't mean any disrespect,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…We ought to agree this is just the right thing to do as a matter of  public policy, not because of who is in the White House or who is the  plaintiff bringing a particular lawsuit.\n\nLook, district courts are supposed to resolve disputes between  litigants. If we adopt this thing and make it law, there is no doubt  any citizen who can walk into court…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…smelt in the San Francisco Bay-Delta Distinct Population  Segment under the Endangered Species Act.\n\nThe listing was based on flawed science in response to an ESA-related  lawsuit and adds yet another piece of regulatory red tape preventing  water from reaching California's Central Valley and communities further  south.\n\nCalifornia's Central Valley…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…nationwide injunctions were issued in the 20th century. This  exponential increase demands action.\n\nNationwide injunctions frequently extend far beyond the immediate  parties in a lawsuit, affecting entire populations and jurisdictions  not involved in the original dispute. These overreaching rulings create  significant uncertainty about Federal policies, drain…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Aquaculture Depredation Order for double-crested  cormorants, which was in place from 1998 until 2016, until it was  vacated by a judge in response to yet another activist lawsuit.\n\nDouble-crested cormorants are waterbirds common to the Great Lakes  States and the Southeast. They are opportunistic and intelligent  predators that often feed at aquaculture…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…According to a Politico article this morning, with this ruling, the  Supreme Court said that in most cases, judges can only grant relief to  the parties who brought a particular lawsuit and may not extend those  decisions to protect other individuals without going through the  process of converting a suit into a class action.\n\nI have been fighting for this…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693094/supporting-supreme-court-ruling-on-nationwide-injunctions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…where they  would egg on the violent agitators, where they would try to pick a  fight in every way they could with the President, even going so far as  to file a frivolous lawsuit that was thrown out unanimously by the  Ninth Circuit.\n\nWorst of all, these politicians decided to place the blame for the  violence on our incredible National Guard members,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…centers.\n\nThis is lawlessness, and this body should recognize it as such.\n\nIn 2024, my good friend, Sheriff Joe Roybal of El Paso County, and  other county leaders filed a lawsuit against the State arguing that  these laws are unconstitutional and that they hamper public safety.\n\nContrast that with cities like Denver, which have exacerbated their  housing…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…sent them an email, and they  did it by phone. They told the State agency that failing to promptly  approve new applicants from minority-owned businesses would result in a  lawsuit--a lawsuit--feeding accusations of racism that would be  scrawled across the news--scrawled across the news. Feeding Our Future  went to the State and said: If you stop giving…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}]