[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, Article I, Section 8 of the  Constitution grants Congress, and Congress alone, the ``power to lay  and collect taxes, duties, imposts, and excises.''\n\nAs Chief Justice John Roberts correctly noted last week, the Framers  were explicit: The executive has no given power to…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700224/create-tariff-policy-that-supports-us-economy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…laying out the full threat picture, the  intelligence behind Iran's retaliation, and the detailed scope and  timeline of any U.S. response. More importantly, I demanded they lay  out exactly what measures they are taking right now to keep our  servicemembers safe.\n\nAs I said Saturday night, Congress and the American people are owed  answers. No President…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…respect for the country I love, and I ought to be proud of it, proud to  be associated with it. I am proud because my ancestors were sacrificed  for more than 240 years  to lay the foundation for the greatness of this country, the economic  foundation. They were sacrificed. They were enslaved. They have never  been given the honor and respect that…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…grieve for  Adriana's family, for the torture they are experiencing layered with  the daily uncertainty that they are navigating as they try to do right  by their daughter and lay her to rest peacefully.\n\nHer parents are by her bedside. Her 5-year-old asked: When will Mommy  wake up?\n\nAdriana should be here today, her blood clots treated, her voice  trusted,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…services for  entrepreneurs with disabilities.\n\nBy requiring the SBA to assess current programs and identify  challenges and barriers that entrepreneurs with disabilities face, we  lay the groundwork for a better, more inclusive society and economy.\n\nSmall businesses are the backbone of the American economy. If we can  make it easier for more people to start…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…by the same company were targeted. They  have already had to make their first round of layoffs. If these awards  are not restored in the next 45 days, they will be forced to lay off 50  percent of their workforce. These are people's lives we are talking  about.\n\nAnd their local partners and collaborators who were anticipating  growth opportunities because…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…for, and conviction of treason, bribery, or  other high crimes and misdemeanors. Further, Section 8 of Article I of  the Constitution States: ``The Congress shall have power to lay and  collect taxes, duties, imposts and excises . . . but all duties,  imposts, and excises shall be uniform throughout the United States.''\n\nIn his conduct of the Office of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Democrats don't like it, and  Democrats want to do something about it, but Republicans are in the  majority.\n\nIf there is a problem with these great issues of our time, don't lay  them at the feet of Democrats. Democrats are doing as best as they can  with what they have to work with, the resources that are available to  them. These resources are not…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…century, and President Trump's  rescission package that is before us wipes out funding to a dramatic  degree for virtually all of them.\n\nHebrew Immigrant Aid Society has had to lay off hundreds of staff.\n\nWorld Relief said this:\n\nPresident Trump [has] said he will defend persecuted       Christians. [But] the U.S. refugee resettlement program is…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…improvements to Federal programs  that will support housing development and affordability.\n\nThis bipartisan bill will broaden access to homeownership, expedite  new construction, and lay the foundation for more cost-effective  housing developments across the Nation.\n\nThis legislation includes 25 housing provisions that were introduced  by Democrats and 12 banking…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…years. They are our engine of  growth.\n\nSo I have heard from small businesses all across Massachusetts, all  across our country, about how they are forcing those businesses to lay  off employees, scale back benefits, or even shut their doors in some  cases.\n\nI spoke with Brandale Randolph, founder of the 1854 Cycling Company,  an electric bike manufacturer…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Secretary  Rubio and other administration officials, no new orders have been  submitted for the next fiscal year.\n\nAs a result, Edesia, the factory in my district, has had to lay off  staff, leaving production of Plumpy'Nut slowed nearly to a halt.  Shipments meant for starving children have been stranded in warehouses.  There are boxes of this stuff…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…economic system of the time.\n\n``Because it has become increasingly difficult for individuals to  build their own security single-handed, government must now step in and  help them lay the foundation stones, just as government in the past has  helped lay the foundation of business and industry. We must face the  fact that in this country we have a rich man's…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…hide it. It was just a few short weeks ago the Republican  leader assured this body that he would never do any such thing, but  that was then.\n\nBut hide or not, the blame will lay squarely on my Republican  colleagues for the impact of what is done here tonight because tonight  is a turning point, a moment in which the majority gave up yet another  guardrail,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…districts across the country are scrambling to make decisions,  but they have unclear information and severely constrained budgets.  Many districts have already been forced to lay off educators and staff  who will not be paid without the Federal funding.\n\nFor many students across the country, the new school year starts in a  few weeks, and schools are…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…resource management plan that  blocked new coal leasing, the mine wouldn't be able to access  additional reserves and would have to close. In doing so, the mine  would have to lay off hundreds of workers and devastate the surrounding  communities that depend on the coal mining industry to drive their  local economies.\n\nWith tears in his eyes, this electrician…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…and shed a tear.      All one in the same, great American Patriots who once walked             the streets here.      Tonight across Michigan and Williamsburg as you lay your             heads down to rest.      There comes a gentle rain, are but our Lord's tears from up             in Heaven to ease your loved ones pain.      And they will…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…way of  deploying and maintaining this infrastructure, especially on the West  Coast, where permitting delays and overlapping approvals have made it  effectively impossible to lay new cables in certain areas for decades.  The chairman just described what we are talking about here.\n\nThese projects weren't stopped because they failed environmental  review.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is happening as  the train moves forward to try to resolve this.\n\nThis isn't a resolution that is going to happen with a whole bunch of  people getting involved and trying to lay out different things that  they want to get to resolution. It is going to be complicated. It is  going to be complex.\n\nAgain, I come back to the fact that there is one person…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…willingness to brief Senators on  the sensitive details of a tactical victory. But they owe it to the  American people--and, frankly, the long-suffering people of Venezuela-- to lay out the path to strategic success in much greater detail.\n\nIf the aim is to reestablish American primacy in its near abroad,  great. If the idea is to evict enemies who hate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…one which takes time,  because as everyone knows who is in business, you need to get the  permits. It takes a while to get the rights-of-way purchased, and it  takes a while to lay that cable for high-speed internet access.\n\nWith the new Starlink system which SpaceX is launching up now, this  can be not only at lower cost but, more importantly, can get…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…country that the world has ever known without  which people will be relegated to a world without the American Dream  backed by the security and safety of the people willing to lay it all  on the line to defend it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…today, President George  Washington laid the first cornerstone of the United States Capitol.  Over 50 years later, on July Fourth, Members of this body gathered once  again to lay a second cornerstone.\n\nOnce more on July Fourth, at the height of the Cold War, Congress  laid a third cornerstone. This week, with this vote today, with our  Nation's birthday…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…this clear significance would  prompt us to make sure that it is easy to build these things, but no.  The United States is one of the most difficult countries in the world  to lay and operate undersea cables. This is a national security  liability.\n\nThere is simply no reason to require a special use permit for an  undersea cable because there is absolutely…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699958/undersea-cable-protection-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the United States by improving the security of two allies that  continue to be important forces for stability in the Middle East. We  would talk about how these agreements will lay the foundation for  investment, innovation, and good-paying U.S. jobs that will boost our  economy.\n\nBut, no, these joint resolutions do not conduct oversight or provide  congressional…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692354/motion-to-discharge-sj-res-54"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…American economic comeback, and we are going to continue to build on  it, and people are going to hear that tonight when the President  speaks.\n\nTonight, President Trump will lay out his vision for continuing to  make America safer and more prosperous for the people who are here, the  citizens of this country, and Senate Republicans are going to work…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…They are giving into the system, but they are never going to  get anything out. Then, you look at the suppression of wage growth. I  know this is geeky, but I sort of need to lay a marker on the  suppression of wage growth. When you bring in millions of people across  the border who have similar skill sets, and they are often willing to  sell their skill…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…that many States continue to face challenges.\n\nThis bill would build on existing law by calling on States receiving  Federal funding to develop family partnership plans that lay out their  specific process for finding potential foster families and recruiting  and retaining them in the foster care system.\n\nThe legislation also authorizes the evaluation…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Affairs educating SHINE  Volunteers. Jerry is a true advocate and can be relied on to accept any  challenges that arise.\n\nIn addition to Volunteering with the SHINE program he is a Lay Pastor  in his church and has spent time assisting with Metropolitan  Ministries, the Shepard Center in Tarpon Springs, Cares Senior Center,  and other non-profit organizations.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…to wonder.\n\nPresident Trump, who is leading these negotiations, first asked for a  cease-fire. He said: For 30 days--maybe 45, 60 days--I am asking both  Russia and Ukraine to lay down their arms.\n\nPresident Putin said: No, I won't agree to a blanket cease-fire, but  I will stop bombing infrastructure in Ukraine. He lied like he  breathed. He continued…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]