[{"senator": "Doris Matsui", "party": "Democrat", "sentence": "…``no'' because this bill is redundant--there  is already a hotline in place for reporting red tape. Rather than  improving the process, this bill would create an unnecessary layer of  bureaucracy that would hinder, not help, the ongoing work of the SBA's  Office of Advocacy.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697466/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…330,000 people losing health insurance  is not a small number. This is a big--big--deal. That number of people  who lose their health insurance is essentially what I call the top  layer of a five-layer cake of consequences to these healthcare bills.  That is consequence one, people lose insurance.\n\nConsequence two is people who have insurance see their premiums…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…Garden and had a three-course  dinner and drinks, featuring Rose Garden salad--at least we know where  the plants went that once were there--steak, and a fudge-filled, seven- layer cake, making their cuts to food assistance even more tone deaf  than ever.\n\nA fudge-filled, seven-layer cake? I guess the theme of the White  House event was ``let them eat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…dispatchable power or baseload power; it  is that grids are getting really, really smart and capable of handling  high penetration of intermittent renewable energy. And when you layer  them on top of each other, they are no longer functionally  intermittent.\n\nSo I kind of was like--I am sort of like from the future, right,  because 10 years ago, 15 years…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…of ``choose your own tax rate.'' I repeat: They can  play a game of ``choose your own tax rate.''\n\nThe Trump policy encourages these giants to set up and abuse  partnerships--layer after layer of redtape solely for the purpose of  dodging taxes. It has nothing to do with creating jobs or launching new  product lines or areas of investment; it is just…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…significantly reducing the refining capacity in our State.\n\nA study out of USC estimated that this could increase the price of  gas to $8 per gallon by the end of next year, and then we layer on top  of that this new so-called low carbon fuel standard. It won't be long  before we are paying $9 a gallon for gas or maybe $10 a gallon for gas  in California, which…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…purchase NOX credits from electric  vehicle manufacturers and may have to purchase credits.\n\nNow, that credit is a Federal credit. The emissions credit trading  system adds another layer of complexity to the compliance and shows how  difficult it can be to marry up the Federal standards with these new  California standards. It is essentially allowing some Federal…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…methane tax. This natural gas tax was a blatant abuse of  power and the first time that the Federal Government has ever directly  levied a tax on emissions, creating a duplicative layer of red tape  that would devastate American energy, if continued.\n\nThe specifics of this tax started at $900 a metric ton in '24,  increasing to $1,200, and then $1,500 in the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…of H.R. 1804, the 7(a) Loan  Agent Oversight Act, introduced by Representatives Meuser and McIver.\n\nH.R. 1804 is an important piece of legislation that brings an  additional layer of transparency in the fight against fraud in the  Small Business Administration's flagship 7(a) loan program.\n\nThis bill would require the SBA Office of Credit Risk Management…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…counter- tunneling operations, fortifying our security system at the border.\n\nPut simply, this would help ensure that Congress has the necessary  data to forge another much-needed layer of defense.\n\nAs transnational criminal organizations continue to grow in both size  and sophistication, illicit cross-border tunnels along the southwest  border of the United…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…expanding the CFPB's authority. But these types of apps are  already regulated, and they accounted for just 1 percent of the CFPB's  consumer complaints in 2023. Why add another layer of bureaucracy?\n\nApparently, Democrats can't help but see innovation as an opportunity  for regulation. All told, the Biden administration saddled Americans  with $1.8 trillion…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…authorization from a Federal or State  agency, it can still be forced through an additional duplicate  permitting process with the Office of National Marine Sanctuaries.\n\nThat extra layer adds years of delay, drives up costs, and  discourages investment without providing meaningful environmental  protection. H.R. 261 clarifies that once a project has been lawfully…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Senate to do  the CRA on this rule.\n\nState and Federal laws, as has already been mentioned, provide robust  oversight for marine historic resources, again making this added layer  of Federal bureaucracy pointless and wasteful. The repeal will lower  energy costs for American families, strengthen U.S. energy  independence, and support an industry critical…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…bitcoin is 180 degrees different than  central bank digital currency.\n\nMr. Speaker, do everything you can to stop the government's power  grab with this, or the superficial layer that is really just cosmetic  where the big banks offer a cosmetic layer of stablecoins but on the  back end it is effectively a central bank digital currency operated by…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…top of that. I heard a term the other  day--I had never heard it before--``coral reefing,'' this idea that you  lay down something that is living and makes sense, then that layer  dies, and you just build another on top and another on top. Eventually,  you get this giant dead mass. That is what we have done with a lot of  these agency regulations. Part…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…existing missile defense programs.  Kinetic systems remain essential for some threats, but magazine depth  and cost limit them.\n\nPulsed lasers provide a scaleable, lower-cost layer that extends the  effectiveness of the entire air and missile defense portfolio.\n\nMy amendment directs the U.S. Secretary of Defense to stay ahead of  the adversaries and modernize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695156/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…expression, and religion. They stand for none of our values. Confucius  classrooms are propaganda, and they are often set up near our military  bases, just to give it another layer.\n\nThere are CCP and Chinese affiliations in 143 schools throughout this  country. Honorable Speaker, I was shocked myself to realize that one of  them sits right outside our…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…for Petroleum and       Natural Gas Systems: Procedures for Facilitating Compliance,       Including Netting and Exemptions'' (the WEC rule).\n\nThe WEC rule is a duplicative layer of red tape that       creates a punitive tax on American energy, stifling       innovation and hampering the industry's ability to produce       the energy that American consumers…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…able-bodied population,  should get a 90 percent match from the Federal Government? Because that  is what is happening. They get a 90 percent rate for that expanded  population, then layer on top of that, and this is what you are now  dealing with.\n\nThe gentleman's chart that The Wall Street Journal did, where you  have the provider taxes, you have this high…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…abandoned nor lost,\n\nHe managed to safeguard on the run\n\nTwice from Poland, in Siberian exile and Kazakhstan,\n\nStained by flowing tears,\n\nThe beauty marks of refugees,\n\nAn added layer of essential warmth\n\nWhich sustained a ravaged body and tested soul,\n\nWrapping me, his other saved possession,\n\nIn a magical garb whose sacred fringes I playfully       unraveled,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}]