[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Why? Because we understood  together that a deal is a deal.\n\nThat doesn't mean the President doesn't have influence. Hey, that was  just about last year's bill. The President lays out a budget for the  next year and has a huge influence. The President can veto the next set  of spending bills or any one of them.\n\nBut once it is locked into law--passed…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…institution,  what does this body mean and whether or not our words and our actions,  as dictated by our oath that we swear to the Constitution of article I,  as well, that lays out what our job is, that that is very much under  threat right now.\n\nI feel for my colleague. I don't know what is happening right now. I  hope that we are able to get greater…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692477/alex-padilla"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…that she is not familiar with Project 2025's  proposals on higher education, it is abundantly clear that this  administration is following Project 2025 to a tee.\n\nProject 2025 lays out a blueprint for ending the Federal Government's  role in public education, starting with dismantling the Department of  Education, so that they can find the money they need…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…not, which is why I cannot support the bill.\n\nIn fact, Project 2025, which we discussed at length last year, one of  the tenets of it calls for privatizing the VA. This bill lays the  foundation for that. We know that our veterans demand, expect, and  deserve the best, highest quality healthcare, and that is why we must  do more through this bill and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692955/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Mr. Speaker, over the past few weeks, I have held a number  of townhalls, and one thing keeps coming up consistently: Democrats  need a cohesive, concise message that clearly lays out what we are for,  not just what we are opposed to.\n\nIn 1994, Newt Gingrich drew up a Contract with America. It was a  simple set of priorities that Republicans promised…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689791/contract-for-america"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…provision to designate  the Assistant Secretary of Commerce to lead a governmentwide supply  chain resilience effort.\n\nIt also ensures input from the Department of Labor and lays out a  national strategy to coordinate action and prevent future disruptions.  Leaving our manufacturers and suppliers vulnerable creates fragile  supply chains that threaten…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…help save  thousands of lives of Palestinians, who, as we speak, are starving.\n\nYou know, some folks take the position that the suffering and  starvation will end when Hamas lays down its arms or releases the  remaining IDF hostages. Every single one of us wants that day to come.  But you know what, we have to ask ourselves a frank question: Is it  right,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694438/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…changed the way  that treatment was provided just in time for when I came along. That  was 20 years ago. However, now we are shutting those clinical trials  down, and that article lays it out clearly and sadly.\n\nIt was a little ironic. Mr. Speaker. You may recall that here in this  Chamber, President Trump gave a speech. It looked kind of like a state  of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…administration keeps promising  comes with little accountability, making it unclear whether those  Federal funds will ever reach the students that need them the most.\n\nEducation lays the foundation for a strong future, as well as a  thriving, healthy community; a thriving, healthy economy; and a  thriving, healthy democracy. We owe it to our grandparents,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and  postpartum women, and support people on long-term recovery.\n\nIf Republicans really support these programs, my colleagues should be  opposing the President's budget, which lays out plans to cut the very  programs Republican Members claim to care about. In fact, the Trump  administration budget goes further and proposes eliminating nearly all  of the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…unclear whether the funds will  actually reach the students and schools that need them the most:  children with disabilities in rural and low-income communities.\n\nEducation lays the foundation for a strong future. Our Founding  Fathers understood that. Today's students are the entrepreneurs, civic  leaders, teachers, doctors, lawyers, engineers, and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Budd). The Chair lays before the Senate a  communication from the Secretary of the Senate regarding a message from  the President received during the adjournment of the Senate.\n\nThe senior assistant…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689336/communication-from-the-secretary-of-the-senate"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Forces to adequately address its recruiting crisis. I would like to  thank Rob for his continued selfless service and contributions to our  country. I am excited to see what lays ahead for him in the future.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Moreno). The Chair lays before the Senate  the following message from the House.\n\nThe Presiding Officer laid before the Senate the following message  from the House of Representatives:\n\nResolved, That…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697948/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…rule submitted by the Biden EPA  relating to review of final rule classification of major sources as  area sources under the Clean Air Act.\n\nSection 112 of the Clean Air Act lays out stringent compliance  standards for facilities emitting over 10 tons of a single hazardous  air pollutant, or 25 tons of an aggregate. Facilities below those  thresholds…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…States, generating more than $11  billion in cash receipts, so the Texas cattle industry is obviously  very concerned about the spread of the New World screwworm.\n\nThis parasite lays its eggs in the wounds of warmblooded animals,  particularly livestock. The larvae burrows into the openings creating  infections that, left untreated, can cause animals to…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the Senate and its 60 votes. With  the 1974 Budget Control Act, this is the dance we go through.\n\nThe other thing I am going to try to walk through is where the actual  math lays in the box that has been given to us by the Budget Committee,  and then the part I am going to do, the Schweikert little bit of hope,  is: Is this the moment? Is this the moment…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, I thank the Chairman for having this Special  Order here tonight and also for the introduction of the special  resolution that lays out the justification and why we took out Nicolas  Maduro.\n\nMr. Speaker, I rise tonight in strong support of the capture of  Nicolas Maduro. Nicolas Maduro and his corrupt inner…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…County is making great  strides not only for our community but also for our Nation.\n\nThe MACH program builds on successes we have already seen in  commercial spaceflight and lays the groundwork for urgent, necessary  advancements to keep our competitive edge as a nation.\n\nThe MACH legislation was included in the NASA Reauthorization Act of  2024 and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Justice). Pursuant to rule XXII, the Chair  lays before the Senate the pending cloture motion, which the clerk will  state.\n\nThe senior assistant legislative clerk read as follows:                               Cloture Motion…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694589/9999"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…services, then that agency's acquisition  personnel will post a solicitation on the Federal Government's SAM.gov  website for a contract to fill the requirements. That solicitation lays  out what the agency wants to buy, how it will evaluate the bids, and  when responses are due.\n\nIn good faith, small businesses dedicate precious time, money, and  resources,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…cornerstone of the American Dream.\n\nFor generations, owning a home has symbolized stability,  independence, and opportunity. It strengthens families, builds  communities, and lays the foundation for long-term financial security.\n\nYet, today, that dream feels out of reach for too many, especially  first-time buyers, young families, and those in rural and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693119/recognizing-national-homeownership-month"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…developing policies that reflect current and emerging challenges.\n\nH.R. 2659 is a thoughtful and necessary step toward improving the  resilience of our critical infrastructure. It lays the groundwork for a  more unified and prepared Federal approach. It supports the operators  who manage vital systems across our country. It strengthens our  national posture…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}]