[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…which is my State house representative in  Albuquerque.\n\nThese are just a few of the New Mexico leaders who are making history  as we stand on this floor tonight, who are leading the way, whose  voices are not only needed but necessary and who must be at all the  tables where decisions are being made.\n\nAs we know, these voices are currently being threatened…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687897/black-history-month"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…colleague from  New Mexico Senator Lujan will be offering a unanimous consent request,  and I want to thank him for his extraordinary leadership on the issue  of SNAP, leading the way on an urgent issue for millions of Americans.\n\nNow, right now, we are facing down two crises at once: a healthcare  crisis and a hunger crisis, and both are caused by…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…baseload  power and a clean and safe pathway for true energy security. It is no  wonder countries across the globe are racing to achieve fusion first,  and San Diego is leading the way with the leadership of companies like  General Atomics and others.\n\nI look forward to celebrating many more accomplishments with my  friends at General Atomics.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694165/recognizing-general-atomics"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…manufacturing through innovation and  development of technologies to decarbonize and improve the efficiency  of cement, concrete, and asphalt production.\n\nU.S. producers are leading the way in the innovation of critical  building materials production, and we have a real opportunity in front  of us to bolster our Nation's infrastructure while making significant…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…major worldwide tourist destination.\n\nThere is still time to build this industry to make us the best in the  world.\n\nMr. Speaker, I thank the U.S. Travel Association for leading the way.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…overlooked, role in reducing the impact of large-scale emergencies and  disasters across the United States.\n\nAs the second largest nonprofit in the Nation, Good360 is leading the  way in providing responsible and efficient distribution of unused goods  to communities affected by disasters and crises. Good360 is meeting  disaster-driven challenges head-on,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…spectators lined the streets to cheer on this year's  players, and it was heartwarming to see our community come together for  such a great cause.\n\nThe city of Bayonne is leading the way in bringing communities  together in an inclusive way, lifting up those around us, and showing  what we can achieve when we work together.\n\nMr. Speaker, I thank everyone…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…export $176 billion in  agricultural products last year. They helped ensure that the United  States is the world's largest agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have a robust export opportunity for the excellent U.S.  manufactured…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…is a huge deal for researchers across the  country, including in my home State of Washington where places like UW,  Fred Hutchinson Cancer Center, and so many others are leading the way  on medical research that save lives.\n\nNow the Trump administration has also attacked our public health  infrastructure in all kinds of ways. Earlier this month, his…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…export $176 billion in  agricultural products last year. They helped ensure that the United  States is the world's largest agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have a robust export opportunity for the excellent U.S.  manufactured…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…personal. In New Mexico, there are thousands of  families who are struggling just to make it to the end of the month.\n\nI will say that, despite the darkness, New Mexico is leading the way  and showing what it looks like to lead with integrity and invest in an  economy that will make it possible for families to thrive.\n\nIn fact, in just a couple of weeks,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…adversaries to meet our energy needs, countries that do not have strong  labor or environmental laws.\n\nThis tax hurts energy producers who are already doing it right.  America is leading the way in reducing emissions.\n\nSince 2015, upstream oil and gas producers have reduced their methane  emissions by 42 percent. Our innovation and technology have allowed us…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688186/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…its longevity to its superior staffing. The  Talladega Insurance Agency is built on family, as it is a family-owned  and operated business and has had four generations leading the way. In  the 1920s, Turner Joel Jones acquired the Talladega Insurance Company  renaming it Talladega Insurance Agency and his brother, George, soon  joined him in the business.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…it comes to  digital payments. Jurisdictions around the world are upgrading their  payment systems to be faster, to be cheaper, and cross-border. The  private sector is leading the way, including payment stablecoins to  enhance the payment rails.\n\nAs the United States grapples with modernizing our own payment  systems, we are confronted with a choice.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Hornell rolls  across the Nation.\n\nThis project is a powerful example of how we strengthen our economy  by investing in our communities, empowering our workforce, and leading  the way in advanced manufacturing.\n\nI commend Alstom for their continued commitment to Hornell and thank  the skilled men and women who are driving this legacy forward.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…past 6 months, President Trump has delivered on his promise  to restore America's strength and dominance, and I look forward to  continuing the fight with President Trump leading the way to ensure  America's golden age lasts for decades to come.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…each and every day.\n\nI am immensely proud of the Brevard, Indian River, and Orange County  School Districts for doing the right thing and making education a  priority and leading the way so that Florida can truly be the future of  not only space but of all intellectual abilities.\n\nMr. Speaker, I thank each of these counties, the teachers, the  administrators,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693664/recognizing-chief-mario-augello"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Class 4A State championship here in  Florida. The Pirates overcame a tough American Heritage squad where  they rallied from a 14-point deficit to win the State title.\n\nLeading the way was Senior Guard Jaida Civil, a University of  Tennessee commit and McDonald's All American, who grabbed 9 rebounds  and scored 20 points.\n\nThe entire team made critical…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…recognize September as National Service Dog Month.\n\nOrganizations like Canine Companions, Paws of War, and America's  VetDogs, headquartered in my home state of New York, are leading the  way. They prepare and place service dogs that make life-changing  impacts, while continuing to stand behind each partnership well beyond  the first match. This month is an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695913/recognizing-september-as-national-service-dog-month"}]