[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the school district, ensuring our  students have healthy, nutritious meals every day to focus and thrive  on their studies.\n\nMr. Singleton has brought discipline, leadership, and a commitment to  service to our schools in Monrovia Unified. Our community is fortunate  to have a dedicated public servant like him.\n\nMr. Speaker, I thank Mr. Singleton for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "Mr. LUJAN. Mr. President, I want to thank my friend from Illinois  Senator Durbin for his leadership and commitment to saving public  broadcasting and educational programming for Americans all across our  beautiful country.\n\nNow, unfortunately, just yesterday in New Mexico, the…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…sustainability, and community well-being. His  leadership has made a lasting impact not only in King County, but  throughout our entire region. Thanks to Dow's leadership and his  commitment to diversity, equity and inclusion, Martin Luther King, Jr.  County will remain a welcoming place for all to thrive.\n\nDow has brought significant positive change…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691034/recognizing-the-contributions-of-dow-constantine"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…connection between our country and the Ecumenical  Patriarchate.\n\nOnce again, I welcome Ecumenical Patriarch to Washington and in  honoring his decades of global leadership, his commitment to peace and  human dignity, and his enduring contributions to our shared moral and  spiritual life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Third Congressional District, home to  thousands of Ukrainians and Ukrainian Americans, it is my honor to  commend Dr. Mariya Dmytriv-Kapeniak for her tremendous leadership and  commitment to human dignity, to peace, and to democracy.\n\nMr. Speaker, I thank Mariya and congratulate her.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Nathan has led the way in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience. We are grateful for his leadership and commitment to  keeping our communities safe.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Nathan Whittington for his service…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…represent.\n\nEvery day, but particularly during this month, we honor and thank  Queen Liliuokalani, Prince Kuhio, and Senator Akaka for their  extraordinary vision, leadership, and commitment to the Native Hawaiian  community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…spending time with his family,  watching a Kansas City Chiefs game or NASCAR race. He spent his life  uplifting and empowering the residents of Grandview through his  leadership and commitment to being a voice for the community. Though  Jim has passed, his legacy and impact on his community will remain long  past our mortal lifetimes. I am reminded of Mark…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…received accolades like the Greater Richmond Bar  Foundation's Volunteer of the Year and the Sierra Club's Green Giant  Award. Through her legal expertise, community leadership, and  commitment to access to justice, she continues to drive positive change  across Virginia.\n\nMedia and Communications Champion Award--Claudia Massey: Claudia  Massey has made…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…for the entire church, and the broader  community as we continue to embrace and celebrate women in leadership  roles.\n\nWe thank Reverend Carr for her tireless work, leadership, commitment  to help others, and for showing us all what it means to walk in purpose  and faith. May God continue to bless her and her work.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…``Bobby'' Schmitt, Commander  of Mission Delta 4 at Buckley Space Force Base, as he prepares to  depart from his post in Colorado. Colonel Schmitt's dedication,  leadership, and commitment to our Nation's defense have been truly  exemplary.\n\nDuring his tenure as Commander of Mission Delta 4, Colonel Schmitt  has overseen critical operations and initiatives…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of American       minerals. In order to do so, we must address unnecessary bans       that inhibit industrial growth.\n\n``We thank Rep. Stauber for his continued leadership and       commitment to alleviating the hurdles that keep our members       from realizing work.''                                   ____                                    LiUNA!…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…the age of 105, Mr. Drinkard remains active in his business. He  still serves on the board of trustees at Troy University, demonstrating  that age is no barrier to leadership, commitment, or purpose.\n\nMr. Speaker, Roy Drinkard is a living example of American grit and  grace. My wife, Caroline, and I are proud to call him our friend. I ask  my colleagues…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693675/happy-105th-birthday-to-roy-drinkard"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Constantinople, His All-Holiness leads the  world's second-largest Christian church. Since assuming this role in  1991, he has earned global respect for his spiritual leadership and  commitment to peace. Guided by his belief that ``war in the name of  religion is war against religion,'' Patriarch Bartholomew has built  strong relationships with religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…access to  health care, and an enhanced quality of life for countless families and  businesses.\n\nTombigbee Electric Cooperative has demonstrated that when vision,  leadership, and commitment to community are combined, meaningful  progress can be made.\n\nThis accomplishment serves as a reminder that rural America must  never be left behind. I commend Tombigbee…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696050/recognizing-the-tombigbee-electric-cooperatives-achievements"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…McCLAIN. Mr. Speaker, I rise today to recognize the  distinguished service of Captain Mike Retzlaff, a proud veteran of the  United States Army whose dedication, leadership, and commitment to duty  reflect the highest traditions of military service.\n\nBorn and raised in Holly, Michigan, Captain Retzlaff pursued higher  education at Cedarville University,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Baptist  College. He then dedicated 32 years to the Texas Department of Public  Safety, where he rose to the rank of Regional Commander, overseeing 46  counties. His leadership and commitment to public safety earned him  widespread respect. Notably, he served as the Commander of all DPS  uniformed forces during the Mt. Carmel incident, further underscoring…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Rotary Club has exemplified the Rotary  motto  of Service Above Self through countless projects supporting local  schools, awarding scholarships, and promoting youth leadership.\n\nTheir commitment to bettering our community is unwavering, and to  mark this milestone, the club has launched a project to construct new,  modern facilities at Shawmut Park.\n\nWith…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…General Wayne A. Downing  Home for Veterans, which helped raise nearly $1.5 million for the  strengthening of services for local veterans.\n\nDon Johnson's tireless leadership and commitment to the non-profit  sector has left a lasting impact on Central Illinois. His work has  advanced economic opportunity, human dignity, and community well-being.  I…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…leadership and  success.\n\nMr. Speaker, I could speak volumes about Doug McMillon's legacy.  Suffice it to say, his quiet and patient demeanor, his bold and  innovative leadership, and his commitment to the shareholders and  associates of Walmart make him one of America's true success stories,  and not only that, but his spirit of charity and funding opportunities…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the community. On top of this, he serves as a recruit  training officer, a position that allows him to mentor and guide new  recruits.\n\nLieutenant Jason Doolittle's leadership, commitment to excellence,  and ongoing involvement in our community sets him apart, and it is an  honor to represent exemplary individuals like him in Congress.\n\nTherefore, on…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…and enhanced this legacy, positioning the institution as an  indispensable force in countering authoritarianism and fostering  democratic renewal worldwide.\n\nHer leadership and commitment will be missed greatly at Freedom  House, as her mark of excellence will be recorded in the historical  annals and remembered by all who have witnessed her profound…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…highest standards of service, of leadership, and of integrity.\n\nFor over 15 years, Mr. Camhi has served with distinction in the New  York Police Department. His leadership, his commitment, and his  generosity have been nothing short of extraordinary. He has led complex  criminal investigations and tactical operations with unparalleled  precision and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…third  straight championship.\n\nThis historic achievement speaks to their drive, their determination,  and overall commitment to excellence as well as, of course, the  leadership and commitment of their coach, Alex Orosco.\n\nThe Bulldogettes have put their community on the map, and all of  Texas is taking notice. I congratulate the young ladies on such an…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…longest tenured active head coach in college  football, with a 206-124 record at Iowa and a 217-145 career record.  This achievement is a testament to Coach Ferentz' leadership and  commitment to excellence within the Hawkeye organization.\n\nMr. Speaker, I congratulate Coach Ferentz. Go Hawks.\n\nI would like to extend birthday wishes to my amazing husband…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}]