[{"senator": "Seth Moulton", "party": "Democrat", "sentence": "Mr. MOULTON. Mr. Speaker, I rise today to welcome His All-Holiness  Bartholomew to Washington, D.C.\n\nThe Ecumenical Patriarch is the spiritual leader of over 300 million  Orthodox Christians worldwide. Since 1991, he has served as the  Archbishop of Constantinople--New Rome and Ecumenical Patriarch, a role  that traces its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…limited, medical and       science research limited, including vaccines and disease       prevention, they will all be severely impacted. The United       States should be a world leader in healthcare and education       and scientific advancement. This is an embarrassment to us as       a country. It should not be possible in America for one       single man--even…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…families, and is known for  its castle theme, friendly staff, and Mr. Patel's own personal customer  service as its owner-operator.\n\nMr. Patel is much more than a business leader; he is an active  philanthropist and sits on the boards of Whittier College, California  Lodging Industry Association, Visit Anaheim, Anaheim Transportation  Network, and Chapman…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Mr. Kiley has said, the bill that  would extend the tax credits is bipartisan. It would pass this House.\n\nIn the richest country in the world, the country that is the global  leader in medical innovation, Americans will die from treatable  conditions.\n\nRepublicans claim that their bill will give consumers more choices.  No choice, this is not about choice.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698405/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…and others who have been working together for some time on this. We  have a lot of momentum. Today, as was said, Speaker Johnson said that  he supports a stock trading ban. Leader Jeffries supports a stock  trading ban. President Trump has said that he would sign a stock  trading ban into the law.\n\nAgain, this is not a partisan issue. Poll after poll…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691224/stock-trading-ban-for-members-of-congress"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…governed by the spirit of January 6 or the spirit of 1776.\n\nWhat is this spirit of 1776? It is the belief in government of, by,  and for the people, not of, by, and for any one leader.\n\nHere, no leader is above the law, nor are they above the people whom  they serve. Look around this city. Our great monuments here were built  by grateful citizens to honor…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…correspondence to American soldiers on  the front lines of World War II and restore morale by ensuring  servicemembers could communicate with their families back home. The  leader of that group was Chasity Adams. (Gregg/Adam)\n\nWe also remember the all-Black Tuskegee Airmen who went valiantly  into battle for the United States in the European theater.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…A member of the University of  Southern California's ROTC program, Colonel Dinh was commissioned as an  officer in December 1995 and graduated from the Armor Basic Officer  Leader Course in September 1996.\n\nColonel Dinh served our country honorably for 35 years, culminating  in his service as commander of the 455th Chemical Brigade in Sloan,  Nevada.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Members of Congress,  should do. Without these extensions, their premiums will skyrocket.\n\nHealthcare is not a luxury. It is a fundamental human right.\n\nMr. Speaker, I stand with Leader Jeffries and House Democrats as we  continue our fight for affordable, quality healthcare in this country.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698377/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, I rise today to recognize the Ecumenical  Patriarch Bartholomew of Constantinople, the leader for Orthodox  Christianity worldwide, who is here in Washington, D.C. after accepting  the distinguished Templeton Prize earlier this year.\n\nThe Templeton Prize is awarded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, today I rise to recognize President Jaehyung  Kim of the Dallas Taekwondo Association, a dedicated leader whose work  has advanced both sport and community across North Texas and beyond.\n\nThrough his leadership at White Tiger Taekwondo and the Dallas  Taekwondo Association, Mr.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692616/regognizing-jaehyung-kim"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of Illinois. Mr. Speaker, as we celebrate Black History  Month, I rise to recognize Joann Williams, a dedicated leader in  Illinois' Fourth Congressional District and a pillar of the LeClaire- Hearst community on Chicago's southwest side.\n\nJoann is a U.S. Army disabled veteran who has dedicated…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…administration to respond to the Russians today: announce  we will abide by the New START limits, build confidence, and create  time and space for negotiation.\n\nPresident Trump can be a leader for peace. Last year, he said, from  the Oval Office: ``There is no reason for us to be building brand-new  nuclear weapons. We already have so many. You could destroy the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…time he opened  his mouth, we knew he was from Worcester, Massachusetts. What he said  with his words inspired courage in all of us.\n\nFather Shaughnessy is a friend. He is a leader, and he is an American  hero.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692558/recognizing-father-paul-shaughnessy"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…don't deserve academic stature and access to  vital funding. These include nursing, physical therapy, audiology,  architecture, and social work.\n\nThis assessment comes from the leader of the Department of Education,  who has no advanced degree in education but does know a lot about pro  wrestling.\n\nI was the chief executive officer of a government for over…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697491/bringing-attention-to-anti-education-agenda"}, {"senator": "John Rose", "party": "Republican", "sentence": "…individual freedoms, but it  would also hinder free market innovation.\n\nDigital assets are here to stay. I agree strongly with President  Trump that the United States should be a leader in this space. However,  the last administration held a very different view. They wasted no time  exploring ways to set up a surveillance state digital currency managed  and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, I rise today to recognize President  Wendy Wintersteen, a longtime champion for Iowa's students and a  nationally respected leader in higher education, as she moves on from  her role as the 16th President of Iowa State University.\n\nWendy's leadership has shaped the future of Iowa State and made a  meaningful…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691609/recognizing-president-wendy-wintersteen-for-her-service-to-iowa-state-university"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…1325 will ensure that Congress receives the updates necessary to  monitor industry regulations. Updating these reporting requirements  will ensure the U.S. remains the global leader in this crucial sector.\n\nI urge my colleagues to support this legislation, and I yield back  the balance of my time.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…interrupted by the Democrats' 43-day shutdown in the fall. But I am  proud to be able to say that the Senate has passed 11 full-year  appropriations bills.\n\nWhen I became leader, I made it very clear that I wanted a return to  regular order consideration of appropriations bills.\n\nToo many times the Senate has resorted to long-term continuing  resolutions…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…sports have played an important role in the history of our  Nation. They teach young people how to be hardworking, detail-oriented,  and resilient. Katie's experience as a team leader has prepared her to  be a leader in life, and I am excited to see what she accomplishes  beyond high school.\n\nAll of southern Ohio is proud of Katie's accomplishments. If she…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691899/recognizing-katie-ankrom"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…In 1986,  Judge Knecht was elected to the Illinois Fourth District Appellate  Court. He is currently the longest serving judge in Illinois court  history and an accredited leader within our Illinois legal community.\n\nOutside of the courtroom, Judge Knecht is heavily involved in  communities across Illinois and with his alma maters. He serves on both…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today to honor the life and legacy of  Gerald ``Jerry'' Danforth, a distinguished Tribal leader, a decorated  Navy veteran, and a beloved husband, father, and grandfather, who  passed away on the morning of June 1, 2025, at the age of 78.\n\nBorn on December 24, 1946, in…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…this distinction. To achieve this, Madison obtained 21 merit  badges, showcasing fundamental skills she learned as a Scout and  commitment to her community.\n\nMadison is a true leader who has served on her school's student  council, engaged in local cleanup initiatives, and assisted special  needs students.\n\nA member of Troop 7056, Madison embodied the spirit…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…just speak for the communities that he  represented. He advocated, and he used every policy tool available to  see that their values were reflected in policy here. He was a leader in  our delegation and in the whole Chamber on issues like water, forest  management, and agriculture, and that leadership, of course, culminated  in his chairmanship of the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698740/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Lastra was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mike Lastra has made a profoundly positive…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…natural gas tax once and for all. It is critical  to negate these punitive regulatory requirements now to ensure that the  United States can reclaim its place as the world leader in energy for  generations to come.\n\nIn the waning days of the Biden administration, the EPA doubled down  on Biden's disastrous energy policies, imposing a burdensome and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…In fact, as soon as the petition hit 218 votes last Wednesday, House  Republicans offered a unanimous consent request to pass the legislation  then.\n\nHowever, the Democratic leader would not give consent to do that last  week.\n\nWhy?\n\nIt is because they are not really interested in this. They are  interested in some other things.\n\nMr. Speaker, I have to…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…1997.\n\nTheir legacy is a testament to the deep tradition of this event, one  of America's oldest and grandest St. Patrick's Day celebrations.\n\nJay has long been a dedicated leader in Savannah's Irish community,  serving as a parade officer and as chairman. His leadership and his  passion have left an indelible mark on our city.\n\nThis St. Patrick's Day,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Ranking Member Emeritus Gerry Connolly, and Ranking Member   Robert Garcia for their support in the Oversight Committee. Finally, I  thank Speaker   Mike Johnson, Majority Leader   Steve Scalise, and  Minority Leader Hakeem Jeffries for their help in getting this bill to  the floor.\n\nI urge all of my colleagues to support this bill to honor the life…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Youngblood was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Tyra Youngblood has made a profoundly…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692457/recognizing-tyra-youngblood"}]