[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Under their dynamic leadership, First Monumental became a  beacon of hope and salvation.", "title": "In Memory of Overseer Roosevelt Carter, I", "date": "2025-06-23"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "I also thank Lou Correa for managing the bill today and Chairman  Green for his leadership, as well as the Homeland Security Committee  staff, especially Lauren McClain, who tirelessly led us through this  effort.", "title": "Securing the Cities Improvement Act", "date": "2025-03-10"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Under the leadership of pastors, including Reverends Howard S.", "title": "Recognizing the 70th Anniversary of Bethel Temple Church in Hampton, Virginia", "date": "2025-10-24"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Your call is to bold leadership from a new generation of freedom  lovers.", "title": "Applauding President Zelenskyy's Address in Davos", "date": "2026-01-22"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "Though we are sad to see her go, the  Coalition, our leadership team, and I, wish Emma all the best.", "title": "Recognizing Emma Weir", "date": null}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "There is no room for error when it comes to this, and  this poor leadership will cost us lives.", "title": "Concerns About Hurricane Season", "date": "2025-06-09"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Speaker, I rise today to recognize a remarkable  group of women whose leadership, service, and achievements have made a  profound impact on communities across Virginia's Fourth Congressional  District and beyond.", "title": "Virginia's Fourth District Women in Excellence Awards", "date": "2025-05-01"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Army veteran and community leader Alcario ``Al'' Castellano for his  dedication to advancing education, arts, and leadership in San Jose and  the greater Silicon Valley of California.", "title": "Recognizing Life and Contributions of Alcario ``al'' Castellano", "date": "2025-05-21"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Among others, I am deeply appreciative of the  Military Aviator Coalition for Health and their leadership in  advocating for this issue.", "title": "Aces Act of 2025", "date": "2025-07-21"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "President, I want to thank my colleague from Colorado,  and I want to thank my colleague from Virginia for their leadership on  what is the very important question before the U.S.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Thanks to Representative Chu's  leadership, we have reintroduced a bill that will end delays and  excuses and finally bring workers the commonsense protection they  deserve.", "title": "Extreme Heat Caucus", "date": null}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "It is about abandoning America's legacy of compassion,  ceding global leadership, and turning our back on the most vulnerable.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "From business success to civic leadership, I am pleased to  congratulate Larry Huggins on a life of exemplary service and  achievement.", "title": "Congratulating Larry Huggins on A Life of Service and Achievement", "date": "2025-03-27"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Under his leadership, GAO continued its impactful  work on the federal government's long-term fiscal outlook, efforts to  reduce overlap and duplication across agencies, and the High-Risk List,  which highlights programs and operations vulnerable to waste, fraud,  abuse, mismanagement, or in need of transformation.", "title": "Commending the Honorable Gene Dodaro", "date": "2025-12-19"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "He has demonstrated extraordinary leadership within the  Orthodox Christian community and across the global religious and  environmental landscapes.", "title": "Welcoming Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "I thank Representative Latta, the chairman of the Energy  Subcommittee, for his leadership on this issue.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "His extensive experience in emergency operations uniquely equipped  him to guide the county through major crises, including his leadership  during the activation of the Emergency Operations Center in the COVID  pandemic.", "title": "Congratulating Mike Oltman on His Retirement with the Woodford County Emergency Management Agency", "date": "2025-12-01"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "Morris' leadership.", "title": "Recognizing Nathan Morris, 2026 Arkansas Superintendent of the Year", "date": null}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "3301, the ELEVATE  Act, and thank Congressman Nunn for his leadership on this forward- looking and bipartisan bill.", "title": "Encouraging Local Emerging Ventures and Economic Growth Act of 2025", "date": "2025-06-23"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "Speaker, I thank the gentleman for yielding and for  his leadership in committee on this piece of legislation that is  designed to empower the American worker.", "title": "Flexibility for Workers Education Act", "date": "2026-01-13"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "Speaker, I thank Chairman Jason Smith for his  leadership on this issue and this important piece of legislation, as  well as the leadership of Representatives Malliotakis and Sewell.", "title": "Recovery of Stolen Checks Act", "date": "2025-03-31"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Her leadership and continued devotion to service have been  the hallmark of her career.", "title": "Protect Medicaid Benefits for American Citizens", "date": "2025-02-26"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Now, he says this without even hinting at one of the Chinese  Communist leadership's most consistent, salient, and frustrating  traits, and this is it.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "French Hill", "party": "Republican", "sentence": "These young men and women have chosen a path of duty, sacrifice, and  leadership.", "title": "Congratulating Robert Arrington", "date": "2026-02-09"}, {"senator": "French Hill", "party": "Republican", "sentence": "Under his leadership, the commission launched its strategic  5-year plan and Austin was instrumental in conservation projects that  will benefit hunters, anglers, and conservationists for generations to  come.", "title": "Recognizing Lorie Tudor on Her Retirement", "date": "2025-03-10"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "I thank Representative Clay Higgins for his leadership on this  critical local policing reform legislation, and I urge my colleagues to  support his bill.", "title": "District of Columbia Policing Protection Act", "date": null}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "He is also a champion for protecting our natural environment,  earning him the title of the ``Green Patriarch.''\n\nHis leadership is a source of inspiration not only for the Greek  Orthodox community but all those who care about human rights, religious  liberty, and the stewardship of God's creation.", "title": "Welcoming His All-Holiness Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I am sick and tired of having the leadership and others say: David,  we will do it after the next election.", "title": "We Are Borrowing A Second", "date": null}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "It was a transformational experience that we will keep with us for  the rest of our lives, and it was, in large part, thanks to Father  Kelly's leadership, faith, and commitment to helping others experience  the power and the history of the Holy Land.", "title": "Welcoming Reverend Eamon Kelly", "date": "2025-11-20"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "The deliberate and Member-driven approach of this process is a  testament to the leadership of my friend and fellow Oklahoman, Chairman\n\nTom Cole.", "title": "Providing for Consideration of H.R. Consolidated Appropriations Act, and Providing for Consideration of H.R. Department of Homeland Security Appropriations Act, and for Other Purposes", "date": "2026-01-22"}]