[{"senator": "André Carson", "party": "Democrat", "sentence": "…Representatives Robin Kelly and Lucy McBath--who, like me, believe that  protecting children, families, and veterans should be above politics.\n\nFirearms are now the leading cause of death for children and  teenagers in the United States. Every year, more than 2,500 young lives  are lost to gun violence. For children under the age of 13, these  deaths…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…children have grown up in the shadow of Columbine, and 25  years later, we are still losing this fight. And they have the right to  be terrified. Gun violence is now the leading cause of death for  America's kids. Think about that, Mr. President. Think about that. Gun  violence is the leading cause of death of America's kids. Twenty-five  years ago when Columbine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…We did really good work, not just for Democratic children but for  Republican children, as well, but we must do more to keep our children  safe.\n\nShootings are the leading cause of death for children and teenagers  in this country. Yes, my Republican colleagues have children and  families who are dying by gun violence every single day, just like us…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…signs of distress,  trauma, or potential violence. It undermines years of progress made in  breaking the stigma around mental health.\n\nWith suicide being the second leading cause of death for children  aged 10-14, gutting this funding will be life-threatening. Our kids'  safety and well-being should not be a partisan issue. I urge the  administration…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692131/crystal-lake-mental-health-program"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…violence, a public health crisis and emergency  in our country. Black people die from gun violence at 2.7 times the  rate of White people. While guns have been the leading cause of death  for all children and teenagers since 2020, guns have been the leading  cause of death for Black children since 2006.\n\nThese statistics are horrifying, but we cannot…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…represent 60 percent of  all firearm homicide victims. A Black person in America is 11.5 times  more likely to die from gun violence.\n\nWhile gun violence became the leading cause of death of all children  for the first time in 2020, it has been the leading cause of death for  Black children since 2006.\n\nWe must do more. We must do more because I can't…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today to speak about a matter of  life or death for millions of children around the world. Malnutrition  is the leading cause of death for children under 5 globally.\n\nWhen children starve, their bodies break down their own muscles,  bones, and organs to survive. Their immune systems collapse, leaving…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…agencies accountable  with what is done with the weapon. The United States already has the  highest number of mass shootings in the world, and gun violence is the  leading cause of death for children in this country.\n\nSo I am glad that one of my Republican colleagues from Florida wants  to make sure that the shootings don't happen again.\n\nLet's start…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691172/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…lives in Vegas--that Vegas shooting. The shooting at a  synagogue in Pittsburgh.\n\nSo here we were in yet another of these maddening realities in our  country that the leading cause of death for our children is shooting.  In our conversations leading up to it, I still remember you and I  saying: We need to come to this floor.\n\nYou said: I am going to stand…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the  years that have followed.\n\nHouse Democrats stand with Gabby and with all Americans who say  enough is enough.\n\nEnough with the gun violence epidemic being the leading cause of  death for the children in this country.\n\nEnough with mass shootings being as frequent as the common cold.\n\nEnough with the text messages to parents saying ``I love you''…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Another victim of the reckless work of DOGE was the National  Firefighter Registry for Cancer, which tracked cancer cases and deaths  of firefighters.\n\nCancer is now the leading cause of death for firefighters, and this  database was critical to tracking health and safety improvements for  firefighters and improving working conditions. In another sweeping…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…background check into a gun that can shoot  bullets, and within months you will be able to purchase those same  parts online legally.\n\nWhen gun violence remains the leading cause of death in the Nation  for our kids, Congress must not hand unregulated weapons over to the  public. We must not make Axon, a multibillion-dollar company, even  richer. I am…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…treat malnutrition. Until this  Trump administration began, we were shipping Plumpy'Nut around the  world, saving millions of lives a year. Starvation is still the leading  cause of death for children globally.\n\nBefore he became Secretary of State, Trump's own Secretary of State,  Marco Rubio, understood the value of food aid. He once said: ``We don't…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…ran for office because I couldn't stand by and watch as Congress  did nothing as children like Hadiya were ripped away from families.  While gun violence became the leading cause of death for all children  and teenagers in 2020, it has been the leading cause of death for Black  children since 2006.\n\nI swore my first oath of office just 3 months after…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…saturated fat, cholesterol, and calories  than fat-free and low-fat milk. Experts agree that saturated fat from  whole milk increases the risk of heart disease, the leading cause of  death in this country.\n\nIn fact, the majority of Americans consume too much saturated fat.  More than 80 percent of the U.S. population exceeds the recommended  limit. This…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…identifying when suicide is a primary  or contributing factor.\n\nThe mental health crisis among America's veterans has reached an  alarming level. Suicide is now the second leading cause of death for  veterans under the age of 45.\n\nDespite ongoing efforts, the Department of Veterans Affairs struggles  to accurately track and report veteran suicides. This not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…more than willing to work directly with  Mexican drug cartels to ensure that this poison continues to reach  America.\n\nUnfortunately, drug overdoses have become the leading cause of death  for Americans who are ages 18 to 45, with fentanyl causing nearly 70  percent of those deaths. With strong leadership under President Trump  back in the White House,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…continues to plague families and neighbors across the  United States.\n\nMy home State of Kentucky, sadly, has been ravaged by the fentanyl  crisis.\n\nDrug overdoses are the leading cause of death for Americans aged 18  to 45, and fentanyl is responsible for nearly 70 percent of these  deaths.\n\nLast year, the DEA seized more than 60 million fentanyl-laced fake…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…to stop the flow of deadly fentanyl that, for  years, has been flooding our communities and, tragically, tearing  families apart.\n\nToday, drug overdose is the leading cause of accidental death across  the country, and fentanyl-driven overdoses are the leading cause of  death for American adults between 18 and 45 years of age. That is  because it is…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…mission to rid our Nation of this poison.\n\nUnder the previous administration, fentanyl claimed the lives of  approximately 73,000 Americans per year and became the leading cause of  death among those aged 18 to 45. President Trump was elected in part to  confront this catastrophic crisis.\n\nFentanyl affects constituents of every Member of this body,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699970/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Health Month is a time to raise awareness about the importance  of cardiovascular health and the steps that we can take to protect our  hearts. Heart disease remains the leading cause of death in the United  States, affecting millions of Americans each year.\n\nThe good news is that many heart conditions are preventable through  small everyday choices. Taking…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…75,000 people died an  overdose death related to synthetic opioids. Fentanyl deaths account  for as much as 77 percent of adolescent overdose deaths, and it is the  leading cause of death in the 18- to 49-year-old age bracket.\n\nWe cannot stand by and do nothing while this scourge exists. The  bottom line is that this overwhelmingly bipartisan bill is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…equipment, and excluding technical data.\n\nMr. Speaker, I rise in strong support of Representative Barr's Stop  Chinese Fentanyl Act of 2025.\n\nFentanyl is the leading cause of death for Americans aged 18 to 45.  It is killing over 70,000 Americans a year, and it is flooding into our  communities with deadly force.\n\nWe know where it is coming from.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}]