[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…This legislation includes critical provisions from last Congress'  Supply Chains Act, which I co-led, including a provision to designate  the Assistant Secretary of Commerce to lead a governmentwide supply  chain resilience effort.\n\nIt also ensures input from the Department of Labor and lays out a  national strategy to coordinate action and prevent future…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Mr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate the 767  graduates of Loudoun Valley High School's class of 2025.\n\nIn their time as Vikings, this class has learned to lead with Viking  Values, respecting one another, extending empathy, and acting with  integrity.\n\nThis class excelled across a wide range of fields, including field  hockey. I congratulate…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…technologies to do so. Let me  repeat that: They have the technologies. They have the equipment  already.\n\nAs a pediatrician, I know how damaging these toxins can be. Mercury  and lead can lead to severe developmental delays, birth defects, and  brain damage for children. Dioxins are known human carcinogens. The  list goes on.\n\nAs a Member of Congress who…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691595/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and things can spin out of control in an instant. That is  exactly what the American people do not want to see. We have seen that  happen in the past; that one incident can lead to an endless war.\n\nSo, tomorrow, Secretaries Rubio and Hegseth owe Senators some pretty  big answers to some very important questions about what is happening in  the Caribbean.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…precedent must always greatly  overbalance in permanent evil any partial or transient benefit which  the use can at any time yield.\n\nOf all the dispositions and habits which lead to political  prosperity, religion and morality are indispensable supports. In vain  would that man claim the tribute of patriotism who should labor to  subvert these great…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…thank the gentleman from New York (Mr.  Goldman) for yielding. I also thank the gentleman from New Jersey (Mr.  Van Drew) for introducing this resolution, and I am proud to co-lead  this resolution.\n\nMr. Speaker, a week ago, my congressional district suffered an  unimaginable tragedy when a terrorist by the name of Mohamed Soliman  drove over an hour to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…contributors to this edition, including  senior public servants and participants in the Stennis Program for  Congressional Interns, reflect on what it means to serve and to lead  with purpose, integrity, and heart.\n\nI am proud that this edition includes an interview conducted by  Meziah Scott, a graduate of Virginia State University, of Michael Maul,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Juan Vargas", "party": "Democrat", "sentence": "…driving force in the creation, restoration, and  preservation of its murals, negotiating with Caltrans to protect the  park's cultural heritage. Accordingly, he served as the Lead Artist for  the Historical Mural Restoration Project.\n\nMr. Barajas is the founder of Motivational Design and has completed  more than 500 public art projects throughout Southern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694876/recognizing-salvador-barajas"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Administration resources. Small       Business Majority strongly supports uplifting immigrant       communities working in good faith to obtain U.S. citizenship.       These bills will lead to less vibrant communities and fewer       Main Street business opportunities for many in search of the       American Dream. Congress should do all it can to support…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Kingdom.'' I know some of you are probably offended because we win all  the time, but in the recent years, we are accustomed to seeing Andy  Reid, Patrick Mahomes, and Chris Jones lead one of the greatest teams  in history. They won three championships overall, two in the last 3  years. They can pass. They can run. They can kick. They can play  defense, and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691222/stock-trading-ban-for-members-of-congress"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…away. Donald  Trump has said publicly that he wants to imprison American citizens in  El Salvador next--not my words; his--so there is no telling where all  of this is going to lead.\n\nWe have seen Federal courts time and again rebuff the Trump  administration's lawlessness and order them to take steps to return  wrongfully deported immigrants. We have also…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Stabilization Act, with strong  bipartisan support.\n\nAs one of the original founders of the bipartisan Congressional  Victims' Rights Caucus, this is good news. I am proud to co-lead the  bill alongside a bipartisan group of colleagues.\n\nRight now, too many victim service organizations are forced to  operate with uncertainty, not knowing if funding will…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699068/applauding-stabilizing-crime-victims-fund"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…is itself a kind of violence that kills the spirit and corrupts  the soul of a person and of a nation. That vicious cycle of violence  and hate, of hate and violence can only lead to the demise of our  country and the destruction of our humanity.\n\nSo in this defining moment, may we resist the seductive sirens of  those who are trying to convince us that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…Texas.\n\nEstablished in 1995, the Paso Del Norte Health Foundation has worked  to ensure our binational tri-state community has the knowledge,  resources, and support needed to lead healthy and productive lives.\n\nFor three decades, the foundation has partnered with countless local  and national organizations to address some of the most critical  challenges…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695206/recognizing-the-30th-anniversary-of-the-paso-del-norte-health-foundation"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…watched her family  grow even as she battled cancer numerous times in her life. At 94 years  old, she has beaten the odds and has proven the doctors wrong. She  continues to lead.\n\nCristina just celebrated her 94th birthday in the United States, and  her story is a story of the American Dream. We are blessed to have her  as part of our community.\n\nMr.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Without participation by U.S. agencies and companies, we allow our  adversaries to pursue their own economic and national security  interests unchecked and the opportunity to lead in the development of  standards for the next generation of wireless technology.\n\nAlready, we are hearing about the Chinese Communist Party's efforts  to dominate the upcoming…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…thank Chairman Hill and Chairman Thompson for their  leadership and for working with us to include our two bills in the  CLARITY Act.\n\nThe United States has the opportunity to lead and deliver on  President Trump's promise to make America the crypto capital of the  world. We cannot and will not fail.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…colleagues don't want only citizens to vote and don't like  voter ID.\n\nMr. Speaker, I am about to yield 2 minutes to my friend from Arizona,  but I will just note that, as one of the lead sponsors of the  legislation to deal with prohibiting Members of Congress from engaging  in the act of trading in stocks, we are working on a bipartisan basis.  We have legislation…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…to ensuring strong elections.\n\nNow, as the chair of the House Administration Subcommittee on  Elections, I am proud to work alongside Chairman Steil to advance  policies that lead to stronger elections across our country.\n\nThese tools will help the States ensure their rolls are accurate and  help prevent any unintended errors.\n\nWe know that some States…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…graduation, as she plans to pursue advanced training in  Fire and Rescue.\n\nJayden Coffey represents the very best of Arkansas' youth--resilient,  service-driven, and ready to lead. It is my honor to recognize her  today before this body and to commend her as a model citizen and  recipient of the Westerman Award.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…and unwavering commitment to the people of Texas' 13th  Congressional District. Bryan has been with my office since the  beginning. As a trusted advisor, he helped build and lead Team Jackson  from the ground up. His leadership and insight were invaluable as we  worked daily to deliver results for the constituents of Texas' 13th  Congressional District.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…well empower the cartels and make the drug problem in our  hemisphere worse. Certainly, any war will exacerbate the already  precarious humanitarian crisis in Venezuela and lead to mass migration  into neighboring countries already struggling under the strain of  millions of refugees. And rest assured, many of those who flee the  disaster of the war…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…needs and environmental needs for the world over. Let's encourage  investment in technology, not support regulations that make it  impossible to do business.\n\nI am proud to lead this effort in the House, and I urge my colleagues  to support this resolution. Let's restore regulatory certainty, the  number one cry from the industry that I meet with. We…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…taxes to support. Federal agencies are simply not doing enough to open  the door for small businesses to compete. Mr. Speaker, this must  change.\n\nTo do that, I am proud to co-lead this bipartisan bill because  supporting our small businesses should never be a Republican or  Democratic issue. It is an American issue, Mr. Speaker.\n\nHere is what is happening:…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Speaker, I ask to be recognized out of order because  a moment of silence goes silent, and can someone lead us in a prayer.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695288/announcement-by-the-speaker"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…As the years passed, the legacy of Hoskins Drug Store was carried  forward by R.C. Hoskins' daughters, Dudley Hoskins Bostic and Molly  Hoskins Scarbrough, who continue to lead the business today with the  same dedication and vision that their father demonstrated nearly a  century ago. Their hard work and dedication have ensured that Hoskins  Drug…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Helping Angels Lead Our       Startups Act of 2025'' or the ``HALOS Act of 2025''.       SEC. 2. CLARIFICATION OF GENERAL SOLICITATION.\n\n(a) Definitions.--For purposes of this section and the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…desperate to smear this  legislation is because they are caught in their own self-inflicted  malaise of denial. Perhaps they still can't accept that Americans chose  Republicans to lead the Nation instead of them.\n\nThat said, Mr. Speaker, Republicans are not distracted by that fear- mongering and doomsaying of those who want H.R. 1 to fail. The facts  are on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…sustainable, and far-reaching results. To earn  the Girl Scout Gold Award, high school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that  produces lasting change. Over the course of 1-2 years, Gold Award Girl  Scouts demonstrate significant…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…chaotic time in our world, and especially our Nation, the  Ecumenical Patriarch's presence in our capital is particularly  meaningful and serves as a reminder to us all how to lead with  compassion and courage, how to minister to our communities with  empathy, and how to live with moral fortitude.\n\nHis ability to unify, to guide anyone and everyone to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}]