[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The goal was to resecure the  United States as the global leader in energy innovation, but now, the  Department of Energy has pulled the rug out from the future by walking  away from leading-edge U.S.", "title": "Department of Energy Project Cancelations", "date": "2025-06-04"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Madam Speaker, I am extremely proud to lead the Main Street Parity  Act with Chair Williams.", "title": "Main Street Parity Act", "date": "2026-01-20"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Today, when we still lead in auto manufacturing, Michigan faces some  of the Nation's highest unemployment rates while families are  struggling with rising costs.", "title": "Real Solutions for Manufacturing in Michigan", "date": null}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Those who lead in the appropriations process here believe in the  constitutional power of the purse.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "President, finally, on the nomination of Bedford to  the FAA, later this evening, Senate Republicans will vote to advance  Donald Trump's nominee to lead the FAA, Bryan Bedford.", "title": "Nomination of Bryan Bedford", "date": "2025-07-08"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Speaker, I thank my co-lead, Congresswoman Shontel Brown from the  great State of Ohio, and all the members of the Congressional Black  Caucus who spoke tonight, and I yield back the balance of my time.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "It is clear that many members of the Trump Administration, including  President Donald Trump himself, are violating the law and the public's  trust in ways that should lead to an investigation on potential high  crimes and misdemeanors by the House Judiciary Committee.", "title": "Concerns with H. Res. 939", "date": "2025-12-12"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "I include in the Record a letter opposing these bills  led by The Leadership Conference on Civil an Human Rights.", "title": "Letter Led By the Leadership Conference on Civil and Human Rights on the Common-Sense Law Enforcement and Accountability Now in DC Act of 2025 (H.R. and the District of Columbia Cash Bail Reform Act of 2025 (H.R.", "date": "2025-11-19"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Even the Trump administration's own experts at CMS, the  Centers for Medicaid and Medicare Services, say that implementation of  this rule could lead up to 1.8 million people to lose health insurance  just this year, 2026.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is likely that this will  lead to higher costs across the entire economy.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "That is why I was so proud to lead a letter  with my Washington colleagues calling for Forest Service terminations  to be rescinded and for the administration to halt any further cuts.", "title": "Cuts to Forest Service Endanger Millions", "date": "2025-04-08"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "For some families, rising costs lead to housing instability or  homelessness.", "title": "Rising Housing Costs", "date": "2026-01-14"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "It sanctioned the leader of the Rapid Support Forces and the  leader of the Sudanese Armed Forces for their armies' lethal attack on  civilians in Sudan.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "The T-HUD bill includes $295 million for Lead Hazard Reduction and  Healthy Homes grants.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Several states have enacted laws relating to salary range disclosure,  and the Federal Government should follow their lead and make salary  range disclosure a national requirement.", "title": "Introduction of the Salary Transparency Act", "date": "2025-03-10"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "1765) to direct the Assistant Secretary of Commerce for  Communications and Information to take certain actions to enhance the  representation of the United States and promote United States  leadership in communications standards-setting bodies, and for other  purposes, as amended.", "title": "Promoting United States Wireless Leadership Act of 2025", "date": "2025-07-14"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Furthermore, I thank my colleagues,  Speaker Johnson and Leader Scalise, along with Chairman Hill and  Chairman Thompson, for putting this bill on the House floor today for a  vote.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Project labor agreement mandates prevent many small businesses from  competing for Federal projects and may even lead to increased costs for  taxpayers.", "title": "Project Labor Agreements", "date": "2025-06-27"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "We continue to lead  the Nation in homelessness, unemployment, taxes, regulations, and  poverty.", "title": "Highlighting the State of California", "date": "2025-11-20"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, I thank Representative Stefanik for her leadership on  this issue.", "title": "Strengthening America's Turning Point Act", "date": "2025-05-13"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "She served as the chief of staff for the Kansas Senate Ways  and Means Committee before joining my staff to lead my district office.", "title": "Recognizing Debbie Luper's Tenure As District Director for the Fourth District of Kansas", "date": "2025-04-30"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "``Taxation without representation is tyranny,'' bellowed  James Otis in the days and weeks and years leading up to the American  Revolution.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Additionally, junior  Andie Tkalcevic added a 21-yard field goal, extending the Lancers'  lead.", "title": "Congratulating Salpointe Catholic High School's Girls' Flag Football Team", "date": "2025-12-03"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "In Iowa, I have seen incredible work being done by people like Shane  Sawyer, an Air Force special operations combat veteran who helps lead  the Quad Cities Veterans Network.", "title": "No Wrong Door for Veterans Act", "date": "2025-05-20"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Speaker, today, the Governor of my  State, Gavin Newsom, gave his state of the State address in which he  declared that California leads the Nation.", "title": "California is the Most Popular State to Leave", "date": "2026-01-08"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Appellate courts have responded by striking down many of the unlawful  intrusions into Presidential authority, but the core problem remains:  The President of the United States shouldn't have to ask permission  from more than 600 different district court judges to manage the  executive branch that he was elected to lead.", "title": "-9999", "date": "2025-03-25"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "This Act may be cited as the ``Helping Angels Lead Our       Startups Act of 2025'' or the ``HALOS Act of 2025''.", "title": "Helping Angels Lead Our Startups Act of 2025", "date": "2025-06-23"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "____         [From the United States House Committee on Ways & Means]   Ways and Means: Watchdog Report Uncovers Widespread Fraud in Obamacare\n\nFraud prevention failures in Obamacare lead to insurance       subsidies for fake enrollees.", "title": "Uncovering Widespread Fraud in Obamacare", "date": "2025-12-17"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Harley is a member of Girl Scouts of  Gulf Coast Florida, Troop 5005, and has exemplified extraordinary  leadership, innovative problem-solving, and a demonstrated commitment  to making a lasting, positive impact, by earning the most prestigious  award in Girl Scouting, the Gold Award.", "title": "Recognizing Harley Cross, Gold Award", "date": "2025-04-30"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "Ecumenical Patriarch Bartholomew not only serves as the spiritual  leader to the upwards of 300 million Orthodox Christians around the  globe, he serves as a model for us all, having dedicated his life to  peacemaking, environmental advocacy and conservation, and facilitating  inter-faith dialogue around the globe.", "title": "Welcoming Ecumenical Patriarch Bartholomew to Washington, D.C.", "date": null}]