[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…face with cuts to SNAP benefits and the school lunch  program. They spoke of how students will not be able to show up to  school ready to learn and how it would impact their learning experience  and their school environment.\n\nI spoke to families who told me that they didn't know how they would  be able to afford healthcare once their Medicaid is cut, once…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Virginians who are  interested in pursuing technology-based careers as their pathway to  success.\n\nGeorge's dedication to STEM education is contributing to the future  of learning and exposes students to diverse opportunities.\n\nMr. Speaker, George's leadership and unwavering commitment to this  program are truly deserving of this recognition. I am honored…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698648/recognizing-george-hinckley"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…his accomplishments and service  thus far.\n\nMel is a great community leader, author, and musician. His  preservation efforts remind us that, as a community, we benefit from  learning about and celebrating the Indigenous population that has lived  on this land for countless generations. I admire his devotion to  preservation and am grateful we have people…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699866/recognizing-mel-vernon-as-november-2025-constituent-of-the-month"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…attacked by the administration and defunded in  the Republicans' big, ugly bill.\n\nI said this to Secretary Hegseth in our hearing last month: America's  future servicemembers are learning in our public schools. They might  rely on Medicaid to see a doctor. They may only have a meal to eat  because of WIC or food stamps, or they may live in subsidized housing.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…is an  attack on democracy itself, and the timing could not be more ironic.\n\nAs we approach America's 250th birthday, our national parks should be  a place of reflection, learning, and honest celebration. Instead, we  are fighting simply to ensure that these public lands continue to  represent the full dimension of the American experience.\n\nNational…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…These programs are designed to help English language learners pick up  the language quickly for attending school or starting a new job.\n\nIt can be hard to be in a new place, learning a new language. I  applaud the courage and openness of these students in coming to the  United States and meeting students from different countries. Our world  is stronger…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695726/education-first"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…fastest bank run ever, with $42 billion  of deposits withdrawn on a Thursday and customers trying to pull out  another $100 billion the next morning when the bank failed.\n\nUpon learning of Silicon Valley's failure, Ranking Member Waters  organized Member briefings with the Treasury Secretary and banking  regulators. We encouraged Biden's regulators, led by…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are dependent on broadband to learn and  teach, to communicate with each other, to establish relationships and  communities. Digital education has allowed for more flexible learning  opportunities for all of us, whatever our ages, but most specifically,  for students doing their homework, doing lectures, engaging in  discussions, and so much more--all…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…through the challenging moments our community has faced this  year, this school has remained a safe and welcoming place for all kids  and has promoted and instilled a love of learning. No matter what may  be happening at home or in the world, these kids know that they can  come here to learn and feel supported.\n\nMr. Speaker, I am honored to represent them…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…K-12  funding in every State and almost 15 percent in my home State of  Georgia, almost $225 million.\n\nThese dollars appropriated by Congress are meant to improve student  learning and empowerment, as well as their achievement, operate before-  and after-school programs, train teachers, and help adult learners go  back to finish high school.\n\nA few weeks…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…opportunity to see this outstanding education model at work  when I toured Santee High School, one of the partnership's campuses. I  was impressed by the students and their learning progress. I was  convinced then and am even more certain now that the partnership has  created a scalable and sustainable model for schools nationally.\n\nThe partnership is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…to work  together so that everybody can benefit from the greatness of this  country.\n\nIt doesn't take anything away from a child sitting in a class with my  grandchildren, learning about the contributions, learning about Chappie  James. How can that be an insult? There is no insult to my children to  learn about Jimmy Doolittle. Why is it an insult to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Vought to release the funds  by July 15. That date has obviously passed, but we have received no  answers.\n\nAlthough the administration did release the 21st Century Community  Learning Center grants yesterday, they are a small percentage of the  outstanding funding, and there is still no word on any of the other  grants.\n\nSchool districts across the country…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Effective.\n\nEffective? Are you kidding me? I shudder to think what it would take  for a man like that to admit failure. We should all hope that we never  find out. Instead of learning even a single lesson, all he has done now  is doubled down on doing as much damage as possible.\n\nWhen it comes to vaccines, he has not only spouted off nonsense and  falsehoods…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…as adults.\n\nThat is not surprising to people just to think it through. It is  true. If kids have access to healthcare, they succeed more in life.  Medicaid helps diagnose learning disorders, treat chronic conditions,  and ensure children don't fall behind simply because they are born in  poverty. It is essential to the American dream, that just because…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…business concerns with information on       artificial intelligence tools; and\n\n``(2) make such educational resources and modules publicly       available on an existing online learning platform of the       Administration.\n\n``(b) Contents.--The educational resources and modules       established under subsection (a) shall include, to the extent       practicable,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…fundamental purpose of American education. It goes without saying that  we should be teaching American values in American schools.\n\nThis is what happens when institutions of learning accept the Trojan  horse of foreign funding. It shouldn't take an act of Congress or a  congressional investigation hearing for parents to know who is funding  their schools.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Christian School pushes students in and out  of the classroom to reach their academic potential, through a  challenging curriculum, Christ-centered teaching, and hands-on learning  experiences.\n\nThe students, faculty, and families at Hanford Christian are  dedicated to serving their community. Every year, they contribute to  food drives and volunteer…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…roots in  agriculture. She was born into the Yarborough pioneer ranching family  in Sanford, Florida, where she was raised with a deep respect for the  land and livestock, learning the ranching lifestyle through hard work  alongside her parents.\n\nIn 1985, she married her high school sweetheart and late husband,  Paul Mazak. Based in Sumter County and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…honor the life and legacy of Judy  Jurgensen Melroy.\n\nA native of Savannah, Georgia, Mrs. Melroy lived a life defined by  faith, service, and love for others. Her passion for learning led her  to become a teacher, where she inspired countless young people and  passed on her joy for education to future generations.\n\nAt home, she poured her heart into raising…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695205/people-are-sick-and-tired"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…roads clean from litter. Moreover, Kay is a member of the  Decatur Church of Christ and has taught Sunday School for many years.  As a result of her efforts to advance student learning and achievement,  she  has been recognized as Bible School Teacher of the Year and Rookie of  the Year at Lindale Elementary School. A devoted follower of Jesus, Kay  is most…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the  faculty, staff, alumni, and families of Solebury School as they  celebrate this extraordinary milestone and continue their inspiring  journey into the next century of learning, leadership, and community.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…country, which stalled hundreds of families from completing  their adoptions. Today, the families I mentioned continue to be  separated from their adoptive child in China or are learning that the  child they have been matched with for many years has been rematched  with a different family in China. The latter is the case for the  Robinson family of Iowa.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692787/intercountry-adoptions"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…programs.\n\nBy working shoulder to shoulder with farmers, agribusiness, and  public policymakers, Dean Buhr has worked to cultivate a student  experience that combines classroom learning with cutting-edge research  and public engagement, preparing CFANS graduates to become the world's  ag leaders of tomorrow.\n\nI thank Brian for his years of service to the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699023/recognizing-brian-buhr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…equal to any mission. Not to rest on a great year for  recruiting, we are expanding access for our military recruiters at  secondary schools and other institutions of higher learning.\n\nAs our men and women in uniform are our priority, the NDAA authorizes  a 3.8 percent servicemember raise, and that is much-needed. It also  extends special pay authorities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695131/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Design.--Training in the       program components established under subparagraphs (A) and       (B) of subsection (b)(2) shall--\n\n``(1) be designed using principles of adult learning and an       industry standard instructional design model; and\n\n``(2) to the extent practicable, as determined by the       agency, be training that is instructor-based.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…partnership with a cultural or language institute  funded by the Chinese Government, including a Confucius Institute. It  would also bar any school that directly operates a learning center  supported by the Chinese Government that receives support from an  individual or entity acting on behalf of the Chinese Government.\n\nOn the outside, these seem like…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…focused on unleashing growth for Main Street,  empowering expansion of advanced manufacturing, and delivering the  skilled job opportunities that will enrich people with valued learning  trades that help build American innovation, technology, and  infrastructure.\n\nIn north Texas, we are in a perfect position to lead this new era of  American growth. Our businesses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…operated, in  part, by the CCP's United Front Work Department, a known overseas  propaganda and influence operation.\n\nForeign experience in our schools threatens not only student learning  but also our national security. H.R. 1049, the Transparency in  Reporting of Adversarial Contributions to Education Act, or the TRACE  Act, by Representatives Aaron Bean…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…provide essential resources for  small businesses to support their efforts to adopt AI.\n\nSmall businesses are optimistic about the potential of AI.  Capabilities like machine learning and language processing are becoming  critical tools for businesses seeking streamlined operations, like  workforce recruitment, marketing, and strategy development.\n\nHowever,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}]