[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and kept their end of the  deal, their retirement benefits would be there for them.\n\nHowever, that promise was broken through no fault of their own when  Delphi collapsed, leaving more than 23,000 salaried workers, including  over 5,000 in Ohio, with sharply reduced or eliminated pensions. Those  are the folks that I mean. This is simply wrong. It is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…questioning what is  going to happen next.\n\nI heard from a grower in my State who said, ``The alarms in ag are  sounding. The band has stopped playing, and the last lifeboats are  leaving the ship. We cannot endure another cycle similar to the one  that was started seven years ago when tariffs were first put in place.  And without meaningful, long-lasting solutions,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…businesses. It is a smart investment in our national security.\n\nAs we speak, Mr. Speaker, there are millions of dollars of food that  has been left rotting over in ports, leaving massive numbers of people  in conflict zones starving. This is all due to the chaos and  mismanagement of the White House.\n\nThis is not fiscal responsibility. It is moral…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…history's shame      I rise      Up from a past that's rooted in pain      I rise      I am a black ocean, leaping and wide,      Welling and swelling I bear in the tide.      Leaving behind nights of terror and fear      I rise      Into a daybreak that's wondrously clear      I rise      Bringing the gifts that my ancestors gave,      I am the dream and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Judge Hicks has been a dedicated mentor  and role model, investing in the growth and advancement of future legal  professionals. Her influence extends far beyond the courtroom, leaving  an enduring mark on the legal landscape through her advocacy, guidance,  and commitment to ensuring equal access to justice for all.\n\nThe decision by the Black Women Lawyers…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tomorrow? Who the heck knows. But businesses can't  count on reliability, only on chaos.\n\nDonald Trump's trade war is a lose-lose-lose for American families  and businesses, leaving them with increased costs and more chaos.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…can say to my colleagues, I got to a point that I said, I am for an  Energy Secretary for life, or until they clean up Hanford, because that  is how technical the job is and leaving it every few years to a new  Energy Secretary and administrators, to me, was part of the challenge.  Also during the Bush administration, when Secretary Bodman was there,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…trade associations, the biggest one,  the American Hospital Association, came right out and said that it will  lead to millions of Americans losing access to healthcare and leaving  many of our hospitals struggling to maintain services and stay open for  their communities.\n\nThe Catholic Health Association said, Congress has a moral obligation  to consider…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…punishes our veterans by pushing out professionals from the  Department of Veterans Affairs. It promotes premature retirements, and  it paves the way for private equity takeovers, leaving care delayed,  denied, and diminished.\n\nFor this reason, at the appropriate time I will offer a motion to  recommit this bill back to committee. If the House rules permitted,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…create legal and regulatory chaos, not  clarity.\n\nThat is because it would revive the Trump era leasing plan that is  legally flawed and under active litigation, effectively leaving no  valid framework for how leasing could proceed. Just a way of saying, my  guess is, it would have more lawsuits that would be easier to attack.  That is because the CRA,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…of Paris. From there, its prisoners were transported to       concentration or death camps.\n\nGrandmother and I stayed hidden in my mother's apartment       for a year, never leaving for fear of being arrested or       worse. I went out alone to get food. Every day I stood in       lines, unable to conceal my Star of David, and because of it,       I was…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…claimed is constitutionally impermissible. A forced merger of       the District and Maryland would also do nothing to address       the purported constitutional objection to leaving the       residual seat of government with three potential electors,       pursuant to the terms of the Twenty-Third Amendment, prior to       the Amendment's repeal.\n\nOpponents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…marriage. Republicans claim that this new version  will ``fix'' this problem by adding in a provision about affidavits to  prove identity. However, the bill remains vague, leaving the process up  to the states. Regardless, millions of women would face additional  burdensome steps to register to vote.\n\nI want to be clear; this bill is not simply a voter…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…for sure.\n\nThis choice would lock out the perspective from previous Tribal and  public engagement and ban the agency from ever again issuing a  substantially similar RMP, leaving land policy frozen in time and  frozen in some kind of a limbo with incredible uncertainty and chaos.\n\nHouse Republicans want to permanently enshrine fossil fuel extraction…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…one-of-a-kind documentation of a significant and  often-overlooked part of the Sewickley Valley community's history and  heritage.\n\nMrs. Cole passed away in 2016 at the age of 92, leaving behind a  family and community proud of her contributions. I think those merit  recognition, and what better way to memorialize Mrs. Cole and her work  than by putting her…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…will be lost following       Biden's day-one decision to immediately shut down       construction of the pipeline that was supposed to carry oil       from Canada to Texas--leaving South Dakotans reeling and       1,000 people immediately out of work.\n\n``Where is it that they can go for their green job?'' Fox       News reporter Peter Doocy asked Psaki…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of the entire Powder River Basin but also disrupt       America's vital energy security well into the future.\n\nThe current RMPA prohibits the leasing of federal coal,       leaving skilled workers questioning the sustainability of the       current economic environment. Passing the CRA resolution       sends a clear message to families, small businesses,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…primarily driven by energy-intensive users such as data centers and  domestic manufacturing.\n\nThe timing of projected demands is occurring as historic levels of  baseload power are leaving the system due to a confluence of State and  Federal actions that have attacked fossil fuels and subsidized  preferred sources of intermittent generation.\n\nIn fact, while…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…infrastructure is a matter of  national security and economic sovereignty. For too long, the United  States has relied on foreign launch  services and satellite capabilities, leaving critical assets vulnerable  to geopolitical uncertainty. Increasing the use of Alaska's space  infrastructure will ensure that our national security interests,  commercial…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…key role in providing peace for our country and does  not go unnoticed. He also continued to demonstrate his strong work  ethic at General Motors, where he later retired from leaving a proud  legacy of hard work behind.\n\nBeyond his dedication to our country, Albert is a lifelong volunteer  who finds joy in helping his community. He spent a lot of his time…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692324/recognizing-wwii-combat-veteran-albert-busacca-on-his-100th-birthday"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…to $34,000 for single  filers and from $32,000 to $68,000 for married filers.\n\nIn effect, this legislation would eliminate income taxes for many of  our Nation's retirees, leaving them with more money in their paychecks.\n\nAs we work on these tax provisions and more, I am looking forward to  working with President Trump to deliver relief for hard-working…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Unfortunately, I was dismayed to watch the agreement sit on the  Governor's desk for over 6 months while she refused to review the  documents and then pushed last-minute changes, leaving members of the  Saint Regis Mohawk Tribe and the Mohawk Council of Akwesasne, who  worked alongside my office on this legislation, in limbo and long  awaiting the culmination…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Reform heard testimony from  President Biden's Social Security Commissioner, Martin O'Malley. He cut  a deal with union bosses after the November election and just before  leaving the agency to run for chair of the Democratic National  Committee.\n\nThe deal locked in telework levels for tens of thousands of Social  Security Administration employees for…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…between agencies and overlapping authority and subject to  enforcement instead of clear rules.\n\nThe uncertainty has driven jobs, investment, and innovation offshore  while leaving American consumers exposed.\n\nThe CLARITY Act fixes this. It establishes clear, functional rules  for digital assets, drawing a bright line between the SEC and the CFTC  and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693792/digital-asset-market-clarity-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…a Chinese cargo ship captain who has  been charged with severing a natural gas pipeline and a communication  cable in the Baltic Sea.\n\nIf we stick to the status quo, we are leaving ourselves more  vulnerable to similar threats at our doorstep. Our adversaries are  taking an increasingly aggressive posture in targeting critical  infrastructure.\n\nCongressman…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…wave of tragic and entirely preventable outcomes. Governor  Hochul and Democrats have doubled down on procriminal policies that put  violent offenders back on our streets, leaving families and communities  to suffer the consequences. The American people deserve better. New  Yorkers deserve better. People in Washington, D.C., deserve better, and  President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Life is a blessing, and as Cheryl Calire transitions into retirement,  my family and I are so grateful to have witnessed her passion and  dedication. We are all charged with leaving our community better than  we found it, and Cheryl certainly has achieved that mission.\n\nI ask this body to join me in recognizing Cheryl Calire for her  commitment to life-affirming…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689281/recognizing-cheryl-calire-for-her-steadfast-service-and-dedication-to-the-saint-gianna-molla-pregnancy-outreach-center"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…will bend the cost curve for  healthcare downward. That is not true at all. Premiums for the average  ObamaCare plan have skyrocketed much higher than traditional inflation  leaving patients with higher costs and fewer choices.\n\nIf Americans are just tuning in to C-SPAN, you might assume that  Republicans are eliminating the Affordable Care Act or ObamaCare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…saddled the country with $36.5 trillion in debt. It is a debt  service that is higher than what we spend on our national defense. It  is an unacceptable legacy that we are leaving to our future  generations. We are working every day toward our budget reconciliation  to get that under control so that we can be the era that bent the curve  on spending…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…police. In fact, one of my  colleagues from Texas was literally serving on the Austin City Council  when they cut $150 million out of the Austin Police Department's  budget, leaving their academy decimated, leaving them unable to field  911 calls, leaving violent crimes skyrocketing in the city of Austin,  because my colleagues on the other side of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]