[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…institutions. Many pregnant students risk their       health or the health of their pregnancies, because they are       unaware of their right to accommodations, including leaves of       absence, lactation accommodations, academic adjustments--      including virtual learning and extensions on completing       assignments--financial aid eligibility,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Dominick Ruggerio, who was both president and the dean  of the Rhode Island Senate.\n\nPresident Ruggerio, who passed away last month, was affectionately  known as ``Donny.'' He leaves behind his children Amanda and Charles  and four beloved grandchildren.\n\nDonny was a graduate of two great Rhode Island institutions--La Salle  Academy and Providence College.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Rhode Island ready to finish this project  that is 80 percent complete.\n\nWe already have a permitting process that works. This amendment  perpetuates a false narrative that leaves thousands of family- sustaining union jobs at risk.\n\nMR. COURTNEY. Mr. Chair, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695136/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of the United States of America, and you should be  removed.\n\nI know that there are some who would want to wait, well, he will  leave office in a couple years, and after he leaves office in a couple  of years, we will get back to our normal lives. Not the case. This man  is having a long-term impact on American society. Not the case.\n\nThere are others…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…spending more money than it costs to buy a Presidential jet--to  rehab a jet that was given to the President so that he could actually  send it on to his personal library after he leaves office. It is  profoundly disturbing, and I appreciate the way you framed it.\n\nThere is enough money for luxury glitz--for a megaballroom. I can't  even imagine how anything…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…dignity. That is not who we are supposed to  be.\n\nEmpathy is not weakness. Empathy is strength, and empathy is action.  It is action against the epidemic of loneliness that leaves millions  disconnected and vulnerable, a crisis that fuels despair and  radicalization.\n\nWe need to invest in connection in this country: in schools, in civic  spaces, in mental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…ranking  member of the Energy and Commerce Committee--and Brendan Boyle, a  Democrat, of Pennsylvania, the ranking member of the Budget Committee.  They asked the question.\n\nThat leaves Republicans in a deep predicament. The budget       resolution, adopted by the slimmest of margins in the       narrowly divided House, was the delicate product of       negotiations…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Hidden is to be made inconvenient  to the dominant narrative, shuffled to the footnotes or left on the  cutting room floor of America's memory. It is dishonest, yes, but it  leaves room for some discovery.\n\nErasure is more sinister. Erasure says that we were never here.  Erasure digs into the archives with red ink and crosses out our lives,  achievements,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…imagine, but, one day, the Trump Presidency will  end. The statute of limitations for these crimes, however, will extend  beyond that date. When the day comes that Donald Trump leaves the White  House and his successor moves in to finally bring some order to this  chaos, there will be accountability. The Department of Justice, free  from its weaponized quest…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…about American energy dominance never was  going to be a reality. It was just a hollow campaign slogan. The  Republican energy agenda is a level of economic self-sabotage that  leaves you slack-jawed: How can you make such an unforced error?\n\nIt is going to take a huge toll on the economy. Our people thought  they were voting for cheaper groceries, utilities,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…go hungry.\n\nEducation has always been a great equalizer and an engine for  socioeconomic mobility. Without the Department of Education, we will be  left with a system that leaves Americans--rural, urban, and suburban-- underserved, uneducated, and unprepared.\n\nIf we want to lead in the world of innovation and discovery, if we  want opportunity for everyone,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689187/gutting-the-department-of-education"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't want to close, but I am prepared to close.\n\nMr. Speaker, this bill is a moral failure. It rips healthcare away  from millions. It pushes more families into hunger, and it leaves  seniors stranded all so billionaires can keep more of what they will  never spend.\n\nRepublicans say: If you lose your job, too bad. If hospitals shut  down, good luck. If…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…into the place where survival is a reach      There's been enough inaction. There's been enough waiting.             There's been enough sorrow.      Only moments of silence leaves more children who yearn for             tomorrow                              By Cecilia Bleyer       Throughout the vast halls of the Senate,      Cycles of pages never relent…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…stablecoin issuers comply with the law.\n\nThe bill also creates risks for consumers who will be stuck in a  lengthy bankruptcy process if a stablecoin ever fails.\n\nAdditionally, it leaves the door open for foreign firms that present  a major national security threat, including targets of sanctions, all  to appease those in the Trump family's inner circle which…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…House Democratic Caucus that  made her so effective with the New Dems.\n\nEmma's tenure with the New Dems has been--by any measure--an immense  success. As she departs, Emma leaves behind a strong New Dem brand and  media presence that will continue to grow atop the foundations she  worked so hard to establish. Though we are sad to see her go, the  Coalition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…was written in 1938 and has never been updated  to meaningfully protect tipped workers.\n\nAs a result, tipped workers are not clearly defined or protected  under the law. This leaves their jobs vulnerable to the whims of  administrative regulations, court rulings, and too often unclear  guidance written by unelected bureaucrats that inconsistently interpret…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Officer Chris Reese was just 30 years old, having served with both  the Virginia Beach Police Department and the Virginia Beach Sheriff's  Office for the last 6 years. He leaves behind a loving wife. He will be  remembered for his loyalty to his loved ones and his passion for  serving the residents of our city.\n\nOfficer Cameron Girvin was just 25 years…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687949/moment-of-silence-in-honor-of-cameron-girvin-and-christopher-reese"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…will  reduce waste, prevent delays in care, and ensure that taxpayer dollars  are spent efficiently. Most importantly, it will help restore trust in  a system that too often leaves veterans feeling frustrated and  forgotten.\n\nMadam Speaker, I respectfully urge my colleagues to support this bill  and join me in making a practical, bipartisan improvement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Speaker, I thank Bill for his many years of service to northeast  Wisconsin and congratulations on his retirement. May this next chapter  be as fulfilling as the legacy he leaves behind.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688600/recognizing-bill-jartz-the-voice-of-lambeau-field"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…her leadership has made a difference, and  her example will continue to guide us long after she steps away from  this role. As she begins the next chapter of her life, she leaves with  our deepest respect, our sincere gratitude, and our very best wishes.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…a pillar of the community. As he completes his final  day behind the barber chair on December 19, 2025, we honor his lifetime  of contributions and celebrate the legacy he leaves behind.\n\nOn behalf of Minnesota's 6th District, I extend my deepest gratitude  to Dennis Eugene Butcher for his 53 years of dedication to the people  of Watertown, Minnesota.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698267/recognizing-the-retirement-of-dennis-eugene-denny-butcher-of-watertown-minnesota"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…and set a path for the future. His guidance has ensured  operational readiness and the expansion of essential services, even as  challenges grew more complex.\n\nChief Williams leaves behind a legacy of integrity, collaboration,  and tireless dedication. I thank him for his service, leadership, and  enduring commitment to the safety of our communities. He…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ship and all things  ready, and such of their friends as could not come with them followed  after them, and sundry came from Amsterdam to see them shipt, and to  take their leaves of them. One night was spent with little sleep with  the most, but with friendly entertainment and Christian discourse, and  other real expressions of true Christian love.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…administration put out, especially on this land in  Montana, is no kind of balance that I have ever seen. It is totally  unbalanced. It locks things down, shuts things off, and leaves the  American people to deal with the ramifications of it, with higher  energy prices, less reliable energy, and also less national security.\n\nMr. Speaker, I want to point…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Spiders--Justice Koontz was known for his  clarity of writing, profound sense of fairness, and deep commitment to  justice. Justice Koontz mentored generations of legal professionals and  leaves a legacy of wisdom, service, and an unwavering dedication to the  rule of law.\n\nWe extend our deepest condolences to his beloved wife, Elizabeth, his  children, grandchildren,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…as well as  eyelash extensions, lifts, and tints. Her team of highly skilled and  experienced stylists and beauticians deliver exceptional services,  ensuring every client leaves feeling refreshed and renewed.\n\nBeyond exceptional expertise, Jenya's salon offers impeccable  customer service and attention to detail. The staff is friendly,  professional,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…monitors,  glucometers, inhalers, and medications and testing to help individuals  with high cholesterol. While the bill includes 14 specific services  that could be covered, it leaves the door open for the list to be  expanded later, as well.\n\nBy providing flexible coverage options for more people living with  chronic health conditions, we can help lower…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…communities can receive much-needed relief  and long-term stability.\n\nThis bill gets us on the right path in accomplishing the Trump  administration's goal of energy dominance and leaves behind wasteful  and destructive, often counterproductive, Biden administration spending  and regulation that created things like the Office of Energy Justice  and Equity and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…importance of standing alongside those who have sacrificed so much for  our country.\n\nMr. Speaker, it is my honor to recognize Mary Ann Keckler for her  extraordinary service. She leaves behind a legacy that will continue to  impact veterans and our community for generations. May her memory be  eternal.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}, {"senator": "French Hill", "party": "Republican", "sentence": "…sunshine flows into trees.             The winds will blow their own freshness into you and             the storms their energy, while cares will drop off like             autumn leaves.\n\nMr. Speaker, I hope future generations of Arkansans and a lot of  Texas visitors will enjoy those glad tidings from Flatside.\n\nI include in the Record an article titled:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}]