[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "…House Democratic Caucus that  made her so effective with the New Dems.\n\nEmma's tenure with the New Dems has been--by any measure--an immense  success. As she departs, Emma leaves behind a strong New Dem brand and  media presence that will continue to grow atop the foundations she  worked so hard to establish. Though we are sad to see her go, the  Coalition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Dominick Ruggerio, who was both president and the dean  of the Rhode Island Senate.\n\nPresident Ruggerio, who passed away last month, was affectionately  known as ``Donny.'' He leaves behind his children Amanda and Charles  and four beloved grandchildren.\n\nDonny was a graduate of two great Rhode Island institutions--La Salle  Academy and Providence College.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…poured into  her family, always being a reliable supporter. Even when a relative  might have felt that life's challenges left them fighting alone, she  was always there.\n\nLynne leaves to carry on her legacy William O. Wagstaff, Jr.; William  O. Wagstaff, III; William O. Wagstaff, IV; her daughter-in-law,  Christina; and bonus children, grandchildren, great-grandchildren,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of the United States of America, and you should be  removed.\n\nI know that there are some who would want to wait, well, he will  leave office in a couple years, and after he leaves office in a couple  of years, we will get back to our normal lives. Not the case. This man  is having a long-term impact on American society. Not the case.\n\nThere are others…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…don't want to close, but I am prepared to close.\n\nMr. Speaker, this bill is a moral failure. It rips healthcare away  from millions. It pushes more families into hunger, and it leaves  seniors stranded all so billionaires can keep more of what they will  never spend.\n\nRepublicans say: If you lose your job, too bad. If hospitals shut  down, good luck. If…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…member.  So I don't mess around when it comes to making sure every single one of  our students, in every corner of our country, has access to quality  public education, one that leaves them prepared for the future and  opens the doors of opportunity wide. It is not a responsibility I take  lightly; it never will be.\n\nOur kids are the future of this country,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…niece of a man  who has contributed to this country and paid taxes for more than 30  years and put four boys through college.\n\nThis body considers, once again, a budget that leaves working people  behind. I will for a moment talk about immigration and our economy  because what these colleagues of mine, the Republicans, will tell you  is that immigrants…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…relationships between Federal, State, and Tribal  organizations and governments to manage our public land. When you cut  Federal staffing, it really has ripple effects and leaves State,  Tribal, and local governments lacking.\n\nI want to express gratitude to U.S. Forest Service staff because they  are also keeping our cherished public lands accessible…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…embarrassed a lot of people and  worried them that we were moving to a police state, with the ICE agents  going up and down the streets looking for people who were raking  leaves, checking on each one of them, in terms of their background and  their citizenship and their identity.\n\nThey swept up almost everybody who was out in the yard. At this time…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, before he leaves the floor, I just want to  thank Leader Schumer for all the help. We are going to be focused today  on something that really matters to people, and I thank him.\n\nMr. President,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…reconciliation that is in front of the Senate right now.\n\nThough Elon Musk has exited the building, a new villain has entered  the chat with OMB.\n\nLet's evaluate the legacy that leaves behind thousands fired,  agencies dismantled, shattered lives, starving children, over 200  lawsuits, and a grift for the ages as Musk stole data, primed the pump  for billions…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691867/zombie-of-doge-lurches-on"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…party-line vote, the  Republicans produced their bill, their budget reconciliation bill,  which extends those tax cuts, despite the fact that it worsens our  budget deficit and leaves middle-class and lower income Americans in  the dust.\n\nThis chart was done by the Peterson Institute for International  Economics, a nonpartisan think tank, which shows again…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…into the place where survival is a reach      There's been enough inaction. There's been enough waiting.             There's been enough sorrow.      Only moments of silence leaves more children who yearn for             tomorrow                              By Cecilia Bleyer       Throughout the vast halls of the Senate,      Cycles of pages never relent…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Urban Development, or HUD, is attempting to  experiment with crypto in their operations, including by paying  grantees in stablecoin or crypto. One of Trump's executive orders  leaves the door wide open for Trump to require the use of his  stablecoins and meme coins in order to pay taxes or enter into other  arrangements with the government. This would be…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…today to congratulate Chancellor  Joe Garcia on his retirement from the Colorado Community College System  (CCCS). Joe spent more than 35 years working in higher education and  leaves CCCS in a strong position for the future.\n\nJoe is the former Lieutenant Governor and Executive Director of the  Colorado Department of Higher Education, becoming the first…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…multiple  claims within the same packet.\n\nWhen a veteran files a claim, it means they need help, yet too often  they receive long, confusing letters full of legal jargon that leaves  them with more questions than answers, ultimately leading them to call  into a claims center or a helpline, which overburdens that and slows  down the overall claims process.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689676/clear-communication-for-veterans-claims-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…will  reduce waste, prevent delays in care, and ensure that taxpayer dollars  are spent efficiently. Most importantly, it will help restore trust in  a system that too often leaves veterans feeling frustrated and  forgotten.\n\nMadam Speaker, I respectfully urge my colleagues to support this bill  and join me in making a practical, bipartisan improvement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695398/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…47 in number,       alternating with three rampant lions and incorporating four       chevrons. In base, the word ``SACRIFICE'' is inscribed. In       dexter base, three oak leaves are placed, symbolizing the       national tree of the U.S., representing strength, resilience,       and honoring the families and widows of the fallen. The       reverse…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…was written in 1938 and has never been updated  to meaningfully protect tipped workers.\n\nAs a result, tipped workers are not clearly defined or protected  under the law. This leaves their jobs vulnerable to the whims of  administrative regulations, court rulings, and too often unclear  guidance written by unelected bureaucrats that inconsistently interpret…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…where he played a key role in uniting the Village and  Town to address critical infrastructure needs, including improvements  to the sewer system.\n\nMr. Speaker, Dick Young leaves behind a legacy of service,  innovation, and unwavering dedication to his community and country. His  accomplishments, generosity, and leadership set a gold standard that…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…sheer numbers of lower income families compensate  with volume, assuring ample affordable housing for all income levels.\n\nGovernment sets basic safety standards but otherwise leaves consumers  alone to make their own decisions about everything else. As the tax  base grows, new revenues are available to expand water systems,  electricity generation, highway…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…and set a path for the future. His guidance has ensured  operational readiness and the expansion of essential services, even as  challenges grew more complex.\n\nChief Williams leaves behind a legacy of integrity, collaboration,  and tireless dedication. I thank him for his service, leadership, and  enduring commitment to the safety of our communities. He…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Ms. TENNEY. Mr. Speaker, I rise today to recognize the life and  legacy of my dear friend Senator Tarky Lombardi, Jr., who passed away  on November 24, 2024.\n\nTarky Lombardi leaves behind five children; eight grandchildren; and  his wife, Marianne, whom he happily was married to for over 66 years;  as well as a profound legacy in service to the State…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Movement. People who invest in our youth, pour into their  families, and strengthen our communities through their time,  compassion, and leadership.\n\nTheir dedicated work today leaves an indelible mark on tomorrow, so  let me encourage you to press onward as you selflessly dedicate your  time to serving your community.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Spiders--Justice Koontz was known for his  clarity of writing, profound sense of fairness, and deep commitment to  justice. Justice Koontz mentored generations of legal professionals and  leaves a legacy of wisdom, service, and an unwavering dedication to the  rule of law.\n\nWe extend our deepest condolences to his beloved wife, Elizabeth, his  children, grandchildren,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Keller's service exemplified integrity, approachability, and a deep  respect for local government's role in serving the public.\n\nAfter years of dedicated service, Mayor Keller leaves a lasting  impact on the borough and the people he served. His commitment to  community engagement and civic responsibility stands as an example of  how local leadership plays…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "John Thune", "party": "Republican", "sentence": "…really about the bill at all or  if this was about wanting to deny President Trump or Republicans, more  generally, a legislative victory, which might be nice for Democrats but  leaves stablecoin issuers and Americans who use stablecoins in the same  difficult spot that they are currently in. But unfortunately, it is  pretty clear that obstructing, not legislating,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…provide comprehensive feedback on its impact.\n\nFurther, it is important to clearly delineate the extent of       the rulemaking's scope. In its current form, the proposal       leaves open the possibility that entities far outside the       market for general-use digital consumer payment applications       will be captured. For example, the proposal specifies…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Tree'' now, and it  is the picture of Oklahoma after that bombing. We survived.\n\nThat scrubby little American elm tree is now enormous 30 years later.  Its branches and its leaves spread out over that site. It is the shaded  spot. And on the morning of April 19, there will be survivors and  families that will sit under its branches. And as we pause for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…importance of standing alongside those who have sacrificed so much for  our country.\n\nMr. Speaker, it is my honor to recognize Mary Ann Keckler for her  extraordinary service. She leaves behind a legacy that will continue to  impact veterans and our community for generations. May her memory be  eternal.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}]