[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…this offset has been employed historically and in  some form since the 1960s. However, in light of this administration's  ongoing efforts, enabled by a complacent Republican-led Congress, to  systematically weaken VA, we must reevaluate whether it remains  appropriate to rely on this offset. I believe it would be prudent to  discuss with the Senate…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…represent, and so many  across our country, I urge my colleagues to vote in favor of this  commonsense legislation.\n\nI thank the gentleman from Arizona (Mr. Ciscomani), who co-led the  bill. I also thank the House Committee on Veterans' Affair for marking  it up and moving it forward. Lastly, I thank the Disabled American  Veterans and Paralyzed Veterans…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…in Gaza still live under constant  threat: of violence, of the elements, of starvation.\n\nEarlier this year, my colleagues, Congresswoman Pettersen and Senator  Gallego, and I led over 100 Members of Congress in urging the State  Department to immediately surge humanitarian aid and ready-to-feed  infant formula to families in Gaza to save lives.\n\nIn a…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…with its 12th national title. All records are made to be  broken, but it is hard to even imagine any other school's team that  could come close to 12 national titles.\n\nThey were led by Paige Bueckers who is going to be one of the greats  in the history of college basketball. She scored 17 points and had  numerous rebounds, steals, and blocks. She has had…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…years. We were actually going backward by 2007, and the rest of the  world was zooming right past us.\n\nIt is one of the laws I passed which I am most proud of, and that is  what led to the rulemaking that promulgated the higher fuel economy  standards for our Nation. I am very proud of that law and the work I  played over in the House authoring it.\n\nAnd…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Site.\n\nYou may remember, in 2020 the first Trump Administration called for a  resumption of nuclear testing in breach of the Comprehensive Nuclear  Test Ban Treaty. Back then, I led the charge in the FY21 NDAA process  to ensure that explosive nuclear testing could not be resurrected in  the United States.\n\nBut the more things change, the more they stay…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…that they are tracking demonstrators with facial ID  technology, following them home to intimidate them. And, in fact, I  have heard stories from demonstrators who have been led home by ICE  agents--so that those agents are communicating: We know where you live.  We know who you are. We want you to be quiet--pepper balls, tear gas.\n\nAnd this is not…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…brought to the floor today would have re-opened  the SBIR and STTR programs, which have been shut down now for more than  70 days. The bill was unanimously passed by the House, led by the  Republican chairs of the House Small Business Committee and House  Science Committee.\n\nSince the SBIR and STTR programs closed their doors, I have heard  from hundreds…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…been  rummaging through people's individual Social Security records.\n\nFor the general public's awareness, DOGE is the so-called Department  of Government Efficiency, initially led by Elon Musk until there was a  breakup of the bromance between he and President Trump, but DOGE still  persists.\n\nMr. Speaker, as you know--and it has to be as much a concern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…years, and many are manufactured       overseas and imported to the U.S. to meet the unprecedented       demand. Unfortunately, the increase in these subpar products       has led to a troubling rise in fires and explosions, some       fatal.\n\nMany food delivery couriers rely on safe, efficient       transportation like e-bikes to sustain their livelihoods,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…line be integrated and no longer segregated.\n\nThis was the dispute that took place when Dr. King was promoted to  the leadership of the civil rights movement. This is where he led the  people in this bus boycott to make sure that, at some point, Black  people could sit on any seat on the bus that they chose to, because  they couldn't.\n\nYou could take…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…they launched a bus boycott, little did they know that  they  were giving rise to the greatest civil movement that the world has ever  seen and that the world has ever known, led by a young minister who was  a mere 26 years old at the time: Martin Luther King, Jr.\n\nThis movement would give rise to what America proudly holds itself  out to be today. That…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…commitment to public service extends  beyond Jefferson County--he also deployed to Sarasota County, Florida  to provide critical support during Hurricane Milton.\n\nNathan has led the way in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience. We are grateful for his leadership and commitment…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…enforcement raids targeting multiple       businesses in Downtown Los Angeles, including Korean-owned       garment factories.\n\nThese sudden and large-scale operations, which led to       numerous arrests, were reportedly conducted without prior       notice, causing severe disruption and significant damage to       the affected businesses.\n\nDisturbingly,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Dino Garr,  Rye High School football teams have won four State championships and  are now competing against Brighton for their fifth State championship.\n\nThis year's squad is led by quarterback Carson Miller; wide receiver  Henry Shoemaker; running back Jagger Fenton; and the aptly named  Charlie Garnet, Garnet being the school mascot.\n\nTheir strong…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…our Armed Forces and the  patriotism of those who serve out of a deep sense of duty.\n\nSome among them have borne the scars of war. Others have shaped the  lives of those they led and mentored. All have left a lasting impact on  their units, their communities, and this country.\n\nIt is my distinct privilege to include their names in the Record. May  their…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…to  bring down costs and empower everyday Americans.\n\nFor instance, President Trump has negotiated countless trade deals to  bring manufacturing back to America. Tariffs have led to massive  investments, particularly in Indiana, including investments from John  Deere and General Motors and many small to midsized companies.\n\nPresident Trump is also helping…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700206/congratulating-president-trump"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and  protect the long-term interests of both the United States and the  Venezuelan people.\n\nNicolas Maduro is a narcoterrorist and international drug trafficker  whose actions led to the addiction and deaths of many Americans. He was  an illegitimate dictator who held power through stolen elections and  horrific violence against the people of Venezuela.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Madam Speaker, I rise today to speak on the bill, S.  3705, the Semiquincentennial Congressional Time Capsule Act, as led by  Congresswoman and fellow commissioner on the Semiquincentennial  Commission, Bonnie Watson Coleman, and also by Senator Thom Tillis of  North Carolina.\n\nThis bill, of course,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699841/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…its immediate consideration in the House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. WESTERMAN.  Res. 105.\n\nMr. Speaker, I rise in strong support of H.J. Res. 105, led by  Representative Fedorchak of North Dakota.\n\nThis Congressional Review Act resolution reverses a resource  management plan, or an RMP, finalized in the waning days of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Act around Christmas 2017. Then- House Minority Leader Nancy Pelosi infamously predicted Armageddon for  America--fear-mongering, plain and simple. The Tax Cuts and Jobs Act  led to historic growth and economic gains in this country.\n\nLarry Summers, a well-known Democrat, described progrowth forecasts  as ``tooth fairies'' and predicted a long recession.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…means the National Telecommunications and Information       Administration.\n\nMr. Speaker, I rise in support of H.R. 1766, the NTIA Policy and  Cybersecurity Coordination Act, led by the gentleman from California's  23rd District and the gentlewoman from Virginia's Fourth District.\n\nCyber threats, whether originating from state actors, criminal  organizations,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…FFA Week, and as a product of FFA myself, I  know firsthand the values, knowledge, and character it instilled in me.\n\nThis year, the over 1 million students enrolled in FFA are led by  their National FFA Officer Team and the National FFA President, Mr.  Trey Myers of Perkins, Oklahoma.\n\nA native of Oklahoma's Third Congressional District and a student…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700175/recognizing-national-ffa-week"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…States was struggling with rampant stagflation, high gas       prices, hostages held in Iran, and increased tensions with       the Soviet Union whose invasion of Afghanistan led to the       boycott of the 1980 Summer Olympics.\n\n(8) The Miracle on Ice was a turning point for American       hockey. The game was named the greatest sports moment of the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…visitors each  week.\n\nWhile seeing tremendous growth in the century since its founding, the  market has stayed true to its roots. Root's remains family-owned and is  currently led by fifth-generation market master Emily Longenecker  Rineer.\n\nWhat began as a poultry auction one century ago has become a staple  of Lancaster County's heritage. As Root's…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…record-setting 12th Iowa State Championship.  This win marks their first title since 2021 and is a testament to the  perseverance, heart, and teamwork that defines Iowa athletes.\n\nLed by senior Dru Dorsey and freshman Ruby Stevens, the Knights  showed skill, leadership, and grit on the field. Dorsey scored one goal  and assisted on the other, setting the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a bipartisan bill, Mr. Speaker, the  Financial Stability Oversight Council Improvement Act, after a decade  of collaboration across four Presidential administrations that has led  to this consensus on this measure.\n\nThe Financial Stability Oversight Council, FSOC, created in the  aftermath of the global financial crisis, plays an important role in  understanding…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…continental security, and he  successfully persuaded them to increase their defense spending and  enhance deterrents against future aggression.\n\nThe President's representatives have led several rounds of  negotiations between the Ukrainians and the Russians--something that  President Biden did not even attempt--and President Trump has secured a  key critical…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…celebrate the  recent recognition of one of Nebraska's preeminent banks and a pillar  of the community it serves, First National Bank Omaha, better known as  FNBO.\n\nFNBO has long led Nebraska's banking sector, especially in their  efforts to expand access to affordable housing across our State. By  engaging with local communities, listening to stakeholder…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…The FY23 NDAA mandated that CBP submit a one-time report to Congress  on a strategic plan to counter illicit cross-border tunnel operations.  This singular report has since led Congress to conduct critical  oversight and has enabled CBP to formalize many of the processes,  technologies, and resources needed to counteract illicit tunnels under  the…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}]