[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…his family, friends, and the people of Blakely in thanking him  for his tireless service and leadership. His steady stewardship and  commitment to the common good, have left a lasting and positive mark on  his community. On behalf of the more than 765,000 people of the 2nd  Congressional District and my colleagues, I once again thank him for  his service…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the  graduates of Stone Bridge High School's class of 2025.\n\nIn their time as Bulldogs, this class has left a lasting legacy in  the form of a mural to represent hope for the future. They excelled  across a wide range of fields, including journalism, data science, and  fine arts.\n\nStone…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…to secure critical resources to help  people lead better lives. Her dedication reflects the resilience we  honor this month.\n\nMr. Speaker, Joann's unwavering service has left a lasting impact and  touched countless families. I thank her for her sacrifice to our  country and her service to community.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…majority, Emma's  creativity and instinct were instrumental in advancing New Dem  priorities that helped improve the lives of Americans across the  country. Her work has left a lasting impact on the New Dems and the  values we fight for.\n\nWhile we will miss her leadership, I am excited to see Emma take on a  new role with Chairman Pete Aguilar and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695681/recognizing-the-service-of-emma-weir"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…vigorously advocated for diversity and  inclusion at all levels of his career.\n\nMr. Speaker, I am pleased to recognize Byron Allen in the hope of  encapsulating a man who has left a lasting mark on entertainment  without ever straying from his moral undertaking of corporate social  responsibility. Byron Allen is a role model for us all and has led a  trailblazing…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…advocating for small businesses, public  safety, and quality-of-life improvements. His collaboration with city  agencies, elected officials, and local stakeholders has left a lasting  impact on the Ridgewood community.\n\nAs Mr. Renz embarks on a well-earned retirement after 37 years of  dedicated public  service, I extend my deepest gratitude for his…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…faiths. Since being elected Ecumenical Patriarch,  Bartholomew has been a courageous voice for unity, religious freedom,  and environmental stewardship. His leadership has left a lasting mark  on both the Orthodox world and the entire global community.\n\nThis will not be his first visit to the United States. When he came  in 1997, he was received in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…constituents in every big decision.  It seems Gerry knew the secret ingredient to community engagement, a  healthy serving of Hyland sauce.\n\nAs a master of puns, Hyland left a lasting impression with his humor.  Before retiring in 2015, at his final board of supervisors meeting, he  shared one last pun that perfectly encapsulated his wit: There once…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…partnerships while keeping Mill Creek's unique identity  intact.\n\nMr. Speaker, I ask my colleagues to join me in thanking Mayor  Holtzclaw for his leadership and service. He has left a lasting mark on  Mill Creek, and I wish him well as he begins the next chapter of his  life.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…heritage.\n\nIt is with great pride and admiration that I recognize Orlando Ortiz  during Hispanic American Heritage Month. His professional achievements  and civic service have left a lasting mark on both the Hispanic  community and the Greater Rochester region.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…institution were invaluable to the college.\n\nKathleen's widespread involvement demonstrates her enthusiasm for  public education systems in the Inland Empire. Her hard work has left a  lasting impact on many, as seen by her recognition as Chaffey College's  2002 Alumni of the Year, and with Chaffey College being named a top-10  finalist for the 2017 Aspen Prize…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…over a decade, he spoke to classes at  Marblehead High School, helping students understand the human cost of  war through his firsthand accounts. His honesty and devotion left  lasting impressions on Marblehead students, making the lessons of  history real and deeply felt.\n\nHarry never wanted to be far from Marblehead Rock. He loved the  Marines, his…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690561/harry-christensen-remembered-for-decades-of-public-service"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…her innovative teaching strategies,  unwavering commitment to student success, and active pursuit of  professional growth. Through her commitment to education, Edie has left  a lasting impact on both her students and colleagues.\n\nEdie's service and devotion to Spotsylvania County Public Schools is  truly deserving of this recognition. I am honored to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, today I rise to honor Mr. Jounghun Bang,  Vice President of the Dallas Taekwondo Association, whose leadership  and mentorship have left a lasting mark on youth and families  throughout North Texas.\n\nThrough his commitment to training the next generation of athletes,  Mr. Bang has fostered excellence on and off the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692604/recognizing-jounghun-bang"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Connecting Arkansas Program, which  included over 30 State highway construction projects and helped  modernize the Natural State's transportation infrastructure.\n\nShe has left a lasting mark on the department and our State, and she  has proven to be a tireless and effective leader.\n\nI thank Lorie for her lifetime of dedication and her terrific  perseverance…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…patriotism of those who serve out of a deep sense of duty.\n\nSome among them have borne the scars of war. Others have shaped the  lives of those they led and mentored. All have left a lasting impact on  their units, their communities, and this country.\n\nIt is my distinct privilege to include their names in the Record. May  their example inspire future generations…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…ever in the Sunshine State to be elected statewide as  Lieutenant Governor.\n\nHer efforts to improve education and to ensure veterans receive the  support they deserve has left a lasting legacy.\n\nHer induction into the Veterans Hall of Fame recognizes her impact on  the Sunshine State and our country. We are proud of her and her  service.\n\nMr. Speaker,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…the nickname ``The Fongressman.''\n\nOver the years, I was fortunate to be mentored by Doug. He was a  great role model and friend. His guidance, leadership, and example left  a lasting impact on me and on so many others who had the honor of  working with him.\n\nDoug will be remembered for his deep love for his family, his faith  and core principles, his…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698728/9999"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…he  was instrumental in maintaining communication lines and coordinating  operations during natural disasters and civil security efforts. His  integrity and dedication left a lasting impression on all who served  alongside him.\n\nMr. Lewerenz's commitment to excellence extended well beyond his  military service. A graduate of Lindsey Hopkins Vocational…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…community extend far beyond his business.\n\nThrough tireless volunteer efforts, active participation in civic  organizations, and a deep commitment to public service, Casey has left  a lasting impact on Brooksville and its people. A true public servant,  Casey served as a City Council member for the City of Brooksville,  where he worked diligently to improve…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…After 30 years of faithful and honorable service, Timothy retired  from the United States Marine Corps. His experience, professionalism,  and devotion to country have left a lasting impact on the lives of  countless Americans. His legacy is one of sacrifice, integrity, and  duty, and we offer our deepest gratitude for his outstanding service to  the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…next  month after more than 40 years of distinguished service.\n\nDr. Wintersteen has been a remarkable leader whose commitment to her  students and to the State of Iowa has left a lasting impact on the  institution. She brought the ``Innovate at Iowa State'' vision to life,  solidifying the school's role as a national leader in research and  entrepreneurship.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697328/recognizing-dr-wendy-wintersteen"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Tribal Council.\n\nA public servant in every sense, Jerry also served his Nation as a  judge on the Oneida Judiciary, where his wisdom, fairness, and devotion  to justice left a lasting impact.\n\nBeyond his public service, Jerry was a man of deep personal warmth  and abiding family values. He is survived by his loving wife, Pamela  Johns Danforth, and their…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…helped raise nearly $1.5 million for the  strengthening of services for local veterans.\n\nDon Johnson's tireless leadership and commitment to the non-profit  sector has left a lasting impact on Central Illinois. His work has  advanced economic opportunity, human dignity, and community well-being.  I congratulate Don on his retirement and wish him, his…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…source of comedic relief, a Christlike man who  overcame personal struggles to inspire others toward ministry and  service.\n\nGeorge's personal growth and friendship have left a lasting impact on  the Athens community, with thousands praying for him following the  accident.\n\nMr. Speaker, our hearts ache for this loss. I pray for the  Whittenburg family…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…shaping the lives of young  athletes in Little League Baseball, high school football, and the Cass  City Youth Football initiative. His belief in the power of mentorship  has left a lasting impression on the young people he has supported and  inspired.\n\nBeyond coaching and mentorship, Jim has worked tirelessly to  strengthen his community. He has been a dedicated…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Marion County. From launching  the Business Retention and Expansion Program to the Best of Red Rock  Awards and the Red Rock StartUP! pitch contest, Carla's leadership left  a lasting mark.\n\nWhat stands out most is her deep love for the people she worked with,  the partners across Iowa, and the local citizens who showed up, rolled  up their sleeves,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…pride.\n\nFurther, his decades of experience in charity auctioneering, show his  unwavering community spirit.\n\nMr. Arve's contributions to local causes and organizations have left  a lasting mark on the South-Dade community. It is with great gratitude  that I recognize Mr. Arve for his lifetime of service, leadership, and  love for our community.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690190/recognizing-mr-harold-r-arve-jr"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…recognize Jim Collins for  his extraordinary 20-year tenure as president of Loras College in  Dubuque, Iowa. As the longest serving president in the school's  history, Jim has left a lasting impact on Iowa's oldest institution of  higher education.\n\nPresident Collins earned his bachelor of science degree in finance  from Loras College in 1984. After graduation,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}]