[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…corruption by  this administration to run a bill on rich people's showers for Donald  Trump? It is just absolutely amazing.\n\nMr. Speaker, I have a little less than a minute left in my time. I  would ask my colleague across the aisle one simple question: Did Mr.  Donald Trump ask him to run a showerhead bill today on the House floor?  If my colleague…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…shutdown, the longest government shutdown in American history. While  House Republicans gave themselves a paid, 2-month vacation, hundreds of  thousands of Federal employees were left wondering how they were going  to pay their rent or mortgage, and 42 million Americans nearly lost  their food assistance.\n\nWhat was the Trump administration doing? Instead…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Montana and Washington, those studies were able to be completed,  and their mineral withdrawals happened in 2018, protecting their  waters, but the Rainy River Watershed was left unfinished.\n\nWhen President Trump took office, his administration initially  promised to complete the study. Instead, President Trump honored his  promise from a campaign rally…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Hickenlooper", "party": "Democrat", "sentence": "…1-year extension, we allow all those people in Colorado and across  the country to sort through their healthcare issues, to reequilibrate,  and to make sure that they are not left out in the cold. And I think  that is the key here. We are looking at tens of millions of people that  will either lose their healthcare or have dramatically significant  increases…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696606/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…This bill is a practical way to create  universal, public prekindergarten. The goal of this bill is to provide  the benefits of early childhood education to those who have been left  out of this essential education.\n\nWe cannot afford to allow the most critical years of child  development to pass unenriched. This bill responds both to the great  needs of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695812/introduction-of-the-universal-prekindergarten-and-early-childhood-education-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…flexible mechanisms for  engagement with Pacific Island countries. But nearly a decade later,  these improvements are still not reflected in U.S. law.\n\nThis legal disconnect has left the American fleet, including vessels  operating out of Hawaii, in a state of regulatory limbo. Operators are  forced to navigate conflicting rules between what the treaty allows…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…reducing reliance on foreign-made equipment but also boosts American  manufacturing and fosters innovation in 5G and 6G.\n\nThe bill ensures that rural communities are no longer left behind in  the race for cutting-edge technology, driving down costs and empowering  smaller carriers to build stronger, more resilient networks.\n\nMr. Speaker, I encourage my…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…striking--it is about access  to care for everybody.\n\nI was talking to a doctor from the Lansing Care Free Medical Clinic.  It is completely Medicaid covered. It is the folks who are left out of  the system. He will just close. We will have clinics just close. So I  think we are talking about something that, again, comes to the heart of  who we are as a community.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…evidence.\n\nSeveral patients reported being reassured that severe pain or  bleeding was normal, only to later require emergency medical  intervention when complications were left untreated.\n\nIf Republicans truly cared about TANF oversight, they would have  spoken out when millions of TANF dollars were stolen from struggling  families in Mississippi to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…pursue a refund will further burden small businesses.\n\nI urge the Trump administration to work quickly to guarantee that  small businesses, the lifeline of our economy, are not left behind  because of this erratic policy.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698342/president-trumps-tariff-policies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…impeachment is the remedy. If the courts cannot control  him and my Republican colleagues, who have the majority in the House  and the Senate, won't control him, then the only thing left is  impeachment.\n\nThat means that the Congress of the United States of America, in this  House, this will become the court of last resort. We plan to use the  court of last…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Since taking office, Donald John Trump has directed the Department of  Justice to dismiss more than a dozen prosecutors who were involved in  investigations against him after he left office in 2021. The Department  of Justice has subsequently launched investigations into officials  involved in prior probes against Donald John Trump, in some cases  against…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…country at the Social Security Administration.\n\nHe is a great example of dedication and service to his fellow  Americans.\n\nMike Nolan wanted to be a Catholic priest, but he left the seminary  system in 1975. When he heard of an agency that would help the aged and  the disabled, he felt the need to apply to work for the Social Security  Administration.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695094/recognizing-clarendon-hills-little-league-team"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Leaders on both sides of  the aisle must speak out and condemn these violent acts. I have said  this repeatedly, but it bears repeating: Political violence from the  right or the left is never--never--acceptable. It is never the answer.\n\nWe must condemn these violent acts when they happen. We also must  speak out against the radical language we see online…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Maldonado stepped up  under pressure and delivered a perfect 10-yard touchdown strike to  Gabriel Canchola. This touchdown pass put the Eagles in the lead.\n\nWith 21 seconds still left, the Eagles' Ivan Lopez broke through the  line to sack the opponent's quarterback and seal the championship.\n\nMr. Speaker, I congratulate the Eagles football team for their…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…brutal, barbaric murder, and the cold-blooded assassination of a man  beloved by millions.\n\nThe depth of this tragedy is hard to process: a life cut short at age  31, a wife left without a husband and two young children without a  father.\n\nThe tributes that have poured in these last 24 hours from people from  all walks of life and all corners of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695355/tragic-loss-of-charlie-kirk"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…responsibilities, culminating in his role as Assistant Chief of Army  Reserve. A native of Oregon and a proud graduate of the United States  Military Academy at West Point, Mr. Austin has left an indelible mark  on the lives of countless Soldiers, Army civilians, and their families.\n\nEven after retiring as a Colonel in the U.S. Army, Mr. Austin's  passion to serve…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…it has ever been, and it  is your plan. It is our job to fix it, which is exactly what we are  doing.\n\nMr. Speaker, ObamaCare has failed to deliver on its promises. It has  left millions of Americans with higher premiums. Again, your votes did  that. It has fewer choices, less coverage, and is plagued by fraud,  waste, and abuse.\n\nMr. Speaker, I recently…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…contract opportunities.\n\nLast year, the Biden-Harris SBA sought to implement a new  certification portal. Unfortunately, this portal's lackluster planning,  creation, and rollout left the SBA with a ticking time bomb.\n\nThe Biden administration's failed Unified Certification Portal  rollout resulted in delays, errors, and cybersecurity risks, shutting  out…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…education in the United States.\n\nFor 1 year, she has not only stepped away from the classroom and her  beloved students, but, as a devoted wife and exceptional mother, she  also left behind her husband, Gabe, and their two children: Aidan and  Sydney.\n\nVeena's passion for STEM education and her students was unmistakable  and contagious. Her kindness and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697562/recognizing-albert-einstein-distinguished-educator-fellow-veena-black"}, {"senator": "John Thune", "party": "Republican", "sentence": "…majority, we did short- term continuing resolutions. Republicans delivered and voted with  Democrats to fund the government.\n\nWell, I know why we are doing this. The Democrats' far-left base said  ``Jump,'' and the Democrat leader said ``How high?'' But the far left's  determination to oppose anything President Trump has ever said or done  is not a good reason…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…to operate. Therefore, you offset the so-called benefit by  burning a lot more energy, meaning you are burning a lot more carbon  dioxide, by the way. In other words, you are left with a policy that is  pretty much all cost and no clear upside to it.\n\nIf you look at the justification, the Biden EPA claimed they  implemented this rule to address hazardous…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Affordable Care Act was sold as a solution. It has locked  families instead into a system where premiums keep rising and  deductibles keep climbing, networks shrink, and patients are left with  coverage that they can't even use and bills that they can't even  predict. There is no transparency in the costs of the healthcare that  they are receiving.\n\nLet's be…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the Connecting Arkansas Program, which  included over 30 State highway construction projects and helped  modernize the Natural State's transportation infrastructure.\n\nShe has left a lasting mark on the department and our State, and she  has proven to be a tireless and effective leader.\n\nI thank Lorie for her lifetime of dedication and her terrific  perseverance…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to cheat in. Essential components of this  process were 30-day registration, in-person election day voting, and  proof of identity.\n\nIn recent years, in many States, the woke left has torn down these  safeguards. Mail-in ballots where there is no chain of custody,  counting ballots weeks after election day, counting ballots in secret,  ballot harvesting,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the  very water heaters the Biden administration attempted to outlaw. This  job-killing regulation imposed by the Biden administration is yet  another painful example of the left's war on hydrocarbons.\n\nThe purpose of this regulation is to try to single out and eliminate  an American manufacturer of noncondensing tankless water heaters.  Effectively,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…advanced manufacturing.\n\nMr. Speaker, after decades of degrowth policies that drove energy  production and refining abroad, our adversaries have exploited  vulnerabilities and left American families susceptible to actions from  places like Communist China.\n\nWe have already seen Communist China take steps to limit exports of  minerals, such as antimony,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Patrick's Day celebrations.\n\nJay has long been a dedicated leader in Savannah's Irish community,  serving as a parade officer and as chairman. His leadership and his  passion have left an indelible mark on our city.\n\nThis St. Patrick's Day, Jay will carry forward not just a family  tradition but the enduring spirit of our community's Irish heritage  that defines…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688723/patricks-day-parade"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…role in helping  military families, like the Belos, find peace in their loss and honor  their loved ones who are taken from them too soon.\n\nThis week marks 1 year since Marc left us, but his legacy lives on  and is now helping other veterans to do the same.\n\nMr. Speaker, I urge my colleagues to join me in honoring American  heroes like Marc Belo and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}]