[{"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…passed away peacefully this November at the age of 92. I was  fortunate to have known Loc Vu for two decades, and I will miss our  community's friend, mentor, and leader. His legacy lives on in the  hearts of the more than 20,000 neighbors he has helped to support and  uplift.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…leadership has kept Haymarket at the forefront of  addiction treatment amidst the opioid epidemic and mental health  crisis.\n\nWhile Father Mac is no longer with us, his legacy lives on through  Haymarket Center. I join people across the Chicagoland area in  congratulating Haymarket Center for 50 years of incredible work,  helping those who had no one…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…and women and then families who accomplish it,  and his tireless efforts to lead from the front, have contributed to  the safety and security of all Americans. Today, his legacy lives on  through the Black family, with their daughter, Corporal Are'wynn Black,  following in her parents' footsteps in the Marine Corps.\n\nOn behalf of a grateful Nation, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…conducted the Ladies African Charitable School for  several decades, providing education for formerly enslaved people and  their children.\n\nOver two centuries later, her legacy still lives on in New Hampshire  with the Dinah Whipple STEAM Academy at the University of New  Hampshire. This program offers underrepresented young teens of color  the opportunity…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…artistic expression--were integral to the  couple's success. Their partnership was a testament to the power of  collaboration and the beauty of shared purpose--and their legacy lives  on in the countless lives they touched through art and advocacy.\n\nPaul and I, and our entire family, mourn the loss of our very dear  friends Rob and Michele with profound…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…fierce determination, ironclad will, and overwhelming dignity       of my grandmother. What an example. That is simply special.\n\nWhat brings a smile to my face is that this legacy lives on       dynamically as ever with her granddaughter, Nina. Nina and       her husband Orion are raising three incredible young women:       Annie, Adalin, and Noelle. Three…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to the Federal Government.\n\nLocally, John was active in civic life for many years, giving his  time and energy to local Democratic politics and community service.  John's legacy lives in all of the lives and communities that he  touched.\n\nMy heart goes out to his family, and may he rest in peace.                   Corruption and Controversy at Fannie…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…effectiveness in advocating for the  Native Hawaiian community continues to impact the Native Hawaiian  community, especially through the Hawaiian Homes Commission Act. His  legacy lives on in the many Native Hawaiian families who have  benefited--and will continue to benefit--from his vision and  leadership.\n\nDaniel Kahikina Akaka was born in Honolulu,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Americans or women in our Nation's military, but still, they rise.  Still, we rise because we understand that an injustice anywhere is a  threat to justice anywhere. Today, that legacy lives on through the  more than 350,000 Black Americans currently serving in uniform and the  more than 2 million Black Americans who are veterans. They served with  that same…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…she decided to take her bold stand,  Dixie remembered: ``I said this is ridiculous, I'm going to change  that, so I did.'' Dixie died in 2020 at the age of 102, but her legacy  lives on. In 2023, she was inducted into the Kentucky Bourbon Hall of  Fame, which recognizes sacrifice and determination in the bourbon  industry. Louisville Mayor Craig Greenberg…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695585/recognizing-the-extraordinary-life-of-dixie-demuth"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…peacefully debate ideas in the court of public  opinion.\n\nUnfortunately, Charlie was taken from us in a disgusting act of  political violence on September 10, 2025, but his legacy lives on.  Charlie will long be remembered for his love of God, his family and  this great Nation and the impact he had on each and every one of us.\n\nWe have the opportunity to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…impact extends well beyond my office. She has mentored young  staffers who will go on to serve in Congress, the executive branch, and  communities across the country. Her legacy lives on in the people she  has trained, the standards she has set, and the example she modeled  every day.\n\nPublic service is often described as thankless. Too often the people…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…day to ensure the safety of our community. They  walked into uncertainty, faced danger without hesitation; and upheld  the values of integrity, justice, and duty. Their legacy lives on in  the hearts of those they touched.\n\nTo the families of our fallen heroes, we offer our deepest gratitude.  No words can truly capture the weight of your loss or the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…dealership while earning numerous President's Awards.\n\nBeyond work, Ted enjoyed time with friends, boating on the Hudson  River, and spending time with his grandchildren. His legacy lives on  through the lessons he passed on to his family, his friends, and the  many lives he touched. May he rest in peace.                   Recognizing S.W. Johnson Fire Department…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…``Puppy'' Fecht, and we honor him not just for what he did but for how  he did it, with courage, with conviction, and with a spirit that lifted  up everyone around him.\n\nHis legacy lives on in the hearts of those who served alongside him  and the freedom that he so selflessly defended. Great American patriots  like Commander Bruce ``Puppy'' Fecht will always…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…to approach challenges with resilience and compassion, and to  uplift others in the process. She was a dedicated wife, daughter,  sister, stepmother, and friend, and her legacy lives on in the hearts  of all who were fortunate enough to know her.\n\nAs we reflect on Krista's life, we recognize the profound impact she  had on her community. From her work…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688958/recognizing-the-life-of-krista-wynne-moore"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…that he brought people together; that he was deeply  committed to serving his community.\n\nMay we pray for his family, remember his sacrifice, and strive to  live our legacy and our lives in whatever way we can, as he did his.\n\nWith gratitude for Deputy Ohlmeyer's service and remembrance of his  life, Mr. President, I ask that we pause for a moment to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699609/9999"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…military families, like the Belos, find peace in their loss and honor  their loved ones who are taken from them too soon.\n\nThis week marks 1 year since Marc left us, but his legacy lives on  and is now helping other veterans to do the same.\n\nMr. Speaker, I urge my colleagues to join me in honoring American  heroes like Marc Belo and their families by passing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691051/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…deepest  respect, not just this week, but every single day.\n\nLet us also remember, honor, and mourn the officers who made the  ultimate sacrifice in the line of duty. Their legacy lives on in the  lives they protected, the officers they mentored, and the communities  they kept safe.\n\nMr. Speaker, I thank every single office across this great Nation for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and  women who made the ultimate sacrifice in the line of duty.\n\nThese officers gave their lives to protect our families, our  neighborhoods, and our way of life. Their legacy lives on in the  communities they served and in the continued service of those who wear  the badge today.\n\nAt a time when violent crime is rising and law enforcement officers…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691352/saluting-police-officer-heroes"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…airfields, one of which earned him the Distinguished Service Cross  citation.\n\nThough he tragically passed away in November of 1942 during a  training flight in Alabama, Buzz's legacy lives on as an inspiration to  all aspiring aviators.\n\nCongratulating University of Florida Forward Thomas Haugh\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to congratulate…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}]