[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…you need to make this  weapon you got without a background check into a gun that can shoot  bullets, and within months you will be able to purchase those same  parts online legally.\n\nWhen gun violence remains the leading cause of death in the Nation  for our kids, Congress must not hand unregulated weapons over to the  public. We must not make Axon,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699906/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…billions to  ramp up mass detentions and deportations, including American children  with cancer, and deny due process to whomever they can, including those  in the country legally.\n\nThe ``One Big Ugly Bill'' spends $46.5 billion on Trump's failed  border wall--which Trump originally said Mexico would pay for.\n\nThat amount is nearly four times what Trump…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…General; Karine Jean-Pierre, the first African-American White  House Press Secretary; Deval Patrick, first African American Governor  of Massachusetts; David Paterson, first legally blind and first African  American to serve as Governor of New York State; Wes Moore, the first  African American Governor of Maryland; Patrick Gaspard, labor union  organizer…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Federal employees or upending our closest trade and national security  partnerships.\n\nInstead, today, we are taking time on the House floor to consider a  minor rule that EPA was legally obligated to develop. The rule in  question--to limit hazardous air pollutants from rubber tire  manufacturers--was finalized in November of last year.\n\nAt no time, as far…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688528/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Days ago, I was approached by a kind nurse who had endured a hard  day. She shared with me that a patient of hers in a local healthcare  center had immigrated to our country legally to work as a common  laborer. She had fled a troubled Latin American country where thugs  controlled the streets.\n\nLeaving all behind, the worker had journeyed here from a…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Biden's  leadership and the Department of Labor, released a proposed rule that  would phase out, as quickly as possible, subminimum wage certificates  which allow employers to legally pay workers with disabilities below  the Federal minimum wage. This was long, long overdue.\n\nAbout 38,500 disabled workers earned a subminimum wage in 2024  because of these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Security office. It's been just a series of dead ends and       mistakes piled atop confusion.\n\nAnd, boy, there is the heart of it. Donald Trump and Elon Musk can't  legally cut Social Security benefits, but what Trump and Musk are now  doing is cutting access to being able to get your Social Security  benefits started, which has a very similar…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…references out of the Seventh Circuit, United States v.  Howard, threatens to significantly limit prosecutors' ability to hold  some of the worst child predators to account legally. The question may  appear to be technical, but the human consequences are grave and  brutally simple.\n\nTitle 18 of the United States Code, section 2251(a), criminalizes the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…know that OMB has made the wrongheaded argument to the  Committees that somehow apportionment decisions on congressionally  passed and duly enacted appropriations are both legally binding as well  as predecisional and deliberative, and that the requirement to post  such information is unconstitutional, but that is not so. OMB and  Director Vought continue…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…family members away.\n\nMasked Federal agents are seizing parents, yes, in front of terrified  children, and many of these people we are finding had no record and  were here legally.\n\nAmerican citizens and permanent residents are snatched from their  cars, and they are taken to detention centers. I worked on one case  this past weekend. It was cold, and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699348/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…teachers from the Philippines living and working on Maui. They were  invited to come to Maui to teach in our schools for a period of time.  And despite these teachers being here legally in our country, the  teachers were detained by Homeland Security and targeted before being  allowed to go about their business. That is called terrorizing people,  plain and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…listen to this--in all 50 States, and in all 50  States, law enforcement pays zero excise taxes on these devices. It is  important to know that long-range tasers can already be legally  purchased by civilians. All they need to do is pass a background check.\n\nI support tasers. I support law enforcement. This bill does not  mention tasers once, and law enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…economic challenges of the Covid-19 Pandemic. The  MCHCC assisted in 150 micro-businesses, artisans and brick and mortar  stores getting the licensing needed to do  business legally and be part of the Mercado. This Mercado Night Market  has become a community staple for five consecutive years.\n\nShe also served on the board of directors for the Kids Discovery…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…employer could justify paying her a subminimum  wage for all hours worked. If this bill were to become law, the  employer could classify her as a tipped employee and could legally pay  her as little as $2.13 an hour.\n\nIn a time of rising costs and an uncertain economy and working  families all across my district struggling to make ends meet, this bill…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…terrorized our communities.\n\nDuring these raids, my constituent Fatima Velasquez-Antonio, was  detained. She has work authorization, no criminal record, and is  allowed to legally remain in this country while her asylum case is  pending.\n\nYet despite all of this, she was taken into custody and ripped away  from her family for weeks. Thankfully, after…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699039/ice-raids-in-north-carolina"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…somebody votes illegally, Mr. Speaker, they are  stealing that veteran's vote. They are stealing your vote. They are  stealing everybody's votes if we allow people who aren't legally  eligible to vote to participate in elections.\n\nHow can you best preserve that? One way is that, when you are  registering to vote, you have to prove citizenship. It is in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…could all rally around.\n\nI sincerely ask my Democrat colleagues: What has changed?\n\nWe live in the greatest country in the world, where anyone from  anywhere can come here legally, make an honest living, and pursue the  American Dream. That is what House Republicans are fighting for.\n\nIt is unfortunate that the other side would rather see programs that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of protection  from political persecution and other areas defined in the law for  special purposes. For instance, you might be granted parole to care for  a sick loved one legally in the United States. You might be granted  some specific purpose for that one individual because we are a  compassionate Nation.\n\nOur colleagues on the other side of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…here.\n\nDuring the Biden administration--people are going to argue--somewhere  between 8 million and 10 million people were allowed in this country  who were not coming here legally.\n\nObviously, if we are going to have immigration laws, in the future,  we have to make it clear that people who broke the laws in the past are  not allowed in the country.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699125/united-states-naturalizes-people-every-year"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…consumer  protections through greater transparency and accountability in the  marketplace. It fosters innovation by providing a pathway for digital  asset firms to operate legally and with confidence, encouraging digital  asset innovation to remain in the U.S. The CLARITY Act unlocks economic  growth, global competitiveness, and financial opportunity…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693773/digital-asset-market-clarity-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…evolving  mission. To meet those threats, the Department was previously granted  the authority to enter into other transactional agreements, commonly  known as OTAs.\n\nThese legally binding agreements allowed the Department to engage  with nontraditional contractors that would not normally do business  with the Federal Government. This includes small…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Republicans in the Senate and this administration remain committed to  protecting American lives and keeping our roads safe. One key to do  that is to ensure CDL holders are here legally and are proficient in  the English language and can actually read road signs.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…abandoning their responsibility to defend our  border and allowing over 10 million people to enter this country  illegally, cutting in line over people who want to come here legally  and add to the American Dream.\n\nWe don't know who these 10 million people are, where they came from,  or if they could be a danger to our community and country. On top of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…rejected any comparison to Venezuela  and has emphasized that Greenland is a peaceful democracy. It is not a  territory to be pressured, to be threatened.\n\nThere is no case, legally or otherwise, for U.S. military  intervention in Greenland. Greenland has been not only a partner but a  faithful partner. They have been an ally and a friend to the United…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in the prior 3  years--it goes up and down by year--but if you take a rolling average,  in the last 3 years, we have over 800,000 people every year sworn in as  new citizens legally in this country. How often do you hear about that?  There are 850,000 people who did it right. It is not impossible to make  your way here.\n\nBy the way, that is historically…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…election integrity in our  Nation's Capital.\n\nThe right to vote is a defining privilege of American citizenship.  Diluting that right by extending it to noncitizens, whether here  legally or illegally, undermines the voice of Washington, D.C.,  residents.\n\nArticle I of the Constitution grants Congress exclusive jurisdiction  over the Nation's Capital, and the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…political consultants are saying, oh, good, more attacks.\n\nThe immorality of this place to not want to tell the truth about our  demographics and the complete barrier we have built legally on  innovation--I have a couple of really geeky things here, but I am going  to skip them and go to something that is a little crazy.\n\nEvery week when I do these, I try to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…state immunity and unlawful seizure. However, just like the court found  in Noriega's case, he will be prosecuted for his crimes, and the  actions that led to his seizure are legally sound, as they follow a 36- year-old template validated by Federal courts.\n\nMr. Speaker, to the Americans whose communities have been devastated  by drugs, to the families…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "French Hill", "party": "Republican", "sentence": "…preserved;\n\n``(D) provides housing that is permanently affordable to       low- and moderate-income persons using a ground lease, deed       covenant, or other similar legally enforceable measure,       determined acceptable by the Secretary, that--\n\n``(i) keeps housing affordable to low- and moderate-income       persons for not less than 30 years;…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…illegally, here is what is  actually happening along our border. They are arrested. They are being  instructed by law enforcement that they violated American law, that  they are not legally present, and they are being immediately turned  around and sent back to their country. That is the legal process.\n\nFor individuals that were coming in from China--and I saw…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]