[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and obviously clear that it demands an answer from the courts.\n\nAccordingly, in a moment, I will ask for unanimous consent to pass a  resolution that would direct Senate legal counsel to file a lawsuit on  behalf of the U.S. Senate to enforce the emoluments clause.\n\nAnd I will just close by saying to my Republican colleagues: I  challenge you. I challenge…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…wildlife, and mosquitoes that can potentially carry disease. They are  being stripped of their civil rights, and as of this past Saturday,  they have been cut off from legal counsel.\n\nWhile this humanitarian nightmare unfolds, soulless politicians like  Ron DeSantis, Donald Trump, and Kristi  Noem grin and call this place--I am actually not even going…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…decision when American lives could be on the line, when war is on the  line.\n\nI share my colleague Senator Kaine's concerns in having read the  opinion of the Office of Legal Counsel. Regardless of what people view  of the merits of that opinion, what we are talking about here is a  wholly other matter. What we are talking about here is potential war…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Restoring Access to Detainees Act with  Senator Murphy. Every family should know where their loved one is being  held. Every detainee must have easy, free access to call legal counsel.\n\nI also authored the CLEAR ID Act with Representative Crockett to  ensure that our community members are not approached or detained by  unidentified Federal agents. Without…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…rule, it also may create a loophole in the Posse  Comitatus Act, which limits the military's involvement in civilian law  enforcement. The Department of Justice's Office of Legal Counsel has  opined that when the D.C. National Guard is operating for non-federal  purposes, even though it is an exclusively federal entity, it may be  used for civilian law…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…trusted community-based organizations       that assist TPS holders with transition planning,       applications for relief, and know-your-rights education.       Access to legal counsel is often the difference between       stability and removal.\n\nTerminating Haitian TPS without a humane and legally sound       alternative compounds existing injustices…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…of research funding is  unconstitutional and flatly unlawful.\n\nThough undocumented families and small businesses were explicitly  encouraged for decades by government and legal counsel to come forward  out of the darkness and pay their taxes through their ITIN number, the  Trump administration is now trying to target this data to carry out his  mass deportation…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…court-sanctioned settlement  agreement; and conducted enforced disappearances of persons without due  process and without disclosing their fate and location to their  families and legal counsel, in violation of the Constitution and the  rulings of the Supreme Court, as well as the foundational principles of  due process and rule of law.\n\nC. Directed and permitted…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…who  sought entry.\n\nThe reports suggest that constituents are being housed in the  processing center for prolonged periods of time without access to their  medication, to legal counsel, or even basic necessities.\n\nLet me be very clear. Just because something isn't named a detention  facility doesn't mean this administration isn't going to use it as one.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…heartbreak.\n\nJackie Merlos and her four U.S. citizen children were detained by  Customs and Border Protection and held for 2 weeks in a windowless cell  without access to legal counsel.\n\nAfter public outcry and a temporary restraining order from a judge,  these U.S. citizen children were released from detention, but now they  have been separated from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694771/toward-a-more-dignified-and-just-immigration-system"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…assistance with a specific problem.\n\nThe bill makes a small but important statutory clarification that the  National Taxpayer Advocate may appoint and supervise her own legal  counsel, rather than only using attorneys that report to the IRS chief  counsel.\n\nBeing able to appoint independent counsel is an essential step to  preserving the independence…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…reason.  These films could be highly incriminating. The American people deserve  to see them.\n\nThird, the White House must declassify the Department of Justice's  Office of Legal Counsel's opinion underpinning their legal argument for  this operation. There is no reason for this document to remain hidden.  The American people deserve to know why this administration…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…silence, he  responded: As far as I know, GAO has always deferred to the Agencies,  until now.\n\nThey literally broke their own policy. They literally violated their  own legal counsel. So now, we are in a quandary. GAO has broken their  own legal counsel. We have an issue that will have well over $100  million worth of effect onto the country. It is…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…independent from the IRS, but the staff  assisting the advocate should be as well.\n\nYet, right now, the attorneys hired to assist the National Taxpayer  Advocate report to IRS legal counsel, are accountable to IRS legal  counsel, and answer to IRS legal counsel, not the National Taxpayer  Advocate.\n\nIt is a situation that begs for conflicts of interest to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…the gentleman  from Illinois (Mr. Davis), for working with me on this initiative.\n\nSince 2015, the IRS has prohibited the National Taxpayer Advocate  from hiring her own legal counsel, which undermines her ability to  provide insight, ensure fair treatment of taxpayers, and responsibly  work with the IRS caseworkers.\n\nAmerican taxpayers expect and deserve…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…authorize the testimony and production of  documents from Ms. Kotschwar except where a privilege or objection  should be asserted. The resolution also authorizes the Senate legal  counsel to represent Ms. Kotschwar in this matter.\n\nMr. THUNE.   on Thursday, June 5; that following the prayer and pledge, the morning  hour be deemed expired, the Journal of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…including the Architect of the Capitol, the Senate Sergeant       at Arms and Doorkeeper, the Secretary of the Senate, the       Office of the Attending Physician, Senate Legal Counsel, and       Senate Legislative Counsel.\n\n2.14 Senate wing of the Capitol means all space on the       Senate side of the U.S. Capitol Building, including the       Senate…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690981/us-senate-hallways-and-balconies-regulations"}, {"senator": "John Thune", "party": "Republican", "sentence": "…challenges the Senator's right to be seated in the Senate, an issue  which the U.S. Constitution commits exclusively to the Senate.\n\nThis resolution would authorize the Senate legal counsel to represent  Senator Wyden named as a respondent in this suit in order to remove the  case to Federal court and seek its dismissal on the basis of the  constitutional…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690107/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas.  Van Duyne).\n\nMs. VAN DUYNE. Mr. Speaker, every day, small business owners serve as  their own accountants, legal counsel, and managers while still handling  the day-to-day operations of their enterprises. That means they work  extra hours or they hire extra assistance just to keep up with…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}]