[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…billion downpayment on our national debt while  improving energy security, lowering prescription drug costs, and  creating a more equitable tax code.\n\nThis was the first legitimate effort to reduce the deficit since the  Budget Control Act passed 11 years earlier. But, unfortunately, my  Republican colleagues reversed course again by passing the ``Big…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…So this is not a great day in the history of the Senate. We are  opening up a Pandora's box of multiple abuses, and let me just point  out that there actually are a lot of legitimate CRA, Congressional  Review Act, targets out there--many dozens of decisions that have been  made in this Congress that lend themselves to a proper use of the  Congressional…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…hammering nails.\n\nCrypto has been around since 2009. Watch how people used crypto over  the last 16 years, Mr. Speaker. You can ignore anyone who says that  this is a tool for legitimate finance. That is because the tool is  overwhelmingly used for crime.\n\nThe Russians use crypto to evade sanctions and fund their war in  Ukraine. The North Koreans use it…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…city, in their  neighborhoods, and all around, and bring fear to parts of the city of  Chicago. Little Village and Pilsen are the ones most well known.\n\nMr. DURBIN. It is a legitimate point.\n\nWill you yield for a question--\n\nMr. DURBIN.--for the Chair?\n\nThe point I am trying to make is there are areas of the city of  Chicago and I am sure in your State…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hospitals, they get underreimbursed, oftentimes on Medicare or  Medicaid. And then the employer-sponsored premiums are the only place  the providers can go to cover their legitimate costs.\n\nSo there is a huge spike in the cost. If you have all these folks  without healthcare and they are showing up and getting free care, then  somebody has got to pay,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…were electing minority  people. Well, he wanted five, four of the five being these seats that  could elect minority people, minority people coalescing to elect  people, a legitimate thing for people to do.\n\nWell, in so doing, he ordered the Governor to do this. The Governor  got with the attorney general. The two of them worked it out such that  seats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…has broadly construed Congress's assigned       power to admit new states and has never interfered with       Congress's admission of a state, even when potentially       legitimate constitutional objections existed. For example, in       1863, Congress admitted into the Union West Virginia, which       had been part of the State of Virginia, in potential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…his hometown--an MIT-educated, baseball-playing engineer  who returned to his home, who served on the Los Angeles City Council  and now serves in this body--has some very legitimate questions about  why, in an unprecedented way, the National Guard and the U.S. Marines  have been deployed into his city, over the objections of the mayor,  over the objections…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…and the Organization of American  States could agree with that, and I am confident even the Vatican could  agree with that, and that is that Nicholas Maduro was not the  legitimate president of Venezuela. The Venezuelan people were neither  free nor prosperous during his corrupt regime.\n\nHere is another truth, Mr. Speaker, that in no way conflicts with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…an estimated  $36 billion.\n\nThis bill ensures that will no longer happen again. It protects  taxpayer dollars, ensuring that they go where Congress intended: only  to the legitimate small businesses of our country.\n\nMr. Speaker, I thank my colleagues for bringing this forward.  Government efficiency is a good thing, but there is a right way to go  about…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…don't usually buy that newspaper, but I am glad I did. There is a long  list of things they raised questions on when it came to fraud in the  Affordable Care Act. It is legitimate to raise those questions. We  should ask that of every single program.\n\nThey suggested in their editorial that the tax credits are somehow an  inducement toward fraudulent…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…advocating for a national abortion ban.\n\nHere is what should concern us all: These centers routinely spread  medical misinformation and intentionally cause delays in accessing  legitimate healthcare. Their theory is delay long enough and women in  crisis are effectively forced to continue their pregnancies.\n\nNow, Mr. Speaker, you will hear my Republican colleagues…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…create the first  research on hemp. We cooperated to give the first opportunity to move  research seeds across State lines. We cooperated and pushed to create  hemp as a legitimate agricultural product.\n\nCBD derived from hemp has been approved by the FDA for treating  seizures. It is a legal medicine. We would wipe out an industry that we  have spent…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Chinese Communist  Party interference with U.S. colleges and universities could lead to a  wide variety of negative outcomes. That said, House Democrats do not  want to see legitimate academic activity between the United States and  China hindered.\n\nThe compromise language recognizes the spirit of the bill--the need  to protect America's intellectual property…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…direct taxpayer dollars  away from helping families afford necessities like food, rent, and  childcare to crisis pregnancy centers that prey on vulnerable women  seeking legitimate reproductive healthcare.\n\nWe have heard today that wonderful, caring people staff these crisis  pregnancy centers, and I don't doubt that, but crisis pregnancy centers  do…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…bodily mutilation and chemical  castration for a minor, which generally is anyone under the age of 18  years, while also preserving the exception for this care if there is a  legitimate medical need for certain procedures.\n\nAnother bill we are considering in this rule is H.R. 498, the Do No  Harm in Medicaid Act, led by the gentleman from Texas (Mr. Crenshaw).…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Democrat leader, just a few short years ago:\n\nThat doesn't mean we don't disagree. But it does mean, when       nominees are held up, opposed, or blocked--it's for a       legitimate purpose, not for leverage in partisan games, to       score political points at the expense of public safety.\n\nDemocrats have engaged in a lot of partisan games this year,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "John Thune", "party": "Republican", "sentence": "…opponents, and oversaw the killing of thousands, as  a U.N. report outlined, to name just a few--just some of--his crimes.  The United States did not recognize him as the legitimate leader of  Venezuela. Neither did the European Union. And he was a fugitive of the  U.S. justice system.\n\nBack during the first Trump administration, Democrats were calling…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…items list, which is incorporated into these regulations as       Section 4.1.\n\n2.5 Personal security entity means a person or company that       provides bona fide, legitimate, and professional private       security services acting within the scope of applicable laws.       A personal security entity may also include, or extend its       services…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…don't recall anyone suggesting that the Biden administration could  not impose sanctions on Nicaragua last year because it was a CAFTA  party. Instead, we recognized that legitimate national security  grounds, including Nicaragua's human rights abuses, warranted the  economic pressure.\n\nThird, it was only yesterday that we confirmed Jamieson Greer as…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…coverage are able-bodied grownups who  refuse to get off the couch and look for work, illegal aliens who  refuse to go home, and fraudsters.\n\nWhat happens when millions of legitimate Medicaid recipients who have  been terrified by the Democrats realize that their benefits are  untouched? Well, we are going to find out.\n\nWill the national debt balloon?…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…fraudulently enrolling individuals to collect commissions  and meet enrollment quotas. This broker gained unauthorized access to  his prescription records and replaced his legitimate employer-sponsored  insurance coverage at his pharmacy.\n\nI wish I could say that these examples are one-time instances, but we  know they are not. The system was built for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "Mr. HIGGINS of Louisiana. Mr. Speaker, what is it that the Democrats  don't want the American people to know? It is a legitimate  consideration that the citizenry from sea to shining sea should ask  themselves right now. What exactly is the problem?\n\nThey say again and again, oh, DHS could do this…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…the goals of what all criminal laws should  achieve, protecting Americans, punishing illegal activity, and to deter  repeat offenses, this is a needed step to accompany the legitimate  approach that the President has been implementing over the past few  years.\n\nMadam Speaker, I urge my colleagues to vote in favor of this  legislation.\n\nMadam Speaker, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…and it demands a serious national  response.\n\nThese groups often use advanced techniques that allow them to operate  quietly within everyday system activity. They rely on legitimate tools  and access privileges to conceal malicious behavior. This makes  detection extremely difficult and allows intrusions to remain unnoticed  until long after a compromise…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…services, and       mobile phones and other mobile devices.\n\n(6) An estimate and discussion of the prevalence, usage,       and availability of technologies that authenticate legitimate       mobile service and mobile communications equipment or       services to which mobile phones and other mobile devices are       connected.\n\n(7) An estimate and discussion…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…trafficker. The argument is that this operation was to enforce the  warrant. It was more of a law enforcement activity because he was the  President of the country--not legitimate, by the way, and everybody  pretty much denied that he was the legitimate President when he stole  the election.\n\nSo the bottom line here is--the theory that some of my colleagues…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…year, I led a probe  into the account security of food delivery services after we had  received reports that showed illegal aliens were buying access to the  accounts of legitimate users. Thankfully, companies like Uber Eats,  DoorDash, and Grubhub implemented stronger driver verification  processes after we began this investigation, but Facebook's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…legal requirement that  Congress be notified before the President takes action. That framework  has governed American foreign policy for more than 50 years.\n\nMaduro is not a legitimate head of state. He is a criminal defendant  under United States law who was charged and indicted in 2020 by the  Department of Justice for drug trafficking and other related…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "French Hill", "party": "Republican", "sentence": "…States escalated sanctions against the Maduro  government for its links to the illicit drug trade.\n\nIn 2019, the United States no longer recognized Maduro as Venezuela's  legitimate president. As a result, the United States officially cut  diplomatic ties with the Maduro regime.\n\nIn 2020, the Department of Justice charged Maduro with  narcoterrorism,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}]