[{"senator": "Al Green", "party": "Democrat", "sentence": "…I would have voted for the impeachment because I  don't think that we should allow a President to circumvent what we know  to be the requirements associated with the legislative process and with  due process which should be accorded people who are being fired as it  were.\n\nWhen you do these things, the courts are acting, and the courts  should act.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Mr. SHERMAN. Mr. Speaker, I am proud to cosponsor the Stop Excessive  Force in Immigration Act. I look forward to working with the bill's  authors through the legislative process to improve important details of  that bill.", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699391/cosponsoring-the-stop-excessive-force-in-immigration-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the       District adopted the majority of H.R. 1 provisions, a small       number were temporarily set aside. These decisions were made       through the District's legislative process and are the same       type of policy judgments that every state and local       government routinely makes on behalf of their residents.\n\nThe timing of these resolutions…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have--not just him but any chief executive.\n\nIt attempts to enact through Executive fiat what the Trump  administration seemingly believes it cannot achieve through the  legislative process, through an act of Congress; namely, Senate  consideration of the SAVE Act, many provisions of which are contained  in the President's Executive order.\n\nI ask my colleagues…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…has been a pillar of  strength in the House of Representatives and a champion for the people  of Maryland for more than four decades. His patriotism, mastery of the  legislative process, and steadfast commitment to America's working  families have left an indelible, positive mark on our Nation.\n\nSteny has been a steady presence in our Caucus and the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…Republicans have rushed this bill to the floor  without input from House Democrats and without going through the Energy  and Commerce Committee, as it should, or any actual legislative  process.\n\nThat might sound like it is in the weeds, but it is not. It is a  glaring failure to engage in real and meaningful policy that the  country is demanding. It is a response…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698378/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…because that is  plainly what the bill says. Forgive me for insisting on scrupulous  attention to words, Mr. Speaker, but that is the business we are in  when we enter the legislative process.\n\nTaken together, the bill makes it so that an officer could retire,  commit a crime, become a person who may not legally own firearms under  Federal law, then buy from…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…black is the  color white or an orange is an apple--because everyone understands a  waiver is not a rule.\n\nSo it is unfortunate that the colleagues in charge of the legislative  process have so corrupted it yesterday and today, not even trying to  actually enact the law to accomplish what they want but instead saying:  Let's use an expedited process…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Imagine--imagine--they said,  the nerve of the Democrats not voting for a bill when there is no text.  How crazy can they be?\n\nWe asserted our rights very simply to continue the legislative  process to allow time to reach agreement. The majority, in an act of  political stubbornness but also stupidity, asked people to vote on a  bill they had never seen. They tried…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690962/stablecoins"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…and resources to support local communities.  There has been a transparent process with multiple hearings and  significant stakeholder engagement.\n\nThis is the way the legislative process should work, and I thank  Representative Horsford and Representative Lee for leading the effort,  along with the support of Representative Titus. I know their  constituents…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Congress, a hearing was held last year,  providing the Forest Service with an opportunity to comment on and  evaluate the proposal.\n\nThis is a critical component of the legislative process that ensures  decisions about the administration of our national forests and public  lands are made out in the open. These shared resources belong to all  Americans,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…strategically improve clean energy tax  credit provisions included in the House-passed reconciliation bill.''\n\nI mean, what is happening right now? This may be beyond the  legislative process.\n\nIn this letter, it goes on to say, in relationship to a bill that  every signatory signed and voted for: ``Our position has always been  that the energy tax code should…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…in order. I mean, that means over 97 percent of  Republicans have not had a single amendment debated.\n\nAre my Republican colleagues proud of being excluded from the  legislative process?\n\nMr. Speaker, I say, again, to the gentleman from Texas who just  spoke, I am sorry. Don't lecture us about deficits when you voted for a  bill that added $3 trillion…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…manufacturing.\n\nMs. CANTWELL. Thank you, Senator Wyden, I agree with you and will  work with you and our House colleagues to incorporate these changes  into the bill as the legislative process moves forward.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…foreign commerce. The Administration's abuse of  emergency powers to give himself authority to regulate foreign trade  and impose tariffs on the entire world bypasses the legislative  process, undermines transparency, and strips away the opportunity for  public accountability.\n\nThis is why, I urge my colleagues, especially Republican Members of  Congress,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…career. In 1992, he returned to the Legislative Reference Service,  bringing with him a wealth of legal knowledge and expertise, making  significant contributions to the legislative process.\n\nThroughout his career, Frank's work in areas like local laws,  taxation, and environmental law had a lasting impact, and his advice  was highly valued by legislators,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…or place it into the       Congressional Record during Floor consideration. I look       forward to continuing to work together as this measure moves       through the legislative process.            Sincerely,                                                        Brian Mast,      Chairman.                                   ____…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…person and  those handful of people every--well, I called them an epithet that ends  with the word ``hole.'' I did. I swallowed it. I took it. I just said:  That is the legislative process. I took it full in the face, went home,  had a beer, petted my dog, tried to get over it, and lived to fight  another day. It was stupid, but they did it. But we live…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…opportunities in the reconciliation instructions  for common ground.\n\nUnlike my friends on the other side, we don't view the Rules  Committee as the first stop in the legislative process, but, rather,  the last. We should let the committees do their work and not prejudge  the outcomes or make baseless accusations and presumptions.\n\nMrs. HOUCHIN.  Foxx),…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…overall operations of the House. These  employees, whose work is often performed behind the scenes, have a  diverse range of responsibilities and skills. They support the  legislative process, ensure the security of this great institution,  maintain our technology and service infrastructure, and contribute to a  more efficient and productive House. The outstanding…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…pipeline safety reauthorizations, just to name a few of the things that  are out there.\n\nIt takes hard work, skill, extensive knowledge, and a deep  understanding of the legislative process to get these things across the  finish line, and Jack has all of those qualities.\n\nIt also takes sacrifice, and Jack, his wife, Paige, and their two  boys, Joel and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…affirm our mutual understanding that your Committee will       continue to be consulted and appropriately involved as this       legislation advances through the legislative process,       particularly with respect to provisions falling within the       jurisdiction of the Committee on Armed Services.\n\nAs requested, I will ensure that a copy of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…investments of more than  $1 million for the watershed restoration project, and I was pleased to  join the effort by securing $2.9 million in Federal funds. During the  legislative process, many students at Whiting Village School wrote  letters supporting the Mill Pond Dam project. When I discussed this  funding with my Senate colleagues, those letters…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…short, especially in comparison to an actual bureaucratic  process, which it is not. Make no mistake, this is not a bureau; this  is not bureaucratic process; this is a legislative process. It is a  legislative process that has endured for hundreds of years in this  country, and it may not be perfect, but it is the best one we have got.  It existed for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…to consider  legislation that preserves equal debate, protects the rights of the  minority, and allows Members on both sides of the aisle to fully  participate in the legislative process.\n\nMr. Speaker, this rule allows the House of Representatives to govern  and to deliver on the responsibilities entrusted to us. I urge my  colleagues to vote ``yes''…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…dedicated young minds from throughout the Thumb of  Michigan.\n\nThese young leaders have remained committed to regular meetings,  coming together to immerse themselves in the legislative process on a  non-partisan, academic basis. Throughout their time in the program,  these students have studied legislation, prepared mock bills, and  worked to better understand…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…right about the stablecoins and the need for regulation. That  is why we passed the STABLE Act, but my Democratic colleagues are right  this time to recognize that the legislative process is broken and,  frankly, we all know that. Everyone in the House does.\n\nWe have seen it broken on lots of things, but here, today, we have  got a defective product that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…our office with exceptional commitment this past year.\n\nVeena was selected amongst a highly competitive group of peers to  come to Washington to better understand the legislative process and to  improve STEM education in the United States.\n\nFor 1 year, she has not only stepped away from the classroom and her  beloved students, but, as a devoted wife…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697562/recognizing-albert-einstein-distinguished-educator-fellow-veena-black"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…before us tonight, they ran hours and hours, if not  days on end.\n\nWhy did those markups run as long as they did? They ran that long  because Democrats engaged in the legislative process, which is their  right.\n\nThe same principle applies to the Rules Committee. On this committee  we have a long tradition of meeting late into the evening to complete…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…these business leaders are the reason why the Pikes Peak region is  becoming one of the economic titans of the West.\n\nRelationships are the most important part of the legislative process,  and I look forward to continuing to work together with these and every  business leader in the Fifth Congressional District to continue to grow  our thriving community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695829/2025-colorado-springs-chamber-of-commerce-dc-fly-in"}]