[{"senator": "André Carson", "party": "Democrat", "sentence": "…incentive directly supports gun owners who take steps to  store their firearms safely--an action proven to reduce the risk of  accidents, suicides, and theft.\n\nSecond, the legislation directs the Department of Justice to develop  and promote voluntary best practices for secure firearm storage, making  this information readily accessible to the public both…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…side who have said the word ``Medicaid''  technically doesn't exist in the bill, therefore, these cuts don't  exist. Give me a break.\n\nThe instruction in this piece of legislation directs the Energy and  Commerce Committee to identify at least $880 billion of cuts in those  programs where they have jurisdiction.\n\nGuess what. Mr. Speaker, 93 percent of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…our  Committee's bipartisan work.\n\nH.R. 1325 is a no-nonsense, good government bill that amends existing  statute to conform with updated regulatory guidelines. This legislation  also directs reporting to Congress on commercial remote sensing  licensing, which is carried out under statutory authority granted to  the Department of Commerce. H.R. 1325 provides…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688997/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…innovation of satellite technology for precision agriculture, which  uses satellite images to help farmers yield better crops and maximize  their yield profitability.\n\nThe legislation directs the FCC to review its satellite service rules  to assess whether there are any rule changes that could better enable  satellites to deliver precision agriculture solutions.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…time as I may consume.\n\nMadam Speaker, I rise to speak on H.R. 5616, the $2.50 for America's  250th Act, sponsored by the gentleman from Alabama (Mr. Aderholt).\n\nThis legislation directs the Treasury Secretary to mint and issue a  $2.50 collectible coin to celebrate the 250th anniversary of the  signing of the Declaration of Independence later this year.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…important  and useful to the courts such as when the Trump administration tramples  upon Congress' constitutional powers by ignoring the will of Congress  as expressed by legislation that directs that a certain thing be done.\n\nWhen Congress passes legislation and that legislation is signed into  law, then whoever is President is charged with the responsibility…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "John James", "party": "Republican", "sentence": "…prosperity.  Boosting domestic mineral production means boosting Michigan's  economy, supporting miners, engineers, small businesses, and families  across our State.\n\nMy legislation directs the Department of Energy to conduct ongoing  assessments of supply chain vulnerabilities, develop strategies to  strengthen domestic production, and invest in innovative…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the bill now under  consideration.\n\nMr. Speaker, I rise today in strong support of H.R. 3187, led by my  friend and colleague from Arkansas, Representative Hill.\n\nThis legislation directs the Secretary of Agriculture to convey a  vacant Forest Service building and less than 1 acre of surrounding land  in Perryville, Arkansas, to Perry County.\n\nThis property…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…as I may consume.\n\nMr. Chairman, I rise in support of H.R. 3638, the Electric Supply  Chain Act, sponsored by my colleague, the gentleman from Ohio (Mr.  Latta).\n\nThis legislation directs the Department of Energy to conduct ongoing  assessments and report to Congress on the components and infrastructure  supply chain needed to secure the reliability and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Government Services Administration, the GSA, to work with Federal  tenants to develop a criteria that facilitates the expanded use of  space sharing or collocating.\n\nThis legislation also directs the GSA Administrator to establish  measurable objectives to quantify the success of the shared-space  framework.\n\nThe SPACE Act achieves this by building upon the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…led by the gentlewoman from  Tennessee (Mrs. Harshbarger), my good friend and a great member of the  Committee on Energy and Commerce.\n\nMadam Speaker, this bipartisan legislation directs the National  Travel and Tourism Office to promote domestic and international tourism  to U.S. music festivals, concert venues, and other music-related  attractions.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…out this Act.\n\nMr. Speaker, I rise today in strong support of H.R. 2480, the  Securing Semiconductor Supply Chains Act of 2025, led by Representative  Landsman.\n\nThis legislation directs the Department of Commerce's SelectUSA  program to coordinate with State-level economic development  organizations to increase foreign direct investment in semiconductor-…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…well, strengthening American  entrepreneurship and competing with the Chinese Communist Party across  every dimension of the AI race, including business innovation.\n\nThis legislation directs the National Institute of Standards and  Technology, or NIST, to develop and share practical resources to help  small businesses better understand and adopt artificial…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…accurate information can support  safer, more effective decisionmaking and better coordination among  Federal, State, and local agencies during wildfire events.\n\nThis legislation directs NASA to leverage its unique research and  development expertise in aeronautics, airspace systems, and advanced  technologies to further the objectives of the ACERO project…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…retractable awning can serve as a valuable source of shade and a  gathering spot for families and friends. However, they can pose a  significant risk to consumers.\n\nThis legislation directs the Consumer Product Safety Commission to  establish safety standards for fixed and freestanding awnings typically  installed in homes.\n\nMy Energy and Commerce Committee…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Specifically, the CASE Act codifies the judiciary's current courtroom  sharing policies for magistrate, senior, and bankruptcy judges.\n\nFor large courthouses, the legislation also directs there can only be  two courtrooms for every three district court judges.\n\nThe Committee on Transportation and Infrastructure, on a bipartisan  basis, has conducted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…today in support of H.R. 1664, the Deploying  American Blockchains Act of 2025, championed by my good friend and  fellow Florida Gator, Representative Cammack.\n\nThis legislation directs the Secretary of Commerce to take the  necessary actions to promote the competitiveness of the United States  in the development and application of blockchain technology.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…lack the technical know-how or  financial resources to adopt AI, which is putting them at a growing  disadvantage.\n\nThat is why I introduced H.R. 3679. This bipartisan legislation  directs the National Institute of Standards and Technology to develop  resources to voluntarily educate small businesses on best practices  when integrating AI into their businesses.…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700126/small-business-artificial-intelligence-advancement-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…resilient.\n\nAs their roles have grown, Congress has not always had insight into  the exact responsibility and tasks the river basin commissions are  undertaking.\n\nMy legislation directs the Government Accountability Office to  conduct a study and compile recommendations for the Mid-Atlantic river  basin commissions to ensure they have proper ethics…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…consultation with the Department of Agriculture, to identify priority  mining projects on Federal lands that can be immediately approved and  expedited for completion.\n\nThis legislation directs the Secretaries of the Interior and  Agriculture to identify all Federal lands in their broad jurisdictions  that may be suitable for hardrock mineral exploration, development,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…U.S.C. 2056 and       2058).\n\nMr. Speaker, I rise today in support of H.R. 1767, the Awning Safety  Act of 2025, led by my good friend, Representative Balderson.\n\nThis legislation directs the Consumer Product Safety Commission to  establish a consumer product safety standard for retractable awnings to  help prevent serious injuries and deaths.\n\nMotorized…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}]