[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…far-flung places in the  world.\n\nIn fact, post-World War II, the war powers have been utilized by an  increasingly strong Executive and an increasingly deferential and  fearful legislature.\n\nNow, during the last several weeks, it has been apparent to anyone  watching that the conflict in the Middle East had the potential to draw  in the United States of America--when…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Colorado State  Representative Shannon Bird for her public service.\n\nThroughout her time in the legislature, Representative Bird has  worked tirelessly to fight for all individuals. She served on the Joint  Budget Committee for 6 years, serving as vice chair and later  chairwoman,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…feed our families but how we pay for our  health insurance because we purchase under the marketplace.\n\nWhy is it so important that people are insured? I was in the Virginia  Legislature when we expanded Medicaid under the Affordable Care Act.  The reason we did it is because we had rural hospitals that were about  to close. We had so many people who were…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the locally  elected District of Columbia Government and impose a new law on D.C.\n\nMr. Speaker, I include in the Record a letter from every member of  D.C.'s local elected legislature, the council, opposing this bill.                            Council of the District of Columbia,                                       Washington, DC, June 9, 2025.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…letters, including a  letter from D.C.'s locally elected Chief Executive, Mayor Muriel  Bowser, opposing this bill; a letter from every Member of D.C.'s  locally elected legislature, the Council, opposing this bill; and a  letter from D.C.'s locally elected attorney general, Brian Schwalb,  opposing this bill.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…servicemembers, the indomitable  spirit you have of solidarity with them, and then the credibility you  bring to this discussion about the importance of the role of the  legislature to make the decisions about whether you and your fellow  citizens, the folks who made the decision to step forward and serve our  country--whether we, as elected representatives,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…issue as       soon as next year, when the current provider tax agreement       between the state and hospitals expires. In advance of a new       agreement, approved by the legislature this year and slated       to take effect in July 2026, Connecticut will have to reapply       for a federal waiver to tax the hospitals above the safe       harbor limit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the branches.\n\nJames Madison warned:\n\nThe executive is the branch most prone to war; therefore       the Constitution has, with studied care, vested that power in       the legislature.\n\nThe War Powers Resolution exists for moments like this. It ensures  that before we send American forces into hostilities, the people's  representatives have debated and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…will get the profits if  these firms succeed?\n\nResidents across our region complain State and local approvals are  moving too quickly. In Ohio, the crooked PUCO and Ohio's Legislature  have granted giant tax breaks to data centers, while local township  officials remain in the dark about details. That is not fair.\n\nOhioans know what secrecy and inside…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…are Black and Brown,  are capable and worthy of local self-government.\n\nMr. Speaker, I include in the Record two letters, one from every  Member of D.C.'s locally elected legislature, the Council; and one from  D.C.'s locally elected Attorney General, Brian Schwalb, opposing this  bill.                            Council of the District of Columbia,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the branch of       power most interested in war, and most prone to it. [Our       Constitution] has accordingly with studied care, vested the       question of war in the Legislature.\n\nOther countries don't do this, but the Framers of our Constitution in  1787 decided we are going to be different. Before we send troops into  harm's way where they could…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…majority Hispanic       district. Additionally, TX-33 is another racially-based       coalition district that resulted from a federal court order       years ago, yet the Texas Legislature drew TX-33 on the same       lines in the 2021 redistricting. Therefore, TX-33 remains as       a coalition district.\n\nAlthough the State's interest when configuring these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…saw impacting her students' lives. She began working as a  legislative assistant for Louisiana State Representative Aimee  Freedman. During her time working in the State Legislature, she worked  on many issues impacting everyday Louisianans. One of her key  accomplishments was helping shepherd  Representative Freedman's bill to eliminate the ``pink…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Executive is the branch of       power most interested in war, and most prone to it. It has       accordingly, with studied care, vested the question of war in       the Legislature.\n\nThat is our Constitution--vested in the legislature because issues of  war and peace should never be entrusted to one person. It is too  tempting. That is why our Founders…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…consistency, and a lapse in their       education and care would result in regression, trauma, and       worse. I teach students in New Jersey who are supported by       your legislature. I teach all abilities, meaning many of the       students live with ADHD, autism, and other disorders that       require extra care and attention. It is my life's mission…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…service, Lieutenant Governor Carroll brought  her leadership and unwavering service to the people of Florida. She was  the first Black Republican female to serve in the Florida Legislature.\n\nThen, Mr. Speaker, in 2010, she made history again by becoming the  first Black woman ever in the Sunshine State to be elected statewide as  Lieutenant Governor.\n\nHer…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…serves students in  partnership with their families.\n\nThe annual program is sponsored by the Iowa Department of Education,  and it is funded by an appropriation of the Iowa Legislature.\n\nNow that she is 2026 ``Teacher of the Year,'' Stephanie will serve as  an ambassador to schools, an ambassador to higher education, and an  ambassador to various communities…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and a dedicated community  volunteer. He served as the President of Oak Cliff Junior Chamber of  Commerce and was a member of Rotary International, the Texas Silver- Haired Legislature, the Reserve Officers Association, Veterans of  Foreign Wars, and the American Legion. Ralph also assisted with  Salvation Army and Red Cross drives to support those in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…our Members to weigh in on  these very important questions. This runs contrary to everything I have  ever believed when it comes to states of emergency.\n\nWhen I was in the legislature in California, and even in the early  days of COVID, I was very much opposed to the legislature having no  role in determining whether we were in a state of emergency. I…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…to incite hatred and violence  against them. Fringe academic ideas about defunding police and  shuttering prisons have moved from the classroom, to the courtroom, to  the legislature, and then to codified laws. Riots. Lawsuits. Slashed  budgets. Malicious lies blared through the largest megaphones in our  country.\n\nTime and time again, the system has…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…powered the  sawmills, the town was renamed Whiting upon its incorporation in 1825  after Timothy Whiting, an early settler and the town's first  representative to the Maine Legislature.\n\nToday, Whiting is a nature lover's paradise of gorgeous scenery and  year-round outdoor recreation. The beautifully maintained Union Meeting  House, built nearly two centuries…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…resulting  shortfall of some $6 billion, Governor Newsom has just taken out an  emergency loan from the general fund in order to cover payments. On top  of that, he has asked the legislature to appropriate even more money,  billions more.\n\nThink about what this means over, let's say, the next 10 years. If  the cost has grown from a few billion dollars to $9.5…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of the people would not be threatened by one-person rule. The  Founders would not be surprised that the Executive would attempt to  aggrandize power at the expense of the legislature. They would have  expected it. Indeed, they did expect it. But they would be surprised-- the Founders would be shocked that Congress would voluntarily and  recklessly and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…basketball championship.  This came on top of a remarkable 24-2 season.\n\nAs a Kansas State senator at the time, I had the privilege of  sponsoring a resolution in our State legislature to commend the team's  win and to host the team at the Kansas State House to see the  resolution's unanimous adoption.\n\nA week ago, on the 20th anniversary, the community…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699133/congratulating-2006-iola-fillies-on-don-bain-hall-of-fame-induction"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…makes that point very clearly.\n\nFor the last 6 or so years, Californians have been paying an extra  fee on their phone service. This was due to legislation enacted by the  legislature and signed into law by the Governor. All of these fees were  collected for the purpose of creating a next-generation 911 system,  which, honestly, is something we need.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and  to seize its powers for himself. He initially proposed simply ignoring  the commission, ignoring the constitution, and overriding his maps with  those that he and the legislature drew. Yet, apparently, someone told  him that that would get immediately struck down in court.\n\nWhat they are now plotting is a special election where they will use  confusing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…Doug LaMalfa.\n\nDoug was a steadfast champion of rural California and for the issues  that matter most to millions of Americans across the West, starting in  the California legislature to the Halls of Congress.\n\nHe fought for water storage and forest management. He fought for  energy abundance. He fought for the farmer. He fought for common sense.\n\nI had…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698728/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, we are heading into what many people hope  is the finishing stretch of our legislature, putting through what  Donald Trump calls the big, beautiful bill.\n\nThere are a lot of issues yet to be decided, and I would like to  address some of those issues today.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…ensure the safety of my family and me in the hours  following the attack.\n\nI had the honor of serving with Speaker Emerita Hortman for 4 years  during my time in the Minnesota Legislature. I will forever cherish the  conversations and friendship that I had with her then and throughout  the 20 years since.\n\nWhen I look at my time serving alongside her, Melissa…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…emissions more than any other  country since 2005. That is important.\n\nMr. WEBER of Texas. Mr. Speaker, this is amazing to me, quite  frankly. I served 4 years in the Texas legislature, and we were busy  with catalytic scrubbers on all the industry that we had  making sure that Texans had clean energy. We care about the  environment. We care about people's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}]