[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Managers Association (BOMA)       International to express our strong support for the Setting       Consumer Standards for Lithium-Ion Batteries Act, this       critical legislation will help protect the public from the       rising number of fires, injuries, and tragic deaths caused by       faulty lithium-ion batteries used in e-bikes, e-scooters, and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…of community- driven policing and helps to make sure that people feel safe and secure  in their communities.\n\nI thank Congressman Roy for his leadership on this legislation, which  will help eliminate duplicative laws and allow us to better serve and  focus on the true threats to public safety, which are always a top  priority of mine.\n\nI urge all of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…going to bless, if you  will, condone, a CR that continues what happened, when my Republican  colleagues did what they thought was right, I assumed, and passed the  legislation without the help of Democrats?\n\nIf you can pass the initial legislation without the help of  Democrats, Mr. Speaker, then why do you want me to join in your CR?\n\nPass this without…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong support of this bipartisan legislation,  which will help ensure that Americans have access to bankruptcy relief  when financial disaster strikes and they need it.\n\nThe legislation would increase compensation for chapter…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…this legislation, the Mikaela Naylon Give  Kids a Chance Act, sponsored by Representatives Dingell and McCaul.\n\nThis bill includes several strong, bipartisan pieces of legislation  to help expand access to care for patients with rare diseases and  complex medical needs. It increases research and development into rare  pediatric diseases, improves regulatory…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…forward along  with my colleague from California (Ms. Simon).\n\nMr. Speaker, I rise today in strong support of the Assisting Small  Businesses Not Fraudsters Act, legislation that will help ensure that  small businesses who need and deserve support get it, while cutting out  fraudsters seeking to exploit vital relief programs.\n\nSmall businesses are the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687933/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…``yes''  on this bill.\n\nMr. Speaker, I urge all Members to support H.R. 3352, the Helping  Angels Lead Our Startups Act, or HALOS Act, sponsored by Mr. Lawler.\n\nThis legislation will help startups have easier access to the funding  they need to get off the ground while addressing the issues of certain  bad actors taking advantage of susceptible investors.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…of their  net worth.\n\nThis legislation creates a new path for capital to reach more hands.  In my State, the Delaware Black Chamber of Commerce has told me that  the legislation would help close the capital gap for diverse  businessowners. Small business leaders say that it is not lack of ideas  but a lack of capital that holds them back.\n\nThis bill opens…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…legislation is needed to permit the memorial to be located  near the existing World War II Memorial. They are part of that whole  story.\n\nI am proud to lead this bipartisan legislation and help complete the  story of World War II in our Nation's front yard.\n\nMr. Speaker, I urge my colleagues to support the World War II Women's  Memorial Location Act, which…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Ukraine's fight. This is a battle  between democracy and tyranny, between freedom and oppression.\n\nThat is why this body has come together on numerous occasions to pass  legislation to help the people of Ukraine resist the Russian invasion  and defend their homeland. We continue to do this because we know that  if Russia succeeds, it sets a dangerous precedent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…costs, more jobs, and a better quality of life for Oregonians and  that I will work with anyone to get that done. I am pursuing all of  that by co-leading bipartisan legislation to help rural small  businesses, by advocating for funding for my district, and by actually  listening to my constituents. It is time for others to do the same.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688086/it-is-time-to-lower-costs"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…the best possible care for  patients. I believe it is incumbent upon us as lawmakers to take the  same approach with policymaking, especially when it comes to crafting  legislation to help care for our veterans.\n\nThe information provided under this report will help us to better  understand the most serious threats facing our veterans, whether it be  suicide,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…given that our Nation's  communication networks are an integral component of nearly every facet  of American life, which also makes them prime targets for attack.\n\nThis legislation will help us better protect American families and  our country from bad actors who want to carry out malicious attacks.\n\nMr. Speaker, I thank Representatives Kelly and Latta…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…text of the legislation or inquire about  the bill's impact on the program and consumers as is our typical  practice for legislative hearings.\n\nStill, I believe this legislation will help address critical gaps in  the vetting of high-cost recipients and will curb waste, fraud, and  abuse in the program, so I urge our colleagues to support H.R. 2399.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690154/rural-broadband-protection-act-of-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…this  happen. By expediting the resources necessary to advance this  reliability, increase the reliability, and increase the resiliency in  the grid, we know that this legislation will help achieve that.\n\nWe know that this will help us unleash American energy production in  vast, new, improved ways. Again, modernize the grid and increase  reliability.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in trying to  explain it is there is so much in there that it is really hard to break  it down into digestible pieces that folks can understand.\n\nThe truth is, this legislation will help Americans keep more of what  they earn by lowering taxes across the board, and not a single Senate  Democrat voted for it. Essentially, by voting against it, they voted…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…DUNN of Florida. Mr. Chair, I rise today in support of H.R. 2483,  the SUPPORT for Patients and Communities Reauthorization Act.\n\nThis bill is a critical piece of legislation that will help bolster  prevention, treatment, and recovery for millions of Americans suffering  from substance abuse disorders.\n\nThanks to the investments from the original SUPPORT…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the failures of the last 4 years, to help working  families and to get our economy moving, to make our country stronger  and more secure. Last week, we delivered legislation that will help  fulfill those promises. That starts with permanent tax relief for hard- working Americans.\n\nBack in 2017, during the first Trump administration, Republicans  passed…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…to struggle  this much, and I am standing here today ready to do something about it.\n\nHouse Republicans have listened to hurting families, and we are  bringing forward legislation to help them get ahead. The Affordable  HOMES Act will cut through unnecessary and complicated red tape that  has been driving up the cost of manufactured housing for far too…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…the State Planning for Reliability and  Affordability Act, to help drive down the cost of energy for Coloradans  and Americans.\n\nThis is a straightforward piece of legislation that will help  counteract shortsighted energy policies that States like Colorado have  implemented for far too long to the detriment of my constituents and  their wallets.\n\nThis…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…leadership on this bipartisan legislation.\n\nMr. Speaker, I urge support for this legislation, and I reserve the  balance of my time.\n\nMr. Speaker, in closing, this legislation will help improve the  Federal Government's use of shared space and save taxpayer dollars. By  building on the success of the last Congress, we can continue to  implement policies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695013/shared-property-agency-collaboration-and-engagement-act-of-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…construction on this project has  barely started, largely due to cost increases that have outpaced the  community's ability to pay.\n\nIn 2009, Congress amended the original legislation to help address  the project's increasing price tag. Unfortunately, rising construction  costs over the past few years have continued to delay this critical  water project.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…deadline rules so taxpayers receive equal treatment  whether they file electronically or through the mail.\n\nMr. Speaker, I urge my colleagues to support this commonsense  legislation to help level the playing field for American taxpayers, and  I yield back the balance of my time.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689373/electronic-filing-and-payment-fairness-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…CLINE.  3424.\n\nMr. Speaker, I rise in support of S. 3424, the Bankruptcy  Administration Improvement Act of 2025.\n\nThe bill before us today is an important piece of legislation that  will help ensure the bankruptcy system continues to function  efficiently and without taxpayer funding.\n\nCongress designed the bankruptcy system to be funded through the fees…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Eagle River Water and Sanitation District and the Upper Eagle Regional  Water Authority, to maintain this vital infrastructure near Bolts Lake.\n\nThis is commonsense legislation that will help local Coloradans and  improve the operational efficiency of this important water  infrastructure.\n\nMr. Speaker, I urge my colleagues to support the legislation, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…than 100 rural  hospitals have closed over the past two decades, and doctors can be few  and far between in rural areas.\n\nBut thanks to the working families tax cut legislation, however, help  is on the way. Republicans' legislation created a $50 billion Rural  Health Transformation Program to address the rural healthcare crisis.  Instead of a top-down,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Board on Geographic Names to rename the Gulf of Mexico as the Gulf  of America. President Trump signed this executive order on his first  day in office.\n\nEnacting this legislation will help make President Trump's historic  action permanent and ensure consistency in references to laws, maps,  regulations, and records of the United States.\n\nThe Gulf of America…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…disasters.\n\nIf a State moves faster in declaring an emergency, the Treasury  Department can more quickly respond when it comes to an individual's  tax obligations. This legislation will help disaster victims receive  desperately needed tax relief sooner rather than later.\n\nAdditionally, this legislation doubles the current mandatory tax  filing extension…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…encourage my colleagues to give it an equally strong  bipartisan vote here in the House.\n\nMr. SMITH of Missouri.  Malliotakis), the sponsor  of this legislation.\n\nThis legislation will not only help taxpayers who have been victims  of fraud, but it will also help combat fraud by eliminating  opportunities for criminals to strike a second time.\n\nCheck fraud…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}]