[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…This year marks the 16th anniversary of Proclamation 8399, a  proclamation to establish National Korean War Veterans Armistice Day.\n\nI am proud to have introduced legislation in this Congress to help  reunify families who remain divided from the war. I look forward to  continuing to work to support our veterans.\n\nI thank the Korean American Grassroots…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…check the President's power. The problems  the act was designed to address are no longer commensurate with the  dangers it is now creating.\n\nI reintroduced this legislation for this Congress, and I thank my  colleagues for supporting this effort.\n\nThe President's actions over the last 8 months demonstrate the need  for this urgent reform and increased…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…includes a bunch of exemptions to allow other kids  to receive the exact same medical care.\n\nI call on my colleagues to vote ``no'' on this truly reprehensible  piece of legislation. Congress should not be making medical decisions  for your kids.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to committee. If…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698348/protect-childrens-innocence-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Donald Trump and his friends.\n\nMr. Speaker, there is something that Ranking Member Garcia brought up  that I think is really important. This is the tenth piece of  legislation this Congress that the Republicans have brought forth  focused on the District of Columbia, focused on D.C.\n\nIf we polled every Republican district, polled my colleagues'  districts…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…this one, America often headed to war  for oil interests. Our soldiers fought unending battles in godforsaken  places anchored to dirty crude. We even had to pass legislation here in  Congress that began in my district to create the toxic exposure fund,  the Sergeant First Class Heath Robinson Honoring our Promise to Address  Comprehensive Toxics Act,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…depicted did not consent to the content.\n\nI am proud to have collaborated with survivor advocates on this bill.  Their lived experience and leadership have shaped this legislation.  Congress needs to act. It is past time to give victims of  nonconsensual, sexually explicit deepfakes the tools they need to fight  back.\n\nI am going to make a unanimous consent…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…than the Trump administration.  Donald Trump and Republicans are putting our elections in a vice grip-- Executive orders from the President on one end and dangerous  legislation from Congress on the other. They don't understand the  sacredness of elections and keeping them fair. The kind of legislation,  the kind of Executive orders which are so jaundiced,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, let's take a step back and be clear on  what is going on here.\n\nThis administration maybe didn't have the votes or will to get  legislation through Congress, so it created these executive orders and  broke the law in doing so. Some of these orders are unconstitutional,  and that is why there have been so many injunctions…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689723/no-rogue-rulings-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the U.S. Virgin Islands and the United  States, including an assessment of the lifespan and security of  telecommunications infrastructure linking the two.\n\nThis legislation will provide Congress with vital information on the  strength and resiliency of communications infrastructure in the U.S.  Virgin Islands. It will also help us determine whether American…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…owning, buying or otherwise trafficking in stablecoins.       Americans must be assured that policy won't be fashioned by       those profiting from the shape of the legislation.\n\nFurther, Congress should approve an amendment that restates       conflict laws that already apply to the president. Namely, he       may not solicit gifts; he may not accept gifts…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…introduce the District of Columbia  Electronic Transmittal of Legislation Act, which would permit the Chair  of the Council of the District of Columbia to transmit legislation to  Congress in the form of the Chair's choosing, including electronic  form. This bill would bring the congressional review process for  legislation enacted by D.C. into the electronic…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689607/introduction-of-the-district-of-columbia-electronic-transmittal-of-legislation-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…represent is  called Libbey Glass. Toledo, Ohio, is the glass center of the world.  The administration took away over $40 million that was going to help  them. This is legislation Congress passed, and the administration  signed the bill. It was vetted by the agencies and so forth. It helped  them save energy so that they could compete with glass against…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…expands the 199A business tax deduction, which will help  incentivize investment across the country and spur economic growth. Our  bill is the most proworker, profamily legislation Congress has seen in  a generation.\n\nThe one big, beautiful bill will secure the border once and for all  and make America safe again. The border was the number one issue on…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…explore the best possible solutions for our law  enforcement officers.\n\nI would like to mention that 146 of my colleagues across the aisle  voted in favor of this legislation last Congress. It is incredibly  bipartisan.\n\nLet's all work together to stand against attacks on law enforcement  and support our men and women in blue.\n\nMr. MOORE of North Carolina.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…cuts we have ever  seen in this country's history. Yet, I would argue, with all respect,  that, arguably, the most important and most transformational pieces of  legislation in this Congress are these bills that we are talking about  here today, the GENIUS Act and the CLARITY Act.\n\nIt is paramount that we send this historic piece of legislation, the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, I rise today in strong support of H.R. 5788, the 504  Program Risk Oversight Act introduced by Representatives Tran and  Patronis.\n\nThis bipartisan piece of legislation would give Congress greater  accountability and oversight of the SBA's 504 Loan Program by requiring  the SBA to provide Congress and the public with annual, data-driven  risk assessments…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…adding jobs, discourage companies  from staying here, and indeed, has made more people leave this State  than any other for several consecutive years.\n\nI am working on legislation in Congress inasmuch as we can use the  levers we have here at the Federal level to try to bring some sanity  back to the economic policy environment in California because there…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…from Texas (Mr. Jackson), and the gentlewoman  from California (Ms. Jacobs) for introducing this important  legislation. The Foreign Affairs Committee marked up this legislation  last Congress, and it passed the committee and the House floor with  strong bipartisan support. I expect it will receive the same support  today.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…simple review of the Federal Reserve Act shows that  the Federal Reserve does not have the legal authority to issue a CBDC  to individuals absent explicit authorizing legislation from Congress.  The Supreme Court has also recognized Congress' power to coin money and  regulate the value thereof, implicitly denying to the executive branch  or to the Fed the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…costly, unnecessary licenses. This will reduce  wasteful spending and improve government efficiency.\n\nMr. Speaker, I thank Ms. Brown for bringing this important  legislation back to this Congress. I also thank Mr. Fallon and Ms. Mace  for their early and continued support of this bill.\n\nI encourage my colleagues to support this bill, and I reserve the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…But we have lost so many of these things and so much of this. It is  Congress's fault for giving it. Over the last 70 years, there are  probably a dozen pieces of legislation where Congress said to the  President: Here, take this power. Create emergencies. Put on tariffs.  Negotiate for us because we are too feeble-minded to do it ourselves.\n\nBut the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…commonsense step forward by  protecting consumers and small businesses alike from these costs. The  Small Business Regulatory Reduction Act is exactly the type of  legislation that this Congress was elected to enact. It ensures that  any regulatory change from the SBA does not increase compliance costs  for small businesses and, in turn, consumers. Regulations…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…the last days before the election, the Biden  administration was doing everything they could to accomplish what we  are doing here today. In fact, there was even legislation in the last  Congress authored by Democrats to do it.\n\nThis is not a partisan issue. It may be a timely issue for this  President, but that does not make it partisan. To do the right…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…have caused costs to go up inordinately. This, by the way,  doesn't even factor in that we have two refineries that are about to  close. Fortunately, we just passed legislation here in Congress to  partially address this issue of the refineries. There is one study from  USC that says that by the end of next year, Californians could pay $8  for gas.\n\nElectricity:…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]