[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…point  out that there actually are a lot of legitimate CRA, Congressional  Review Act, targets out there--many dozens of decisions that have been  made in this Congress that lend themselves to a proper use of the  Congressional Review Act.\n\nAnd, guess what, it takes 30 signatures to bring one of those up. The  minority can do that.\n\nSo if the majority…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…``necessary to protect  another person'' from ``serious bodily injury''; and not likely to  cause injury to others; and ``all other options have been exhausted or  do not reasonably lend themselves to the circumstances.'' That is  actually what the law says.\n\nI just wanted to note that. I am not sure what those 14 criteria are.\n\nNorton).\n\nI strongly oppose this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…opportunity to explain why institutional  knowledge can make a difference.\n\nBecause the Honorable Maxine Waters was present in 2008 and saw what  occurred when banks were afraid to lend to each other, she was able to  give the necessary input when we had the Silicon Valley and Signature  Bank failures. She was able to give the necessary input to prevent a…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…million students in their elementary to postsecondary  education across the country. Mrs. McMahon has no experience teaching  or working in a school. Her experience does not lend her the tools the  Secretary of Education needs to address the complex needs of our  Nation's students, who are struggling with rising mental health issues.\n\nI do not have confidence…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…conversation, thoughtful gestures, and the occasional treat for his  furry friends along the route.\n\nTo his fellow letter carriers, Jay was well known for his willingness  to lend a hand, often helping others with their routes after he  finished his own. As one of those colleagues summed it up: ``He made  everyone feel like you were the most important…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697602/jay-p-larson-post-office-building"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…businesses, cause havoc to rural  communities, cause havoc to the idea of what it means to be an  American: that we take care of our own, that we stand up for each  other, that we lend a hand, that we lift folks up. And here it is, this  voice of bipartisan sensibility that says: Hey, hold a hearing. We will  come. Put some of us on a commission.\n\nThis is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…formation and get that capital to small- and medium- sized businesses. I want to point out that, as we have had tighter and  tighter bank regulations, banks have been reluctant to lend money to  small businesses except where their risks are guaranteed by the Small  Business Administration. SBA loans are, of course, limited.\n\nWe need BDCs to provide investment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…roles at the Office of Management and Budget, the Department  of Defense, the American Embassy in Thailand, and the National War  College. Even after retirement, he continued to lend his expertise as a  consultant to the Federal Government.\n\nLocally, John was active in civic life for many years, giving his  time and energy to local Democratic politics and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Learning follows students home, and so should internet access for  everybody--everybody.\n\nThe Federal Communications Commission's decision to allow schools and  libraries to lend Wi-Fi hotspots was not a radical idea; it was a  responsible idea. It recognized that in the 21st century, a student's  ability to succeed should not depend on whether their…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…ranking member of the  Committee on Financial Services.\n\nMr. McGOVERN. Mr. Speaker, if I could inquire of the gentlewoman, if  she doesn't have many speakers, maybe she can lend us some time. We  have a ton.\n\nMr. McGOVERN. Mr. Speaker, I say that because here in Congress, we  measure how much people really believe in their position by whether  they…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…though, is that many  homeowners of modest means could never get a shovel in the ground  because they couldn't get financing.\n\nWe talked to the banks and the banks said they would lend if  homeowners could get FHA insurance, or if Fannie or Freddie would  backstop the loans.\n\nToday, along with my Republican colleague  Andrew Garbarino, I have  introduced a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693705/america-faces-a-housing-crisis"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…a crucial step forward in protecting our natural  resources and enhancing our capacity to respond swiftly to the threats  posed by invasive species.\n\nI urge my colleagues to lend their support to our Invasive Species  Response Act. Together, we can ensure the preservation of our  ecosystems and promote a resilient future for our environment.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…and for a cure. I am so moved by  her strength and resilience.\n\nIn honor of Rachel's family and the tens of thousands of others who  face Huntington's Disease, I am proud to lend my voice to this cause.  May this month serve not only as a time of remembrance and education,  but also a call to action. I ask my colleagues to do everything we can  to help…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Federal Government receives a fiscal benefit for  otherwise undeveloped lands.\n\nMy neighbors in La Paz County need a hand up, and I hope that I can  count on my colleagues to lend a helping hand.\n\nMr. Speaker, I once again ask my friends to support this legislation,  H.R. 1043, and our Nation's domestic energy dominance, and I reserve  the balance of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…the moral  universe is long, but it bends toward justice.''\n\nThat arc bends when brave people stand up. It bends when people  refuse to be silenced. It bends when free nations lend their voices to  those who have been denied one.\n\nMr. Speaker, that is what we are witnessing in Iran today: a movement  not controlled by foreign powers, not directed by political…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…bank exams and outdated  thresholds so well-run banks can focus on lending, not paperwork;  expanding community and rural banks' access to stable deposits so that  they can lend locally and support small businesses and households;  supporting rural banks; encouraging new bank formation; and providing  regulators flexibility to handle failures without…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…know there is a lot of hearsay, a lot of thoughts about where this  could go in the future, but, quite honestly, that is not the way this  bill was drafted. It is not going to lend itself to being used that  way.\n\nMr. Speaker, I do agree with the ranking member that all U.S. States  and territories already criminalize misuse of less-than-lethal devices…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to educate the  students about the struggling Veterans in the community and to teach  about the importance of service to others. This project has also opened  their hearts to lend a helping hand to others in need. The students  look forward to this food drive every year and have such pride in  participating. The students also speak around the town to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691946/recognizing-steven-walker"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…country.\n\nBorn and raised in Texarkana, Steve has spent his life building up  others and strengthening his community. From a very young age, he has  always been the first to lend a hand to anyone in need--and often to  those who never even had to ask. Steve has also built a loving, faith- filled family with his wife, their three children, and grandchildren.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "French Hill", "party": "Republican", "sentence": "…funding. It  streamlines the exam process that is tailored particularly for our  vital community banks. It helps promote more community banks to do what  they do best, which is lend locally and support their communities.\n\nI think it is important, Mr. Speaker, that on this House floor all of  us know that without our community banks and without vigorous…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…counties in desperate  need.\n\nThis spirit of service is what makes Western North Carolina truly  special. It is exemplified by neighbors showing up in times of crisis,  ready to lend a helping hand and stand together during the darkest of  days. The Clay County Sheriff's Office deployed officers and resources  to Haywood, Buncombe, Avery, and Mitchell counties,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…those also on  the scene, the young boy probably would have died.\n\nMay the actions of Mr. Van Orden and the folks who assisted in saving  the young boy inspire all Americans to lend a helping hand to those in  need. You truly never know how far an act of kindness, big or small,  can go.\n\nMr. Speaker, Derrick, Representative Van Orden, is with us here. He…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695712/recognizing-derrick-van-orden"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…boosted community involvement and school  spirit. In addition to her work with the booster program, Shae  volunteers directly with the sports teams. Shae is always there to lend  a hand and mentor other volunteers. Shae's commitment to the school  extends to the staff as well. Recognizing the hard work and dedication  of teachers and administrators,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691987/recognizing-shae-burgess"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…He started it  when he was 18 years old.\n\nOne of the things that always impressed me was how he managed to stay  in contact, to offer to help to push issues forward, and to lend a hand  no matter how big or small the cause.\n\nRecently, I appreciated hearing from him as I had put some  information forward, and he responded immediately on what a good idea…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…councilman for years. From  2000 to 2024, he served as the Mayor of Cameron, stepping in to serve  as Interim City Manager while the city was held without one. Bill does  not simply lend a helping hand, but he truly commits himself to  enforcing change and improvement where it is needed.\n\nAt nearly 77 years old, while raising three children and being a  grandfather…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Brooksville a better place to live. He is an  active member of multiple local groups, always stepping up to help  organize community events, support charitable initiatives, and lend a  hand wherever needed. His volunteerism  has been instrumental in projects that promote economic growth,  cultural enrichment and social well-being in Brooksville. One of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…academically and socially.\n\nBehind the scenes, Mrs. Harvey is valued by her colleagues as she  displays a commitment to teamwork, collaboration, and a continual  willingness to lend a helping hand.\n\nIt is a true honor to represent exemplary teachers like her in  Congress, and I commend Mrs. Samantha Harvey for her tireless devotion  to education and to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]