[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…year in Astoria,  OR, for a multiday celebration to commemorate the magic that is ``The  Goonies.''\n\nOne of the reasons for the enduring success of ``The Goonies'' is the  lessons it has imparted on generations of viewers who come away  inspired to stand up to bullies, accept people who are different from  them, and ``never say die'' when it comes to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…interpreter. A student who just needed a  little bit of speech therapy in order to be a part of the class would  not have that, making it nearly impossible to follow daily lessons or  participate in discussions.\n\nWeakening IDEA would not only cut funding or reduce services, but it  would threaten the future of these students who with just the right…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Sun's $75 million  investment in Trump's World Liberty Financial.\n\nWe do not need to repeat the mistakes of the past with a new risky  financial product. We can integrate the lessons of the past for a  future that spearheads responsible innovation and growth.\n\nRemember the predatory mortgages from the financial crisis? Those  were also sold as innovative…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…through some sort of appeasement. It will not  help. It will not work. Putin will go on to seek other territory and  other land. He is very hungry for that. We must learn the lessons of  Neville Chamberlain in 1938 and 1939, where he thought he was going  somewhere toward peace and, of course, 1 year later, Hitler walked into  Poland.\n\nWith that, Mr. Speaker,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…a future where nuclear weapons are not just tools of  deterrence but urgent threats hanging over every human life.\n\nMr. Speaker, we cannot afford to look away, not when the lessons of  the past are still very visible amongst us. Look to the people of the  Marshall Islands. Many of them are living in my district, part of our  Hawaii ohana, whose lands…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…School, helping students understand the human cost of  war through his firsthand accounts. His honesty and devotion left  lasting impressions on Marblehead students, making the lessons of  history real and deeply felt.\n\nHarry never wanted to be far from Marblehead Rock. He loved the  Marines, his country, his town, and--most of all--his family.\n\nMay Harry's…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690561/harry-christensen-remembered-for-decades-of-public-service"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…realized the only true shield against nuclear  annihilation is not a Golden Dome. It is the hard, unglamorous work of  a verifiable arms control treaty.\n\nWhen we forget the lessons of the past, then we are doomed to make  the same mistakes. Luckily, we still have time, a very short time, to  do the hard work of diplomacy instead of resting the fate of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…narcotrafficking.\n\nThe administration's goals are aspirational at best, and aspirations  are not enough when the stakes involve war and the future of millions  of people.\n\nOne of the first lessons I learned as an Army officer is that hope is  not a plan. Over my career, both in uniform and in the Congress, I have  seen the United States hope that its military interventions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…to do with the geopolitical challenge of our  time, the threat of the Chinese Communist Party. Tell that to anybody,  and you truly live in denial of the world today and the lessons of  history.\n\nThe PRC knows history, and they already have an edition of the  People's Daily, their leading newspaper, already printed up as a gift  for the President's trip…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…remember the past are condemned to repeat it.\n\nI worry that we are dangerously close to repeating this democratic  decline amidst economic disruption. However, heeding the lessons of  history, I believe there is still time to prevent it.\n\nAs we fight against Republican attempts to diminish our democracy,  like the bill on the floor this week, we must…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…State to bear on their own.\n\nAmericans deserve competence and compassion, not political games and  threats to withhold funds when lives are on the table.\n\nWe must remember the lessons of Katrina. Disaster will strike whether  we are ready or not. It is the Federal Government's responsibility to  be ready.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694969/20th-anniversary-of-hurricane-katrina"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…straight basketball district championship.\n\nMr. Speaker, I know that the class of 2025, whether it is in the  basketball gym, class, mock trial, or on stage, will carry their  lessons learned during their time at Patriot High School in whatever  they do next.\n\nI congratulate the class of 2025, and they should not forget to thank  their parents and teachers,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1692005/recognizing-patriot-high-school-class-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…only marvel at the  mountains or coastlines. They come to understand who we are. They come  to confront the complex tapestry of our past: our triumphs, our  failures, and the lessons that bind them together.\n\nThat is why the recent removal of the interpretive materials titled  ``Life Under Slavery,'' ``The Dirty Business of Slavery,'' and signage  addressing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…excellence by providing a rich education at their outdoor campus at the  foot of the Rocky Mountains. The staff at Red Rocks Elementary School  go above and beyond by focusing on lessons that integrate art,  technology, music, and the outdoors. This award-winning school has  provided excellent education to children in Colorado and produced  generations of…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692016/recognizing-red-rocks-elementary-school"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…often express  adherence to verse 45, which admonishes: ``Whatever you did not do for  one of the least of these, you did not do for me.''\n\nMr. Speaker, there are a lot of lessons to be found in chapter 25 of  Matthew long before one gets down to verse 45. There are lessons on the  importance of being prepared, the importance of providing service, and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…this contest and represent an  industry that she loves and that she will strive to make a meaningful  impact on for years to come.\n\nGracyn Stevens says she appreciates the lessons that she learned  growing up showing cattle in 4-H. The cattle industry taught her that  true success is about the effort and passion put into each project.\n\nI congratulate…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697999/congratulating-gracyn-stevens"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…extraordinary accomplishment.\n\nI congratulate them on their Class 2A PIAA Basketball Championship  and wish them the best in their future endeavors. I am certain that the  lessons that each of these students learned on the court will continue  to serve them well throughout their lives.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689659/congratulating-the-linville-hill-christian-school-boys-basketball-state-champions"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…using.\n\nAdditionally, my amendment directs the Army Corps of Engineers and  EPA to publish a revised compensatory mitigation rule that incorporates  advances in science and lessons learned since 2007; promotes  equivalency and flexibility among mitigation options, providing  builders additional options beyond mitigation bank credits; speeds the  approval…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…community and  at Harlem High School. He is a family man, a role model, a teacher, and  a molder of men who has devoted his life to ensuring young students  learn the skills and lessons necessary to be successful not only on the  baseball field, but in life.\n\nI am honored to help Coach Lewis celebrate this occasion and the  positive, lifelong impact he has…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688921/harlem-high-school-baseball-field-named-after-legendary-coach-jimmie-lewis"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…earn an Eagle Scout Award, Carter had to obtain 21 merit badges  showcasing the skills he learned as a Scout and his commitment to the  community. Thanks to the invaluable lessons taught to Scouts, Carter  has become an expert in first aid, camping, fitness, communication, and  citizenship.\n\nThroughout our Nation's history, the Boy Scouts have played…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…become article 5-- and yet an even bigger majority of recipients again said yes.\n\nOf course, there was some controversy and opposition. There were  still isolationists ignoring lessons of the decade. But after years of  neglect for the national defense, after the folly of appeasement and  the failure of deterrence, after pouring the equivalent of 37 percent…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…The rights of a free people are protected and preserved       through honorable, virtuous, leadership which invokes the       nobility inherent in all men and women. As the lessons of       history clearly demonstrate, we recognize that freedom is       fragile. It is a rare and prized       possession and requires constant care and vigilance for its…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Affectionately called Gardener Bob, he brings the art of growing one's  own fruits and vegetables to the Cypress Elementary Cubs. As part of  the school's 4th Grade Science Lessons, students learn the farm-to- table concept by preparing the soil, planting seeds, nurturing the  seedlings into mature plants, harvesting and finally preparing and  consuming…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…systems'' means any portable wireless telecommunications       equipment utilized for the transmission or reception of       classified information.                    Ukraine Lessons Learned Working Group\n\nSection 6413 of the Fiscal Year 2025 Intelligence       Authorization Act (P.L. 118-159) required the Director of       National Intelligence and the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…to teaching English, she offers an agriculture elective that  introduces students to FFA and Supervised Agricultural Experience (SAE)  projects. Her class includes hands-on lessons about dairy and beef  cattle, visits to local farming operations, and a variety of  experiences designed to connect students to agriculture. Michelle also  has a deep passion…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698441/recognizing-michelle-nuckols"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…their communities. This is  the way they do it.\n\nFinally, I will make a point that hasn't really been discussed here  today in this debate; that is, we should remember the lessons of  Silicon Valley Bank. There was a very, very significant panic because  of the failure of Silicon Valley Bank and there was a run on that bank.\n\nWe don't want that to happen…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…years, many of his students  have been selected to participate in PMEA district, region, and state  band festivals.\n\nOutside of his work at QCSD, Mr. Parker has taught saxophone lessons  for the past 38 years. He is an active clinician, adjudicator, and  guest conductor, having led bands across Pennsylvania and Vermont. He  is a dedicated member of PMEA,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "John Thune", "party": "Republican", "sentence": "…dominance to  ensure we have an affordable and reliable energy supply for years to  come.\n\nStrong small businesses mean a strong America. I will always be  grateful for the lessons I learned getting my start working in small  businesses. During the summers, my parents, who were educators, ran a  motel in my hometown of Murdo, and as is common in a lot…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…soldier, at that time--shining  black leather boots, making sure your uniform was ready for those  weekend drills in a blustery cold Iowa. But he also learned the more  impactful lessons in the National Guard, such as leadership and  teamwork and caring for the brother to the left and right of you. His  focus, even as a young soldier, was always on people.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…for that I am deeply grateful.\n\nHigh Impact Movement is proof that when you invest in others, whether  it be through tutoring a student after school, sharing valuable life  lessons through mentorship, or just encouraging a young person to be  the best that they can be, you'll find that the results have an impact  that echoes far into the future.\n\nOne…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}]