[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…happen, and they did it anyway. Now, we  have a chance to fix it. Democrats have a clean, 3-year extension of  these tax credits on the floor today with bipartisan support.\n\nLet's make sure families get the help they need. We must vote ``yes''  on this bill.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698797/breaking-the-gridlock-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…stalled. Has anyone looked at their 401(k) lately? People are very  uncertain.\n\nLet's get back to business, standing up for hardworking Americans,  standing up for businesses. Let's make sure we guard their pocketbooks  and tackle the affordability squeeze together, rather than serve the  special interests that all have too much power. Republican billionaires…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…address the affordability crisis?\n\nOur servicemembers and their families deserve answers to these  questions before we ask any servicemember to put their life on the  line. Let us make sure they get those answers. Let us have this debate.  Let us move beyond a parliamentary point of order designed to hide from  the American people the cost of our military…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…colleagues to vote ``no'' on  this misguided bill.\n\nIt is not that we are not trying to empower women who are making  choices during their pregnancy. That is not it at all. Let's make sure  that they are empowered with every tool, every resource, and every bit  of information they deserve to make the choices they need to make about  their lives, their bodies,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…We have not funded healthcare in rural communities across the  country. We have gutted programs that provide actual support for  pregnant people.\n\nThis is a joke. This let's make sure they get an email with all of  the information. It is unserious.\n\nMr. Speaker, I urge all of my colleagues to vote ``no'' on this bill  and to take serious action to support…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…around here.\n\nI have to tell you, Mr. Speaker, this is ridiculous that this is what  we are doing this week when there is so much happening in the world. By  the way, again, let's make sure everybody understands this: This big,  ugly bill that is coming here is about a tax break for billionaires. I  just showed you the figures, Mr. Speaker. There is more…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…for  them. We can't allow everyone. We need an orderly process to achieve  this goal.\n\nWe are a nation of immigrants, and I am proud of that fact. I hope  everyone is. Let us make sure we do immigration the right way.\n\nThe reference in 2018 was an embarrassment--an embarrassment to the  White House, to the Oval Office, and to the Presidency. I am glad…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…kinds of policies and 75 percent of them are in red States.\n\nThe legislation that Senator Warner and Senator Wyden proposed is  simple and reasonable. We are simply saying: Let's make sure the same  tax credits that made care more accessible for tens of millions of  Americans yesterday and last year and the year before that continue to  be there for families…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…will close  schools. It will shut down our trash removal. For those of us in the  region who use the Metro, there will be dramatic cutbacks.\n\nLet's correct this mistake. Let's make sure that we show on our 250th  anniversary the cleanest, safest city in America. This will be a giant  step toward that.", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688853/district-of-columbia-local-funds-act-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is a lot  of work to be done, and I may not be around for some of it. But I will  still remember that $800,000 when I first ran was a record. Now it is  rather routine.\n\nLet's make sure that if you have politics in your bloodstream, it  doesn't take embalming fluid to replace it. Let's replace it with the  ideals that we all aspire to.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…its own.  It happened because we put pressure on them.\n\nNow the money is flowing, and I hope it is the entire $7 billion that  goes to our schools throughout the country. Let's make sure that we  know where it first happened. It happened when the flood of phone lines  started going to my colleagues here in Washington.\n\nI am going to, and my colleagues…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…fierce, and deadly, and it is indiscriminate about where it  strikes, but we have the ability to fix it. I call on my colleagues to  come together. Let's make it better and let's make sure that these  tragedies don't happen again.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…images which I won't repeat  for the record, but they are horrible.\n\nEven after these reports, X still has not prevented Grok from  creating these exploitative images. Let me make sure you understand  what I just said. Even after these terrible, deepfake, harming images  are pointed out to Grok and to X, formerly Twitter, they do not  respond. They don't…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Stefanik,  Andrew Garbarino, Nick LaLota, and Mike Lawler. These  are just facts right now. It was big talk about standing up to protect  the State and local tax deduction.\n\nLet's make sure we set the record straight here as to what happened  to the State and local tax deduction, which impacts millions of  hardworking American taxpayers all across the country,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…and that people are who  they say they are when they go to the polls, you should vote ``yes.''\n\nThe answer to this is easy. It is common sense. It is why it is  popular. Let's make sure we reinstall integrity in our elections.\n\nFor the record, let me just clear up a few misconceptions that our  colleagues on the left have tried time and time again to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Federal law  enforcement agencies, including the United States Immigration and  Customs Enforcement for keeping our communities safe in the face of  danger.\n\nMr. Speaker, let's make sure that we are dealing with the facts as  they actually occurred. The assertion the LAPD had the situation under  control; we all saw otherwise on our television sets. The…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…support the one-size-fits-all electric  vehicle mandate that the market and the American people have clearly  rejected.\n\nThis legislation is about defending consumer choice. Let's make sure  California does not dictate what the rest of America drives.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690487/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Speaker. It is worse today  than what it was back in 2008 and 2009 when ObamaCare was passed.\n\nThis is our opportunity to realize we have to cut spending in  Washington. Let's make sure we take care of our men and women in  uniform, but let's address the healthcare costs that are truly  subjugating our Federal budget.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…enforcement, they are TSA, or they are air traffic  controllers--they are keeping this Nation and Americans safe--if we are  going to force them to work, at a minimum, let's make sure we pay them  and pay them on time.\n\nI came down in as nonpartisan a manner as I possibly could and  literally begged the other side to just join us, vote to proceed to…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…owe it to our citizens. We owe it to our troops, and we owe  it to the integrity of this Nation. The crisis wasn't spontaneous. It  was built, funded, and incentivized. Let's make sure it is never  repeated.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}]