[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…President Biden.\n\nDid I say bipartisan? Yes, it was bipartisan. I voted for it. I stood  proudly with my colleagues on both sides of the aisle to take this  important step.\n\nLet's be honest. It was just that, one step. It was a step that needs  to be followed up with more steps, more action, more help, and more  signals that we are bigger and better than…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the university partnerships that have  built the modern American economy.\n\nThey call this reform. It is not reform. It is a dagger to the heart  of American innovation.\n\nLet's be honest about what's going on here. Elon Musk and the so- called Department of Government Efficiency are using the Federal  Government to settle scores: cancer trials, nonessential;…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…hospitals and clinics over the cliff. Cuts  to Medicaid aren't just cuts to line items on a budget. They are cuts  to care that keep my constituents alive.\n\nMr. Speaker, let's be honest about what this is: a budget that raises  costs for working families, adds red tape for patients and providers,  and gives handouts to billionaires, all while risking…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…strong, and worker  strong.\n\nMr. Speaker, I think it is notable, as we stand on this floor  tonight, that there is not a single Republican here to stand with our  workers.\n\nLet's be honest: When my colleagues across the aisle say that they  stand for American manufacturing and American jobs, they don't mean  that they stand with American workers. They are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bill  would cause. These are the most basic questions  that you could possibly ask about whether to overturn D.C.'s tax law,  and he couldn't answer them. He had no clue.\n\nLet's be honest about what this is. It is powerful people in  Washington telling local communities: Sit down and shut up. We know  better. Then they leave working people to clean up the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…who pardoned over and over and over  again healthcare fraudsters while at the same time screwing over the  American people by taking away their healthcare.\n\nMr. Speaker, let's be honest about what is happening here because  this really is not that complicated, and the American people aren't  stupid.\n\nThis Republican bill does not fix the healthcare crisis…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, let's be honest about what this is. The  administration didn't try to cut PBS and NPR because of the budget.  They went after them because public media doesn't play along with the  never-ending…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693621/pbs-and-npr-tell-the-truth"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…cable news and assume the only thing we do around here is  fight, but I think the last three bills on the floor are a good example  that, indeed, is not the case.\n\nNow, let's be honest. None of these bills have been silver bullets  slaying the biggest policy challenges facing our Nation, but they are  real attempts at governing. The Save Our Seas Act,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…slows down the loan process and risks excluding legitimate  applicants, particularly those from immigrant and mixed-status  communities who already face steep challenges.\n\nLet's be honest about what this bill really does. It uses small  business policy as a vehicle for immigration politics. That is not only  misguided, it is harmful.\n\nSmall businesses are…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…them,  their outrage would be the same with much more colorful language.\n\nA phantom foul, five seconds left, Alanna Smith playing legal defense  on Breanna Stewart, who, let's be honest, is the league's marketing  golden girl. The contact? It was embellished, marginal at worst, but  the whistle blew. The game and the title were handed to New York on a…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…those are reasonable. As to the part that you are pulling out, which I  think is unreasonable, I appreciate that you now agree that that, too,  is unreasonable. But let's have an honest, frank discussion about the  rest because, certainly, the points you have raised are ones that I  want to have the opportunity to talk about. I understand where you…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today in strong opposition to this  ridiculous bill.\n\nLet's be honest: This bill, along with the executive order it  reinforces, is absurd. It is unserious, ineffective, and beneath the  dignity of this institution.\n\nChanging the name of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690943/gulf-of-america-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…comes to industries critical to our  economic and national security, such as pharmaceuticals and weapons,  ensuring the viability of domestic supply chains is paramount.\n\nLet's all be honest, as a result of the crushing use of tariffs  imposed unilaterally by the President, small businesses are clamoring  for options in their supply chains that avoid massive…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…annual economic activity and 8,000 jobs by the latest count.\n\nApparently, this does not matter to the President and his  administration. Unemployment has been rising.\n\nLet's be honest. DRP does not mean Deferred Resignation Program. It  means destroy, ruin, and punish.\n\nMadam Speaker, stop this madness. Protect MARAD. Protect our ports.  Protect our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…re-arrested, charged, or sentenced for other crimes.\n\nQuite a record. Maybe we should call this new panel the subcommittee  on criminal recidivism by Trump's friends.\n\nBut let's be honest. That is not what this is about. This is about  distraction, another shiny object, because the majority doesn't want to  talk about the things that they are actually blocking,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…administration are working to claw our way back  to sanity for the United States of America.\n\nWe have lived through the most devastating border crisis in modern  American history. Let's be honest. It wasn't a natural disaster, and it  wasn't an accident. It was the direct result of bad choices made by the  Biden-Harris administration.\n\nThis wasn't mere mismanagement.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…theft from other  taxpayers.\n\nSo as the CBO confirmed, $18 billion in Federal spending was put on  emergency care, and these are just the facts that play out.\n\nAgain, let's have the honest conversation. If the other side wants to  fund it, then say it; but don't say it is not happening or bury it  under the typical bureaucratic or political doublespeak.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…they are not fooled by the chaos. They are not  happy with the chaos. They are watching this body to see who will fight  for them and who will fold to Trump.\n\nMr. Speaker, let's be honest. This administration isn't governing. It  is looting. Trump's cronies are lighting the house on fire so their  billionaire friends can sell the ashes for profit.\n\nWith…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…commitment to the American people by finally  reopening the government. It delivers on the promises that we have made  to our veterans, our farmers, and our taxpayers.\n\nLet's be honest: This government shutdown was completely avoidable.  On September 19, House Republicans passed a continuing resolution that  funded critical services and would have given…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…left with  coverage that they can't even use and bills that they can't even  predict. There is no transparency in the costs of the healthcare that  they are receiving.\n\nLet's be honest about where we are right now. Healthcare now consumes  one-fifth of our entire economy. Hospital prices have risen three times  faster than the awful inflation that we…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone care? Does anyone care? What is wrong with this place?  The immorality that the next generation will be poorer than us--but we  are not allowed to say that because, let's be honest, people want more  stuff. If we keep giving them more stuff, they vote for us. They might  even contribute.\n\nLook, let's just continue to do some of the basic demographics.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and trying  to show the math?\n\nI get my brothers and sisters around here:\n\nThat was interesting, David. I am still going to vote for piling on  more debt because, well, let's be honest, my voters want stuff, and I  will be out of here by the time this blows up.\n\nIt probably doesn't blow up. What happens is you hit a moment where  the money required to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Instead of supporting officers who want safer alternatives to  deadly force, Democrats are trying to scare the public with cherry- picked statistics and misleading claims.\n\nLet's be honest. If Democrats were truly concerned about public  safety, they would not oppose a bill that encourages de-escalation and  reduces the likelihood of fatal outcomes and encounters.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Republicans  control this, but we are all too scared to actually read something that  is in a big binder that actually has math in it that would be hard and  difficult because, let's be honest, it is really hard putting a couple  of hundred pages of facts and details in a tweet.\n\nThe fact of the matter is that MedPAC, The Wall Street Journal  series, and the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Dakotans through  blizzards, floods, and drought, always with steady insight, clear  instructions, and a partly sunny optimism, even on the coldest North  Dakota days.\n\nLet's be honest: Being a weatherman in North Dakota, in my State, is  no easy task. While our weather is reliably unpredictable, John was  always a high-pressure system of calm and confidence,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691313/congratulating-john-wheeler-on-his-retirement"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…anyone that actually cares about  these subjects of taking on debt and deficits, help us. Help us explain  it to our brothers and sisters. Help us take on what will be, let's be  honest, a barrage of hate from the brokers, from the insurance  companies that don't want a system that lines up the incentives  properly.\n\nThese were the incentives of the original…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…2023. She  is right that the Trump administration has prioritized this work, and  we have worked with the administration to bring legislative clarity to  that vision.\n\nLet's be honest. There are many parts of the siting and permitting  process that Republicans and Democrats disagree on, but this is not one  of them. A more efficient and a more transparent…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}]