[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…across Texas.\n\nTexas has the second-highest rate of food insecurity in the Nation.  One in four children in our State face hunger. That is 25 percent of  our children.\n\nLet's be clear: How can you claim to be pro-life and then just let  children starve?\n\nTo paraphrase Matthew: For I was hungry and you gave me something to  eat. I was thirsty and you…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693026/children-in-texas-are-going-hungry"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…our chance to  have the Members of the House vote their conscience. Do they vote for  the President and his ways, or do they vote for their people, their  constituents?\n\nLet's be clear about this so-called emergency Donald Trump declared  on Canada and so many other countries where no emergency exists. For  over 50 years, emergency authorities have been…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…a guy with a cell phone in his  hand in the back. They couldn't handle that.\n\nSo ICE is withdrawing from Minnesota. It is good. We are glad they  are leaving our State, let me be clear. And when I talked to Director  Homan about 10 days ago, he said this was the timetable, and they must  follow through. He said they would first push out the Border Patrol…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…healthcare is safe, effective, and  medically necessary. It is supported by every major medical association  in the U.S., representing more than 1.3 million U.S. doctors.\n\nLet's be clear by what we mean by gender-affirming care. We don't  only mean surgery. Sometimes it is just using the correct pronouns.  Sometimes it is mental health care. Sometimes it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…decision, not a financial necessity.\n\nNow, the Trump administration has yet again made the decision--made  the choice--to allow our fellow Americans to go hungry. Now, let's be  clear: The only way to ensure the SNAP benefits are issued by November  1 is for the Trump administration to release the billions of dollars it  has sitting in an account in…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…the  CLARITY Act would allow companies to raise up to $200 million over 4  years without any disclosure and without any transparency, just by  tokenizing their security.\n\nLet's be clear. Putting a security on the blockchain doesn't make  investors safe. It might make money for the crypto industry. Mr.  Speaker, I know you all like that. It might make it…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693785/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…military in the Caribbean, right nearby  Honduras, to fight drug trafficking makes an utter mockery of  Donald Trump's supposed desire to root out all drug trafficking.\n\nLet's be clear of the facts: The person Donald Trump just pardoned  was convicted of helping move 400 tons of cocaine to the United States,  all the while Trump blows up alleged drug…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise in opposition to this big, ugly  bill. Let's be clear: This bill is TrumpCare. And TrumpCare means 17  million more Americans will be uninsured and all the rest of us will be  paying higher costs and driving further to get…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693205/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that our constituents  desperately want us to do, Republicans in the House have chosen once  again to advance a resolution under the guise of denouncing  ``socialism.''\n\nLet me be clear. This resolution is an embarrassing distraction from  the complete and total failure of the Trump administration to deliver  actual results for the American people, and…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Angeles, California, who were exercising their First Amendment right to  free speech. This resolution is in no way sufficient. It is a way to  roll back free speech.\n\nLet's be clear. We do not have a democracy if we erode the right to  free speech. We will not have a democracy if the President of the  United States continues to abuse his power and…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692811/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…the checks that our seniors depend  on go out. Trump and Elon Musk want them to quit.\n\nThe Social Security worker told us he felt that he had failed the  American people. Let's be clear: He didn't fail us. The Republicans  did.\n\nThat is why I have been out there raising the alarm. Seniors and  their families deserve what is coming. Seniors built this country.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690565/district-work-period-regarding-social-security"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…property taxes, State formulas, and a  little bit from the Federal Government. This bill would require schools  to report funding from or contracts with a foreign source.\n\nLet's be clear. There is no evidence that K-12 schools are under any  threat from misinformation or covert influence by authoritarian foreign  governments in any measurable way.\n\nIf passed,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Tuskegee Airmen and General Colin  Powell, the first Black Joint Chiefs chairman.\n\nWhy are they erasing these people from the website and not anybody  else? We know why.\n\nLet me be clear: The White House and the so-called Department of War  appear determined to undermine, discredit, and even erase the evidence  of Black patriotism and Black servicemembers…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the bombing has largely stopped, and the  hostages are home. This is extraordinary. I salute everyone involved in  getting us to this day, including President Trump.\n\nBut let's be clear, there is more work to be done. The only way this  cease-fire will succeed is if it is the beginning of a relentless,  tireless process that aims to get us to the two-state…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…to meet the needs of the American people, House Republicans are  busy spreading fear and lies to justify their attempts to  disenfranchise millions of eligible voters.\n\nLet's be clear: It is already against the law for non-Americans to  vote. This bill is a solution in search of a problem. The SAVE Act  would create new barriers to the ballot box for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690004/safeguard-american-voter-eligibility-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…This will be an extraordinary use of something never intended to be a  way to have--unilateral--one single person invoke a tax on the people.\n\nWith regard to tariffs, let's be very clear. Tariffs are simply  taxes. Tariffs don't punish foreign governments. They punish American  families. When we tax imports, we raise the price of everything from  groceries…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…support of S.J. Res.  80, legislation to disapprove of the Bureau of Land Management's 2022  Integrated Activity Plan for the National Petroleum Reserve in Alaska.\n\nLet me be very clear. This is not an abstract policy debate for the  people of Alaska. This is about whether the Federal Government will  honor both the law and its commitments to the people…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the winter and cooled  in the summer. This legislation cuts through that backlog. It empowers  grid operators to prioritize projects that actually enhance  reliability.\n\nLet us be clear about how we got here. Democrats have spent years  forcing premature retirements of coal, nuclear, and natural gas through  excessive regulation, while shoveling subsidies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…job. We are not closing out debate. We  are having plenty of debate. There are plenty of opportunities for our  colleagues to offer amendments.\n\nMs. FOXX.\n\nMr. Speaker, let's be clear: Republicans don't oppose the full  transparency of the Epstein files. We embrace the Oversight Committee's  task of doing just that. We embrace Representative Massie's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I rise in support of this Senate amendment  to the fiscal year 2025 budget resolution.\n\nLet's be clear about what we are voting on today. We are not voting  on the budget. We are not voting on the numbers. We are voting on the  framework, a starting point for building a…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689887/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…structural. They target woke U.N. handouts,  failing to keep the peacekeeping efforts, and Biden's DEI and climate  propaganda campaigns masquerading as humanitarian aid.\n\nLet me be clear. This does not cut defense. This does not cut Social  Security. This does not cut Medicare. This is about rooting out waste,  fraud, and abuse and very firmly putting…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…everyday participation  in our society. Yet, for the most fundamental act of a self-governing  people, the right to vote, that same standard of verification is  missing.\n\nLet us be clear. Despite the rhetoric, this is not about creating  hurdles at the polling place. It is about the integrity of the  registration process. As Americans, our right to vote…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699946/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…interests, no. They are using it to attack President  Trump. This week, they are going to force a vote on another War Powers  Resolution to tie the hands of the President. Let me be clear about  what that resolution does and what it does not do. It does not reassert  Congress's powers. It does not make America stronger. It makes America  weaker and less…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…would not just resort to political maneuvers.\n\nI am not a fan of tariffs. That is no secret. I am in favor, however,  of robust engagement with our trading partners. Let me be very clear.  In trade, there is no stagnation. If we are not gaining ground, I think  we are losing ground, and data would show that.\n\nDuring the Biden administration, the President…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…prohibit the use of United States Armed Forces  off the coast of Venezuela without regard for the real and growing  threats posed by the foreign terrorist Maduro regime.\n\nLet's be clear-eyed about the danger that we face. The Maduro regime  is a designated foreign terrorist organization, a narcoterrorist state  that collaborates with other foreign terrorist…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, I stand in support of Congressman  Barr's good legislation.\n\nLet me remind those listening about this idea that the tax issue is  so important. Let's be clear here. The current rate on the highest  earners in the United States is 37 percent. If our resolution passes,  it will stay at 37 percent. There is no big tax break for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Agriculture Committee with strong support from both sides of the aisle.\n\nWith over 300 votes in the House last Congress, this bill is ready to  cross the finish line.\n\nLet me be clear. This is a win for everyone involved. It supports our  children's health and gives a boost to our Nation's dairy farmers who  work hard every day to provide safe, nutritious…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the combination of them has led to a reduction in trust  between our two caucuses--trust that is essential to having an  understanding and an agreement to move forward.\n\nLet me be clear about this year's appropriations process. It was  positive from when we started in March-April to when we concluded on  the committee in July and voted out eight strong,…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…who need it most. This includes mothers, children, seniors, and  people with disabilities.\n\nDemocrats continue to fearmonger and misrepresent what is in this  bill, but let me be clear: House Republicans are eliminating waste,  fraud, and abuse to focus Medicaid on the most vulnerable and not on  able-bodied adults who choose not to work.\n\nWe are fighting…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…narcoterrorist, and Democrats are acting like we started world war III.\n\nFor that brief, targeted action, they now insist Congress must step  in and tie the President's hands.\n\nLet's be clear about how ridiculous this resolution truly is. It  orders the United States to withdraw forces from Venezuela, yet there  are no U.S. forces in Venezuela to withdraw. You…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]