[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…or that the Department is just too  big. Now, if we are saying this because of the budget cuts Republicans  are starving for to underwrite the tax rate for the wealthy, let me  remind us all that the Department of Education is the smallest Agency  in the Cabinet by a lot.\n\nThe Department is responsible, though, for promoting equal access to  education;…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republican leadership perhaps daring their  own members who are deeply worried about this bill to oppose it on the  floor.\n\nSo if Republicans do, in fact, proceed very soon, let me remind them  about the consequences of passing this bill. It will be a disaster for  families, for the economy, and even for Republicans themselves. It rips  healthcare from 16…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693133/one-big-beautiful-bill"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…for hundreds of thousands of my constituents.\n\nIn Texas alone, more than 4 million people rely on Medicaid for  healthcare, including half of the children in our State. Let me remind  you, this is a State of 32 million people. Half of the children in our  State rely on Medicaid, one out of every two kids in Texas.\n\nWhen Trump proposes gutting it, he…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…one-vote  margin--and now we are learning that some Republicans didn't even know  what was in the bill, which is inexcusable. Yet, that is what they are  claiming publicly.\n\nLet me remind my colleagues: Republicans are giving more tax breaks  for billionaires, wealthy heirs, and corporations, while lower income  Americans are made worse off through the largest…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…a minimum of nearly $1 trillion from Medicaid, our  Nation's largest healthcare program.\n\nFor those who are saying that somehow the Medicaid program has a lot  of waste, let me remind us that Medicaid is the leanest Federal  healthcare program. Every independent study says  that Medicaid is financially sound, the most financially sound Federal  healthcare…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688050/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the cancellations of these investments that was stolen  back in Ohio by the Trump administration was another major Ohio  company, steel producer Cleveland-Cliffs.\n\nPlease let me remind folks that steel helps create America's spine,  certainly for manufacturing, and Cliffs traces its roots in our Great  Lakes region back to 1847. Get ready for this: Their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…purchasing power, and taxpayers pay for the unnecessary  enforcement. We need transparency, fair treatment,  and laws that reflect reality, not fear or political theater.\n\nLet me remind this Chamber, undocumented immigrants--the same people  being targeted--contributed $96.7 billion in Federal, State, and local  taxes in 2022, including $25.7 billion into…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…student loans, threatened schools and  universities, and given their friends contracts to not only rewrite  educational curricula but to even rewrite American history itself.\n\nLet me remind my colleagues: This is the agency that was born out of  the civil rights movement, the agency that ensures kids with  disabilities have opportunities and ensures that all…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697300/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…were unjustly cut.\n\nThese are not abstract numbers. These are real people who planned  their lives around commitments and promises that were made to them and  then broken.\n\nLet me remind you that when the auto rescue moved forward, corporate  interests were stabilized, made whole, but working people were left  behind, and that imbalance has lingered for…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…indigenous people; veterans; and working-class Americans.\n\nIn advancing it, Republicans invoke those historical policies that  were intended to disenfranchise Americans. Let me remind Members what  they were: literacy tests and poll taxes for eligible voters,  grandfather clauses that tied voters' rights to the grandfathers before  the Civil War, all-White…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Did we forget why we are here and why the people elected us? They  elected us to make their lives better, not to hurt them or make their  lives worse. That is not our job. Let me remind you: The people elected  us. They put their trust in us to make their lives better, not worse.\n\nI invite all of my colleagues to join us. Join us to fight for people  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…KELLY of Illinois. Mr. Speaker, I rise in opposition to President  Trump's rescission package that steals $400 million from PEPFAR, a  lifesaving global health program.\n\nLet me remind my colleagues that PEPFAR is a bipartisan effort first  led by Congresswoman Barbara Lee and signed by President George W.  Bush. It has been reauthorized on a bipartisan…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692543/rescissions-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…the people who live in  our States and in the country.\n\nWe have all heard a lot of excuses trying to justify why a handful of  Senators deserves a big financial windfall. Let me remind you why they  are wrong.\n\nThis all began when President Trump and his political allies cooked  up a scheme to try to overturn the result of the 2020 Presidential  election,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…winning the  war  against Russia's invasion. I will be joined by Congressman   Mike  Quigley of Illinois and Congresswoman Madeleine Dean of Pennsylvania.\n\nAs I begin, please let me remind the President of our country, our  Vice President, and Secretary of State that freedom means never  surrender. Liberty must never capitulate to dictatorship. America does…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…losses is somehow a brilliant move. Now, I wasn't very good in  arithmetic, but that doesn't sound like a brilliant move to me. That  sounds like a stupid move.\n\nFirst, let me remind my colleagues across the aisle that this is just  a pause.\n\nSecond, 10 percent tariffs across the board are still in place, plus  the increased Chinese tariffs.\n\nThird,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…amazing that you would be  wrong because there are people in this room that think women are  incapable of getting an ID. I think that is an insult to women.\n\nMr. Speaker, let me remind you why we are here. We are here because  this previous administration, the Biden administration, imported 10 to  15 million illegal aliens who have come here and we have…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…legislation that  requires two things, voter ID, plus proof of citizenship, is being  labeled by people in the Senate and people in this very Chamber as Jim  Crow-era laws.\n\nLet me remind the American people of history. It was the Democratic  Party who championed the Jim Crow-era laws. And this is the farthest  thing from it. In fact, Mr. Speaker, if you…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…expensive. By forcing this choice on California consumers, we will also  be forcing on them all of the concomitant increases in the prices of  the goods that they buy every day.\n\nLet me remind you, California already has the worst poverty of any  State in the country. Madam Speaker, this waiver would have made it  even worse. That is why I think it is entirely…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690433/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…narcoterrorists who have the blood of hundreds of thousands of  Americans on their hands. Whatever the reason, this would be foolhardy.\n\nIf you think I am exaggerating here, let me remind you of the kind of  depraved savages we are dealing with. Recall the Tren de Aragua gang  member who tried to rape 22-year-old Laken Riley while she was out for  a jog…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…taken out of the productive sector, the private sector,  given to the government is a mistake.\n\nTo those who still call themselves conservatives but now support  tariffs, let me remind them that Milton Friedman said tariffs ``raise  prices to consumers and waste our resources.''\n\nTo those who still have a fond memory of Ronald Reagan on my side,  Ronald…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…complex issue. It is not in any of the  bills that we are dealing with today, and that is his complaint, it is  that there ought to be something in there.\n\nMr. Speaker, let me remind folks how we got here. We got here with a  bill that came out of the Speaker's office, Speaker Pelosi's office,  called the Affordable Care Act, ObamaCare. It was going…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I stand in support of Congressman  Barr's good legislation.\n\nLet me remind those listening about this idea that the tax issue is  so important. Let's be clear here. The current rate on the highest  earners in the United States is 37 percent. If…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…card, would you just shrug it off and pay for it?  I think not. You would demand answers. You would challenge it. That is  exactly what DOGE is doing with your tax dollars.\n\nLet me remind you of something else. In November, the American people  voted for change. They chose a different direction because the status  quo simply wasn't working. Now, because…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…there was no consultation with those regulators. That was a flaw.  Importantly, the Council may not then vote on a proposed designation  unless this determination is made.\n\nLet me remind my colleagues that the SIFI designation process has  been flawed from the start. First, it targeted individual companies for  designation without any process or notice.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…rule provides for consideration of this  rescissions package and advances H.R. 1 by adopting the engrossment  resolution.\n\nSince Democrats seem to have selective memory, let me remind them,  and Americans, that during the 117th Congress, very recently, House  Democrats deemed 29 items total. Also included in that number is the  engrossment correction…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are no specific cuts  in here.\n\nThe frustrating thing I hear from the other side is that they are  talking about that any cut or any reduction in spending is a problem.  Let me remind people, 26 percent of the current level of spending for  the current year is borrowed. That should be of huge concern to  everybody. The average American has about $100,000…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688024/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…they haven't said is the one thing that this bill does, which is  to open up the government. Not one Democrat is getting up here saying  this bill opens the government.\n\nLet me remind them and my colleagues and the American people that  this bill opens the government tonight, and the American people have  Republicans to thank for ending this shutdown…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696720/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Speaker.\n\nThey say we haven't put forward anything at some points, and at other  points in their debate, they claim that this bill is terrible, that it  does nothing.\n\nLet me remind you, Mr. Speaker, that a part of this bill revives a  Democratic plan that was supposed to be short term called cost-sharing  reductions. It is fascinating because during…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…she is a nice person, but  she missed the boat. She lost her--I don't know the word to describe  it. For what she has done, she deserves to come off of the committees.\n\nLet me remind you, we want to go to the Ethics Committee. To those  listening, the Ethics Committee is five Democrats and five Republicans.  Let them find it, but in the meantime, you…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…their healthcare premiums so big corporations can  get their tax deductions.\n\nRepublicans voted down every single amendment that Democrats offered  to protect Medicaid. Let me remind everybody that in more than 25  districts, more than a third of the constituents rely on Medicaid. That  includes Republican Nick Begich's and  Robert Bresnahan's districts.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]