[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of  Members, and leaving the rest of Congress and the country in the dark?  What is it about the killing of these two survivors that the  administration is unwilling to let the people see?\n\nThe legality of the entire campaign of striking these boats and  killing those onboard, rather than interdicting and arresting them, has  been called into serious…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that on CNN. If we say  that it is racist on CNN, we become persona non grata. We are not going  to be back on CNN. If we are there, the host would send little signals  to let people know that this was something that was imposed and not  something that was desired.\n\nCNN is a status quo news network. I am not a status quo  Representative. I want to change…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…implies and  suggests a camaraderie in the idea that young women are for sale.\n\nOn July 15, House Speaker   Mike Johnson told CNN:\n\nWe should put everything out there and let the people       decide it.\n\nWell, actions are more powerful than words. The words were:\n\nWe should put everything out there.\n\nThe action was he adjourned the House of Representatives…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…documented. Just give us a little inkling. Give us a little feeling for  the strength and conviction that drives you to do this unusual taking  of the floor for a long time to let the people know how bad these  things are going to be.\n\nMr. SCHUMER. ``Chuck'' is OK.\n\nMr. SCHUMER. So I thank my colleague for his strength, his courage,  and his effectiveness in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Will the gentleman yield?\n\nMr. GREEN of Texas. Mr. Speaker, if I may, I want to let people know  this not just for the Honorable Chip Roy, but I have relationships with  people across all lines in this Congress. When he comes to the floor  and says that he wishes…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693109/tax-cuts-and-spending"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…happened, I cannot accept that, and neither should any of  us.\n\nNo one has done more than Donald Trump. He has used the powers of his  office to hand out pardons--pardons to let people off who attacked  police officers. I am the son of two cops. He pardoned over 1,000  individuals. Many of them attacked cops in and around this building. It  is insulting…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Republicans are telling  the American people. We are going to die anyway. How outrageous is  that? How cruel is that?\n\nMr. Speaker, that may be true someday. It is no excuse to let people  starve today and not because of Republicans' cruel policies. We should  not turn our backs on millions of Americans and their fight to survive  poverty and live with dignity.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that adversaries and criminal organizations  could use stablecoins for their very harmful purposes.\n\nWhile we are talking about crypto, I think it is important for me to  let the people know that crypto is a digital form of private cash. It  is very important that people understand that. We are trying to share  the information so people understand about…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…community health centers  across the Nation to close. That is no joke. People are starting to see  it. They are starting to express their consternation. They are starting  to let the people know that somehow this must not happen. They want to  change it. If they want to change it, why would I vote to continue it?  I refuse to change my position. I stand now…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…terrified that, if they lose  their market, even temporarily, those relationships deteriorate. When  new relationships are forged, it is hard to get people back. If you  have let people down once, then what happens next?\n\nSo this is the situation--this double deal, I guess I will call it,  with Argentina--with our, well, having a trade war with China. So…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…crucial programs for the poor and working  families. That is a fact. It is not being made up. It is right there.  It is going to take food away from hungry children. It will let people  die from the lack of healthcare coverage. They are even cutting, again,  trillions of dollars so that we can continue to fund a budget that  can't pass an audit.\n\nOne of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…persona, enlarge their image, enlarge their  reach, enlarge their power, many Trumps who want to be another Donald  Trump. They are out there, and we need to do something to let people  know that when you behave as he has behaved, justice will be served.\n\nYesterday, the sword of justice swung across the House of  Representatives, and it left its indelible…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Congress of the United States does not  need to be making decisions about restaurants in Charleston, South  Carolina, or bars in El Paso, Texas, or what have you. Why don't we let  the people of the States and the localities make those decisions.\n\nMr. Speaker, I thank my colleague for his excellent presentation of  the bill. I wish it were one that we could…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…more.  That is cheating. So our bill put an end to that. Congresswoman Ocasio- Cortez and the socialist wing of the Democratic Party want us to put it  back. They want us to let people cheat.\n\nWhat else are the socialists asking for in this $1.5 trillion? Well,  they are saying: We don't want people who can work to work.\n\nWe put a provision in our bill…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…on a daily basis. I shake hands and greet people.  Whether I like them or not, I shake hands. It is something that I do,  but I can tell you what I don't do. I do not let other people wrap  their arms around me unless they are my kids, my friends, or my family.\n\nThat is Nicolas Maduro's hand right there. I will put a little arrow  there. That is Ranking…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the hearings. They have done  the work. They work well. The higher up the food chain it goes,  frankly, the more political the decisions become and the less informed.  Let the people who have actually done the work write the bills. In this  case, in these three and the three preceding bills, that is exactly  what happened, and I couldn't be more pleased…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…citizens is  already eight times what they were in the sixties and fifties.\n\nNobody should apologize or say that we are being mean or not letting  people in here. When we let in people who came here illegally, what we  are doing is kicking anybody who did it the right way in the face.\n\nWe know we have a housing crisis in this country. When you begin to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…passed, and  that the motion to reconsider be considered made and laid upon the  table.\n\nMr. SULLIVAN. Yes, I agree to the modification.\n\nMr. SULLIVAN. Mr. President, I want to let people know back home that  means that that bill, the ARTIST bill that we have been trying to get  moved for a long time, just passed the U.S. Senate. So I want to thank  my colleague…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…almost  10 million people coming here, not just illegally, but we don't even  know who the heck they are. They could be all kinds of vicious. We want  to make sure that we let people into this country who are the right  people who assist and contribute to society as opposed to taking from  it, let alone commit violent actions against society.\n\nThe good…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…next Congress came in and  said: That would cost hundreds of millions of dollars. By the way, why  should we in the Federal Government care what everyone's desk is like?  Let people choose on that.\n\nThat simple statement, that simple first time that it was actually  used, started a process now of saying: If an administration at the last  minute puts…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…resources to our constituents to combat opioid  abuse. That is what we are talking about. It is that simple. They can  hate the President, or they don't have to, but don't let these people  facing substance addiction and our communities suffer for their talking  points.\n\nMr. Speaker, I know that my colleagues on the other side have been  using the same anti-Trump,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…agent who  lost his finger, it is a danger sign for America. Every country has  immigration laws. When I talk to people in my district, even people who  think we ought to let more people in this country, they don't think we  should have no immigration laws. Nevertheless, this is where we stand.\n\nAs I repeated before, right now we naturalize about 800,000…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…be offered treatment as an alternative to  incarceration.\n\nThe Governor is refusing to fund the treatment programs that are  needed.  He is all too willing to continue to let people wither away on our  streets and die from overdoses because he is not properly funding this.\n\nThe mayor of San Jose, who is a Democrat, has said that the  Governor's refusal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]