[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…would shield them from higher costs.\n\nWe have been hearing about some of these deals that Senator Crapo  referred to that have been reached with the EU and Japan, but let's be  clear about what those deals mean because even after those deals--those  agreements, trade agreements--Americans are going to be left paying  dramatically higher tariffs.\n\nA…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…cutting important critical  services for the American people to give tax credits to billionaires.  There are a lot of B's in this statement. None of them are very good.\n\nLet me be very clear: Republicans have barely made any attempts to  support working families. Instead, they have written an economic love  letter to people like Elon Musk. This is a 386-page…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…inflation is up, joblessness is up, the stock  market is all over the place with American retirees losing  trillions of dollars in just 72 hours, and a recession is looming.\n\nLet's be clear: Republicans have no plan to prioritize hardworking  Americans, but they have a $7 trillion plan to help billionaires. They  will do that by cutting Medicaid and nutrition…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689917/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…a guy with a cell phone in his  hand in the back. They couldn't handle that.\n\nSo ICE is withdrawing from Minnesota. It is good. We are glad they  are leaving our State, let me be clear. And when I talked to Director  Homan about 10 days ago, he said this was the timetable, and they must  follow through. He said they would first push out the Border Patrol…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…many of them seasonal workers here under the H-2A visa  program, the basic right to speak up about unsafe working conditions  without fear of being fired or deported.\n\nLet's be clear. This rule that the administration is attacking wasn't  about politics. It wasn't about gangs or drugs or any of the disgusting  tropes the other side will paint against…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…do know is that the White House  has been trying to absorb this historically independent agency and has  given DOGE the green light to cut USPS staff and gut services.\n\nLet me be clear. The United States Postal Service does not use  taxpayers dollars for operating costs. Reducing post office locations  will lead to slower service, longer wait times,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692996/closure-of-quartz-hill-post-office"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…tax and investment policy is now: Do not invest in our  future but, rather, give more handouts to the privileged, wealthy, and  few at the expense of the working class.\n\nLet's be clear. The Federal Government should be building, not  blocking projects that strengthen our economy, lower costs, and create  American jobs.\n\nMr. Chairman, I urge my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694858/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Republicans  are continuing to advance a budget that would slash support for  veterans, even further undermining healthcare, housing assistance, and  food support.\n\nMr. Speaker, let me be clear: We don't support veterans by handing  them a folded flag with one hand and cutting their lifelines with the  other. More than 1.6 million veterans rely on Medicaid for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Individuals who have convictions set aside under the YRA  are significantly less likely to reoffend. Instead of celebrating this  success, H.R. 4922 would dismantle it.\n\nLet us be clear about the hypocrisy of this measure. House  Republicans from 34 states, including Louisiana, Missouri, Ohio,  Alabama, and North Carolina, voted to reduce the eligible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…decision, not a financial necessity.\n\nNow, the Trump administration has yet again made the decision--made  the choice--to allow our fellow Americans to go hungry. Now, let's be  clear: The only way to ensure the SNAP benefits are issued by November  1 is for the Trump administration to release the billions of dollars it  has sitting in an account in…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…1965.\n\nIn his first week, President Trump revoked the ``Equal Employment  Opportunity'' executive order that prohibited racial discrimination for  Federal contractors.\n\nLet's be clear: They aren't hiding this agenda to make discrimination  legal again.\n\nThat is why I filed legislation to restore those policies, and I am  proud to have had over 60 cosponsors…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…military in the Caribbean, right nearby  Honduras, to fight drug trafficking makes an utter mockery of  Donald Trump's supposed desire to root out all drug trafficking.\n\nLet's be clear of the facts: The person Donald Trump just pardoned  was convicted of helping move 400 tons of cocaine to the United States,  all the while Trump blows up alleged drug…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that our constituents  desperately want us to do, Republicans in the House have chosen once  again to advance a resolution under the guise of denouncing  ``socialism.''\n\nLet me be clear. This resolution is an embarrassing distraction from  the complete and total failure of the Trump administration to deliver  actual results for the American people, and…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…avoid the U.S. law that requires Congress to  vote.''\n\nBy the way, those aren't my words. That is a tweet from a Republican  House Member who just simply told the truth.\n\nLet me be clear: A vote for this rule is a vote for tariffs. It is a  vote for raising the costs on everyday Americans.\n\nNow, many Republicans I have worked with over the years can attest…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689861/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise in opposition to this big, ugly  bill. Let's be clear: This bill is TrumpCare. And TrumpCare means 17  million more Americans will be uninsured and all the rest of us will be  paying higher costs and driving further to get…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693205/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…the dollar.\n\nThat is why we have been working on this issue in our committee for  the last several years. Similarly, the Senate has been running through  their process.\n\nLet me be clear, this bill is not perfect. With my experience in  Nebraska, I have been a strident supporter of a strong, robust State  pathway for issuers. This bill has a State pathway,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693846/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…ironically, prohibiting voter  ID essentially. It also included ballot harvesting, promoting mass  voting by mail, and taking taxpayer dollars to fund political  campaigns.\n\nLet's be clear. Democrats believe Congress has the power to ban voter  ID but not the power to require it. This shouldn't be controversial.  Requiring proof of citizenship to register…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…alien from Somalia previously arrested for dangerous drugs and  possession of narcotics.\n\nWe are talking about dangerous people, Mr. Speaker. The list goes on  and on. Let's be clear, ICE is targeting criminal rings, and the Trump  Administration isn't ignoring fraud as Governor Walz had done for  years. They are targeting that criminal ring for immigration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to secure our elections, but in an age  of progressive, suicidal empathy, basic concepts such as voter ID and  proof of citizenship have been attacked as suppression. Let me be  clear: Nothing could be further from the truth.\n\nVoter ID, voter identification, is arguably the single most  commonsense proposal to ever grace this Chamber. A proof of citizenship…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…This will be an extraordinary use of something never intended to be a  way to have--unilateral--one single person invoke a tax on the people.\n\nWith regard to tariffs, let's be very clear. Tariffs are simply  taxes. Tariffs don't punish foreign governments. They punish American  families. When we tax imports, we raise the price of everything from  groceries…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…choosing from investments through a  brokerage window.\n\nMr. Speaker, I think most would agree that advancing a political  agenda at the expense of retirement savings is wrong. Let's be clear:  Americans invest to secure a brighter future for themselves and their  families, not to bankroll Democrats' radical initiatives and pet  projects and take care of their…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…size and  cost, with little accountability and even less justification. We have  seen waste. Some of it egregious, some of it so routine that people  barely blink an eye.\n\nLet me be clear: Demanding transparency, efficiency, and  accountability from our government is not extreme. It is common sense.  It is what every hardworking American does when they…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…interests, no. They are using it to attack President  Trump. This week, they are going to force a vote on another War Powers  Resolution to tie the hands of the President. Let me be clear about  what that resolution does and what it does not do. It does not reassert  Congress's powers. It does not make America stronger. It makes America  weaker and less…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…have been granted to the D.C.  Council by Congress, and Congress is the seat of authority when it  comes to the Federal enclave.\n\nHe also talked about Florida's laws. Let's be very clear: Florida has  established itself as a beacon of law and order, making sure that our  citizens are safe throughout all of our jurisdictions. If there are  some abilities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…would not just resort to political maneuvers.\n\nI am not a fan of tariffs. That is no secret. I am in favor, however,  of robust engagement with our trading partners. Let me be very clear.  In trade, there is no stagnation. If we are not gaining ground, I think  we are losing ground, and data would show that.\n\nDuring the Biden administration, the President…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Agriculture Committee with strong support from both sides of the aisle.\n\nWith over 300 votes in the House last Congress, this bill is ready to  cross the finish line.\n\nLet me be clear. This is a win for everyone involved. It supports our  children's health and gives a boost to our Nation's dairy farmers who  work hard every day to provide safe, nutritious…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…at 12:20 a.m.\n\nLate-night sessions are not partisan anomalies and unique to the  Democrats. These are precedents that Democrats themselves have  maintained for years.\n\nLet's be clear, this is the way the Rules Committee has operated when  necessary, regardless of which party holds the gavel. It is about  getting the work done. In fact, tonight we may…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…The amendment prohibits the expenditure of funds to create,  procure, or display any map that depicts Taiwan as part of the  territory of the People's Republic of China.\n\nLet's be clear: Taiwan is not a part of the People's Republic of  China. We should not appease the desires of the Communist Chinese  leadership by pretending that it is. Our maps should…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…coverage without annual or lifetime limits.\n\nTogether, the MAHA accounts and MAHA insurance offer something that  the Affordable Care Act never did: a real alternative.\n\nLet's be clear: This does not force anyone to abandon their current  coverage. If you like the crappy ACA ObamaCare plan that you currently  have, you can keep it, but Americans deserve…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…requires California to end the sale of all  internal combustion engines by 2035, and 17 States, including the  Commonwealth of Pennsylvania, are set to adopt this regulation.\n\nLet me be clear: No one should be forced to buy a product purely  because of government regulations. We cannot allow Gavin Newsom and  California Democrats to decide what vehicles my…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}]