[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…take on a major role here.\n\nMr. DAVIS of North Carolina. In the 118th Congress, we passed FIT21  with overwhelming bipartisan support. The CLARITY Act builds on this  work. Let's pass the CLARITY Act and send a strong message to the  American people and the world that the United States will lead in  building a forward-looking digital economy.\n\nMr. Speaker,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…on this  Congress' power of the purse. Some will admit that. Some will say it  silently.\n\nIf there were ever a time for this Congress to exercise that power,  it is now. Let us pass five bills on which we have agreement and  substantially restrain and stop the funding of DHS a week from this  Friday. Then, let us come to an agreement on honoring the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…help people out?\n\nVery simply speaking, it is a simple premise. Let's take the  Department of Homeland Security bill where we have major agreement on  the bulk of the bill, let us pass the bill in that context and fund  those agencies, take care of those folks, and fight for demands on  reforming ICE and CBC.", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700220/homeowner-energy-freedom-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…opportunity is now, right now, to allow this body to  unanimously pass this much-needed proposal to extend the credits by 3  years.\n\nI urge my Republican colleagues, let this bill pass. Let's give the  American people what they so fiercely and rightfully demand. Most of  all, let's give millions of Americans relief from the sky-high price of  these…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the  President has said he would sign it, after changing his position on the  bill over the weekend when he could see the tidal wave of public  opinion moving against him. Let's pass this bill. Pass it in the  Senate. Sign the bill, and let's go ahead and release the complete  file.\n\nAnsari).\n\nMr. RASKIN. Mr. Speaker, I have never heard a more defensive…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…about providing service employees with financial  relief, let's do it now. Let's do it today because the American people,  they get sick and tired of Washington games.\n\nSo let's pass this bill without playing politics, without taking away  healthcare and food assistance from families who need it the most.  Let's pass it by itself.\n\nThat is why I am calling…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…earlier some polling numbers. Let me put  another polling number out there. Mr. Speaker, 90 percent of Americans  support universal background checks. If that is the standard, let's  pass a universal background check right now. Let's save lives from  senseless gun violence.\n\nRepublicans say that this bill will stop noncitizens from voting, but  as the ranking…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699937/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…$600. Beginning January 1, Rebecca will pay $796 a month.\n\nThis is totally unacceptable. All of these are too high. Let's make  healthcare available to the American people. Let's pass today, not  tomorrow, not the next day, the Federal tax credits.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698790/breaking-the-gridlock-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…benefits or close rural hospitals. Well, they were  wrong. We don't need more broken promises. What we need is a different  approach, a one big, beautiful repeal instead.\n\nLet's pass the Protecting Healthcare and Lowering Costs Act, which  will restore people's benefits and access to care, ensuring that people  in small towns and rural communities will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…government  efficiency, and it is from legislation that has gone through committee  with support and input from both sides of the aisle.\n\nAs the legislative year comes to a close, let's pass the SAMOSA Act  and lower costs for taxpayers.\n\nMr. Speaker, I urge my colleagues to support this bill.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698152/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…This does nothing to strengthen our country or our  national defense. It hurts our economy. Why are we going down this  path?\n\nLet's get serious about immigration reform. Let's pass some laws that  enable workers to work legally and let employers hire these workers  legally, as well.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Senate Republicans are frozen,  paralyzed by fear or cynicism, while enabling Trump to use millions of  hungry Americans as political hostages. Senate Republicans should let  this bill pass.\n\nMr. President, I yield to Senator Lujan for the unanimous consent  request.", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Executive, proceeding to spend money wherever he wants.\n\nThat $20 billion, I would love to see--I am not being coy. I would  rather have all of the Senators right here and say: Let's pass a bill  right now and say ``hell no.'' You know, a lot of that $20 billion is  going to the debt that has been built up in Argentina, and friends of  President Trump have…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…their more  than 700 supporters for honoring my mother on this day of advocacy, her  birthday.\n\nMr. Speaker, I urge all of my colleagues to join us in this important  effort. Let's pass H.R. 842, the Nancy Gardner Sewell Medicare Multi- Cancer Early Detection Screening Coverage Act and pave the way for a  world without cancer.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…together, both political parties.\n\nI want to thank Congresswoman Ocasio-Cortez for her leadership on  this issue and her bravery on this issue throughout this debate.\n\nNow, let's pass this in the House and make it the law of the land.  Give to the victims their day in court to hold those responsible and  continue to publish these images at their expense.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…bill, the No Corruption in Government Act to finally  ban Members of Congress from stock trading, stop government pay raises,  and extend the lobbying ban.\n\nMr. Speaker, let's pass this bill and get it to the President's desk.  Let's give the American people back their faith in democracy.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691381/congressional-stock-trading-ban"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…with this resolution. Let's not  protest the bridge that gets us there. Let's cross it and achieve the  results the American people expect from the Republican majority.\n\nLet's pass this and deliver a new golden age in America.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689890/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…targeted fix with a big impact. It cuts red tape  and keeps America's capital markets open and accessible for the next  generation of job creators.\n\nLet's green-light growth. Let's pass this bill and keep America's  strong economy.\n\nMr. Speaker, I ask all of my colleagues to join me in supporting H.R.  3343.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693854/greenlighting-growth-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…sanity, and  basic fairness. It secures the future of our economy and our safety  net.\n\nLet's choose the path that has been tested and proven to work. Let's  approve this rule. Let's pass the One Big Beautiful Bill Act, and let's  get this country back on track.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…occur again.\n\nThis bill passed the House unanimously last December, and I look  forward to its timely passage once again so that we can get it to the  Senate.\n\nMr. Speaker, let's pass this very critical bill, H.R. 1082, and I  reserve the balance of my time.\n\nMr. BILIRAKIS.  I am very proud to serve  under his leadership.\n\nMr. BILIRAKIS. Mr. Speaker, in…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…American public as pawns in this  partisan gamesmanship.\n\nSo, literally, I think the Senator knows me. He knows I am saying  this in good faith: Please do not object. Let this bill pass so the  House can come back, and the President can sign this into law, and  these good people who are being forced to work or who have been  furloughed can get the pay…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bill to the floor for a  vote. Not only is it supported widely by Members in this body but a  poll showed that the American people support this proposal by a 3 to 1  margin. Let's pass this legislation and restore a dose of sanity to  politics in this country.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…must-haves, not on  the nice-to-haves. These stations are not only nice-to-have to some,  they are not-nice-to-have to most, and they are certainly not must- haves.\n\nMr. Speaker, let's pass this rescissions package. Let's get on our  way to having some accountability for the American people and codify  President Trump's spending reductions into law.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…with us in this Congress. In  both instances, the House of Representatives affirmed that only U.S.  citizens should vote in Federal elections.\n\nLet's add voter ID to it. Let's pass the SAVE America Act. Let's send  it over to the Senate and let the Senate move this legislation to the  President's desk.\n\nMr. ROY. Mr. Speaker, that was a whole lot of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Energy and Commerce Committee family, who tragically lost his life,  as has been said, in an awning accident. I thank his family for joining  us here today.\n\nMr. Speaker, let's pass this good bill in his memory, and I yield  back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692747/awning-safety-act-of-2025"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…staff, Republican and Democratic staff, worked up and through  Christmas and after Christmas to get this done. These men and women are  outstanding. They do a great job. Let's pass this great bill for  America.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Act is a proinnovation, profreedom, and  progrowth piece of legislation. It is a bipartisan solution to a global  challenge, empowering U.S. markets to lead, not follow.\n\nLet's pass this bill and secure American financial leadership in the  global digital economy. I encourage all my friends in this body to  unequivocally vote ``yes'' on this bill.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…fund DEI musicals in Ireland and no more tax dollars to fund  electric vehicles in Vietnam.\n\nTaxpayers, Mr. Speaker, have said enough is enough. I say enough is  enough. Let's pass this bill, Mr. Speaker, and let's go get them.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692531/rescissions-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Mr. Chair, I thank Chairman Guthrie for his work on this important  issue, and I urge my colleagues on both sides of the aisle to support  this legislation.\n\nMr. Chairman, let's pass this bill. Let's secure our borders. Let's  stem the tide of the growing fentanyl crisis, and let's save lives.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…over and over and over again.  This is how it is playing out.\n\nAs to these bills, I reiterate there is not one Republican Senator  objecting to them. Bring them forward. Let's pass them now. If there  are problems, I don't know what they are, why they would arise. They  are on the Democrat side, not ours.\n\nBut that is not our problem. It shouldn't be…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]