[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Donald Trump's Department  of Justice. We know that Jeffrey Epstein in 2008 was given a generous  nonprosecution agreement for sex trafficking charges. That agreement  let him continue his criminal activities, and that agreement was  offered by Alexander Acosta, who is Donald Trump's chosen Secretary of  Labor.\n\nThat is not all. We know that Donald Trump…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…making more money by laying off more people, having less services,  and charging larger interest rates. I am not on the side of big banks.  I am on the side of the people.\n\nLet me continue. The Republicans may claim this resolution also  prevents the OCC from updating its merger review procedures in the  future. Why would they want to do that with just one…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…development  through nature tourism, research, education, and outreach.\n\nOhio is proud to host our guests from near and far. We welcome  everyone during America's Birding Week. Let this continue for  generations to come.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…not receive taxpayer  dollars. Certainly, they should not receive taxpayer dollars that are  completely unregulated.\n\nIf we want to support parents and pregnant women, let's continue  helping them.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…proud to co-lead this bill, and I thank the gentleman from Long  Island (Mr. LaLota) for working with me to improve the SBA and simplify  the Federal contracting process. Let's continue to empower local  businesses and ensure that every entrepreneur has the opportunity to  succeed.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bipartisan…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…applied in  this fashion, there is a whole host of adjudicatory decisions by a wide  variety of Agencies across the Federal Government that are now fair  game.\n\nBut for now, let me continue to focus on the waivers in question that  Republicans are seeking to overturn. See, I rise not only in opposition  to this power play tonight, I rise in the interest of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…community leaders to push for policies that reflect that priority  because when we invest in men's health, we invest in everyone's future.  Let's keep moving forward. Let's continue this discussion as we all  become healthier, smarter, and more productive citizens, which will  ultimately make our Nation a stronger place.\n\nMcClellan), my dear friend…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…along with  the extraordinary accomplishments of members of other groups, and to  fight and resist bigotry of all forms, as George Washington talked  about.\n\nMr. Speaker, let us continue to fight for an America that is going to  be open to the contributions of everybody, and I appreciate Ms.  Wasserman Schultz' ability to bring before us again the Jewish…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…I will continue to push to make sure that residents in  my district and across Los Angeles County have every Federal resource  available to them to rebuild their lives. Let us continue to rebuild  with equity, care, and courage so that our communities are safer,  healthier, and more resilient for everyone.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…foreign shores.\n\nI urge my Republican colleagues and my Democratic colleagues--all my  colleagues--to speak up and stand with Ukraine as they have done for so  many years. Let us continue.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…The House Republicans are working to do that and, of course, they are  in a tizzy, Mr. Speaker, because they are finally being exposed for  covering it up for 4 years.\n\nLet them continue to come up and talk about all the deficit spending  that they created while they cite and talk about the One Big Beautiful  Bill Act. If you look at our scorekeeper here…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…socialism, House Republicans continue to deliver measurable and  substantive progress.\n\nI urge my colleagues to support the rule and the eight underlying  pieces of legislation. Let's continue delivering wins for the American  people.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696902/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the bill, put in a provision that says that at the end of this year,  those extra subsidies are going to end.\n\nCongresswoman Ocasio-Cortez says: No. Until you agree to let them  continue, to let anybody at any income level get subsidies, we are  going to shut the government down.\n\nThat is their third demand, and that is part of the $1.5 trillion.\n\nFinally,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…cases facing  $33,000-a-year premiums who have a salary of $90,000? What do we do for  them?\n\nSome people just want to continue the subsidies as they are--the  status quo: Let's continue the subsidies for 3 more years. And, yes,  the premiums will continue to rise. Yes, it will require taxpayers to  subsidize more and more. By the way, the policies we are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…have been many great generations of Americans dating back to  our founding, and I trust there will be many more. The patriotism and  humility of one inspires the next. So let's continue to cherish and  honor our ``greatest generation'' and the greatest of our generation.  Let's inspire this generation and the generations that follow by  recognizing these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…they meet the promise that was given to you: We are going to make  things more affordable.\n\nIt is not the Affordable Care Act, and that is the reality of the  math.\n\nSo let's continue to walk through parts of this.\n\nThe number of subsidized zero claims is fascinating. The enhanced  subsidies that came out after COVID were only supposed to be 5 years.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…all who wear the  uniform. We must ensure that our veterans and servicemembers are  treated with the dignity, care, and gratitude that they have so  courageously earned.\n\nLet us continue to build a country worthy of the sacrifices of our  veterans. May God bless our veterans, our fallen heroes, and our great  Nation.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…math  doesn't get you anywhere close. It may make you feel better. It may  make you feel better, but I am going to show you numbers that should  scare you half to death.\n\nLet's continue to try to run through healthcare expenses. We are  going to have to update our charts because we got one just a couple of  hours ago and didn't have a chance. It actually…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…trade war. It is just to remove the  tariffs on both sides. Remember what Mama Gump said:\n\nStupid is as stupid does.\n\nLet's don't be stupid. Let's don't have a trade war. Let's continue  to be friends. Let's get rid of these tariffs.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]