[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…particular, and it is  about the U.S. military and the leadership of the U.S. military.\n\nBut I want to kind of set the stage here a little bit. The United  States has the most lethal military in the history of the world. The  President presiding right now has experienced that as a U.S. Navy SEAL,  I myself as a pilot flying off of an aircraft carrier in…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…voice my strong  support for the War Powers Resolution introduced by Senators Schiff,  Kaine, Wyden, and Sanders.\n\nOver the past month, the United States has carried out four lethal  strikes on boats in the Caribbean, reportedly killing 21 individuals.  These attacks have been retroactively explained by the President's  unilateral declaration that the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…clear: I, too, was in this Chamber as the events unfolded, and what  happened on January 6, 2021, was in fact horrible, brutal, frightening,  violent, and in some terrible cases lethal.\n\nTo all members of law enforcement who responded that day and to their  families--but especially to the Capitol Police--thank you. We are  grateful to you. We cannot repay…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…2025, the U.S. Treasury Department took a positive  step. It sanctioned the leader of the Rapid Support Forces and the  leader of the Sudanese Armed Forces for their armies' lethal attack on  civilians in Sudan. But more needs to be done.\n\nCease-fire after cease-fire has failed. Peace negotiations have  stalled, and outside countries--the UAE, Turkey,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…assessment       of possible ties between officers and hate groups. It       modernizes data systems across agencies and ensures       transparency around school-based arrests, less-lethal       weapons, and disciplinary actions.\n\nRepealing or defunding this law would not make the District       safer. It would restore outdated and harmful practices that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…and seek our approval.\n\nCurrently, the administration is waging a secret war against a secret  list of unnamed groups that they will not tell us about. There have  been four lethal strikes against boats in the Caribbean. The  administration wrote us a letter--wrote this body a letter--about what  they were doing in September. They said they considered…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…about helping law  enforcement, but if that were true, the bill would mention law  enforcement. It doesn't. Law enforcement agencies already have the  ability to procure less-lethal tools and are already exempt from many  Federal firearm requirements.\n\nLet's talk about who opposes this bill. It is opposed by Brady,  Everytown for Gun Safety, GIFFORDS,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700038/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…on  our watch. If you haven't noticed Ukraine's struggle against the  spiderweb of tyranny fostered by Russia, China, Iran, Belarus, and  North Korea, it is real, and it is lethal.\n\nUkraine is in a historic fight now, not of her own choosing but for  her very survival. The poorest nation in Europe has fought back  mightily against the third largest military…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Mr. JOHNSON of Georgia. Mr. Speaker, I rise in opposition to this  bill because it would make us less safe. Police already have access to  less-than-lethal weapons like tasers. They don't need a change in  the law. That is not an excuse for changing the law.\n\nThis bill expands access to dangerous, prohibited individuals by  stripping…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700040/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Ospreys, and attack helicopters; the MV Ocean Trader, a floating base  designed for special operations; reaper drones, Harriet jets, and fifth  generation fighters--incredibly lethal aircraft.\n\nBut this is not all. The largest aircraft carrier ever built, the USS  Gerald R. Ford is on its way right now from the Mediterranean. This  means we will see upward…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…line.\n\nHe was reflecting a familiar theme: that until President Trump thumbs  his nose definitively at a Court ruling, then his attacks on democracy  are troubling but not lethal. It is normal politics up until that  dramatic confrontation between the executive branch and the judicial  branch, for which the Constitution, as we know, really has no  prescribed…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…would rip a dangerous new loophole in the Gun  Control Act by changing the definition of firearm throughout the entire  criminal code to exclude from coverage certain less-than-lethal but  still highly dangerous weapons, such as tasers, which have been  identified as a contributing factor in more than 500 deaths throughout  the United States of America.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…legislature could ban or regulate the use of silencers, and silencers  are broadly used by killers, by criminals who are trying to hide the  fact that they are engaged in criminal, lethal conduct.\n\nOn April 7, the DOJ announced that it was repealing a policy from the  Biden administration that said simply this: If you are a gun dealer and  you are engaged in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Trump had signed a secret directive  ordering the Pentagon to conduct maritime strikes on drug boats.  Secretary Hegseth then signed an execute order, or EXORD, directing  lethal military strikes against alleged drug boats. He has refused to  submit that EXORD to Congress despite legal requirements for him to do  so. By not following a statutory requirement…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…fair pay, raises, pensions, and the  like because, gosh knows, it is not easy to be a teacher. It is  certainly easier to be a teacher when you are safe from a deadly and  lethal virus that killed a million Americans.\n\nMr. Speaker, to reflect on our present time and the moment we find  ourselves in, it is right and fair for us, and for me as a Member…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…leading cause of  death for American adults between 18 and 45 years of age. That is  because it is cheap to make, easy to transport, and so potent. Just a  few milligrams can be lethal.\n\nAddressing the spread of illicit and illegal fentanyl-related  substances has been a top priority not only for myself but for many  other colleagues in this House. It is…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Maduro is an authoritarian thug. He reduced a once-prosperous  neighbor of America to an impoverished vassal of Cuba, Russia, Iran,  and China. He profited from the flow of lethal drugs to America. He  spat in the face of Venezuelan voters. And, until very recently, he  slept in peace while they starved.\n\nA Western Hemisphere without him or his ilk in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…part to  the increasing presence of fentanyl and fentanyl analogues which are  approximately 100 times more potent than morphine and 50 times more  potent than heroin. The lethal dose of fentanyl is just 2 milligrams or  about four grains of sand.\n\nA loophole that the cartels have tried to use to traffic their  illicit fentanyl into our country is by…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…support the warfighter.\n\nThis bill revitalizes the defense industrial base and American  manufacturing, supports a well-deserved pay raise for our  servicemembers, creates a more lethal and agile force to counter our  adversaries, and secures our Nation's borders, all while saving  taxpayers over $20 billion through cutting inefficient programs and  government…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…technologies with unmet operational  needs.\n\nAs chairman of the Subcommittee on Tactical Air and Land Forces, we  have ensured this bill delivers on maintaining a capable and lethal  fighting force by authorizing over $38 billion for the development,  procurement, and modification of aircraft, including full funding for  the 6th generation F-47 and F/A-XX…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695147/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…FITZGERALD. Mr. Speaker, I rise in support of the resolution and  in support of H.R. 2189, the Law-Enforcement Innovate to De-Escalate  Act. This bill will put lifesaving, less lethal technology in the hands  of more law enforcement and public safety officers.\n\nWhen the Gun Control Act of 1968 was enacted more than 50 years ago,  it was not written with…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…about time that we support the Law-Enforcement Innovate to De- Escalate Act. This crucial legislation ensures that law enforcement  officers have access to the best, less-than-lethal technologies for de- escalation.\n\nUnder current law, certain new less-than-lethal technologies are  included under the National Firearms Act, NFA, a law designed to  regulate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700029/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. Speaker, I rise today in support of H.R. 2189, which includes the  Innovate Less Lethal to De-Escalate Tax Modernization Act, led by  Congressman   David Schweikert.\n\nThis legislation shines a bright light on how our laws actually work  in the real world, where…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…authorities have shut  down the internet and the phone service. They have cut citizens off  from one another and from the outside world. Peaceful protesters have  been met with lethal force.\n\nAlthough the regime has shut down nearly all communications, we are  seeing reports estimating that over 12,000 innocent civilians have been  killed. More than 18,000…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…programs.\n\nThis amendment would also reduce naval reactors by over $1 billion,  again, almost a 50 percent reduction of the account, creating cascading  impacts to America's most lethal and capable naval assets, our  submarines and aircraft carriers. These are only but two examples of  the 54 account reductions proposed by the amendment.\n\nFor these reasons,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…have increased pay for our troops. We are making  generational investments in our defense industrial base. We are filling  our stockpiles. We are making our soldiers the most lethal fighting  force the world has ever seen.\n\nWe will never apologize for keeping America safe. Thankfully, Mr.  Speaker, the people of America are now seeing through Biden's 4…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Madam Chair, this year's NDAA builds on an outstanding  year for our military and ensures our servicemembers are a lethal and  ready force and that they are going to be a force that is going to be  able to project power and will be capable of confronting threats from  our southern border to our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695131/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…That is the emergency we  have. That is an emergency.\n\nThis opioid crisis is fundamentally different from any past drug  epidemic. These substances are engineered to be highly lethal. The  amount that you can fit on a pinhead could kill a person. Unknown  exposure just from somebody coming to assist somebody could kill  somebody. These are weapons of mass…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mike Carey", "party": "Republican", "sentence": "…a chemical used in the preservation of meat and  fish, which in high concentrations is deadly if ingested.\n\nIn fact, one spoonful of the chemical is one hundred times more  lethal than other poisons. High concentrations of some chemicals can be  harmful if used improperly, which is why they are usually highly  regulated or banned for sale to consumers.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690217/youth-poisoning-protection-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the call of duty with unwavering courage  and honor. Through centuries of conflict and change, they have earned  their reputation as one of the world's most disciplined and lethal  fighting forces, steadfast in their mission to defend our freedom.\n\nIn Missouri's 4th Congressional District, we are proud to be home to  two outstanding detachments of the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696572/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}]