[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…deference to the  violence that took place 5 years ago, we run the risk of abdicating our  responsibility to the American people to safeguard our Nation's core  principles of life, liberty, and the pursuit of happiness.\n\nThe insurrection of January 6 could very well be the worst domestic  attack on our government since the Civil War, which ended in 1865.\n\nThat…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…stimulate  and embitter. Hence likewise they will avoid the necessity of those  overgrown military establishments which, under any form of government,  are inauspicious to liberty, and which are to be regarded as  particularly hostile to republican liberty. In this sense it is, that  your Union ought to be considered as a main prop of your liberty,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Defense for George Bush I, he worked  for Haliburton company whose purpose is earning money off drilling, and  refining dirty crude oil from everywhere in the world. Oil is not  liberty. But its presence has impacted liberty throughout modern  history. Osama bin Laden was intelligent. He understood the finances of  Middle East oil interests. I believe he…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…This is about fighting lawlessness. The 14th Amendment to the  Constitution, to which we all pledge fealty, is pretty straightforward:\n\nNo person shall be deprived of life, liberty or property       without due process of law.\n\nThat was the clause that the U.S. Supreme Court unanimously  interpreted to mandate the return of Mr. Abrego Garcia.\n\nThe President…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the emergence of another King, another despot.  They created checks and balances, separation of powers, an independent  judiciary. They understood that the greatest threat to liberty wasn't  foreign invasion; it was the concentration of power in the hands of one  person or faction.\n\nThis President has systematically dismantled these safeguards in his…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…without an individualized       hearing strips them of due process and violates one of our       most fundamental constitutional rights: the presumption of       innocence. Liberty cannot be taken away solely based on       accusation, without more.\n\nWe are not aware of a single jurisdiction in the country       that allows detention based solely on…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…birthplace, of American  slavery; and the birthplace of Thomas Jefferson, who wrote that all men  are created equal and endowed by their creator with the unalienable  rights of life, liberty, and the pursuit of happiness. He excluded  nearly half a million enslaved men and women, indeed, all the women who  resided in the Thirteen Colonies, including in his beloved…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…crypto because he saw it as a way to pad his pockets.\n\nDuring the campaign trail, Trump ramped up his crypto involvement. In  September 2024, he and his family launched World Liberty Financial, a  crypto trading platform. Days before the Inauguration, Trump launched  his memecoin which he later used to offer access to the White House to  the highest bidder,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…independence or his judicial temperament; he is here because of his  ideology.\n\nMr. Tung embraces an extreme and rigid view of the Constitution that  rejects both equality and liberty. He has made it clear that under his  constitutional philosophy, there is no protection for rights that most  Americans take as fundamental, including the rights to reproductive…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…United greatly harmed our body politic, we will not  let it prove fatal. In a 1938 address to Congress, President Franklin  D. Roosevelt issued a stark warning: `` . . . the liberty of a  democracy is not safe if the people tolerate the growth of private  power to a point where it becomes stronger than the democratic state  itself.''\n\nHouse Democrats…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…in just about everything. Our  basketball arena, FedExForum, has made the city the home of an NBA  team. That is because of Fred Smith. Our college football team plays in  Liberty Stadium. He has pledged $50 million to improve that stadium and  bring it up to higher standards. We have a golf tournament that is the  FedEx St. Jude Golf Classic.\n\nHe had…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…that. It is sad to say it is his second term, and he  doesn't understand that the Declaration of Independence is about this  idea that we are entitled to the rights of life, liberty, and the  pursuit of happiness, and that is for all of us that are here.\n\nLet's go through some of the things that he did manage to do and some  of the havoc that he has managed…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…INDIANA\n\nClarksville Police Department\n\nBloomington Police Department\n\nRockville Police Department                                     IOWA\n\nPolk County Sheriff's Office\n\nNorth Liberty Police Department: ``Use of Force Report''       says Electronic Control Devices are not a ``deadly force.''                                    KANSAS\n\nRiley County Police…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Ms. SCANLON. Mr. Speaker, on January 22, the Trump administration  forced the National Park Service to remove panels at Independence Hall  National Park, the cradle of our liberty, telling an important chapter  in George Washington's Presidency.\n\nEarly in our Nation's history, Philadelphia was our Nation's Capital,  and when Washington moved to the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699712/rewriting-history"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…us.\n\nAmericans, please hear me: Who are we? Who are we if we let Trump  abandon our core principle that no one in this country will be  imprisoned unlawfully? This is about liberty, and there is nothing more  important than our liberty.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691378/suspending-the-writ-of-habeas-corpus"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Medal, the Asiatic-Pacific Medal, the Philippine  Liberation Ribbon, and the Victory Medal. These honors reflect his  direct contribution to the global fight for peace and liberty during  one of the most defining conflicts of the 20th century.\n\nFollowing his military service, Lewis continued to embody the values  of duty, service, and community. He…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694998/recognizing-lewis-m-unterman"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…inclination to make war upon nations that did them no wrong after they  were informed it was a requirement of the Koran.\n\nIn Jefferson's papers in 1786, he wrote: ``We took the liberty to  make some inquiries concerning the ground of their pretensions to make  war upon nations who had done them no injury, and observed that we  considered all mankind as our…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…community.\n\nHis passion for championing the rural and ranching communities of  Sierra County sets him apart as a leader,  and his steadfast commitment to safeguarding life, liberty, property,  and Sierra County's community values is unparalleled.\n\nSheriff Fisher is known for being a trusted leader and has earned the  respect of those who have the privilege…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Congressional Patriot Award. Gary has dedicated his life to faithfully  serving his community and country.\n\nBorn in Texarkana, Texas, Gary attended school in the Texarkana and  Liberty-Eylau districts before pursuing higher education at Texarkana  College, Texas A&M Commerce, and Texas A&M--Texarkana, where he earned  a Bachelor of Science in Business with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…throughout history: Was the Sun rising or was the Sun setting?\n\nIn that moment, a fledgling Nation hung in the balance, and even the  Founding Fathers did not know whether liberty would prevail.\n\nFor far too long, Mr. Speaker, the American people have felt the same  uncertainty, years of what many viewed as America last policies that  left families…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…1776, Americans can trace a shared heritage--a heritage  of freedom--to that founding document proclaiming our unalienable  rights and self-evident truths: equality, life, liberty, and the  pursuit of happiness.\n\nThe Declaration of Independence launched the American experiment that  continues from one generation to the next. This experiment is unique…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Convention, Eagle Forum, Family Watch International,  Faith and Family Foundation, Independent Women's Forum, Students for  Life Action, the Family Policy Alliance, and the Faith and Liberty in  the Nation's Capital organization all were present.\n\nI, quite frankly, since I have been here, haven't seen such a  groundswell of so many conservative nonprofit groups…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…approachable in their style, showing the same love and grace as our  risen Lord and Savior.\n\nHaving been a firefighter for 5 years before entering full-time  ministry, this Liberty University alum is tough-minded, disciplined,  and steady in his leadership. He is authentic and genuine and always  faithful to preach the truth of the inherent Word of God.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690047/welcoming-guest-chaplain-dr-michael-gossett"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school football  team in Ohio's 5th Congressional District. The young men of the Liberty  Center High School football team have represented their school ably on  their way to achieving the Division V State Football Title. In their  effort to surpass all other…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697967/recognizing-liberty-center-high-school-on-winning-the-division-v-state-football-championship"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Bartholomew is  also a leading figure in interfaith dialogue among Judaism,  Christianity, and Islam. His presence here reminds us that faith has a  vital role to play in protecting liberty and human dignity.\n\nMr. Speaker, it is my honor to welcome him to Washington and to thank  him for his steadfast leadership in advancing religious freedom around  the world.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…wilderness of far Downeast Maine after  America won its independence was a hero of that conflict, General John  Crane. A Massachusetts carpenter, Crane was a leader of the Sons of  Liberty and was the only rebel injured during the Boston Tea Party.\n\nCrane recovered and was commissioned as a Continental Army artillery  officer who distinguished himself at Bunker…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "French Hill", "party": "Republican", "sentence": "…with New Yorkers. He pledged to ``replace the frigidity of rugged  individualism with the warmth of collectivism.''\n\nHere in our Nation's semiquincentennial, 250 years of liberty, the  new mayor rejected the fundamentals of American hard work and the  extraordinary benefits of markets that have freed billions from hunger  and poverty around the globe.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…soon look like when  freedom-loving Americans flee for their lives and Sharia law becomes  the rule of law in the five boroughs in New York City.\n\nNew York City, the symbol of liberty and freedom in the new world, is  now turning into the same oppressive hellhole freedom-loving immigrants  have fled from for centuries. They have been running from it. But…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, today I rise to recognize an inspiring  moment in our community, the Spokane Impact's first home match this  past Saturday at the HUB Sports Center in Liberty Lake.\n\nThe Spokane Impact is one of the founding teams of the Inspire Soccer  League, the first-ever national soccer league created specifically for  athletes with intellectual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…for quite some time.  In fact, it has been pointed out that our ideas are old. I would point  out that my colleague is right. Our ideas are old in the sense that  individual liberty and fiscal responsibility are ideas that have  withstood the test of time. That is something that conservatives  recognize.\n\nThe city of Washington, D.C., does not adhere…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]