[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…exempt any platform that is the network for  crypto transfers from any regulation at all. That might be attractive  to my Republican colleagues because Donald Trump's World Liberty  Financial is one of those platforms.\n\nThe CLARITY Act would defund white-collar police by shifting most of  these coins from the well-staffed, well-funded SEC to the much…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Seattle's first Fair Housing Act, establishing protection for  tenants of protected classes and marginalized communities. A lifelong  champion for racial justice, McKinney founded Liberty Bank, Seattle's  first black-owned financial institution which countered racially biased  restrictions on loans to African Americans and expanded opportunities  for homeownership…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Islam--and his presence in our  Nation's capital is an opportunity to highlight the positive role  religious leaders of his stature bring to the cause of peace and  religious liberty.\n\nThe true peacemakers of history not only sought to reduce conflict  but also showed compassion toward those who persecuted them. Patriarch  Bartholomew fits that definition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…without an individualized       hearing strips them of due process and violates one of our       most fundamental constitutional rights: the presumption of       innocence. Liberty cannot be taken away solely based on       accusation, without more.\n\nWe are not aware of a single jurisdiction in the country       that allows detention based solely on…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…venture. This is the  President of the United States going to the UAE and asking a foreign  government to invest $2 billion in his personal business. The company  is called World Liberty Financial. On World Liberty Financial's  website, it says the majority of the company is owned by Donald J.  Trump.\n\nThis was a pretty exceptional request to make because…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…INDIANA\n\nClarksville Police Department\n\nBloomington Police Department\n\nRockville Police Department                                     IOWA\n\nPolk County Sheriff's Office\n\nNorth Liberty Police Department: ``Use of Force Report''       says Electronic Control Devices are not a ``deadly force.''                                    KANSAS\n\nRiley County Police…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…us.\n\nAmericans, please hear me: Who are we? Who are we if we let Trump  abandon our core principle that no one in this country will be  imprisoned unlawfully? This is about liberty, and there is nothing more  important than our liberty.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691378/suspending-the-writ-of-habeas-corpus"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Though our actions didn't always live       up to our ideals, we stood for simple but powerful ideas that       people everywhere embraced: democracy, equality, individual       liberty, and human rights.\n\nThat moral foundation is now in grave danger. The challenge       comes from within, as President Trump and his administration       have assaulted the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…proud of  the notion that we are a government of the people, by the people, and  for the people.\n\nI am proud to know that the pledge has in it the notion that there  should  be liberty and justice for all. I am proud to know that we have these  words that indicate to all that all persons are created equally and  endowed by the Creator with certain inalienable…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…reminded why  I first ran for office and why I continue fighting for my community.\n\nI was raised to believe that the United States of America was built  on the principles of liberty, democracy, and equal opportunity. For  more than two centuries, those ideals have guided us, creating a Nation  where everyone has the right to pursue their dreams, serve…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690202/standing-for-america"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Kettle Run, and I look forward to watching  all that they will accomplish in the future.\n\nI congratulate the class of 2025 of Kettle Run High School.                Recognizing Liberty High School Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to congratulate the 347  graduates of Liberty High School's class of 2025.\n\nThe graduates, as Eagles,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…unemployed, living either       with my parents or in a nursing facility.\n\nHome- and community-based services represent American       values of equal opportunity to pursue life, liberty, and       happiness. They represent our societal commitment to       providing and promoting those opportunities to all citizens,       and these values and commitments--manifested…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rise to urge Speaker Johnson to not allow his worship  of one man to rewrite the history of that horrible day. Congress must  show respect for those who defended democracy, liberty, and Article I  of the Constitution of the United States right here in the House of  Representatives, defending the vote that occurred in 50 States across  this union. We…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…told the mob to ``stop the steal'' and to ``fight  like hell.'' Then, he deployed them to the Capitol of the United States  of America, the beacon of democracy, freedom, and liberty for all the  world, and the Capitol was breached.\n\nThere, of course, was no steal, and the courts said so in court after  court after court after court. However, unlike Al…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the price of a six-pack to  $19.\n\nThe President proclaimed Liberation Day as a declaration of economic  independence, but this is doing nothing to protect the right to life,  liberty, and the pursuit of happiness. The only thing these tariffs  will liberate are rent money and mortgage payments from bank accounts,  kids' college savings from investment…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…appreciate his friendship.\n\nWe convene here before the Fourth of July. I think it is worth  recalling those unalienable rights that sparked this American  experiment: life, liberty, and the pursuit of happiness. Our Founders  built this Republic on the promise of freedom: the freedom to build, to  strive, and to pursue our own dreams. But that promise…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…family, community and  world and act to bring about a better future for others.\n\n``A servant leader applies true principles such as: public and  private virtue, natural law, liberty, life, personal responsibility, et  cetera.\n\n``A servant leader has the ability to build coalitions and inspire  others to follow as first among equals. They see where things…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Missouri's 7th District, for their commitment to God and  country, and to serve and protect us against our enemies. They serve a  noble cause. May they ever carry the torch of liberty and continue to  serve honorably for the next 250 years.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…issuers a regulatory  framework for strong reserves, real redemption rights, and smart risk  management.\n\nFinally, the Anti-CBDC Surveillance State Act is about protecting  liberty. It blocks the Federal Government from launching a central bank  digital currency that could be used to track or control how law-abiding  citizens spend their dollars.\n\nTogether,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…to join me in  supporting this commonsense legislation. Together, we can keep America  at the forefront of innovation and ensure that our digital future is  one defined by liberty, accountability, and American leadership.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692731/deploying-american-blockchains-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…throughout history: Was the Sun rising or was the Sun setting?\n\nIn that moment, a fledgling Nation hung in the balance, and even the  Founding Fathers did not know whether liberty would prevail.\n\nFor far too long, Mr. Speaker, the American people have felt the same  uncertainty, years of what many viewed as America last policies that  left families…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…approachable in their style, showing the same love and grace as our  risen Lord and Savior.\n\nHaving been a firefighter for 5 years before entering full-time  ministry, this Liberty University alum is tough-minded, disciplined,  and steady in his leadership. He is authentic and genuine and always  faithful to preach the truth of the inherent Word of God.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690047/welcoming-guest-chaplain-dr-michael-gossett"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…ideals and shattered through glass ceilings.\n\nFrederick Douglass was born into slavery in 1818 and courageously  escaped bondage in 1838. He built a life dedicated to truth, liberty,  and justice.\n\nHe became a journalist in Rochester, New York, and launched The North  Star using his own money, giving voice to the voiceless in the years  before the Civil…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…with a great deal of pride that I rise  to pay a very special tribute to an outstanding high school football  team in Ohio's 5th Congressional District. The young men of the Liberty  Center High School football team have represented their school ably on  their way to achieving the Division V State Football Title. In their  effort to surpass all other…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697967/recognizing-liberty-center-high-school-on-winning-the-division-v-state-football-championship"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…At 78 years old, Jimmy Lai will likely die in jail. This is a tragedy  for freedom in Hong Kong and the People's Republic of China--and one  that reminds us that the work of liberty, the work of freedom, the  sacrifice and the struggle required to maintain it are not cheap.\n\nOur Nation was built on a yearning for the kind of freedom from  government repression…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…don't have a legal team on retainer who gets crushed first.\n\nOvercriminalization is one of the most destructive features of the  modern Federal leviathan. We cannot restore liberty, shrink government,  or protect due process unless we first expose the scope of the problem  and that is what this bill attempts to do.\n\nI am so pleased to be a sponsor, but…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the home front who taught our kids  and fueled the arsenal of democracy.\n\nOur generation salutes the Greatest Generation for the defeat of  fascism  and the preservation of liberty and freedom.                           honoring floyd brantley\n\nMr. HILL of Arkansas. Madam Speaker, one of those Pacific vets is my  friend Floyd Brantley of Conway, Arkansas,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Bartholomew is  also a leading figure in interfaith dialogue among Judaism,  Christianity, and Islam. His presence here reminds us that faith has a  vital role to play in protecting liberty and human dignity.\n\nMr. Speaker, it is my honor to welcome him to Washington and to thank  him for his steadfast leadership in advancing religious freedom around  the world.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Communist Party have chosen  repression over freedom, indoctrinating their citizens to embrace  socialism and communism, ideals fundamentally opposed to American  values of liberty, freedom, and self-determination.\n\nNow, we are seeing those same authoritarian efforts reach into our  classrooms. While some are now closed, the CCP established Confucius…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…trafficking, confront the  malign influence of the Chinese Communist Party, and counter terrorism.\n\nWe reinforce democracy and human rights efforts, and we defend  religious liberty. As both a moral duty and vital American interest, we  will not tolerate religious persecution and attacks on faith. Upholding  those values strengthens American leadership…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]