[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…of the Communist bloc, our forebearers met tyranny head- on. We met the threats that we faced and stood together on our Nation's  founding commitment of life, liberty, and the pursuit of happiness,  year after year, in the face of constant threats.\n\nAmerican liberty has been a multigenerational effort, admired around  the world with each generation standing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…violence that took place 5 years ago, we run the risk of abdicating our  responsibility to the American people to safeguard our Nation's core  principles of life, liberty, and the pursuit of happiness.\n\nThe insurrection of January 6 could very well be the worst domestic  attack on our government since the Civil War, which ended in 1865.\n\nThat insurrection…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…America or people who have come to the United  States of America. It is about people who just happen to be passing  through.\n\nIt is about the right to life, liberty, and the pursuit of happiness,  and especially life, because without life, you cannot have the liberty  and the pursuit of happiness.\n\nAll of these people have in common the fact that they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…note in our Declaration of Independence written 250  years ago, which promised that all men were endowed by their creator  with the inalienable rights of life, liberty, and the pursuit of  happiness. Thomas Jefferson didn't mean all men. He didn't include the  men, women, and children that he owned, including his children and the  mother of those children.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…to say it is his second term, and he  doesn't understand that the Declaration of Independence is about this  idea that we are entitled to the rights of life, liberty, and the  pursuit of happiness, and that is for all of us that are here.\n\nLet's go through some of the things that he did manage to do and some  of the havoc that he has managed to wreak.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…self-evident, that all men are       created equal, that they are endowed by their Creator with       certain unalienable Rights, that among these are Life,       Liberty and the pursuit of Happiness.\n\nHow can you have life, liberty, and the pursuit of happiness without  health? Health is at the core of life. Health is at the core of true  liberty. Health…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…we have these  words that indicate to all that all persons are created equally and  endowed by the Creator with certain inalienable rights, among them  life, liberty, and the pursuit of happiness.\n\nI am proud that we would receive and have the Statue of Liberty. The  statue speaks to the world about who we are. It really symbolizes the  United States…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…six-pack to  $19.\n\nThe President proclaimed Liberation Day as a declaration of economic  independence, but this is doing nothing to protect the right to life,  liberty, and the pursuit of happiness. The only thing these tariffs  will liberate are rent money and mortgage payments from bank accounts,  kids' college savings from investment accounts, and retirement…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''\n\nMr. Speaker, I want to lock in for just a moment on that aspirational  objective, the pursuit of happiness. When it comes to everyday  Americans, this one…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…celebrate the 250th  anniversary of next year says that: All men--and I would add women--are  endowed by their creator with certain inalienable rights: life,  liberty, and the pursuit of happiness. Life is number one.\n\nWhen the Federal, State, and local governments work together with the  private sector, our research hospitals, the nonprofit community,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Congressman Takano for recognizing me  and for hosting this important discussion in front of the American  people.\n\nOur country was founded on the values of life, liberty, and the  pursuit of happiness, but who are we as a country if we backtrack on  those founding values? We would not be the country that inspired our  parents, our neighbors, and our grandparents…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Democrats here are focused on a bill to lower costs  for tens of millions of Americans and prevent many from losing  healthcare.\n\nMr. Speaker, we speak about life, liberty, and the pursuit of  happiness. We can't be free, it is hard to be happy, and lives are cut  short with no healthcare.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…slavery; and the birthplace of Thomas Jefferson, who wrote that all men  are created equal and endowed by their creator with the unalienable  rights of life, liberty, and the pursuit of happiness. He excluded  nearly half a million enslaved men and women, indeed, all the women who  resided in the Thirteen Colonies, including in his beloved Monticello.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…can trace a shared heritage--a heritage  of freedom--to that founding document proclaiming our unalienable  rights and self-evident truths: equality, life, liberty, and the  pursuit of happiness.\n\nThe Declaration of Independence launched the American experiment that  continues from one generation to the next. This experiment is unique in  the 6,000-year…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…government. It is an inherent natural right. As our Founders  recognized, we are endowed by our creator with certain inalienable  rights, that among them are life, liberty, and the pursuit of  happiness.\n\nOne of the ways we pursue happiness is by transacting with each  other: We buy things, or we make money from selling things. In the  natural order, there…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…friendship.\n\nWe convene here before the Fourth of July. I think it is worth  recalling those unalienable rights that sparked this American  experiment: life, liberty, and the pursuit of happiness. Our Founders  built this Republic on the promise of freedom: the freedom to build, to  strive, and to pursue our own dreams. But that promise only thrives…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty, and the pursuit of happiness. That to secure these  rights, governments are instituted among men, deriving their just  powers from the consent of the governed.''\n\nWhat was the first right…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of liberty. We owe our freedom to those who answered the call and never  returned. In America--the greatest country on Earth--our founding  promise of life, liberty, and the pursuit of happiness is preserved  only through the sacrifice of our heroes.\n\nThe American flag flies in red, white, and blue--each color rich with  meaning. Blue stands for vigilance…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691585/recognizing-the-service-of-those-who-gave-the-ultimate-sacrifice-memorial-day-2025"}]