[{"senator": "Ed Case", "party": "Democrat", "sentence": "…of our government by cosponsoring my Legislative Branch  Independence Act.\n\nMy bill would amend the appointment processes for three key  legislative branch positions--the Librarian of Congress, the  Comptroller General and the Director of the Government Publishing  Office (GPO)--to provide that appointment and removal of their leaders  are the exclusive…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…here as an  immigrant speaking no English from very humble beginnings.\n\nI thank my teachers at Kaahumanu Elementary School, Koko Head  Elementary School, and especially the librarian at Koko Head Elementary  School who awakened my love of reading. They helped me to learn English  and helped set me on a course that ultimately led to the U.S. Senate.\n\nToday,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…celebrate an  extraordinary milestone in the democratization of public information,  as the Internet Archive marks their one-trillionth web page archived.\n\nFounded by digital librarian and MIT alumnus Brewster Kahle, the  Internet Archive first launched in San Francisco in 1996 with the goal  of providing ``Universal Access to All Knowledge'' by creating…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696412/recognizing-the-internet-archives-one-trillionth-web-page"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…faith, an exemplary  educator, and a library media specialist. She served in the Selma  public school system for 36 years where she shaped minds and uplifted  children. As a librarian, she was a strong advocate for reading,  initiating the Reading is Fundamental, RIF, program in 1973, delivering  books to children throughout Alabama, Mississippi, and Tennessee.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, President Trump fired the Librarian of  Congress just 1 year shy of completing her 10-year term. He also fired  the head of the U.S. Copyright Office, replacing them with his former  lawyers and current DOJ…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691272/attacks-on-library-of-congress"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…noise, and use them as propaganda machines  to spread disinformation and continue to divide our Nation.\n\nThe latest example is President Trump's removal of Dr. Carla Hayden  as Librarian of Congress, a respected public servant with decades of  experience, and his illegal installation of personal attorney, Todd  Blanche, in her place. He is not a librarian…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, I rise to call attention to the brazen  firing of our respected Librarian of Congress, Dr. Carla Hayden.\n\nLast week, she was ruthlessly fired by President Donald J. Trump. Dr.  Hayden is a model public servant who led the Library with dignity and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…CEO said this recognition reflects the trust placed in them by  educators, the hard work of their Fellows, and the resilience of the  students themselves.\n\nMoreover, Acting Librarian of Congress Newlen said the awardees this  year had a particular focus on family and community, something  Delawareans know is at the heart of our State's success.\n\nBeing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1234) to direct the Librarian of Congress to promote the more  cost-effective, efficient, and expanded availability of the Annotated  Constitution and pocket-part supplements by replacing the hardbound…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}]