[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…experiences. Books like ``The Hate U Give'' by  Angie Thomas, ``Beloved'' by Toni Morrison, ``Between the World and  Me'' by Ta-Nehisi Coates have been removed from classrooms and  libraries not because of their literary merit but because of the  discomfort they cause to those who wish to ignore the brutal realities  of race in America.\n\nThese bans are not merely…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…strong opposition  to S.J. Res. 7, the Congressional Review Act resolution that would  repeal the Federal Communications Commission's commonsense rule  allowing schools and libraries to use E-Rate funds--``E-Rate'' stands  for ``Education Rate funds''--to ensure that there is access to the  educational tools of a school or a library to every child in…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…supported.\n\nNearly 175 Nepali language books and around 250 Urdu language books  were received as donations by community members. This is a testament to  the value of public libraries as a resource to our communities and the  growing diversity of our region, as well.\n\nPublic libraries, including where our office hosts our office hours,  continue to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…funding for the arts, closing  down museums, grant programs, and after-school programs that teach  young people how to play music, how to play an instrument, and shutting  down libraries.\n\nIt is so healing when we turn on the radio. We want to go to a  concert. We go to an art performance because that is meaningful,  regardless of your political party. Everyone…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…2025 Library of  the Year by the National Library Service for the Blind and Print  Disabled, a division of the Library of Congress.\n\nThe Library of the Year award recognizes libraries that excel in  providing accessible reading materials and services to those with  visual, physical, or print disabilities. Libraries receiving this award  have a strong effectiveness…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…this latest move fits that mold.\n\nThe Library of Congress is the world's largest library and a symbol  of our commitment to free thought. We have seen growing attacks on  libraries and books nationwide. Now it seems even the Library of  Congress is not off limits.\n\nWhile personnel were fired, this is about power, who controls what  Americans read, learn,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691272/attacks-on-library-of-congress"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Museum and Library Services.\n\nLet's be clear. This is a direct attack on rural families, veterans,  caregivers, and children, including thousands of Delawareans who rely  on libraries not just for books but for help with job applications,  disability forms, and housing assistance.\n\nIn Dover, librarians are helping my neighbors navigate Social  Security…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690588/cutting-lifeline-of-institute-of-museum-and-library-services"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…and developing  participants' literacy skills and interest in public service. Through  programs such as the Little Library Program, they have partnered with  educators and libraries to provide resources for over 500 children to  develop strong literacy skills, It's About the Kids continues to be an  excellent asset to the constituents of TX-30. For the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…away  from their homes, because it was the only way they could access their  homework.\n\nNow, to combat that homework gap, Congress established a fund in 2021  for schools and libraries to loan Wi-Fi hotspots to students and  educators. The program was an enormous success, ensuring nearly 18  million students at over 10,000 schools and libraries could get…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…communities can provide modern, state-of-the-art facilities,  one that will ensure that all students have the right to read--with  evidence-based reading instruction, school libraries, books at home,  diverse materials, and the freedom to choose what to read.\n\nToday, we are failing our public schools because we are not investing  in them. For example,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…trying to dismantle every institution that informs, educates, and  inspires the American people.\n\nFrom Sesame Street to the Smithsonian, from symphony halls to small- town libraries, Republicans are waging a culture war on anything they  cannot control.\n\nTheir goal is simple: Erase facts, silence independent voices,  replace them with partisan noise,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…position she has held for more than 7  years.\n\nIn this position, Denise oversaw library services for 29  municipalities. This included the main library in Bellefonte, branch  libraries in Centre Hall and Phillipsburg, a world-class research  library, and a local historical museum in Bellefonte.\n\nIn 1981, Denise began her career at the Murrysville Library.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698534/recognizing-denise-sticha"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…coincides with the  2019 launch of a digital version of CONAN. Over the past 5 years, the  CONAN website has become an invaluable resource to individual citizens,  schools, libraries, and, of course, Congress.\n\nIt has received more than 28 million visits since it was created and  features hundreds of pages of constitutional analysis and content. The…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…mission of the library system remains the same: to provide  materials and information services for lifelong learning, enrichment,  and reading.\n\nIt has often been stated that libraries aren't about the books but  about the people. Nowhere is that perspective more clearly evident, in  form and function, than in the Williamsburg Public Library.\n\nOn behalf…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…more than 20 years, Read Across America has been a nationwide  tradition, held annually on March 2 in honor of Dr. Seuss' birthday.  Across the country, thousands of schools, libraries, and community  centers bring young people together to experience the magic of books.  This celebration fosters a lifelong love of reading and reminds  students that, with…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688379/recognizing-read-across-america"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…community.\n\nDuring her tenure as a board member, Kathy continuously advocated for  the support and services of the Mono County Office of Education and  Mono County Public Libraries.\n\nWith the education board also serving as the county's library  authority board, Kathy worked tirelessly to support various local  libraries, including her beloved Coleville…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}]