[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…intergenerationally and painstakingly has built the North Atlantic  Treaty Organization, a global fortress of democratic nations.\n\nAcross Europe, from the ruins of World War I and World War II lie the  precious graves of 411,516 American soldiers and--no one knows  exactly--35 million to 50 million Europeans who died fighting or in the  crossfire.\n\nThese heroes and heroines…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…``no,'' he  said, over the next 3 years, it is going to add almost a trillion  dollars to the debt, and that is in the best case, the most rosy  scenario. Then he said: That is a lie.\n\nThis clock that we have that has the debt, it is still going up. DOGE  has not yet reversed it. I say that as a member of the DOGE Caucus who  wants to shrink the size of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…vote. The legislation before us makes a  mockery of that legacy.\n\nSince his defeat in the 2020 election, President Donald Trump and his  Republican allies have pushed the big lie of a stolen election. The  majority has tried to convince the American people of the lie that  noncitizens are a threat to our elections and are using that lie as an  excuse…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…been saying all       along: the math doesn't work without devastating Medicaid       cuts,'' Pallone said Wednesday in a statement. ``Republicans       know their spin is a lie, and the truth is they have no       problem taking health care away from millions of Americans so       that the rich can get richer and pay less in taxes than they       already…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…and hide. But we saw what  was done.\n\nWhat kind of monster shoots an unarmed, fleeing woman in the head?  What kind of monster watches the video of that crime and chooses to lie  to the American people as they defend the murderer and defame the  victim? How do we prevent ourselves from descending to their monstrous  depths?\n\nMr. Speaker, I will tell…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…said, this rule also includes the next step in a budget plan that would  cut taxes for billionaires at the same time that it cuts healthcare for  working people. The math doesn't lie. This budget plan requires $880  billion of cuts under the Committee on Energy and Commerce.\n\nMr. MAGAZINER. Mr. Speaker, the majority could cut literally every  program under…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689865/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…there. But many would like to  ignore the fact that it is a fragile and irreplaceable beauty that  lives along the Coastal Plain in order to search for oil and gas that  may lie beneath.\n\nThe battle has been the subject of many intense congressional debates  for decades. So far, we have been able to protect the Coastal Plain and  keep it intact, as…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Venezuelan people.\n\nThe people of Venezuela deserve free and fair elections.\n\nAnd then let's talk about how this entire setup for this gunboat  diplomacy was based on a massive lie to the American people. The Trump  administration said: This is about stopping drugs coming into the  United States that have done so much damage to our families.\n\nWell, we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…this day 5 years ago when this Chamber, the  people's House of the United States of America, was viciously attacked  by a violent mob.\n\nNo tweet, no post, no spin, no disgusting lie-filled website is going  to change the facts of the history of what happened on that day.\n\nI rise today to honor the men and women who with great courage and  sacrifice defended…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698536/a-somber-day-of-remembrance"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…either flying  missions or with boots on the ground, for a war not authorized by  Congress. Mothers and fathers of American sailors, marines, soldiers,  and pilots do not want to lie awake at night wondering if their kids  will be the ones who have to be deployed to yet another armed conflict,  this time in South America.\n\nLast month, we came to this body…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…year-old woman who was not the wife of Representative Cory Mills--and  that the alleged victim ``let officers hear Subject 1 [now identified  by MPD as Mills] instruct her to lie about the origin of her bruises .  . . Eventually, Subject 1 [who we now know is Representative Cory  Mills] made contact with police and admitted that the situation  escalated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…United States--by the way, it is not even  authority. It is a ceremonial function to certify the election.\n\nIt was Donald Trump, who was, in the beginning, the instigator of the  lie, the instigator of the call to people around the country who did  believe in him to come here and stop the steal and who culminated his  efforts with his speech at the Ellipse,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…enslaved Black men and poor  nonlandowning Whites who came together during Reconstruction to rebuild  this Nation, the backlash to that involved racial terror lynching, or  the lie of white supremacy and a rash of voter suppression laws that  completely ignored the 14th and 15th Amendments.\n\nThe backlash in the civil rights movement of Dr. King was a Southern…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…begins now.'' But in 100 days, since  Inauguration Day, ``King'' Donald has shown us that he sits on a throne  of fool's gold--one built on empty votes, unfulfilled promises, and lie  after lie after lie.\n\nIn just over 3 months, ``King'' Donald's reign has rained down chaos  and corruption and cuts and crisis on the American people. And he is  counting on…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…row.''\n\nBut what do we hear from the head man, the leader in Israel,  Netanyahu? He says, on Sunday, this past Sunday:\n\nThere is no starvation in Gaza.\n\nLet me be clear. That is a lie. The world knows it is a lie. We know  that it is a lie. Donald Trump knows that it is a lie. President Trump  said on Monday:\n\nSome of those kids--that's real starvation stuff,…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…strategy, just the conditions. This body works best when engaging with  the full context of the policy environment.\n\nAs we await the Supreme Court's decision on whether tariffs lie  within the authority of IEEPA, today's politically motivated vote, I  believe, is premature. If my colleagues have full confidence there is  no risk of fentanyl imports at…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Louisa Greve,\n\nDirector of Global Advocacy, Uyghur Human Rights Project.\n\nMr. SMITH of New Jersey. Mr. Speaker, we must act now, and we must  act decisively. The lives of so many lie in the balance.\n\nMr. Speaker, the United States has to lead with moral clarity. We  have to send an unmistakable message that the human body is not a  currency, it is not a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Democrats are doing today. It is obscene. It is disgusting.  You are seeing in real time Democrats wanting and defending grooming of  children, and it is abhorrent.\n\nThere is a lie at the heart of the debate that we are having today  that I have to correct. No child is born in their wrong body. There are  only two sexes. They are male, and they are female.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698349/protect-childrens-innocence-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…values  instilled by his family, coaches, and community. I congratulate him on  this incredible achievement and wish him all of the best and continued  success in the years that lie ahead.                 Honoring the Life and Service of Jim VanWert\n\nMr. MACKENZIE. Mr. Speaker, I rise today to honor the life and  service of Jim VanWert, a dedicated member…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…signing up folks in the system.\n\n``ObamaCare Is a Mecca for Fraud,'' The Wall Street Journal from just  a couple days ago. ``Open Enrollment is Healthcare's Most Expensive  Lie.''\n\nHow many more studies do we need to explain that you are being  defrauded, Mr. Speaker?\n\nIf this were helping people be healthier, then bless it, but,  instead, the Democrats…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Democratic colleagues hate President  Trump so much that they refuse to work with him even when it means  securing a more prosperous future for America. Instead, they have  chosen to lie again.\n\nThe lie that they tell us is that by making tax cuts permanent,  Congress is taking money from working-class and low-income families to  give tax cuts to the rich. The…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…colleagues' time and be a little more brief than that.\n\nI just want to say something that many of us learned when we were  children. We were taught: It takes a lot longer to build a lie than to  tell the simple truth.\n\nMy friends and colleagues, on both sides of the aisle, have waited  long enough. Some of us have literally been up for days now, but this  day…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Democrats support picture ID, 82 percent of Hispanic Americans support  picture ID to vote, and 76 percent of Black Americans support a picture  ID to vote.\n\nIf they still want to lie to people on the other side, Mr. Speaker,  if they still want to try to scare people and talk about Jim Crow, then  you might want to ask those same people why the Democratic…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…turns out to be the  scale and the speed we are burying this society in debt.\n\nThen, we hit moments like this, and we are going to happy talk our  way through it. We are going to lie about things. Oh, we are going to  make up a pretend growth rate, and that is going to produce $2.6  trillion. Our own reconciliation budget, there is going to be $1.7  trillion…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I thank the vice chair of the committee for  yielding.\n\nMr. Speaker, the unaffordable care act was born as a lie and  continues to be promoted in terms that are lies.\n\nMr. Speaker, do you remember these promises?\n\nIf you like your doctor, you can keep your doctor. If you like your  health…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…activities, or  recreational activities to just see who would come in and ask for their  papers.\n\nRepresentative Roy, I am proud to report what I knew inherently that  that is all a lie. That is all propaganda meant to scare people and  meant to stop law enforcement from doing its job.\n\nI am so disgusted by the names that our men and women that wear the  uniform,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…American public deserves transparency, and I urge critics of the  bill to ask why relationships, including those with our worst enemies  and our adversaries, should continue to lie in the shadows.\n\nMr. WALBERG. Mr. Chair, I yield 2 minutes to the gentleman from  Missouri (Mr. Onder), a member of the Committee on Education and  Workforce.\n\nMr. WALBERG.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…didn't happen, and accusations of  improper conduct, which did not happen. It also came forward with an  alleged victim. It was all malicious. It was all made up. It was all a  lie. Yet Gemma even generated fake links to fabricated news articles to  support the defamatory claim, and, of course, the links didn't work.\n\nThis marks a catastrophic failure…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…credibility       or not.\n\nThere has never been a newspaper or a book written that had       nothing false in it. Only one book is 100 percent true: the       Bible. God cannot lie and we may be certain that every word       of the Bible is true.\n\nDepending on the translation, Jesus 75-80 times in the       Gospels uses the phrase ``I tell you the truth''…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…our  country, must now be followed by the largest repatriation in history.\n\nDemocrats insist that they don't object to removing violent  criminals, but that is a demonstrable lie. The whole point of the  Democrats' sanctuary laws is to protect criminal illegal aliens from  being turned over to ICE for deportation. Instead, they released them  back into…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}]