[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…administrative leave on March 2, 2025.\n\nOn January 28, the day I was designated as the Acting       Assistant Administrator, Secretary of State Rubio issued a       waiver for Life-Saving Humanitarian Assistance to President       Trump's Executive Order pausing foreign assistance.\n\nFrom Day One, implementing this waiver was my highest       priority. My…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…received services ranging from medications that       prevent constant pain to (before our move) air ambulance       flights from Albuquerque to CHCO, including several life-      saving surgeries.\n\nLosing funding for Medicaid directly translates to       unnecessary suffering and even loss of life for Joaquin and       countless children like him. Please…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I rise today to introduce the Gun Safety  Incentive Act, a commonsense and life-saving measure to address one of  the most urgent crises facing our Nation: the epidemic of gun violence,  particularly as it affects our children.\n\nI am proud to be joined in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…rescissions bill did to  public broadcasting--NPR and PBS--legacies of President Johnson's Great  Society that help our citizens stay informed. Think of the harm done to  life-saving foreign aid that keeps children fed and vaccinated from  dreadful diseases that can and will cross our borders in check. And the  Big Ugly Bill does substantial harm to…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that  stands out as a pillar to the Deal community and beyond. I commend the  Deal First Aid Squad for their commitment to support residents during  times of need, including life-saving interventions and storm-related  emergencies. As the country braces with more extreme weather, like  severe flooding and heat, it is rewarding to know that safety is the…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…are within the jurisdiction of such committee; and\n\n(2) would ensure that the bill would not threaten       communities in rural and remote areas ability to receive       life-saving emergency alerts and warnings, like those related       to flash floods, wildfires, extreme heat, snowstorms,       earthquake, and tornadoes.\n\nWhen the Senate considers…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693632/hr-4"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and left the job.\n\n``It took me three months to get back on my feet after the       toe amputation. There was nursing care for two months to help       me walk again. This life saving medical procedure left me       with over $20,000 in debt, even with insurance!\n\nI avoided doing [necessary] follow up with doctors due to       not being able to afford…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…large family units including U.S.       citizen children who have never lived in Haiti and are       culturally American; and\n\nHaitians with medical complexities receiving life-saving or       life-extending treatment in the Boston area, who would be       unable to receive comparable care if returned to Haiti.\n\nTPS is a life-line for Rim's Haitian client…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…(CAG), formerly known as  Operation Warp Speed. There, she led a joint and interagency team that  worked ``hand-in-glove'' with industry partners to deliver millions of  life-saving doses and treatments to the American people and globally.\n\nIn addition to the CAG, Major General Kotulich has served in several  joint positions to include Chief of Staff…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…support of H.R. 323. Officer Anthony Mazurkiewicz was  born in 1967 and was a 29-year veteran of the Rochester Police  Department. He received the Rochester Police Department Life Saving  Award, Officer of the Month Award, 17 Excellent Police Service Awards,  and 7 Unit Commendation Awards.\n\nOfficer Mazurkiewicz and his partner were shot while undercover…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697615/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…concerned about their cost of living, whether they are concerned  about that hot chocolate, whether they are concerned about that coffee,  or whether they are concerned about life-saving medical devices.\n\nWhat this will do--which has been blocked for almost a year--is  simply to have a vote on the House floor so that the American people  can see because…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…active  shooter response protocol. Through this work, he has emphasized the  importance of awareness, prevention, and survival, equipping  individuals and businesses with life-saving tools and strategies.\n\nChief Tholen's service-oriented mindset was shaped early in life.  Raised in a family-owned plumbing business, he learned the values of  hard work…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…public health  crises, and other large-scale emergencies, the ability to respond  quickly and efficiently has never been more critical. Good360 and its  partners ensure that life-saving assistance and high-quality supplies  reach those who need them most.\n\nGood360 collaborates with the Federal Emergency Management Agency  (FEMA)'s Donations Unit as well…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…military and civil works construction, and regional  infrastructure improvements in New York and New Jersey. Mr. Seebode's  leadership has played a pivotal role in delivering life-saving  technical expertise and environmental restoration during national  crises. Together, we have worked on projects to reduce storm and  coastal flood risks to protect residents,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the people associated with Dick Eastland, the camp  director of Camp Mystic who gave his life trying to save those little  girls; the spirit of Jane Ragsdale, who lost her life saving five  little girls--her guitar was found down the Guadalupe River just  yesterday; and the spirit of all the little girls who were riding in  the bus as they left Camp Mystic,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…Foxx, and many others, iHeartRadio Asheville became a lifeline  for our mountain communities. Their around-the-clock coverage reunited  families, connected neighbors with life-saving resources, and delivered  accurate, timely updates when our region faced one of its darkest  hours.\n\nWestern North Carolina is stronger today because of the courage and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695854/recognizing-iheartradio-asheville"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…awards, including being named ``Reserve  Deputy of the Year,'' ``Sergeant of the Year,'' and ``Lieutenant of the  Year.'' Additionally, he was named a Pistol Expert, and ``Life Saving  Award'' recipient.\n\nLieutenant Delong also served as a trainer for Hamilton County  Sheriff's Office new Reserve Deputies, and he was a Board Member for  the Community…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689279/recognizing-lieutenant-kurt-delong"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…in 2002.\n\nDuring his distinguished career as an officer with the Rochester  Police Department, Officer Mazurkiewicz was the recipient of the  Rochester Police Department Life Saving Award, Officer of the Month  Award, 17 Excellent Police Service Awards, 7 Unit Commendation Awards,  32 Chief's Letters of Commendation, and the Good Conduct Award for 29…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…his 11-year career in law enforcement. He  served in both Walton County's field training program as an instructor  and in the breathalyzer program, eventually earning the Life Saving  Award Certificate. On top of his impressive law enforcement career, he  was a dedicated husband to his wife, Crystal, and an exemplary father  to his four children: Zane,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689979/mourning-the-loss-of-walton-countys-sheriff-deputy-william-will-paul-thomas-may"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…program to enhance senior well- being. Recently, RSVP Pasco partnered with Solo Moms to empower single  mothers and with the American Cancer Society to help patients access  life-saving treatments. Each partnership reflects the program's  commitment to addressing diverse community challenges with tailored  support. Led by Ann, the leadership team within…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}]