[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…communities dubbed  ``mill towns'' that became the epicenter of invention and innovation.  They not only inspired a westward movement but addressed favorably the  quality of life of people across the great world.\n\nMr. Speaker, all of this is a part of history and now underpins the  opportunity to grow an innovation economy. Yet, under the Trump  administration,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…that intellectual capacity of this great Nation  and the pioneer spirit of this Nation to continue to foster this growth  of product delivery that speaks to the quality of life of people across  this great world.\n\nWe as a nation have been a leader. I think back to the humble  beginnings of this Nation. In the 1800s, there was a development of the  Erie…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…night when most Americans will not be tuned in is a life-and-death  discussion about cuts to perhaps the most important Federal program  that impacts the daily health and life of people across the country,  the Medicaid program.\n\nAgain, over 3 million New York City residents are also enrolled in  the New York State Medicaid Pharmacy program, the so-called…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…Eisenhower to protect its wildlife and  habitat values.\n\nBut that is only part of its story.\n\nThe Arctic Refuge is also deeply connected to the traditions and  daily life of the people who have lived there for thousands of years-- longer than this building, this city, this country have existed-- because the refuge is not just land.\n\nFor wildlife, it…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…medical research, and food and nutrition programs here at  home.\n\nWhy is it that we always have money for bombs, but when it comes to  helping improve the quality of life for our people, we are told we  can't afford it? It doesn't have to be this way, and both Vladimir  Putin and Donald Trump seem to agree. Both Presidents have spoken  favorably of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Lake  Strikers for receiving the Carl E. Wehde Award. This award honors the  late Carl E. Wehde and celebrates outstanding contributions that  enhance the quality of life for the people of Crystal Lake.\n\nThe Crystal Lake Strikers are a drumline that seamlessly integrates  the arts and education. They perform year-round and offer a wide range  of programs…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…to see life crumble before       your eyes. Just trying to get ahead and just to find setbacks       waiting for you. I would like Congress to actually sit in       real life people's shoes for just a while to see how it       feels. I hope we can get something changed.\n\nThat is a busdriver in Minnesota begging our colleagues on the other  side of the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…snowstorm. People seek shelter during a tornado  or a hurricane. Weather forecasts are available at our fingertips, and  behind every alert, every early warning, every saved life are the  people at NOAA.\n\nI have spoken with shrimpers in Newport, Oregon, and scientists at  Oregon State University, Tribal leaders along the Columbia River, and  teachers in Hillsboro.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…New York, and I spoke with  small business owners, seniors, healthcare workers, veterans, local  electeds, Republicans, Democrats, Independents--people from all walks  of life. People are anxious about tariffs driving up their costs, about  inflation eroding their paychecks, and are fearful for the future of  Social Security.\n\nLast week, I met with the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…because of the GOP's craven allegiance to billionaires over working  people.\n\nThe cost-of-living crisis is not fake news. It is not a perception  issue. It is daily life for the people that we all represent. Let's do  something about it. Let's reject this budget. Let's stop the healthcare  cuts. Let's stop the premium hikes. Let's stop the hospital…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696729/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…be. It is justifiable anger. The  American Dream is gone for too many people, people who work hard, who  play by the rules, and yet can't catch a break, who see life as too  expensive.\n\nPeople are right. The American people understand our economy has been  rigged against so many. I say the American Dream hasn't slipped away;  it has been ripped away.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…seen how their work  reminds us that our city is stronger together.\n\nKYCC represents the very best of us. They understand that people come  from all different walks of life, and that people need to be supported,  uplifted, and heard.\n\nKYCC's work reflects a simple truth: when families are supported,  communities thrive.\n\nI thank all the dedicated staff,…", "date": "2025-12-30", "source_url": "https://justfacts.votesmart.org/public-statement/1698473/recognizing-the-50th-anniversary-of-the-koreatown-youth-and-community-center"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…none is more fundamental than ensuring public safety and protecting  human life. It is the foundation for everything else--our economy, our  freedoms, and our way of life--so the people on the front lines of that  effort are our first responders.\n\nPolice officers, firefighters, EMTs, correctional officers, and  dispatchers are the tip of the proverbial…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…proposed a  $5,000 credit for people having children. I think that might not be  quite right. I personally prefer a new $5,000 exemption. Nevertheless,  there is no time in life when people are more financially strapped than  when they have young children.\n\nI am strongly opposed to the so-called SALT Caucus of people who  desperately want to have a greater…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…was recognized for his extraordinary research on cystic  fibrosis, which is helping to pave the way to new therapies that are  dramatically improving health and extending life for people with cystic  fibrosis.\n\nCystic fibrosis is a genetic lung disease that primarily affects  young people. Dr. Welsh's research has been instrumental in  understanding the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…against the Israelis. I  think it was for the same reason. She wanted to adopt a cause to feel  she had a purpose in life.\n\nWhen one particularly has kind of a spoiled life, the people you want  to help are people who are kind of opposed to the successful society we  have here in the West, be it America, be it Europe.\n\nThere is a certain hierarchy of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…inadequate 911 system  because they need to start over from square A.\n\nThis, Mr. Speaker, is an example of how the failures in Sacramento  that have degraded the quality of life for people throughout our State  are not a matter of Democrat versus Republican, but simply a matter of  competence, of basic government performance, and of serving the people  of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Biden-Harris 14(c) rule, and I encourage all of my colleagues in the  U.S. Congress to tour some of their own shelter workshops, where you  can see how valuable they are in the life of people who are given a  little bit less than some of us in some ways to live their lives.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689252/abandon-biden-administration-rule"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…bunch of barbecue. I would want those young people to understand  that the civil rights movement was not something in black and white on  the History Channel. It was real life. People got their heads cracked,  and people lost their lives. Dr. Middlebrook, I think, got arrested  over 40 times during all of that. He is an inspiration to me.\n\nOne other story:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}]