[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…full wage. This is  problematic because tipped workers are paid less per hour and have less  access to benefits such as sick leave, healthcare, short-term  disability, and life insurance.\n\nIn fact, the Federal tipped minimum wage is only $2.13 an hour.  Instead of giving workers a leg up, this bill offers bad actors an  opportunity to cut corners and shortchange…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…also  thank my partners in this effort, Congressman Keith Self and Senator  John Cornyn.\n\nThe Fairness for Servicemembers and their Families Act will help  ensure that life insurance benefits for servicemembers and veterans  account for changes in the economy.\n\nThis bill will require the Department of Veterans Affairs to  periodically review and report…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…education programs and shaped a law to ensure  that filling a prescription for lifesaving anti-overdose medication  would not create a barrier for Rhode Islanders getting life insurance.\n\nI am grateful, in particular, for Donny's leadership on climate. He  sponsored legislation that put Rhode Island on a path to 100 percent  renewable energy by 2033. When…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Fairness  for Servicemembers and their Families Act of 2025.\n\nMr. Speaker, just a few short years ago we increased the maximum  coverage amount under the Servicemembers' Group Life Insurance (SGLI)  program and the Veterans' Group Life Insurance (VGLI) program from  $400,000 to $500,000. Prior to that, however, those maximum coverage  amounts had not been increased…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689628/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…basic actuarial realities of what insurance is  about. By way of example, we don't get to buy homeowners' insurance  after the house has burned down. We don't get to buy life insurance  after we die.\n\nThe idea of what we did here was to spread the notion of risk, an  entirely reasonable consequence, authored by former President Obama  and, by the way,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…get him the care he truly needed.\n\nThe insurance companies didn't know the Timothy that I knew. Where we  all saw an extraordinary little guy in a fight for his own life, the  insurance company saw expenses in a ledger book. They put caps on his  care and denied coverage for needed mental health treatment. When  Timothy received the care he needed,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…focus right now kind of taking off where Senator  Durbin left off talking about our children, our babies. One in three  children in Wisconsin rely on Medicare for their life insurance. That  is one in three children in Wisconsin's urban, suburban, and rural  counties who need Medicaid just to see a doctor to get regular checkups  or to get vaccines and…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…held a hearing where we talked about not the  financing of healthcare but things that could disrupt the cost of  healthcare? We had one gentleman from one of the biggest life insurance  companies in America come in and talk about it saying that here are the  things we do to keep our insured population alive and healthier.\n\nWe do things. We reward them…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…amend title 38, United States Code, to require the  Secretary of Veterans Affairs to periodically review the automatic  maximum coverage under the Servicemembers' Group Life Insurance program  and the Veterans' Group Life Insurance program, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…are 4.7  million homeowners across the country who deserve that little bit of  certainty, and it does not seem like it is asking too much.\n\nImagine if your homeowners or life insurance was subject to lapsing  every year if Congress couldn't get their act together. Well, for  families living in communities with the NFIP as the only option for  flood insurance,…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…on their core mission and grow. Through a PEO, the employees of  small businesses gain access to important employee benefits such as:  401(k) plans; health, dental, life and other insurance; dependent care;  and other benefits they might not typically receive as employees of a  small company.\n\nPEOs also take over the back-office tasks that consume time,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}]