[{"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…noted, our dear friend and colleague, the late  Congressman Gerry Connolly also served on the Adams Commission until  his passing earlier this year. Gerry dedicated his life to serving his  community and our Nation and stood for what was fair and just, as did  our former Presidents John and John Quincy Adams.\n\nCongressman Connolly is deeply missed, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…time zones will join a live, guided  meditation led by global humanitarian Gurudev Sri Sri Ravi Shankar,  founder of The Art of Living Foundation. Gurudev has devoted his life  to serving humanity, promoting peace, and advocating human values for  over 45 years.\n\nGurudev is universally acknowledged for his ground-breaking work in  stress-management and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698102/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…constituents, not by Members of Congress who do  not represent them.\n\nWe have more important work to do than to express displeasure at a  Member of Congress who has spent his entire life serving the people of  Illinois and people across this country.\n\nNow, please, let's get back to the real work on behalf of the  American people. I urge my colleagues to reject this…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696781/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…honoring james t. poston\n\nMr. CORREA. Mr. Speaker, I rise today to honor James ``Jamie'' T.  Poston, a proud American and Vietnam combat veteran who has dedicated  his life to serving our great country.\n\nJamie entered the United States Army in 1966, deploying to Vietnam as  a Mustang crew chief.\n\nToday, at 80 years young, Jamie remains a pillar of support…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…passed away from his injuries at just 47  years old.\n\nOfficer Facio lived the American Dream. Born in Mexico, Officer Facio  earned his U.S. citizenship and dedicated his life to serving the  community that welcomed him with open arms.\n\nHe began his law enforcement career with the Phoenix Police  Department, and nearly 4 years ago joined the Apache Junction…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…now occupies for life. There is  no one more deserving of this high honor and profound responsibility  than Justice Jackson. She is one of the best.\n\nShe has devoted her life to serving our country, and she has done so  at every level of the Federal Judiciary. At every turn, she has upheld  the Constitution and faithfully followed the rule of law. She…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to honor the memory of Phyllis B.  Fulton, who sadly passed away last week.\n\nA native of Elizabeth City, North Carolina, Phyllis dedicated her  life to serving her community through her work as a social worker.  After graduating from North Carolina Agricultural & Technical State  University in 1969, she began her career with…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Caitlin Rose, who are in the gallery, along with many of Gerry's  current and former staff to witness the debate on this bill.\n\nOur Ranking Member, Mr. Connolly, lived his life serving others and  making our country a better place. He was a steadfast advocate of the  disadvantaged and the voiceless, and he stood up for what was right and  what was just.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…him for  the excellent work and impact he had on the Grandview community.  Introduced to public service at an early age as an Eagle Scout, Jim  dedicated the rest of his life to serving the City of Grandview and  caring for anyone he crossed paths with. Jim showed endless love for  his community, and the impact he had will be remembered forever.\n\nBorn…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…NEGUSE.  Mrs.  Hayes is the author and the sponsor of this legislation, a former  public schoolteacher, and a National Teacher of the Year. She is  someone who has spent her life serving the students, the young folks,  and the working families of the people of Connecticut.\n\nMr. Speaker, some of this can get lost in translation, so I will try  make this very…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise to honor and recognize Reverend Sarah  Yvonne Williams Carr, a truly remarkable woman who has dedicated her  life to serving the Ebenezer Baptist Church and the Alexandria  Community.\n\nReverend Sarah Carr, a trailblazer who has made history at Ebenezer  Baptist Church (EBC) in Northern Virginia,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…both accessible and applicable, he has a deep love for teaching the  Word of God to people of all ages and backgrounds. Additionally, Pastor  Chris has committed his life not only to serving within the walls of  Antioch Fellowship Church, but also to standing up for those without a  voice and advocating for justice, faith, and community uplift.\n\nAgain,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…this pales in comparison to his walk with  Christ. In 1947, Ron was saved at the Broadway Baptist Church in  Maryville, Tennessee. He then went on to live a Christ-centered life  serving as the music director for a number of churches and Christian  organizations throughout East Tennessee. Since August of 2014, Ron has  served as the Minister of Music at…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690142/recognizing-ron-tilley-of-calvary-baptist-church"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…His uncle Jay Kimmitt spent decades on the  Appropriations Committee as a professional staff member. His aunt and  godmother Judy dedicated nearly her entire professional life to serving  six different Senators. This is a patriotic family who clearly values  the dignity of public service. I trust that William will continue the  family tradition as the…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "Mr. STUTZMAN. Mr. Speaker, I rise today to recognize the outstanding  life and public service record of DeKalb County Commissioner Mike  Watson.\n\nMike dedicated his life to serving northeast Indiana in roles ranging  from president of the Auburn Economic Development Commission, president  of the DeKalb Central Foundation, and serving as an Auburn…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689233/recognizing-the-life-of-dekalb-county-commissioner-mike-watson"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…dedicated service to the Alabama Legislative over several decades  has made a lasting impact on the lives of many Alabamians.\n\nMr. Caskey has dedicated many years of his life to serving the  Alabama Legislature and its citizens. Beginning his career in 1970 as a  clerk for Senator James B. Allen, Frank's commitment to public service  continued through…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…D. Holmes,  Chairman of the Jackson Township Board of Supervisors, for his many  years of service to Jackson Township, York County, Pennsylvania.\n\nJon has dedicated his life to serving the great People of Jackson  Township. He began in 1990 after being appointed as an alternate to the  Township Zoning Hearing Board, where he served for almost two years.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…natural disasters and emergencies, and serving on the  Orange County Public Schools Career & Technical Education Advisory  Board from 2013 to 2022, Bobby dedicated his life to serving Central  Florida's agriculture industry.\n\nBobby was honored for his years of service by receiving many awards  and acknowledgements including his induction into the Florida…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…platoon leader during Operation Iraqi Freedom II  earned him the Bronze Star Medal and the Combat Infantry Badge.\n\nFollowing his retirement in 2023, Bobby rededicated his life to  serving his brothers and sisters who also hung up the uniform. Today,  he is Post Historian for American Legion Post 141 in Howell, Michigan,  where he previously served as Post…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690118/recognizing-bobby-brite"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…a solemn note as we honor the  life of Honorable Circuit Judge Tom Remington, who passed away on May  7, 2025, in Pensacola, Florida.\n\nTom dedicated over 60 years of his life serving our Nation and our  State, first as an artillery and infantry officer in Vietnam, where he  earned the Combat Infantryman Badge, two Purple Hearts, two Bronze  Stars with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691470/thanking-emergency-medical-services-personnel"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…John's roots run deep in the greater  Washington, D.C., area. Graduating from Georgetown University and  George Washington University Law School, John has committed his life to  serving his community and giving back to those who helped him along the  way. Above all else, I know what John enjoys most is being a loving  husband to his wife Diane, and an…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…beginning of December due to a 9/11-related illness.\n\nA proud Eagle Scout, a graduate of Tappan Zee High School and of  Rockland Community College, Pieter dedicated his life to serving  others. After working as a technician for ITT in Antarctica, Pieter  began his career in public safety with the NYPD in 1984, serving as a  patrolman in the 44th Precinct…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}]