[{"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…same diagnosis, I would have had to say all we could do  was tell you to enjoy whatever time you have left.\n\nNow, because of these investments, I am able to live a full life  expectancy, like many of the other survivors.\n\nFrom developing the first chemotherapy drug to treat metastatic  cancer in 1956 to promising new research on immunotherapy, NCI-funded…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…really is. It is an attack on the most  vulnerable to pay for the wealthy and the well-connected.\n\nThese cuts would not just shrink the deficit. They would shrink the  life expectancy of millions. They would drive up hospital costs,  emergency room visits, and medical bankruptcies. These proposals would  lead entire communities, especially communities…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Health Investment  Zones Act of 2026. This legislation would designate health investment  zones for 10 years in areas with large health disparities based on  income, life expectancy, provider shortages, and align tax, grant,  loan-repayment, and Medicare incentives to expand services where they  are needed most.\n\nThis bill would establish health investment…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…exacerbating the  issues that we have from a healthcare standpoint. We haven't expanded  Medicaid. This is in a State that for all intents and purposes has  pretty much the lowest life expectancy in America. I think we are  technically third by some decimal points, so congratulations, we live a  few weeks longer in the State of Alabama than, say, West Virginia…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…wearing respiratory  protection, even as the science made clear that wildfire smoke causes  lasting lung damage and is linked to more than a dozen cancers.\n\nFirefighters' life expectancy is now nearly 10 years shorter than the  average American. That is unacceptable.\n\nThe Healthy Lungs for Heroes Act changes that. It directs our Federal  land agencies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698661/firefighter-protections"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…as we approach  the end of 2025 Minority Health Month.\n\nThere is a long, storied history of poor health outcomes in minority  communities. African Americans have lower life expectancy, higher rates  of infant mortality, increased instances of maternal mortality, higher  rates of chronic illnesses, and more frequent cancer diagnoses. Every  American…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…this country of monumental  proportions. It is one of the greatest killers in America. Fentanyl and  fentanyl analogues have literally been responsible for lowering the  life expectancy for Americans. It is one of the greatest crises we have  seen to human life in America in my lifetime. There is so much data- driven evidence and evidence-based answers…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…determinants of health.\n\nI represent Massachusetts' Seventh Congressional District where in a  3-mile radius from Cambridge to Roxbury, the Blackest part of my  district, life expectancy drops by 30 years.\n\nNow, some have tired of hearing these sobering statistics, but I will  enumerate them time and again until they change. If you are tired of  hearing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…person as countries like the  United Kingdom, Canada, Australia, and Japan spend on healthcare, so we  should be the healthiest. We are not. We are 48th in the world for life  expectancy.\n\nDo you know, Mr. Speaker, what most of the countries doing better and  paying less than us have in common? They have universal healthcare.  Americans' physical and financial…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…suffer.  Exposure to trauma can harm the brain, changing the way people see and  interact with the world.\n\nWe know that young people who experience trauma have a shorter life  expectancy, are more likely to misuse drugs, attempt suicide, commit  violence, or not graduate from high school. By providing Joliet  firefighters with the tools to help individuals…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…about one hospital in Hawaii. This is a national  crisis. Rural Americans face significantly worse health outcomes and  health disparities. In too many rural counties, life expectancy is a  decade shorter than that of their urban neighbors.\n\nMaternal mortality in rural areas is nearly double that of urban  areas, and more than 200 rural hospitals have…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…affordable for all Americans. Despite  spending 18\\1/2\\ percent of our GDP in the United States on healthcare,  we have the worst outcomes: the highest mortality rate, life  expectancy, and acuity.\n\nWe need to make it more affordable. I agree with the ranking member  and the chair that we should work together on the inefficiencies in the  system. However,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698403/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…are spending twice  what any other industrialized country is spending on healthcare--for  worse results.\n\nDo you know that, today, in the United States of America, our life  expectancy is 6 years shorter than if you live in an industrialized  country in the world that has a universal healthcare system that costs  half of what this healthcare system costs?…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…have  lower life expectances. Systematic inequalities in socioeconomic  status, education, food security, and access to healthcare play an  intricate role in life expectancy. The life expectancy for Black men is  age 72.8, in contrast to 77.5 for White men. All Americans should  equitably reap the earned benefits of their tireless labor.\n\nWith fewer…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…controls on NIH       science research, FDA approvals, and CDC guidance.\n\nFor the sake of power, they are destroying an enterprise       that added more than 30 years to U.S. life expectancy and       made America the world leader in medical technology and       innovation. We need you in Congress to stop this process.       USAID cannot be restored to what…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…help of the  University of Pittsburgh, conducted a study of the health of Alaska  Natives. Many of our communities in rural Alaska all had some of the  lowest levels of life expectancy in the entire world. Between 1980 and  2014, the average lifespan increased by 13 years across the region,  largely due to oil and gas revenue providing the opportunity…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…connection and contributing  to programs aimed at supplying nutritional services, continued  education, and transportation for our aging neighbors. It has improved  the life expectancy, health outcomes, and quality of life for millions  of seniors, and that is why I am proud to be leading the fight to  reauthorize this important legislation alongside…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693849/recognizing-the-60th-anniversary-of-the-passage-of-the-older-americans-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…help of the University of Pittsburgh, conducted a study of the health  of Alaska Natives. Many of our communities in rural Alaska all had some  of the lowest levels of life expectancy in the entire world. Between  1980 and 2014, the average lifespan increased by 13 years across the  region, largely due to oil and gas revenue providing the opportunity…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…esteemed colleagues on the other side  from that great Commonwealth, thought it was appropriate to say: Let's  close that down early.\n\nIt opened in 2012 with a 50-to-60 year life expectancy, and they  wanted to close it down somewhere around 2035 or 2040, well before its  life expectancy is up. What that does is that pushes the power  companies to have to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}]