[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the biggest corporations. The richest Americans will be  seeing $400,000 more in tax cuts in their pockets every year because of  this legislation. I don't know how their lifestyle--if you are a  millionaire or something like that and you get a tax break of $400,000,  what does that money do to change your life?\n\nWell, I can tell you this: One thing…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…anniversary with their Crystal Celebration. I can't be there  in person, but we are there in spirit.\n\nAt Home provides a support system to help seniors continue to enjoy a  vibrant lifestyle as they age--able to remain in their homes and highly  active. At Home volunteers and professionals deliver a monthly schedule  of educational programs, active discussion…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…community that it is today. Originally inhabited  by the Native Ute, Cheyenne, and Arapaho people, the town has grown  alongside the state of  Colorado, boasting a slower lifestyle ``up the hill'' away from the  City of Denver. Evergreen's charm can be seen in the community's  appreciation for the arts, outdoor recreation opportunities, and small  community…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cancer last year. Jess said that if the tax  credits go away, as they are supposed to on January 1, she would be  forced to pay more for healthcare and will have to make a ``lifestyle  change to pay the difference,'' potentially working more shifts. She  also worries about a lapse of coverage if the price increase forces her  to switch plans. Any gap in…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Lake Tahoe shoreline cleaned by the team's beach-cleaning  robot, BEBOT.\n\nJB and JT, two longtime friends from Las Vegas, were drawn to the  Sierra Nevada by the beauty and lifestyle of the mountains. As their  connection to the area and the great outdoors deepened, JB and JT  witnessed the toll of increased tourism on their natural surroundings.\n\nWith…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…drives, and organized a  Veterans Day program for his hometown.\n\nThe Young Marines is a national youth program that focuses on  community service, leadership, and a drug-free lifestyle. To be the  Pennsylvania Regiment Junior Young Marine of the Year, YM/Cpl Muchmore  completed Junior Leadership School, fulfilled requirements for rank,  education, and community…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and responsibility.\n\nMr. Hebel, a proud graduate of Penn State University's Landscape  Architecture program, has long emphasized that landscaping is both a  financial and a lifestyle investment. Through his guidance, the company  has earned a reputation not only for its design expertise but also for  its enduring client relationships through many generations.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and       geothermal exploration and development. The purpose of the       withdrawal is also to protect the health, traditional       cultural values, and subsistence-based lifestyle of the       Tribes that rely on resources in the region, such as wild       rice, which are particularly susceptible to adverse impacts       associated with mineral exploration…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…full and accurate information is available on the risks  associated with prescription drugs. It works to prohibit pharmaceutical  companies from promoting drug usage over lifestyle changes.\n\nThis will also eliminate the inappropriate intervention between a  patient and the patient's doctor. Unregulated prescription drug  advertising often misinforms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695425/president-trumps-peace-through-strength-agenda"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Congratulations to JB Harris and JT Chevallier for this amazing  accomplishment.\n\nJB and JT, two longtime friends from Las Vegas, were drawn to the  Sierra Nevada by the beauty and lifestyle of the mountains. As their  connection to the area and the great outdoors deepened, JB and JT  witnessed the toll of increased tourism on their natural surroundings.  With…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…She was born into the Yarborough pioneer ranching family  in Sanford, Florida, where she was raised with a deep respect for the  land and livestock, learning the ranching lifestyle through hard work  alongside her parents.\n\nIn 1985, she married her high school sweetheart and late husband,  Paul Mazak. Based in Sumter County and starting with just seven…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…professional truck driving profession.  Karen is a role model for young adults, particularly women, to consider  trucking and logistics as a career.\n\nKaren promotes a healthy lifestyle for herself and other professional  truck drivers. She emphasizes the need to stay fit and healthy is vital  as a long-haul truck driver. Karen is also the proud mother of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689097/recognizing-ms-karen-partin"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…don't know if I was her favorite, but certainly I  was one of her favorites.\n\nThe interesting thing was, we couldn't gain weight, though. Despite  eating seconds and an active lifestyle, nobody gained weight. We were  all in a good weight area.\n\nAnd what did we eat? We ate real food. What did that real food look  like? Well, we had whole milk for breakfast…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…were bombings, and there were anti- Vietnam protests, but they failed to bring down America because  Americans themselves are hardworking, and they realized the middle- class lifestyle in America would be like a wildly wealthy lifestyle  everywhere else in the world.\n\nThey failed. They thought: Let's educate our so-called minority  people that America is…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…restore common  sense. It will restore the paradigm of consumer choice.\n\nMadam Speaker, I like EVs. I happen to drive an EV myself. It works  well for where I live and for my lifestyle, but I would never think to  use the coercive powers of government to impose my personal preferences  as a consumer on everyone else. Americans should be able to drive a…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…our shareholders, through jobs and dividends, and to       preserving our Inupiaq way of life, culture, and traditions,       including the ability to maintain a subsistence lifestyle       that supports our communities. In furtherance of this       congressionally mandated mission to provide benefits to our       shareholders, ASFIC conducts and continues…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…avid dancer who goes out dancing at least five  times a month in the winter and even more during the summer.\n\nLawrence credits his agility and dance ability to his active  lifestyle as he walks frequently and has had several successful deer  hunts. Reaching the century milestone is a testament to his strength,  wisdom, and many lives he has touched over…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…be overwhelmed by this. It can hurt their  children. I think studies will show various measures of success or  failure, and it is much more difficult with a single-parent lifestyle.  Something that is not publicized enough is it is horrible for the men.\n\nGeorge Gilder would tell us, if you look at a single-parent  situation, the person who is penalized…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "John Rose", "party": "Republican", "sentence": "…for their own personal gain.''\n\n``Mello's penchant for extravagance is what brought her       down. We identified that her reported income was well below       the lavish lifestyle she lived. As we uncovered the details,       the criminal scheme grew, the dollar amount grew, and the       reach of her spending grew,'' said Acting Special Agent in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]