[{"senator": "Mike Quigley", "party": "Democrat", "sentence": "…across time zones will join a live, guided  meditation led by global humanitarian Gurudev Sri Sri Ravi Shankar,  founder of The Art of Living Foundation. Gurudev has devoted his life  to serving humanity, promoting peace, and advocating human values for  over 45 years.\n\nGurudev is universally acknowledged for his ground-breaking work in  stress-management…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698102/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…vote on this bill. Democrats here are focused on a bill to lower costs  for tens of millions of Americans and prevent many from losing  healthcare.\n\nMr. Speaker, we speak about life, liberty, and the pursuit of  happiness. We can't be free, it is hard to be happy, and lives are cut  short with no healthcare.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…open-heart surgery. She spent her first year  alive on oxygen.\n\nAurora is a fighter, but without Medicaid, Karisa could never have  afforded the surgeries that saved Aurora's life. Because of Medicaid,  Aurora isn't just surviving; she is thriving. She is going to birthday  parties. She is playing on the playground and dancing to her favorite  cartoons.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…silent. No American who cares about       our freedoms, our institutions, and our identity as a nation       can afford to be a bystander. Each of us in different walks       of life must do what we can--speak out, mobilize, defend our       way of life. The moment requires nothing less. We must       recognize the seriousness of what is taking place and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today in memory of Baldwin Park  Police Officer Samuel Riveros, who lost his life in the line of duty  while attempting to rescue a fellow officer.\n\nKnown for his infectious smile, love of the Dodgers, and  snowboarding, Officer Riveros served in the Baldwin…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…time when the President of the United States says  that he wants to create a fund for January 6, not a fund for Michael  Fanone who had a heart attack and had to beg for his life; not a fund  for Sergeant Gonell who was forced out of the force because of  permanent injuries and now is living on a fraction of the salary he had  before trying to support…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…depression are as common as the  common cold, but unlike the cold, they won't go away on their own. It  requires attention. You can live a very long, comfortable, healthy,  happy life, but it requires action on your part.\n\nThat is why our caucus is engaging in talent, on both sides of the  aisle. Recognizing that this is not a Republican or a Democratic issue.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…not  maintain so-called separate but equal schools.\n\nIn Brown v. Board of Education, the court said: ``It is doubtful that  any child may reasonably be expected to succeed in life if he is denied  the opportunity of an education. Such an opportunity . . . is a right  which must be made available to all on equal terms.''\n\nThe court then concluded that…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698125/dismantling-the-department-of-education"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Lieutenant Colonel Harold H. Brown. He was a  Tuskegee Airman, and this is the bronze statue that was cast in our  region as part of our Air Force museum, honoring his astounding life.\n\nHe was a warrior for justice on many fronts and an unwavering  patriot. He was always happy. His story is one of resilience,  excellence, and service, embodying the very best…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to honor the life and legacy of  a loving husband, dedicated grandfather, doting grandfather, astute  entrepreneur, committed public servant and dear friend of longstanding,  the Honorable Curtis…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…take meaningful action to address the cost- of-living crisis weighing heavily on struggling American families.\n\nRegrettably, the President and Republican leadership have made life  more difficult and less affordable for hardworking families across our  Nation through chaotic trade policies and devastating cuts to  healthcare and food programs.\n\nThe pending…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "Mr. WHITESIDES. Mr. Speaker, I rise today to honor and remember  Donald Leroy ``Cool'' Kuehl, a proud United States Army World War II  Veteran, whose life was defined by service, courage, and deep love of  country.\n\nBorn in 1925 in Long Beach, California, Don answered our Nation's  call during one of the most consequential moments…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699857/in-memory-of-donald-l-kuehl"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…Mexico. When tariffs go up, local  businesses pay the price. When Canada retaliates, it becomes harder for  our workers to sell their products abroad.\n\nThis trade war is making life more expensive, creating uncertainty  and putting good jobs at risk, all while the world continues to move  around us. Congress has constitutional authority over tariffs. We…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Angeles. And growing up in  the 1970s and 1980s--40 years after the gas masks that I spoke about a  minute ago--smog was still ever-present in our sky and part of our  daily life.\n\nI still remember what it was like being sent home early from school  as a kid because the air was too unhealthy for us just to play on the  playground--the stinging in our…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…difference between whether a family eats, pays their  rent, or sees a doctor.\n\nMr. Speaker, 2.8 million rural Americans will lose coverage. For  them, this is not politics. This is life or death.\n\nHealthcare should never depend on your ZIP Code. This clean extension  of the ACA tax credits will save lives.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Electronic Warfare (AISREW) mission       systems, Global Positioning System (GPS) capability, secure       communications, aircraft defensive systems; spares, including       whole life costs of airborne and ground segments; aircraft       modification and integration; ground systems for data       processing and crew training; ground support equipment;…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696581/arms-sales-notification"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity, and the return of future  generations to their…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692444/recognizing-stephanie-wilson"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…opportunity.''\n\nWe all know the line. It is an unforgettable one. They seized the  moment at a time when I was too young to really comprehend what it  meant. When you watch it later in life, as a guy who enlisted in the  Army during the Cold War, to see moments like that that move the Nation  and unite us, you see what sports can do.\n\nAt the same time, the Soviet…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "John James", "party": "Republican", "sentence": "…what the heck something costs: No more games, no more surprises, and no  more $47 aspirin.\n\nThis is bipartisan, bicameral, and commonsense stuff. In literally  every part of life elsewhere, buying a car, groceries, or a cell phone,  you know the price before you swipe your card and before you put your  hard-earned cash on the register, Mr. Speaker. You…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…program to enhance senior well- being. Recently, RSVP Pasco partnered with Solo Moms to empower single  mothers and with the American Cancer Society to help patients access  life-saving treatments. Each partnership reflects the program's  commitment to addressing diverse community challenges with tailored  support. Led by Ann, the leadership team within…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…close to doubling in 10 years.\n\nDoes this body, the lobbyists in the hallways, the groups in the  hallways demanding more spending, or any of the staffers who might not  have a life so they are watching this really think that the bond  markets aren't going to go: They are doubling U.S. debt, maybe we  should ask for a little premium, which is called term…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…home to hardworking farmers,  entrepreneurs, educators, and service members--all of whom have played  a role in shaping its legacy.\n\nWe remember the early settlers who shaped life in this land, facing  hardships with unwavering determination. We honor the industries that  have driven our economy forward, from steel and manufacturing to  agriculture and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…National Wildlife Refuge''.\n\nMr. WESTERMAN.  1596, the bill now under  consideration.\n\nMr. Speaker, Jocelyn Nungaray was a vibrant 12-year-old girl from  Houston, Texas, whose life was tragically cut short on June 16, 2024,  when she was murdered by two Venezuelan nationals who illegally entered  the United States and are allegedly members of the Tren…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…as the greatest machine on Earth,  is a complex system compromised of myriad components and infrastructure  to deliver electricity that powers our economy and enables modern life  for households.\n\nTo ensure the timely delivery of electricity at all times of the day,  utilities have historically undergone extensive planning processes to  methodically…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Fire Rescue, Firefighter/Paramedic--Company       Fire Captain Ralph Mascaro of Hillsborough County Fire       Rescue, and the Sun City Center Emergency Squad.\n\nPreservation of Life Award: Firefighter/Paramedic Jacob       Campbell, Fire Captain Clifford Davis, Firefighter/Paramedic       Anna Inman, and Firefighter Maurice Swan of Hillsborough       County…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…Bartholomew not only serves as the spiritual  leader to the upwards of 300 million Orthodox Christians around the  globe, he serves as a model for us all, having dedicated his life to  peacemaking, environmental advocacy and conservation, and facilitating  inter-faith dialogue around the globe.\n\nLeading the Church since 1991, His All-Holiness has shepherded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to  low-income qualifications. Even if one is technically low-income, they  could have unlimited assets, as well.\n\nIn any event, I really think, in all of my years in public life, the  most questionable program I have ever come across is the low-income  housing tax credit.\n\nThe press corps likes to run down politicians. Here is something they  ought…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…they  did lose their cousin, Janie Hunt, 9 years old. What a tragedy. I thank  both of these gentlemen for their work during that time.\n\nMr. Speaker, I rise today to honor the life and legacy of Judy  Jurgensen Melroy.\n\nA native of Savannah, Georgia, Mrs. Melroy lived a life defined by  faith, service, and love for others. Her passion for learning led…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695205/people-are-sick-and-tired"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…unimaginable adversity. Since the arrival  of the first Jewish immigrants to America in 1654, Jewish Americans  have made extraordinary contributions to every facet of American life-- strengthening our culture, economy, and society.\n\nThis alarming trend has inspired a growing grassroots civil rights  movement, End Jew Hatred, dedicated to making antisemitism…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…mentors,  protectors, neighbors, community leaders, and patriots. In Mississippi,  we are blessed with extraordinary individuals who wear the badge with  honor and integrity. Every life lost in the line of duty is a tragedy  that affects us all.\n\nToday, I want to specifically honor the four Mississippi officers  whose names have been added to the National Law…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}]