[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…supposed to live? How are your  constituents supposed to live? How are any of our constituents supposed  to pull themselves up by those ridiculous bootstraps that people like  to talk about?\n\nThis administration and the House majority are actually not just  taking away their boots but taking away the leather, the rubber, the  soles, and the labor that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…of the Energy Subcommittee.\n\nMr. PALLONE.  Schrier).\n\nMr. PALLONE.  Matsui), the ranking member of our Communications and  Technology Subcommittee.\n\nMr. Speaker, I would like to talk about the seven hazardous air  pollutants that Republicans are apparently fine with pumping into the  air we breathe.\n\nFirst is mercury. Mercury is quickly absorbed into…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…of D.C. It is not  about hers or mine. It is about their local elections.\n\nI think it is interesting because I don't know what happened. My  Republican colleagues always like to talk about limited Federal  Government. My Republican colleagues always like to talk about how  important local governance is. Yet, they want to rip it away from the  people…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…microphone in a studio here in Washington and took to the  Nation's airwaves to deliver an address. This is part of what Ronald  Reagan said:\n\nMy fellow Americans:\n\nI'd like to talk to you today about our environment. But as       I mentioned earlier this week, in doing so, I might be       letting you in on a little secret--as a matter of fact, one…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…or have an arrest warrant out for the fact  that they have committed violation of international human rights laws.\n\nI know when it comes to Russia or China, my colleagues like to talk  about rule-based international order. When it comes to governments like  the government of Israel, my colleagues are willing to throw  international law in the shredder.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…about a lot of things going on. My  Republican colleague might be able to stick narrowly to one particular  topic. Good for him if that is what he would like to do, but we like to  talk about all of our legislation in context here.\n\nThis is a matter that is actually called for directly in the very  first sentence of the resolution that we are all about…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…would be impacted by cuts to  Medicaid that my Republican colleagues are proposing.\n\nEarlier this evening, I talked about children, babies, our most  vulnerable. Now I would like to talk about older adults.\n\nI rise to share the story of Renee. Renee is a 60-year-old woman. She  lives in Milwaukee, WI. In October 2023, Renee was diagnosed with stage  IV breast…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…at https://networkcontagion.us/wp-content/uploads/A-Tik-Tok-ing- Timebomb__12.21.23.pdf.\n\nOn the flip side of another example is the current topics that China  doesn't like to talk about--they are sensitive to. You are never going  to see any information on TikTok about Tiananmen Square and what  happened.\n\nAnd now, we are in a trade war. In a new…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…crisis pregnancy center had given her the  wrong information. This misdiagnosis greatly increased her risk of  having pregnancy complications.\n\nMs. CHU. Mr. Speaker, I would like to talk about Kentucky, where a  postpartum nurse with 20 years of experience was motivated to volunteer  at a crisis pregnancy center. During her training, she learned that the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…plants in recent  years.\n\nThis is not free market competition. This is protectionism for  expensive incumbents while families are footing the bill.\n\nThe third thing I would like to talk about is reliability. Opponents  sometimes argue that wind and solar are unreliable. The evidence says  exactly the opposite.\n\nBattery storage deployment is absolutely taking…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, I thank the chairman for yielding me time.\n\nMy friend, the chairman, referred to stupidity in debating this  resolution. I would like to talk about hypocrisy and illiteracy. Ten  days before Joe Biden left office, he raised the bounty on Nicolas  Maduro to $25 million. Now, I don't know if my Democratic colleagues…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…presentation of technologies, new pharmaceuticals,  and new methodologies to crash the price of healthcare. I get the crap  kicked out of me because armies of lobbyists don't like it when we talk  about changing their business model.\n\nRemember, several months ago, I came here to the floor and showed  that we came up with a math experiment of, in America, how…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. I would like to talk about a topic that may seem  irrelevant to the average person at first glance, but it actually  affects all of us a great deal more than we might imagine. A tiny but  vicious…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…accurately.\n\nNumber one, they refuse to speak about the fact that this bill is  about ending an emergency relating to a fentanyl crisis. Number two,  every single item that they like to talk about on tariffs and Canada  are literally items that are exempt from tariffs in Canada.\n\nIt is very important, certainly as one of 435 in the House of  Representatives,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…today, and I think 4 minutes will turn out to  be an appropriate amount of time.\n\nMy colleague on the other side talked about the nature of things  being deadly. I would like to talk about that.\n\nOn April 17, less than 1 month ago, at 11:56 in the morning, a  shooter carrying a gun walked onto the campus of Florida State  University and began to shoot…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Speaker, first of all, due to when I was pushed  back to start this, my speech will go a little less than 10 minutes, if  anybody is planning around it.\n\nMr. Speaker, I would like to talk a little bit about the big bill  that we just passed and some provisions that should be monitored as we  work our way not only through the big reconciliation bill but through…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…unfortunately, we eat from a box. We eat from a  sack, and that is not real food. We did not have any of these  ultraprocessed foods in my diet growing up.\n\nNow, I would like to talk a little bit more about eating, about  eating real food, and share the new nutritional guidelines released  yesterday by USDA, HHS, and FDA. Guess what their advice is.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…surpass 400--and this far  surpasses the number that Joe Biden confirmed in his first year in  office.\n\nOne of these highly qualified nominees is Arjun Mody, whom I would  like to talk about now.\n\nArjun is an extraordinary leader and a trusted friend. Arjun has been  nominated to serve as Deputy Commissioner of the Social Security  Administration. Now,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…government programs, decrease the  degree to which we have government programs controlling or directing  Americans' lives.\n\nOne of those programs that I really don't like the more I talk to  experts on the topic is something called low-income tax credits.\n\nThese low-income tax credits are given to property developers that  are equal to 10 percent of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…business, beginning with our obligation to provide for the  common defense. In particular, our work to deliver full-year Defense  appropriations is not finished.\n\nSo I would like to talk briefly about what must come next after  interim government funding is extended and what is at stake for our  national security. The U.S. military is not immune from the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}]