[{"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…security of those who depend on these essential safety nets.       We cannot allow them to be dismissed amid political and       economic maneuvering by unelected bureaucrats like Elon Musk,       who have placated the legislature and judiciary while       wielding outsized influence over public policy, all while       bypassing democratic accountability.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…election, this will be a priority, and that is campaign finance reform.\n\nAll this excessive money from big industries, from big banks, from  corporations, and from people like Elon Musk pollute this Chamber in a  way where the needs and the wants of regular people get put to the  side.\n\nIt is disgraceful, if we are being honest here, Mr. Speaker. As…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…going to talk  about for the rest of this evening is some bad news, bad for the  American people.\n\nThe Republican plan to extend the Trump tax cuts for billionaire  donors like Elon Musk is a bad deal for the American people.\n\nDuring this Special Order, we are going to lay out exactly how  reckless this Republican plan is to extend the Republican Trump…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…House Committee  on Veterans' Affairs, I rise today in complete opposition to the  Republican rip-off budget resolution.\n\nLet's be clear: This is a tax break for billionaires like Elon Musk  paid for by working people, including millions of our veterans. The  Republican rip-off cuts at least $880 billion from Medicaid, the  program that 80 million Americans,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…critical program for future generations.\n\nThe House Republican budget scheme, endorsed by our President and  designed to help the superwealthy and their billionaire buddies like  Elon Musk, will cut Social Security benefits and Medicare and Medicaid  benefits.\n\nIn my district alone, the Republican proposal will gut Medicaid for  250,000 of my constituents.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…history of the EPA. In my view, it is a day that will live in  environmental infamy. It marks a step back by decades.\n\nAnd for people who think, well, we need some disruptors like Elon  Musk, who is behind these steps to decimate the Agency, disruption can  sometimes be constructive, but not when you burn down the house, burn  down an Agency, burn down…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the cost of living for families along the Gulf Coast and  all across America.\n\nIn fact, what the Republicans have been focusing on is a massive tax  giveaway to billionaires like Elon Musk while they rip away healthcare  from millions of Americans.\n\nIn Florida, we have about 4.6 million Floridians who rely on the  Affordable Care Act for their healthcare…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…much on their agenda other than slashing $880  billion from Medicaid, SNAP, Meals on Wheels, Head Start, and the other  programs that actually serve Americans who don't live like Elon Musk  and Donald Trump. However, Mr. Speaker, you would think they would have  the time at least to write a bill that would not permit these kinds of  things to happen.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…taking, taking, so let me clarify facts here.\n\nThe reality is that Republicans are pushing for a billionaire budget  that gives $4.5 billion in tax breaks to the ultrawealthy like Elon  Musk and Jeff Bezos, while cutting trillions of dollars in programs  like Medicaid and SNAP. That is not immigrants doing that. That is  Republicans doing that.\n\nRepublicans…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…off the tables of  families who are just trying to get by.\n\nThis isn't about fiscal responsibility. It is about cruelty. It is  about choosing hedge fund managers and people like Elon Musk over  hungry kids.\n\nBudgets are moral documents, and this one being put up by House  Republicans is morally bankrupt. I will not vote for a bill that  abandons families…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the budget process is done, we are  protecting the people who need it the most. Right now it looks like we  are taking from the most vulnerable to give to the most wealthy, like  Elon Musk and his allies. We have got to reverse that process.\n\nI want to commend the gentlewoman for pulling this together, my  colleagues with the Congressional Black Caucus,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…are very good.\n\nLet me be very clear: Republicans have barely made any attempts to  support working families. Instead, they have written an economic love  letter to people like Elon Musk. This is a 386-page love letter to Elon  Musk.\n\nRepublicans can run from the truth all they want--they have been  silent--but the truth is in the eyes of this administration:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…our communities, and our climate to pay for more tax cuts for  wealthy people, that would cut Medicaid and block help for families  that will go hungry so that billionaires like Elon Musk get another tax  break they simply don't need.\n\nBut that is not what I am here to talk about this evening. I am here  at this hour, or this morning, because right here,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…a King or some kind of dictator. He said:  Let me be a dictator for one day. But his actions show he wants to be  one for much longer.\n\nMeanwhile--meanwhile--billionaires like Elon Musk have been handed  the keys to the Federal Government with little accountability.\n\nDonald Trump claims he is a better President than George Washington,  but he takes…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…lower costs or tackle the cost of living for our neighbors back home.\n\nInstead, Republicans have been singularly focused on crafting a  massive tax giveaway for billionaires like Elon Musk that is paid for  by ripping away health coverage from the people we love the most: kids,  our parents, our neighbors who rely on skilled nursing, and people with  disabilities…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…said these famous words, ``We could say they spend money like drunken  sailors, but that would be unfair to drunken sailors,'' which just  about sums it up.\n\nFor somebody like Elon Musk, who is reportedly one of the most  wealthy--maybe, the most wealthy person--on the planet to spend his  time and effort and to assemble a team like he has to work with…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}]