[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…influencing tariff policy in the United States of America.\n\nWhen Donald Trump negotiates tariffs, is he protecting American  consumers and small businesses? No, not so much. More likely, he is  cutting deals for his crypto friends. That is the essence of selling  public office, and it is corruption.\n\nBut put aside the criminal violations of law that may be…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…exists. For more than 50 years, the  general duty clause has allowed OSHA to step in when employers expose  workers to recognized hazards that are serious, preventable, and likely  to cause harm.\n\nUnder the Trump administration's labor proposal, OSHA will no longer  be able to cite employers for hazardous conditions intrinsic to a job.  That could leave…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…chair of the Congressional Black Caucus Health Braintrust, I am  familiar with the adverse statistics that face Black and Brown  communities.\n\nBlack women are three times more likely to die due to pregnancy- related causes than White women.\n\nBlack people are about twice as likely to die from diabetes than  White people.\n\nOn the South Side of Chicago, which…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…be reversing the Trump administration's  actions to close the Department of Education and rip away funding from  students, teachers, and schools.\n\nHouse Republicans are not likely to take on any of these actions that  I suggested because they refuse to take on President Trump, even when  he is breaking the law. It is clear that my Republican colleagues…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…science as well.''\n\nThis bill is not only cruel, but counterproductive too. Most  incarcerated people return home. The evidence shows that a minor  charged as an adult is more likely to reoffend and be violent after  release than a minor charged as a juvenile.\n\nD.C. residents have all the obligations of American citizenship,  including paying Federal taxes,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…because who is considered special interest changes regularly based on  DHS' security assessments.\n\nThis bill lets bad actors know in real time which nationalities are  more likely to get enhanced screening and exactly where CBP has been  stopping these migrants. Criminal organizations could then use this  information to adjust their operations and try…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…they are also driving  up prices across the board on all types of goods and services-- electricity costs. If we continue down this path, as I noted, the  average family will likely see a $2,000 increase per year.\n\nThis might not mean a lot to some of the President's friends and  family members, billionaires on his Cabinet. They are not going to care…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the United States and the democratic nations of the world  on notice, and that is why we must strongly oppose him. If we do not,  then he or other authoritarian leaders will likely try something like  this again, either in Ukraine or elsewhere in the world.\n\nMs. McCOLLUM. Madam Chair, America is not alone in our military  support of Ukraine. Our NATO…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…that lead into the Senate . . . are made of       nothing but glass, mostly glass. So they're easily       breachable. And if those doors had been breached, more than       likely there would have been gunfire at that point.\n\nThis is a quote. These are the words of Inspector Thomas Lloyd of the  U.S. Capitol Police, as reported in a new book by Mary…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…they weren't represented at a ratio of six to one.\n\nAccording to the Jewish Federation of North America, individuals on  TikTok for over 30 minutes a day were  17 percent more likely to be anti-Semitic. And last year, anti-Semitic  comments on TikTok rose 912 percent.\n\nMy fear is that a similar study would show that in between the issues  that we do think…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…unregulated. Plus, while the bill       stipulates that ``less-than-lethal projectile devices . . .       must be designed and intended to be used in a manner that is       not likely to cause death or serious bodily injury,'' the       bill fails to prohibit or even acknowledge the inevitable       modification of ``less-than-lethal projectile devices''…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…show a one-size-fits-all sentence makes no sense.\n\nJudges, not politicians, should decide sentences. Now, individuals  whose convictions are set aside under the YRA are less likely to  reoffend. That means the law works, and it keeps communities safer.\n\nNow, we also know that in nearly 80 percent of cases, judges impose a  mandatory minimum sentence anyway.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…that the intent is  to expedite the construction of the new headquarters for U.S. Space  Command, but the authority provided by this provision is broad,  permanent, and will likely be used beyond this one instance. The  Appropriations Committee meticulously considers how funds from these  accounts are to be used, and this authority offers too much room…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…any parent, if a servicemember's child can't get the care they  need, they will be distracted from their mission.\n\nUltimately, this ban will hurt our military readiness and likely lead  servicemembers to leave the military. This amendment isn't only  bigoted; it is shortsighted and would hurt our national security. I  urge my colleagues to oppose this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…is how they keep dignity. It is how they stay at home.  Unfortunately, Miguel's fears are not unfounded. The rural hospital  that he depends on treats patients who are more likely to be on  Medicaid or Medicare. In other words, they have a disproportionate  share, and if these patients, these Medicare patients, lose their  health insurance because of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…on the sidelines while small businesses paying  record wages struggle to find help.\n\nThis egregious executive overreach not only violated the  Congressional Review Act but likely reduced the fraction of people  participating in the workforce and contributed to inflation.\n\nMr. Chair, we must meet the vital supplemental food needs of  Americans that Congress…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…ensure that bankruptcy cases are quickly and efficiently  administered. While bankruptcy filings in recent years have slowed,  early data suggests that bankruptcy filings will likely increase in the  coming years. Maintaining these temporary bankruptcy judgeships for the  next 5 years will ensure that the bankruptcy system can continue to  operate at full…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Frozen food is more than just a convenient  option. It is a solution to food waste and a way to save families  hundreds of dollars.\n\nStudies show that frozen produce is less likely to be wasted compared  to fresh produce that spoils over time, giving consumers access to  affordable, nutritious food year-around.\n\nBy freezing food at its peak, we preserve…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Mexico, in my district will have to drive 1\\1/2\\ to 2 hours  to the nearest emergency room. Ask any first responder: The quicker  somebody gets to an emergency room, the more likely they are to  survive. When life or death is a matter of minutes, what Republicans  are doing this week is deadly.\n\nMr. Speaker, my colleagues on the other side of the aisle…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…jurisdictions. This is our opportunity, Mr. Speaker, to  change that, to instill significant election integrity.\n\nBefore I close, let me say that during this debate today, we are  likely to hear all sorts of comments from my colleagues on the left.  They will make arguments about disenfranchisement. They will use terms  like ``Jim Crow 2.0.'' I remind everyone…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…determination under clause       (i), including--\n\n``(aa) the basis for the determination;\n\n``(bb) the purpose for which any action was taken pursuant       to such clause;\n\n``(cc) the likely effect of the determination and such       action on the incentives and conduct of insured depository       institutions and uninsured depositors;\n\n``(dd) any mismanagement…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the last decade, competition has driven financial institutions  to lower their overdraft privilege fees to retain customers. Innovation  has made accidental overdrafts less likely as many financial  institutions now offer low balance alerts, automatic transfers from  savings, and other tools to help consumers avoid being in overdraft and  better manage…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…this  resolution last week, the element of surprise would have been entirely  lost, and the successful mission flown by our brave airmen would have  been much different and, likely, much costlier.\n\nOf course, Congress must be consulted. Of course, we can debate the  scope and strategy of our military engagements. But we must not shackle  our President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…solve this problem. They want to have a political issue they can  ride all the way to the midterm elections. That is not just a cynical  view of mine, I think that is a very likely reality.\n\nWe can do better. We need to do better. Our constituents expect us to  do better by working together to come up with affordable solutions for  them without taking…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…will cost the average family  $4,200 a year. In fact, according to the analysis, tariffs could cost  the least fortunate families on average $2,400. The middle class will  likely pay higher costs of about $3,000. Tariffs are a cost. Taxes are  a cost. If you tax a good, it is added on to the cost. This is what  happens. It happens whether inflation…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…is to buy  regenerative thermal oxidizers, which are essentially flares that burn  off the smokestack exhaust at the specific tire plants.\n\nThese devices are expensive and likely will not be able to be  installed within the 3-year Clean Air Act deadline. It is my  understanding that the tire industry estimates that it will cost about  $100 million to…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…response to this tragic event, the Department of Homeland Security  launched the BioWatch program, a monitoring system that collects and  tests air samples for biological agents likely to be used in a  bioterrorism attack. This program has played an essential role in  keeping us safe, providing valuable data on potential biological  threats.\n\nWe must do everything…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…it literally doesn't take planes falling out of the sky.  Tonight, you can continue your shutdown, but you can vote to pay the  air traffic controllers so that is far less likely. If you vote no and,  God forbid, it actually happens, can you live with yourself?\n\nI came to the floor 2 weeks ago in as nonpartisan a fashion as I  possibly could, begging…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Broadway, downtown, and its current location on Opry  Mills Drive. Both locations enjoy hundreds of thousands of visitors  every year.\n\nWithout the Grand Ole Opry, we would likely not know names like Hank  Williams, Patsy Cline, Loretta Lynn, or Willie Nelson. Heaven forbid,  we might not even know Dolly Parton, had it not been for the show.\n\nWSM, those…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…ensure that rural America gets a fair shot--nothing more  than the law requires. When medical students have a chance to train in  rural America, we know that they are more likely to stay in rural  America.\n\nFinally, I want to applaud the University of Dubuque for announcing  the John and Alice Butler College of Osteopathic Medicine. This will  help…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}]