[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…and  Republicans want to make it more difficult to receive Social Security  rather than strengthen Social Security.\n\nInstead of a wasteful, time-consuming, silly bill like this, why  don't we work together and bring to the floor a bill that will  strengthen Social Security? That would be a help to our neighbors back  home.\n\nI think what it comes down…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…legislation. All  it does is to say in a case where, say, nobody is hurt at all, the case  of somebody who is asleep in their car in Arizona, for example--there  are statutes like that  where you don't even have to be in a moving vehicle. If someone is  drunk inside a vehicle, nobody is hurt, and there is no property  damage, that person could be deported as a…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…guest, I know firsthand the  dedication of WJBC's incredible team--past and present--who have made  this station a pillar of local journalism. From legendary broadcasters  like Don Munson and Steve Vogel to today's voices like Scott Miller,  WJBC has been a reliable source of news, sports, and thoughtful  discussion.\n\nWJBC continues to cement its legacy…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690795/recognizing-wjbc-radios-100th-anniversary"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…worked or been married because of her       mental disability, and she is dependent on her Medicaid       benefits. Please keep these benefits in place for people like       my sister who don't have much in their lives they can depend       on.\n\nLaura, your sister is now living with you after being separated from  your parents, who are now in a nursing…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…was required of him. The officers did  what was required. I am not mad at any of them.\n\nWhen you protest, be prepared to suffer the consequences. You don't  have to like them, and I don't, but I wasn't here, so I was at home.\n\nHe uses that word ``lunatic,'' and he used it against people sitting  right here on this side of the aisle. He called the Members…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Department of Justice. By the way, the President made the  request that this be done.\n\nThe attorney general for the State of Texas said, no, they don't do  business like that. They don't draw lines to benefit people of color.  They draw their lines to gain some partisan advantage.\n\nLet me read just a little bit more of what it says in this one  paragraph.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…attacking Second Amendment  rights.\n\nSo I am here to join my colleagues to say, what are we going to do to  fix this system? What are we going to do to make sure that tragedies  like this don't happen and that we investigate the truth--not make up  something about the situation minutes after it has happened?\n\nI say this because my State has struggled with these…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…corporations. That wasn't a partisan idea. It is now, unfortunately.\n\nI am grateful to Senator Kelly for bringing us down to the floor to  talk about the way our citizens feel like they don't have power, the  way that the Citizens United decision has left our voters feeling like  the game is rigged. But it is kind of sad that it is only Democrats  down here…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Democrats are going to  offer tomorrow. It is going to be a simple, straightforward extension  of the healthcare tax credits these families depend on, so that  families like this don't have to rely on hope alone.\n\nAnd my Republican colleagues, they are going to have a different  plan. Instead of lowering people's premiums, they are going to give  everyone…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that given the five  basic planks of this resolution, which had been expressed on both sides  of the aisle, that we would have something other than arguments that  sound like, I don't know, moldy bread, stale cheese; arguments we heard  time and time again about a shutdown.\n\nBut my resolution and my remarks tonight didn't even mention the  shutdown.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…brother. He is a friend. Colleagues, he is a human  being--just one of many cases.\n\nSo don't tell me the Trump administration is following the law when  we hear cases like this, and don't tell me that the administration is  only targeting dangerous, violent criminals because the data proves  otherwise.\n\nAs his family was scrambling to find details about…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…you, I really have come to have a  lot of affection for you. I am going to miss you. This place is going  to miss you. I hope if I see you out and about, you don't pretend like  you don't know me and I can tell you what an honor it was that we  served together in the U.S. Senate.\n\nI think I speak for 99 other people in telling you how grateful we  are.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…around this place, is we don't treat the voters like they have  an IQ. Stop talking down to America. I will argue that many of them are  a hell of a lot smarter than people like me.\n\nWe don't get to actually put net interest into our reconciliation  budget. As a matter of fact, there is nothing we get to do about it.  There is some things we could have if…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economy  this year. Try to keep that number in your head because we are going to  come back to that in some charts and explain why that is so  devastating.\n\nMr. Speaker, it is like we don't care about people's retirement, our  kids, the next generation, and how the hell they will actually cover  any of the scale of debt. Then we lie about what drives the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…heroic efforts by U.S.  Capitol Police and other local and Federal law officers who defended us  and our democracy on January 6.\n\nIt is not a scary thing. The plaque looks like this.\n\nDon't you agree, Mr. Speaker?\n\nIt is lovely. It recognizes their heroic efforts, and it is the law.  It was signed into law by the President that this plaque goes up.\n\nWhat…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Capitol Police,  whom I walk past every day. Mr. Speaker, I urge every Member, as they  go past our police officers, not to grumpily look at them, not to pass  by and act like they don't exist, but to take a moment to shake their  hand, tell them thank you, and look them in the eye and tell them how  much you appreciate them.\n\nWe couldn't conduct our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}]