[{"senator": "Al Green", "party": "Democrat", "sentence": "…kind of hate for those who may not have analyzed this to  the extent that I have. That is a kind of hate. We call that racism.  Racism is a form of hate where we just don't like people because they  show up with the wrong complexion. That is Texas. By the way, that is  my State.\n\nIn Texas, persons could not vote because they were of color. They  could…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…the coming period as this continues on because I know it is so  easy to make it feel like, again, it is just completely detached.  Often, it really seems that way. It feels like people here in the  Senate, here in Congress, at the White House, we are playing with other  people's chips, that we don't feel it ourselves.\n\nI have to say, I found it disgusting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…class no longer exists. You are  either rich or poor. Politicians today have no real understanding of  what it is like to struggle every single day. If they had to live like  regular people, maybe things would improve for seniors like me.''\n\nMr. Speaker, Becky lives in Louisiana's Third Congressional District,  a district represented by our colleague Representative…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…How many  lives need to be lost before Republicans tell the Trump administration  to stop the decimation of SAMHSA?\n\nI have other questions, too. They are simple ones like: How many  people work at SAMHSA currently? What divisions have no staff left at  all? What programs have they had to cut in local communities?\n\nIn February, following the firing of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…every single day, just like us  here in the Democratic Party. We would never know that from this bill  or when we are listening to our Republican colleagues.\n\nFor people like me, for people who have buried their son or their  loved one, their daughter, their big sister, or their little brother  before their time, we really know what is at stake. We cannot…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is not in session?\n\nMy Republican friends are so in the pockets of billionaires and the  well-off and the well-connected, I don't think they know what real life  is like for so many people in this country, how difficult it is.\n\nWhen we talk about programs like SNAP, I have a news flash for you.  The majority of people on SNAP who are able to work, work.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…would like to spend a moment talking about the consequences of the  administration's policies, both tariffs and the erratic behavior, that  have an impact on people like myself, people who owned restaurants for  decades, and the thin margins they operate under.\n\nMr. Speaker, recent surveys have said, 42 percent of small businesses  reported increased…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691262/rising-costs-for-small-businesses"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and instability Haiti is experiencing       right now (and, not to forget, the US's role in fomenting       that instability over the years). Our Haitian neighbors, like       all people, deserve to live with dignity, peace, and freedom.       That is what allows people to not only be healthy, but to       thrive, and to contribute to our Commonwealth…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…``criminal'' immigrants that he promised he would go after, but  targeting anybody that looked like me, looked like my colleagues,  looked like my family members, looked like the people who live in Los  Angeles.\n\nI don't know any MS-13 members, gang members, who work at a car wash  or as day laborers. That is where he was targeting, not focused on  people…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…right now. I was on the phone. I wasn't  saying: Hey, who did you vote for? I said: Hey, can you help my dad?\n\nThat is what Americans across this country are asking, like, are you,  the people in power, the people with the gavel, are you going to help  me?\n\nMake me drop my notes.\n\nI want the party in power to say: Yeah, I am going to help you. I am  going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…of  Colorado and across the Nation are on Medicaid. This will significantly  impact red States, blue States, and especially the rural places across  the United States.\n\nLike many people, my family has been impacted by the opioid epidemic.  When I was just 6 years old, my mom hurt her back. She was  overprescribed opioids and became addicted like so many…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…what  my staff has researched for me.\n\nThe knowledge and skills of our young people and the things that they  learn in school should not be limited to people who look like them or  only people with similar backgrounds and experiences. We learn from  each other when we bring to discussion a plethora of backgrounds and  experiences that we can learn from.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…proactive approach to reducing crime in the  District and today is experiencing a three-decade low in crime.\n\nD.C. has done this in part by having a police force that looks like  the very people it is sworn to protect, lives in the community it  serves, and caters to the unique needs of D.C. residents.\n\nMrs. McIVER. H.R. 5143 discourages basic public safety,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695638/district-of-columbia-policing-protection-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…cause to stand up for our servicemembers and our shipyards, to stand up  to determined and dangerous common enemies like Vladimir Putin, and to  stand up for our allies like the people of Ukraine.\n\nI read every bill we vote on, as we all should. This one is 2,000  pages, and I fear that the 200 amendments that have just come to this  floor are going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695157/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…aspect, but not to the substitutes for meat.\n\nMr. GOSAR. I am interested in the substitutes because I don't think  our warfighters should have to have that, and I would like people to  make that distinction, even if it costs the amendment.\n\nMr. Chair, I yield back the balance of my time.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…think that is weird, then you  need to get on the internet and listen to what they are doing. You need  to watch their behavior. And they mean what they say. And don't be like  the people in the thirties that got it wrong. Israel is not going to  get it wrong the second time.\n\nDonald Trump. God bless President Donald J. Trump. I am so glad he  won. What…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…enemies will stop at nothing to  destroy us, and they don't care how they do it. These enemies would  stoop so low as to target our young people. For years, countries like  the People's Republic of China have used our own universities to  advance agendas that hurt American security.\n\nAside from the state of Qatar, there is probably no other country…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…in his office labeled unacceptable words, and he meant it.  The words ``stakeholders,'' ``empower,'' and ``equity'' were banned. He  thought government should sound more like the people it serves. He  hated what I called LaMalfa-isms, overcomplicated government  explanations for simple things, like saying that the transportation  infrastructure is undergoing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698710/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tolerate--because I have been doing these for a decade, and I am just  exhausted. I am frustrated. I am angry.\n\nMy brothers and sisters here, Democrat and Republican, I like most of  these people, and I am crushed. I am just absolutely intellectually,  emotionally, even physically crushed at the inability to tell the  truth. We don't want to tell the truth…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…subsidies directly to them to cover nothing because  they never used it.\n\nThe percentage of people who weren't using their health insurance  went up significantly. It wasn't like people were getting hurt or sick  at a similar rate. What was happening was they didn't know they were in  the system. As part of the GAO study will explain, they were getting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…New York State--minimal coastline--is in a  dark color. Pennsylvania is in a dark color.\n\nThis is called river ring flooding, where you have a river and it  comes down like this, and people building in the valley get flooded  because the river overflows its banks, and it fills up that V-shaped  valley. So that is why you would see flooding.\n\nAnd so that…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…when socialism comes to America, it will come  as a smile.\n\nVenezuelans are not the first to be seduced by the siren song of a  benevolent and all-powerful government. Like every people who have  blundered down that road, they awakened one morning to find the  benevolence was gone and the all-powerful government was still there.  Let that be a lesson…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…pay-as-you-go systems, which is  Social Security and Medicare, at a time when we have a shortage of  young people. There is a way to make it work.\n\nAre you going to allow people like me, people who are here willing to  think to be able to refine the process, to modernize?\n\nLook, we will try to touch on this if I have time. Here is the MedPAC  report from last…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…happened on that day, May 31, into June  1 of 1921. It is what it was like before, when it was Black Wall  Street, a thriving community. It was like what it was like afterward,  when people stayed and rebuilt a community. It is like what it  is now. It is people with great pride who continue to be able to thrive  in that community and still call it…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…make decisions as to whether or not these crimes are duplicative,  whether they might be contradictory, and whether maybe they go too far  or not far enough.\n\nWe feel like the people's House, for sure--Congress in its Article I  function--ought to know how many crimes there are and what penalties  are associated with those crimes so that the American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of  making billions and billions of dollars scoring people as sicker. Read  the articles.\n\nTurns out, I think this bill the Democrats would like, the  Republicans would like, and people who do math will really like.  Talent-based immigration is great for long-run economic growth. It  actually fulfills even things the President talked about on the  campaign…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}]