[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…from major U.S. stock  indexes--a consequence of the AFFE rule--BDCs experienced 29 percent to  33 percent lower investment growth compared to peers. The effects were  not limited to the financial sector: companies that relied on BDC  capital saw lower job creation, with employment growth falling by 1.5  to 6.4 percentage points compared to pre-exclusion…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Attorney       General who represents the public interest. Changes to these       charter agencies would significantly undercut the already       thin ties to autonomy that limited home rule provides.\n\nFinally, I urge you not to up end our three-pall education       funding SOAR Act. I have long supported the program to expand       opportunity for DC…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District's tax administration system to conform with legal       requirements prior to the Tax Amendment Act's enactment. The       necessary changes include, but are not limited to:\n\nUpdating forms, schedules, and instructions. Forms and       other relevant filing documents must be developed.       Additionally, preparation for each filing season…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…up to 12 or more hours to come online. Coal plants are inherently  inflexible, and that worsens grid congestion. By forcing coal plants to  stay online, we are occupying our limited transmission capacity with  inflexible generation. That prevents cheaper and cleaner resources from  being delivered.\n\nThis is a real concern. Independent market monitors…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…support or passionate opposition, in  connection with this bill. My hope was that hundreds of Members on both  sides of the aisle could participate in it.\n\nInstead, we have a limited debate where the relevant committees of  jurisdiction have been given 15 minutes each on a bill of such  significant magnitude as it relates to the health, the safety, and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…they can't  get any answers by phone.\n\nThis is outrageous, and I am so afraid of what is happening to those  who depend on Social Security. I am so afraid that seniors with limited  amounts of Social Security are going to end up hungry. Of course, they  wouldn't be able to pay any rent unless they are getting subsidized by  HUD in some way.\n\nLet's go…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Individuals with Disabilities  Education Act, and the Higher Education Act are some of our Federal  laws that work to ensure that opportunities to learn and advance are  not limited by income, race, ethnicity, or disability.\n\nThe expansion of public education is a great American story. Yet,  today, it sometimes seems to have been forgotten. Some argue…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…America the Beautiful pass that  covers entrance fees and standard day-use fees for national parks and  other Federal recreation sites.\n\nHowever, eligibility for this program is limited and leaves some  families out because of a technicality. This bill would fix that  oversight by broadening access to include families of servicemembers  who died during inactive…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691052/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…disability are employed. This is not because they lack the  skills or the willingness to work, but often because they face  persistent structural barriers, such as discrimination, limited  flexibility in the workplace, and inadequate transportation options,  among others.\n\nWhile small firms employ half the private-sector workforce, they may  face challenges…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…so to protect their residents and to protect their environment.\n\nLastly, let me just conclude by stating something that has  conveniently been stifled in this whole debate--limited debate--and  conversation. So who benefits from all of this? It is not unleashing  job creation and innovation in States--the other 49 States--but  California. It is holding…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…fact, children  comprise as many as half of those living with rare diseases. Yet, here  is the reality for those children: Treatment options for children  remain extremely limited compared to those for adults.\n\nWe know that children respond to cancer treatments differently, but  there is limited research on how these therapies impact them. We owe  our…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…about the sciences. Do we want to go  to Mars? Who is going to take us there? It is going to need the  ingenuity and expertise of the American people.\n\nThe cuts are not just limited to NASA and the National Science  Foundation. They are cutting healthcare research, as well.\n\nA woman in my district said her son has a disease for which NIH was  researching…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…procedural protections for defendants.\n\nChief Justice Rehnquist said:\n\nIn our society liberty is the norm, and detention prior to       trial or without trial is the carefully limited exception. We       hold that the provisions for pretrial detention in the Bail       Reform Act of 1984 fall within that carefully limited       exception. The act authorizes…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…executive order that  stripped collective bargaining rights from roughly 67 percent of the  Federal workforce, so more than two-thirds of the Federal workforce.\n\nRemoving their limited bargaining rights does not improve efficiency.  It threatens the integrity of our civil service. These rights exist for  one essential reason: to shield Federal employees…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…monthlong debate.  Wars happen quickly, and they necessitate quick action, according to  the Constitution.\n\nYes, we have always accepted that there has to be an exception--but a  limited exception--to that supreme clause in the Constitution. If there  is an imminent attack against the United States, of course--of course-- the people of the United States want…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…number of AGOA countries, including Angola, Mozambique,       Tanzania, and Zambia.\n\nQ2: What is AGOA's impact on critical minerals supply       chains?\n\nA2: AGOA offers limited tariff advantages to the mining       sector, since most minerals already face relatively low       tariffs. Its real value lies in the realm of soft power. In       June…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…This legislation that is Commerce, Justice, Science Appropriations  Subcommittee work product strikes a careful balance, funding critical  resources while also protecting limited taxpayer dollars. The spending  that we always worry about being too much is addressed in this  legislation to make sure that we are on a different path than continued  borrowing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…bipartisan, nonpartisan consensus: Iran  cannot get a nuclear weapon. The targeted yet overwhelming strikes  executed this past weekend were precisely tailored to achieve that  limited, yet vital mission.\n\nLet's remember who we are dealing with here. The Iranian regime is  the world's foremost sponsor of terror. They have funded monsters,  sponsored violence,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…supposed to do. It is  supposed to start us down the path.\n\nIf we find that there are other issues that Congress needs to step in  and deal with, then we can do so. We are not limited to taking action  only in December 2025. That is why we have a legislative body that will  consider if this bill does good.\n\nI submit to you, Mr. Speaker, that the SCORE Act…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…security, economic opportunity, and  community development.\n\nCongress' direction that DOI establish and administer a competitive  lease program was nondiscretionary and much more limited than the  action DOI took in the 2024 ROD. To the extent DOI, or any other  Agency, imposes permit terms or operational requirements that impede  the economic feasibility…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…aviation--it was a profound act of compassion. It marked a turning  point in how we approach health care access for those living in rural  communities. For areas long burdened by limited infrastructure and  geographic barriers, this moment offered something far greater than  innovation--it delivered dignity and hope. It was, in every sense, the  ``Kitty Hawk…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…would love to see is let's open up the conversation  about how we have associations of healthcare plans. Right now, the  small business owner I talked to earlier this week is limited to only  choosing things in the ObamaCare Marketplace, and the price is  absolutely skyrocketing for him. He doesn't have the option to actually  join together with other…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…full compliance with that guidance. The  guidance is very simple. No. 1, if the President is going to take  action, it must, No. 1, be in the national interest and, No. 2, be  limited in nature, scope, and duration. And, of course, that is further  modified by the action that Congress has taken in the War Powers Act.\n\nWhat this President did with this single…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…opportunities and partners to strengthen their       regional economy.\n\nInstead of working with Arctic Slope communities to create economic  opportunities, the Biden-era ROD further limited the economic prospects  available to those in the region, reducing investment and cutting off  essential new infrastructure that would support resource development.\n\nDuring…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and cultural well-being of the Navajo       People and the Navajo Nation.'' See Navajo Nation Council       Resolution CAP-20-13 (2013), NTEC is, thus, a Navajo Nation       limited liability company with one shareholder, the Navajo       Nation. NTEC owns and operates three surface coal mines       within the Powder River Basin, including one mine--the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…from around the world of undersea cables being severed with recent  examples of this occurring in both Taiwan and the Baltic.\n\nIn the United States, as these cables have a limited number of  landing areas, our adversaries would have the ability to cut off an  increasing portion of communications, internet activity, and financial  transactions by attacking…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…and the Caribbean since the start of  2025. This is enough cocaine to harm nearly 170 million Americans.  Congressional authorization is not required to carry out precise,  limited strikes.\n\nMy colleagues did not object when prior Presidents conducted military  operations in Yemen and Libya and Syria, operations which were also  limited and successful.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…free-market principles  that built our Nation has declined. This shift endangers the core  values handed down by our Founding Fathers: liberty, personal  responsibility, and limited government.\n\nWe cannot ignore these warning signs. We cannot allow the failures of  socialist systems abroad or here in the United States to be rewritten,  dismissed, or forgotten.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Small businesses are the backbone of this country. Everyone on both  sides of the aisle knows that. They drive innovation and job creation  in our districts, but they are often limited from reaching their full  capacity or capability because of overregulation.\n\nThe bill introduced by our subcommittee chair, Ann Wagner, addresses  this challenge by directing…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693957/small-entity-update-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…here. They are not  necessarily a moral and religious people. They may not respect our  Constitution. When they eventually participate in our elections, will  they vote for the limited government that our forefathers felt that we  needed, a limited government that is required?\n\nMost countries built on elections wind up collapsing, and they  collapsed because…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}]