[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Legos, one  of his favorite toys. As a dad, this hits home for me. My girls are  Lego and Disney Princess fans. I have watched the movie about ten  times.\n\nFrom Transformers to Lincoln Logs to Barbies, this administration is  raising prices in our toys aisles with these tariffs. We keep hearing  that this President is ushering in a golden age. I  think raising…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692923/lowering-costs-for-all-virginians"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Constitution starts out with the  three words ``We the People,'' and they are written in supersize font  to tell you that that is what the core of our democracy is all about-- or, as Lincoln so well summarized, government of, by, and for the  people.\n\nThere are several things essential to make this happen: the freedom  of speech, for one; the freedom of assembly,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Medicaid. Yes, he voted with Republicans on this.\n\nMr. Speaker, you can be sure he will be hearing from his constituents  because people know.\n\nI will close by saying that Lincoln said:\n\n``Public sentiment is everything. With it, you can accomplish almost  anything. Without it, practically nothing.''\n\nHowever, for public sentiment to prevail, people…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…shop for themselves or they don't worry about  paying rent. They don't care about us. Trump said he would drain the  swamp. What a bunch of BS. He moved the swamp into the Lincoln bedroom  for God's sake.\n\nThe bottom line is simple: He has not done a single damn thing that  he promised to do. Not only have they failed, they have failed  catastrophically,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…joint address, Master Sergeant Roland L. Cooper. Roland, known to many  back home as ``Coopdawg,'' has spent years fighting for veterans in New  Mexico.\n\nAs chairman of the Lincoln/Otero County Veterans Leadership Council,  he has seen firsthand the barriers that rural veterans face: long  travel times for medical care, unreliable transportation, and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…one big, ugly bill. Real  leadership requires working with Congress as a separate and coequal  branch of government to actually lift people up.\n\nMr. Speaker, when President Lincoln addressed the House of  Representatives--I believe it was his second annual message to Congress  on December 1, 1862, in the middle of the Civil War, an existential  crisis…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the aisle to stand with me in support of the Women's Bureau  and the crucial opportunities and protections it provides for women in  the workforce.        Congratulations to Lincoln High School and Sprague High School\n\nMs. BONAMICI. Mr. Speaker, I rise today to celebrate and congratulate  two high school teams on their recent cochampionship win of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…supercharging the private-sector deals. The  problem is that is not going to build the communities that have been  hollowed out.\n\nWe know what builds communities from Hamilton to Lincoln to FDR. We  need a government that says: If you make it in America then we will buy  it. That is what we did, by the way, for SpaceX. That is what we did  for Intel. That…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…United States Senator.\n\nI would prefer to stand by the tradition of free speech and even the  tradition of heckling. There is a fine American art of heckling. If you  read the Lincoln-Douglas debates, I recommend the Harold Holzer version  of it because the newspapers carried all of the hecklers' comments,  too. People would get up and heckle, and Lincoln…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688507/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…treatment of Ukraine and our giving in to the Kremlin. But that  President, who was looked to as a portrait of the American conservative  movement, watching as the party of Lincoln and Teddy Roosevelt and  Reagan completes its transformation into the party of Donald J. Trump,  it probably doesn't recognize what it sees.\n\nWhat happened to ``States' rights''?…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Mr. President, this weekend, across the country, we  observed our Nation's 249th Independence Day, a day intended to  celebrate a government of, by, and for the people, in Lincoln's words.  But this Independence Day was anything but a celebration in one  respect, and that is because, this Fourth of July, the President and  congressional Republicans…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…citizenship in the United States.''\n\nDouglass believed the Civil War offered the Black soldier an  opportunity to gain his stripes, but he could not convince his friend,  Abraham Lincoln, to allow Blacks to serve. In August 1862, a formerly  enslaved Black man from South Carolina came here to Washington and  convinced Lincoln to allow Blacks to serve.\n\nHistory…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…his  daughter and nephew William Thomas Carroll, Clerk of the Supreme Court  and member of the prominent Carroll family. William Thomas Carroll  provided President Abraham Lincoln with the Bible that was used for his  first inauguration, which has since become known as the ``Lincoln  Bible.''\n\nThe House flourished under the ownership of the Carroll…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…starting with  the Constitution of the United States of America. The President wants  to keep all of these gifts from foreign dictators. Come to Congress.\n\nThat is what Abraham Lincoln did. The King of Siam gave Abraham  Lincoln elephant tusks. This is in the middle of the Civil War. Check  out the descent of honor and integrity in our country. In the middle…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…opportunity for partisan  division. Why? Why can't we honor law enforcement together and follow  through on our word?\n\nMr. Speaker, I am pleased to hear my colleague invoke Abraham Lincoln  in the rejection of disunion secession and violent attack on the  Federal Government.\n\nNeither of my colleagues who is on the floor has said a word  explaining why they won't…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Nebraska's role in that.\n\nIn the agriculture and rural development funding bill, I secured $16  million for the USDA's Agricultural Research facility at the University  of Nebraska-Lincoln. This investment will support research that  benefits Nebraska producers and strengthens American agriculture.\n\nIn the Commerce-Justice-Science funding bill, I secured over…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…resolution condemns the violence, but there is something far  more sinister afoot that strikes at the very foundation of a  constitutional Republic: the rule of law. As Abraham Lincoln told the  Democrats long ago: ``There is no grievance that is a fit object of  redress by mob law,'' and this generation of Americans is taking note.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…honor and congratulate  Illinois Fourth District Appellate Court Justice, James ``Jim'' Knecht,  as he reaches the milestone of serving 50 years as a judge.\n\nJim was born in Lincoln, Illinois in 1944 and graduated from Lincoln  Community High School in 1962. Afterwards, he attended Illinois State  University and earned his Juris Doctor from the University…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…housing.                    Celebrating 100 Years of Bryan Health\n\nMr. FLOOD. Mr. Speaker, today, I rise to recognize and celebrate a  truly remarkable milestone for the city of Lincoln and the entire State  of Nebraska, the 100th Anniversary of Bryan Health.\n\nSince first opening its doors in 1925, Bryan Health has grown from a  hospital in Lincoln into one…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…dominance was on full display as the team captured individual  State championships in three of four events. Senior captain Claire  Rawlins led the way with a perfect 6-0 record in Lincoln-Douglas  debate, tackling the timely question of artificial general  intelligence. With four career State titles and a remarkable 29-3  record, Claire's leadership is unmatched.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. Cleaver and Mr. Flood have  done, as I say, benefiting a big city like the Los Angeles Basin all  the way to a capital city like Little Rock, Arkansas, and certainly to  Lincoln, Nebraska.\n\nI am so pleased to have the leadership of the gentleman from Nebraska  (Mr. Flood), who serves as the chair in this Congress of the Housing  and Insurance Subcommittee.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…taking place this weekend.\n\nNow, John Adams is an exceptional school in my district. As a matter  of fact, they have three schools now--in Roseville, El Dorado Hills,  and Lincoln--and there are hundreds of families on the waiting list.  This is a charter school. The school is so popular that there are  hundreds of families who want to go there, as…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…creativity touched everyone who knew her. Layla passed  away on August 7, 2024, after a heroic 2-year battle with cancer.\n\nLayla grew up in Pearl River, New York. She attended Lincoln Avenue  Elementary, Pearl River Middle School, and was a rising sophomore at  Pearl River High School where she earned High Honor Roll.\n\nLayla excelled on the varsity bowling…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…lecture us about morality.\n\nThere is a war on immigration enforcement right now in our country.  There is a war on the rule of law itself. It is the ``mobocratic  spirit'' that Lincoln spoke of in 1838.\n\nSome of the Democratic Party politicians in this city might want to  pretend that is not what is going on here, but their friends on the  streets out there…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…dedicating his life to eliminating slavery. I can't help but think of  the divine providence that allowed John Quincy Adams for one term to  serve in the same Chamber as Abraham Lincoln. I think God smiled upon  our Nation when he did that to pass the torch on to Abraham Lincoln and  end that scourge for America and for mankind.\n\nMr. Speaker, by reauthorizing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…look closely, paw prints  left behind by this stray spirit can be spotted outside the entrance of  the Old Supreme Court Chamber.\n\nFrom poltergeists to apparitions of Abraham Lincoln and other dead  Presidents, Washington has a long history of ghost stories.\n\nThe city itself was transformed into a ghost town when government  workers disappeared from their…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Elsasser, Taylor Frauendienst,       Shelby Hoobler, Shelby Kirkbride, Harper Klinger, James       Neishabouri, Kinzley Nusbaum, Michael Tully Rubich, Lukas       Salsgiver, Lincoln Searle, Vesper Seitz, Loriana Walter", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…battlefield, I was challenged to think anew about what it meant that  50,000 Americans were the casualties of that pivotal conflict on the  fields at Gettysburg.\n\nPresident Lincoln, months after, spoke in dedicating the cemetery at  Gettysburg. At that point, it was ``four score and seven years ago.''  Today, it would be 12 score and 10 years ago because…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…Memorial, because of the  efforts of the Honor Flight of Southern Oregon. Whenever I have the  opportunity to meet these heroes, I am reminded of the words of  President Abraham Lincoln: ``The struggle of today, is not altogether  for today, it is for a vast future also.'' Our veterans embody this  spirit, having fought valiantly in the Korean and Vietnam…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…rights and  women's suffrage, and became one of the most forceful orators in  American history. During the Civil War, Douglass recruited Black  soldiers, met with President Lincoln to advocate for equal pay and  treatment, and worked to assist those escaping slavery.\n\nAfter his Rochester home was destroyed in a suspected arson attack,  he moved to Anacostia…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]