[{"senator": "Gary Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. President, I rise today in opposition to Linda  McMahon's nomination to serve as the Secretary of the Department of  Education.\n\nAll across America, from small towns like Grand Marais to cities like  Grand Rapids, public…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…office. He called upon the Republicans  to stop, not to proceed, and my Republican colleagues didn't. That left  us with the current crisis.\n\nWe have a proposal. Congresswoman Linda Sanchez' U.S. Citizenship Act  will modernize our immigration laws, strengthen our economy, and  provide for a responsible approach to border management, family  reunification,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…80  percent of students who go to public schools.\n\nColleagues, that is the situation. That is the context in which we  find ourselves today as we consider the nomination of Linda McMahon to  serve as Education Secretary.\n\nWe could talk about Linda McMahon's qualifications, or, frankly, lack  thereof, but I am not shocked because President Trump isn't…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, I rise today to speak on the importance  of the Department of Education and my grave concerns about the  nomination of Linda McMahon to be the Secretary of Education.\n\nPresident Trump has made it clear what his directive is for Linda  McMahon. It is to dismantle the Department of Education. And despite…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688251/nomination-of-linda-mcmahon"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, as we celebrate Public Schools Week, Senate  Republicans are preparing to confirm Linda McMahon, another of  President Trump's billionaire patrons, as Secretary of Education, and I  oppose such nomination.\n\nDuring her confirmation hearing, Mrs. McMahon demonstrated…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…6500, the AGOA Extension Act.\n\nLet me first thank Ways and Means Committee Chairman Smith, Chairman  Smith of the Trade Subcommittee, Ranking Member Neal, and Ranking  Member Linda Sanchez for working on this in a bipartisan way and  getting it over the hurdle.\n\nMadam Speaker, I also have to think about an individual who mentored  me. I cannot think about…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…County. These individuals embody the  spirit of civic engagement and community service that strengthens the  social fabric of our region.\n\nThis year's distinguished honorees are Linda Hill Anderson, Sandra  Atkins, Timothy G. Curtin, Barbara Effman, Helena Friedman, Susan  Gilbert, Juanita Gray, Mona Malbranche, Melinda Montgomery, Dr. Irving  Rosenbaum,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, I rise today to congratulate Linda Larson on  fulfilling her lifelong dream of completing her college education.  Linda graduated with an Associate's Degree with an emphasis on  political science from Inver…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. LARSEN of Washington. Mr. Speaker, I rise today to congratulate  Linda McCarthy on her retirement from Mt. Baker Planned Parenthood and  thank her for her many decades of service and dedication to the people  of Northwest Washington.\n\nSince 1977,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689685/recognizing-linda-mccarthy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…funded special education. Right now, the Federal Government is only  covering 12 percent of the tab, and that is unacceptable.\n\nNow President Trump and Education Secretary Linda McMahon are  threatening the very foundation of public education. They are slashing  education funding, stealing from children to give tax breaks to CEO  billionaires and millionaires.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…prioritizing       weaponizing these laws to advance discrimination instead       of protecting students, including pregnant and parenting       students. Education Secretary Linda McMahon fired nearly       half of Department staff--with the Office for Civil Rights       (OCR), which is responsible for ensuring schools comply       with federal civil…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…and civil rights protections for their children under this  landmark law.\n\nOn March 20, 2025, the President signed an executive order directing  the Secretary of Education, Linda McMahon, to facilitate the  dismantling of the Department of Education, which raises significant  questions about the future of IDEA and the impact on the education of  these…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…bill also extends the safe-to-report policy to the entire Coast  Guard personnel, the entire service. That was done administratively by  the last Commandant of the Coast Guard, Linda Fagan, who, again, I  think was very focused in terms of making sure that the safe-to-report  policy was going to be in place to eradicate activities that really  harm the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, before my colleagues vote on the next  vote, Linda McMahon's nomination for Secretary of Education, they  should remember that a vote for Mrs. McMahon is a vote for draconian  cuts to education and rising property taxes for…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688393/nomination-of-linda-mcmahon"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Adam Sterling, US Ambassador, retired; Clyde Taylor, US       Ambassador, retired; Harry Thomas, US Ambassador, retired,       Former Director General of the Foreign Service; Linda Thomas-      Greenfield, US Ambassador, retired, Former U.S. Permanent       Representative to the United Nations; Susan Thornton, Former       Assistant Secretary of State;…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…has dedicated his career to community service.\n\nFrom earning the rank of Eagle Scout to coaching on the football  field and raising a family with his high school sweetheart Linda, Mr.  Arve embodies dedication, integrity, and hometown pride.\n\nFurther, his decades of experience in charity auctioneering, show his  unwavering community spirit.\n\nMr. Arve's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690190/recognizing-mr-harold-r-arve-jr"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, the Senate will soon vote to confirm  Linda McMahon to be Secretary of Education.\n\nI know that some people feel that the Secretary of Education should  have extensive experience in a school system; however, it is important…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Commerce  Committee and look forward to seeing this legislation passing Congress  and being signed into law by President Trump.               Expressing Gratitude to Arnie and Linda McClure\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to honor the  community impact of Arnie and Linda McClure of Shirleysburg,  Pennsylvania.\n\nArnie is an accomplished…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Lakewood       Ranch High School; McKenzie Gorskey, Lakewood Ranch High       School; Jennifer Grant, Lakewood Ranch High School; John       Wilkerson, Lakewood Ranch High School; Linda Chamberlain,       Manatee Technical College; Hannah Hunter, Willis Elementary       School; Noelle Kourakos, Willis Elementary School; Kathleen       Bayliss, Sea Breeze Elementary…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690566/congressional-education-award"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Jordan: Bloomberg News; Fahrenthold, David: New York Times;       Fedor, Lauren: Financial Times; Felder, Rafi: MLEX US;       Feldman, Victor: CQ Roll Call; Feldmann, Linda: Christian       Science Monitor; Felker, Edward: CQ Roll Call; Fellmann,       Fabian: Tages Anzeiger; Ferran, Lee: Breaking Defense;       Ferrechio, Susan: Washington Times;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…world-famous  Houston Livestock Show and Rodeo since 1975, serving on the Calf  Scramble and Livestock Committees.\n\nAfter moving to Huntsville in 2011, Richard and his wife Linda, have  been supporting the FFA and 4-H youth of Walker County through the  annual county fair auctions and fundraisers in conjunction with his  service to the HEARTS Veterans…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696281/recognizing-richard-reagan-horn-with-a-congressional-veteran-commendation"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…the Life of Bob Sekerak\n\nMr. MILLER of Ohio. Mr. Speaker, I rise today to honor the life of  Bob Sekerak, a proud Clevelander.\n\nBorn to John and Mary, and beloved husband to Linda, Bob's greatest  joy was his son, Brian.\n\nDrafted into the Army during the Vietnam war, Bob served honorably as  a medic in Seattle.\n\nAfter the war, he returned home to Hinckley,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Minerva Water Supply Corporation; and for  17 years has served the Minerva community as a volunteer fireman where  he currently serves as their treasurer.\n\nAlongside his wife, Linda Matocha Masur, Danny has dedicated 58 years  of marriage to raising four children and has extended his love and  commitment to nurturing nine grandchildren and one great-grandchild.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…central Arkansas and the deep respect our communities all hold for our  Nation, its defense, and the men and women who wear the uniform.                          Honoring Dr. Linda Jackson\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to recognize Dr.  Linda Jackson.\n\nLast year, Dr. Jackson was honored with the Outstanding Alumna of  2025 Award from…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…the courage of their family  members who gave the gift of life on their behalf: Chase Agudelo, Seth  Anthony Beyrooti, Michael Robert Brown, Shawn Carpenter, Jose Collins,  Linda Marie Couch, Giovanni Cruz, Brooke Dawkins, Andrew Dorsey, Blake  Eden, ``CJ'' Jordan-Michael Grey, Melissa Houser, Kory Humphrey, Jacob  Monroe, Tribhawan Anand Persaud, Dylan…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691332/fourteenth-annual-footprints-in-the-sand-kidney-walk"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…fighting for the American Dream that has  stewarded freedom for generations of Americans.\n\nI rise today to recognize the Richard Nixon Presidential Library and  Museum in Yorba Linda for helping lead this nationwide commemoration.  Its new exhibit, ``America 250: A More Perfect Union,'' invites  visitors to walk through the defining chapters of our shared…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…which dot our universities around the country: ``The  complete destruction of traditional marriage and the nuclear family is  the `revolutionary or utopian' goal of feminism.''\n\nLinda Gordon, another prominent feminist: ``The nuclear family must  be destroyed. . . . Whatever its ultimate meaning, the break-up of  families now is an objectively revolutionary…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Fraud in California\n\nMr. KILEY of California. Mr. Speaker, I have sent a letter along with  several of my colleagues in the California delegation to Secretary of  Education Linda McMahon and Attorney General Pam Bondi asking them to  investigate a simple question: Why is it so stunningly easy to commit  fraud against the State of California?\n\nDuring…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "Mr. SIMPSON. Mr. Speaker. I rise today to recognize my long-time  employee, Linda Culver, as she prepares to retire at the end of June.\n\nI've often said that a really good staff makes a decent Member of  Congress--and throughout my time in office, I've been…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…FOX NEWS; Garvin,       Krista: FOX NEWS.\n\nGaskins, Kayla: SINCLAIR BROADCAST GROUP; Gatz, Ashley:       SPECTRUM NEWS; Gatza, Fabian: ZDF GERMAN TELEVISION; Gaudino,       Linda: CNN; Gaughan, Thomas: NEWSMAX TV; Gaul, Nora: CNN;       Gaur, GIRISH: LINDELLTV; GAWAD, Atef: AP-BROADCAST; Gayle,       Anna-Lysa: WDCW; Gee, Alexander: CNN; Geerdes, Christopher:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]