[{"senator": "André Carson", "party": "Democrat", "sentence": "…we have a duty to protect Americans  reporting abroad. An Israeli investigation was concluded, finding that  it was indeed an Israel Solider who shot Ms. Abu Akleh in her line of  duty. It is the responsibility of the U.S. to learn all the unanswered  questions leading up to, during and after the fatal shot that killed  Ms. Abu Akleh. Additionally, this…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Colorado, on his retirement following 33 years of service to the West  Metro Fire Protection District.\n\nThroughout his career, Chief Lombardi went above and beyond the line  of duty, and focused on growing programs that saved Coloradans money  and protected the health of our first responders. He started the  Advanced Resource Medic across West Metro,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694720/recognizing-chief-don-lombardi"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…line of police work, they still cannot get approved for Public Safety  Officers' Benefits, which provide disability benefits to officers  catastrophically injured in the line of duty.\n\nAs Sergeant Gonell recently told my staff, Trump is treating the  rioters like they were the ones defending the Capitol. He noted that at  every turn when Republicans…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today in memory of Baldwin Park  Police Officer Samuel Riveros, who lost his life in the line of duty  while attempting to rescue a fellow officer.\n\nKnown for his infectious smile, love of the Dodgers, and  snowboarding, Officer Riveros served in the Baldwin Park Police…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Awards,  and 7 Unit Commendation Awards.\n\nOfficer Mazurkiewicz and his partner were shot while undercover  investigating a double homicide. His sacrifice while serving in the  line of duty deserves to be honored.\n\nI encourage my colleagues to join me in honoring the life of Officer  Mazurkiewicz by naming a post office in Avon, New York, after him.\n\nMs. RANDALL.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697615/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…their service.\n\nWhile there are a number of different memorials for them, there is  currently no memorial or medal that honors all public safety officers  who die in the line of duty.\n\nFrom 2015 to 2024, the leading causes of death for law enforcement  officers were: COVID-19, job-related illness, car accidents, and  shootings. These causes are responsible…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699503/medal-of-sacrifice-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…plane crashes, or  kitchen fires, firefighters are always there to answer the call.\n\nInternational Firefighters Day is also a solemn reminder of those we  have lost in the line of duty. Just last year, our community lost one  of our own, Firefighter Trevor Brown, a husband and father of three  from Sterling. He passed away responding to an emergency gas…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690693/recognizing-international-firefighters-day-and-trevor-brown"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…investigators investigating these  incidents across the Nation. At this staffing level, it would take up  to 4 years to thoroughly research and release a report after each line- of-duty death.\n\nThat was until 2 months ago.\n\nUnder the banner of government efficiency and the claim to reduce  waste, DOGE has fired three of the five investigators, which means…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…to psychological traumas. According to the FBI,  assaults against officers remain very, very high, with tens of  thousands of them who are injured annually.\n\nBeyond the line of duty, officers experience higher rates of PTSD,  depression, and suicide compared to the general population. Yet, for  too long, this body, Congress, has not done as much as…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…gave their lives serving their  communities. This week, we honor Officer Evan Dunn, who was a member of  the Golden Police Department, who tragically passed away in the line of  duty in November 2024. Officer Dunn joined the Department after serving  as an Army Aviator and Black Hawk pilot in the Missouri and Colorado  Army National Guard. As a soldier,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692010/recognizing-the-golden-police-department"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…courage and with bravery, our  officers run toward danger every day to keep us and our loved ones  safe.\n\nToday, we honor Nassau County's own who gave their lives in the line  of duty. Among them are Officers Erick Contreras, Christopher Cizmarik,  Kevin Canavan, and Philip Schifini of the Nassau County Police  Department who bravely served our community…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…of an  eye; homes, family heirlooms, beloved pets, and, tragically, family  members.\n\nI have spoken with people who demonstrate extraordinary bravery and  step into the line of duty as wildland firefighters, sacrificing their  safety to protect their neighbors and their communities.\n\nThe 2020 Labor Day fires were the most destructive in our State's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Corporal Donald formally on  the honor of receiving the Purple Heart award. I join the rest of the  community in thanking Corporal Donald for his courage and bravery in  the line of duty.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…lifesaving efforts. They succeeded.\n\nThis illustrates how our brave first responders will always answer  the call.\n\nIn honor of the bravery of all first responders lost in the line of  duty and recognizing National Fallen Firefighters Memorial weekend, let  us celebrate those who are sworn to serve and to their dedication to  public service to others.\n\nAs…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690783/national-fallen-firefighters-memorial-the-lyons-fire"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Detective Ryan So of the Scottsdale Police  Department, and Officer Zane Tristan Coolidge of the Phoenix Police  Department.\n\nPolice Officer Zane Coolidge was shot in the line of duty while  responding to reports of larceny, passing away at the hospital. He  served with the Phoenix Police Department for 5 years and is survived  by his wife and infant…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…not issued grenade launchers. They are not  issued sawed-off shotguns or missile launchers or helicopters. These  are not part and parcel to an officer's weapons in the line of duty.  They are issued handguns, maybe a shotgun, and maybe a rifle. That is  it.\n\nThese things are ultimately distractions. The DOGE stuff I won't  respond to at all because…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…1962 through a joint resolution of Congress, National  Police Week is a time for our Nation to honor the courageous men and  women who made the ultimate sacrifice in the line of duty.\n\nThese officers gave their lives to protect our families, our  neighborhoods, and our way of life. Their legacy lives on in the  communities they served and in the continued…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691352/saluting-police-officer-heroes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Deputy Reckling served faithfully for 9 years with the Oakland County  Sheriff's Office. He was from Michigan's Ninth District.\n\nSadly, Deputy Reckling was killed in the line of duty on June 22,  2024. He was only 29 years old. When he was killed, he was a proud  husband and father to three beautiful daughters, with a fourth one on  the way.\n\nAs we mark…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691379/recognizing-the-life-and-service-of-deputy-sheriff-bradley-j-reckling"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Hoosier State.\n\nPolice Week is a time for all of us to recognize and honor those  serving our communities and, most especially, those who have given  their lives in the line of duty.\n\nThis week, I was joined by our Johnson County Sheriff Duane Burgess.  Duane and his deputies work tirelessly to keep Johnson County a safe  community in which to live,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691339/recognizing-indianas-sixth-district-law-enforcement-community"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…supporting  William with back blows. They saved his life that day.\n\nWe must also remember that Police Week honors fallen peace officers,  including one officer who died in the line of duty, Austin Police  Department Senior Officer Jorge Pastore died in action November 11,  2023, responding to a domestic violence call in South Austin. Hostages  were held inside…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…pursuit of justice. Their devotion merits  our admiration, and we are deeply indebted to them.\n\nWe especially honor the fallen heroes who made the ultimate sacrifice  in the line of duty. This year, we are honoring 234 law enforcement  officers who were killed in the line of duty.\n\nThe list of fallen includes two of my fellow Iowans, Trooper Jeffrey  Brown…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Service (in       this resolution referred to as the ``Memorial Service''), on       the Capitol Grounds, in order to honor the law enforcement       officers who died in the line of duty during 2024.\n\n(b) Date of Memorial Service.--The Memorial Service shall       be held on May 15, 2025, or on such other date as the Speaker       of the House of Representatives…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…sacrifices  as our Active-Duty counterparts when deployed. Their courage and  dedication deserve equal recognition.\n\nMr. Speaker, of the last eight servicemembers killed in the line of  duty, six of them were reservists, the two remaining being my fellow  Navy SEALs, who were lost in the Red Sea. Their loss underscores the  serious consequences of the decisions…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…and  I know the courage it takes not just for the officer but for the family  members who stand behind them.\n\nWhen the worst happens, when a first responder is lost in the line of  duty, it is the family who bears the burden of that sacrifice for the  long term. They are the ones picking up the pieces, mourning their  loved ones, and carrying their legacy…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…That is why, today, I am introducing the Leo K9 Protection Act, a  straightforward bill to strengthen the penalties for those who assault  or injure these animals in the line of duty.\n\nI am proud to champion the Leo K9 Protection Act alongside the  dedicated team at K9s United, whose tireless advocacy ensures that our  service animals are treated not…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693945/supporting-paws-in-motion"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…risks they faced. Their story reminds us why we  pause this week to honor law enforcement.\n\nNational Police Week is not only a time to honor those who were  killed in the line of duty, but also to thank those who continue to  answer the call with distinction.\n\nThese officers, along with thousands of others across the country,  deserve not only our gratitude…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…qualities  that were exemplified in her interactions with the public and her  peers. Fellow officers remember fondly her compassion for animals which  extended into the line of duty.\n\nBeyond her law enforcement duties, Sgt. Bettis has been a consistent  mentor and friend to her colleagues. Known as ``Mom'' at West Branch  Post 32, she provided unwavering…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Tenney).\n\nMr. GILL of Texas. Mr. Speaker, I encourage my House colleagues to  support this bill naming a post office for Officer Anthony  Mazurkiewicz, who gave his life in the line of duty.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697616/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "Mr. SCHMIDT. Mr. Speaker, I was absent from the house to attend the  funeral of Kansas City, Kansas, Police Officer Hunter Simoncic, who was  killed in the line of duty last month. Had I been present, I would have  voted YEA on Roll Call No. 221, YEA on Roll Call No. 222, and NAY on  Roll Call No. 223.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694871/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…knew him.\n\nOfficer Mazurkiewicz was an American hero who dedicated 35 years of  his life to upholding justice and the rule of law until he was  ruthlessly killed in the line of duty while serving our community.\n\nRenaming the Avon post office in his honor will not fill the profound  hole left in our community and in the hearts of his beloved family,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}]