[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…go to war, to deploy military forces  without congressional authority, or to kill anyone against the laws of  war.\n\nDrug trafficking cases should be handled in a courtroom. Listen, the  majority's entire argument that this was so serious it required action  without congressional approval is completely destroyed when the  President himself just pardoned…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698246/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…their  friends and the people in this country who say it is important for all  of us to make sure our healthcare premiums are lowered? I would say to  my Republican colleagues: Listen to your constituents. It is their  health. It is their lives. They are telling you that. They want action.  Open enrollment for this country starts Saturday. The time to act…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…were hiding from them because they could not justify their support of  this big, disgusting billionaire bailout.\n\nMr. Speaker, I encourage my colleagues from New Jersey to listen to  their constituents and vote ``no.'' May God forgive those who do not do  for the least among us.\n\nMr. BOYLE of Pennsylvania.  Balint), a distinguished member of the  House…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…big people who showed such small character when they tried  to suppress others. I want to cause good trouble and prove worthy of  those who came before.\n\nThis is not normal. Listen to America. Listen to Americans. They seem  to always be ahead of this body. They are rising up in State after  State, not along partisan lines, but along an American line,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…coming away from it having lit that  fire.\n\nSo it is important enough that I thought I might try a poetical hand  to it. I have read this before, and I will read it again.\n\nListen, my colleagues, and you shall see\n\nHow Rhode Islanders blew up the dread Gaspee.\n\nGreat Britain was fearsome, she ruled the sea,\n\nBut Rhode Islanders burned with the fire to…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…clear in my  opening, and I will read it again to him, that if noncitizens are  voting in Federal elections, they should be prosecuted. We all believe  it. He doesn't have to listen if he doesn't want to, but please don't  mischaracterize what I said.\n\nMr. Speaker, I am looking over to the other side of the aisle and  can't help but be stunned by the number…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, he told you guys to close your eyes and vote  for this garbage.\n\nRepublicans were ordered not to say a word in committee, just fall in  line and rubber-stamp it.\n\nNow listen to this: Now they are sneaking a change into the rules  buried in the fine print of this rule to give themselves same-day  authority to bring the bill to the floor with a moment's…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Senate can take another powerful  step--a powerful step in the right direction--by voting to repeal the  global tariffs on a bipartisan basis.\n\nI would just close by saying: Listen to your constituents. Listen to  what you are hearing from home, because what I heard was,  overwhelmingly, Oregonians and the people I ran into in airports and  the like said…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…continuance of the Union as a primary  object of patriotic desire. Is there a doubt whether a common  government can embrace so large a sphere? Let experience solve it. To  listen to mere speculation in such a case were criminal. We are  authorized to hope that a proper organization of the whole, with the  auxiliary agency of governments for the respective…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today I rise to read a letter from more  than 20 survivors of Jeffrey Epstein and Ghislaine Maxwell. I implore  my colleagues and all Americans to listen to their words.\n\nDear Members of the Republican Women's Caucus:\n\nWe write to you today with urgency, respect, and hope.       Strong American women are serving in the House…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…rise with a letter. This is a  letter from Republican State legislators from my home State of  Minnesota, addressed to President Trump and Republicans in Congress.  Please listen carefully.\n\nDear Mr. President, Congressman Emmer, Congressman Finstad,       Congresswoman Fischbach, Congressman Stauber, and Ms.       Carlton, Minnesota has been a leader…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689690/addressing-unworkable-funding-reductions-in-the-federal-budget"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…colleagues to recognize the human cost of these reckless  firings and funding freezes. I am sure the constituents of my  colleagues will make it clear to them even if they don't listen to us  today.\n\n(English translation of the statement made in Spanish by Mr. Vasquez  is as follows:)\n\nMr. Speaker, I want to recognize a group of individuals who are the  life…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…who rely  on this funding to prevent or treat disease, afford food, and access to  clean water.\n\nMr. Speaker, according to the Boston University School  of Public Health--and listen to this--more than 50,000 adults and 6,000  infants have died of HIV due to the disruption of PEPFAR. People are  already dying. More than 29,000 children have died of malaria,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, let me just say to the gentlewoman that, according to  CBO, undocumented immigrants are not receiving Federal funds for  Medicaid. My colleagues should read CBO. Don't listen to your  Republican talking points. Actually read the stuff that we pay people  to provide to us with the information to make sure we have the facts.\n\nMr. Speaker, these bills…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…not delivered for their people: record  malnutrition, shortages of basic medicine, horrible repression of women  and girls, and instability that threatens the entire region.\n\nListen to this carefully. The State Department--our State  Department--has put out a notice that Americans should not travel to  Afghanistan because it is too dangerous. So why, why…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…will stand by his assertion. Some may  cast their actions today as an exercise of party loyalty. Some may even  be praised by Pennsylvania Avenue. But for those who care to listen  closely, within that praise will be heard a touch of disdain.\n\nIt is no secret that Congress lacks the fortitude to stand up for its  prerogatives, and this is bipartisan.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…that most people talk about and that is  a big piece, but surely not the only piece, is to make sure that  Americans don't face a massive tax increase.\n\nMr. Speaker, if we listen to our friends on the other side of the  aisle, they brag that they want these tax rates to go up. They want the  2017 tax cuts we passed with President Trump to expire. They…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…schedule to travel with me to Arizona to better  understand the border crisis and the serious impact it was having on my  State as well as his own. Doug was always willing to listen, learn, and  engage on the issues that matter most. He was the most curious man.\n\nI thoroughly enjoyed working with him on a wide range of policies and  challenges that uniquely…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…in Kentucky, Especially Among [Young People].''\n\nCalls to poison control centers in Kentucky regarding cannabis have  doubled in the last 5 years, and more than 40 percent--listen to this-- have been about children under 12.\n\nChildren all over the Commonwealth, from Laurel County to Jefferson  County, are facing serious health and safety concerns due…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…SRS funding while waiting for this legislation to be  reauthorized. Communities across Arkansas and the United States are  sounding the alarm, and it is time for Congress to listen.\n\nThis bill not only shines a light on an educational issue but  underscores the need for an increase in responsible forest management.  That is why I introduced the Fix Our…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…of the new golden age of  America. How do we get there? We get there by actually making the right  decisions for those hardworking families who have been struggling.\n\nIf you listen to the people on the other side, Mr. Speaker, who have  over and over again said they are against this bill and all the things  that are in this bill for hardworking families,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthcare  into financial engineering.\n\nWhat you have done is, is financing, is subsidies healthcare. Well,  we will tax these people and we will subsidize this population. Listen  to the debates here. It is about subsidies on top of subsidies. It is  financial engineering. Now, it is healthcare. Why it is healthcare is  because it is easy. It makes…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…us, not just here in this room but across the country, can  be proud of because we truly are on display to the rest of the world.\n\nMr. Speaker, this is very interesting to listen to the arguments  coming from the other side of the aisle about what we are doing here  tonight.\n\nIn talking about free speech, it seemed to me that the gentleman from  Texas…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…false debates, straw man arguments, and non sequiturs.\n\nWe tried to pass this bill last week, but Democrats wouldn't agree to  doing so. Let's vote now. Democrats should stop, listen, and take yes  for an answer.\n\nMr. Speaker,\n\nAt the top of this page, I have written: ``Democrat hypocrisy on  Epstein.'' Mr. Speaker, that is what we are hearing today.\n\nMr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…neighborhoods and is destroying our independent  pharmacies, we should all be able to agree that that is  anticompetitive. That has got to stop. We should be able to do that.\n\nListen, we already passed this last July--a $50 billion amount going  to rural hospitals to stabilize those rural hospitals. We have already  engaged in ways to be able to stabilize…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…are the only two  coaches in the U.S. Senate, but we still think we are the best.\n\nYou know, we concentrate on things like moving the ball forward,  don't we? We absolutely listen to our team. We listen to voters. We  listen to--who I always call the voters--Toby and Edith. This is a  gigantic distraction again by the Democrats just because they hate…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698542/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…going to get a revenue reduction to the Treasury.  Your hope is the economic growth will offset part of that.\n\nWhen we do the math and we talk to every outside group and we listen  to the CBO--the Congressional Budget Office gets a lot wrong--but every  outside group who looks at this tells us that our assumptions that we  baked in of $2.5 trillion of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Iranians.\n\nWhat is this all about? Killing the Jews and, eventually, us and  dominating the world religiously. If you think that is weird, then you  need to get on the internet and listen to what they are doing. You need  to watch their behavior. And they mean what they say. And don't be like  the people in the thirties that got it wrong. Israel is not going…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Trump administration.\n\nRes. 80 and H.J. Res. 124.\n\nI urge my colleagues to reject unlawful regulatory overreach,  reinforce American energy dominance, uphold Federal law, and listen to  Alaska Native voices by supporting the Alaska congressional delegation  and voting for this joint resolution of disapproval and rescinding this  Record of Decision.\n\nRe…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…that we will somehow steal their safety net or  cut their program, which couldn't be further from the truth.\n\nMr. Speaker, my Democrat colleagues in the Rules Committee said,  listen, if you are just talking about cutting waste, you know we are  there. You know we will meet you half way. We want to ensure that the  taxpayer dollars are stewarded, and yet…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]