[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…President Trump's long list of enemies.\n\nAll it would take is a minority of 30 Senators to introduce related  bills, and the Senate would be bogged down voting on Agency grocery  lists all day long. Is that how we want to spend our days here at the  Senate, voting on every vaccine approval because Secretary Kennedy  decides to send them to Congress?\n\nSo to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…year. Good luck to those  15,000 superintendents who have to keep up with that list, with the  added problem that the Departments of Energy and the Treasury also keep  separate lists. Those 15,000 superintendents have to keep up with those  lists, too.\n\nAt its core, this is just another unfunded mandate, where you have to  train 15,000 superintendents and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Services.\n\nOn page 35 to 36 of the document, it says: ``The budget eliminates  the following programs to align investments with the administration's  priorities. . . . ''\n\nIt lists the following programs. First responder training--there are  so many. I don't want to read them all. The chairman mentions helping  first responders. That first responder training…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…thing  to do. An entire year of meals costs about the same as a single day in  the hospital.\n\nUnfortunately, one in four Meals on Wheels programs around the  country have wait lists. Many older Americans wait months or even years  to access program benefits. It is not just about the food. Nutrition  programs also promote socialization, wellness, and safety…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Emoluments Clause       and are reiterated in the U.S.'s anti-bribery statute, 18       U.S.C. Sec. 201, and federal regulations, 5 C.F.R. Sec. 2635.       Although section 2635.205 lists several exemptions from the       prohibition, none exempts soliciting purchases for personal       gain.\n\nAs to why the public might be interested in sending money,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…call it the great climate insurance collapse. It is widely warned of.  It is on its way. As I went around the COP, I handed out this little  folder wherever I could, which lists just some of the climate economic  catastrophe warnings that are out there:\n\n[C]limate change could reduce the level of global GDP per       capita by 10-20%.\n\nThis is Fed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…conversations with  law enforcement, as I have, he would know that there were 15 victims of  this terrible attack.\n\nIt is poor decorum to ask this body to vote on a resolution that  lists the wrong number of victims. They are my constituents. They are  real people who were burned half to death by a terrorist 7 days ago.  The least you can do is list the right…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…pharmaceutical middlemen, also known as pharmacy benefit managers,  and achieving mental health parity by going after insurance companies  that mislead seniors in Medicare Advantage with lists of doctors that  aren't actually available. Americans have deep concerns about the state  of their healthcare, and these reforms represent a down payment on the  effort to…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…expenses and the overhead of the BDC. This is in  radical opposition to how similar investments are treated.\n\nIf a mutual fund invests in the bank, the mutual fund, of course,  lists as an expense of the mutual fund the expenses of the mutual fund.  It does not list the overhead of the bank as if that is an expense of  running the mutual fund.\n\nBanks and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Speaker, we cannot have effective reform of Federal criminal laws  without first passing and implementing the Count the Crimes to Cut Act.  This bill is not about simply making lists. It is about creating the  tools that we need for precise data-driven reform.\n\nWith concrete data, we can determine exactly which reforms are  needed, remove speculation from…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…time within five years  of applying for the award. The definitions of who is included a  ``hostile foreign entity'' is very far reaching and includes twelve  separate entity lists as well as any entity performing academic,  scientific, or technical collaboration perceived to contribute to  nefarious activity.\n\nFor an agency to implement this prohibition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695251/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…September--also last month--the Trump administration put out a new  Executive order about domestic terrorist organizations. They said that  they were going to, again, make secret lists of ``terrorist groups''  inside the United States and send the full force of the U.S. Government  against those terrorist organizations. They are not telling anyone the  name…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Bice), but the words ``marriage certificate'' do  not appear anywhere in the SAVE Act. In fact, it could have been  written in that way since Republicans are adding all these lists and  requirements for people to do. Yet, it actually does make it harder for  almost 70 million American women to vote.\n\nEighty-four percent of women choose their husband's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "Mr. WARNER. Madam President, I also want to thank my dear friend from  Maine. She is moving back up much higher on all of our lists for being  willing to step up and help correct this.\n\nYou know, we all want what the President wants. The President wants  our Nation's Capital to be the safest, cleanest,…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688853/district-of-columbia-local-funds-act-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…voter  rolls. DOJ has requested information or meetings about election  administration from States and has demanded 40 States--40 States-- provide their full voter registration lists. In a private meeting,  Michael Gates, a Deputy Assistant Attorney General in the Department of  Justice Civil Rights Division, disclosed that all 50 States will  eventually…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Interconnection of Dispatchable Power Act.\n\nYear after year, projects that would keep the lights on and lower  bills are stuck in the interconnection queues and regulatory wait  lists. Sometimes as long as 7 years they are stuck there. That is  simply unacceptable. Families do not care about bureaucratic excuses.  They care about whether their homes are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…specified in such notice pursuant to       paragraph (2)(A), in bold, font size 14, and immediately next       to the taxpayer's address on page 1 of the notice.\n\n``(ii) No lists of potential errors.--A notice which       provides multiple potential or alternative errors which may       be applicable to the return shall not be sufficiently       specific…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…it without a government mandate.\n\nMr. Speaker, I will yield 3 minutes to the gentleman from Indiana  (Mr. Baird), my friend.\n\nMr. GUTHRIE. Mr. Speaker, the Federal Register lists this class of  equipment, and the simple payback period in years is 93.9 for all  purchasers. I have it right here.\n\nMr. Speaker, as we have heard today, the Biden-Harris administration…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Justification waiving the congressional       review requirements under Section 36(b)(1) and 36(b)(5)(C) of       the Arms Export Control Act (AECA), as amended for the       attached lists of transmittals of proposed Letters of Offer       and Acceptance to the Government of Israel. The determination       and detailed justification are a part of each transmittal.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…shield rating of 91 of  100, while the average rating for the right and lean-right outlets was  a low of 66 of 100.\n\nA Global Disinformation Index report on the online news lists the 10  riskiest online news outlets as the New York Post, The Federalist, The  Blaze, The Daily Wire, Newsmax, One America News Network, The American  Spectator, The American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…statements  to the FBI. The main conduct being alleged involves theft of campaign  funds totaling $225,000, tax fraud, as well as fraud surrounding a PPE  loan.\n\nThe indictment lists a number of co-conspirators, including the  former chief of staff for California's attorney general, including a  high-powered lobbyist, including another well-known consultant,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…President determines to have knowingly and       directly engaged in or facilitated the involuntary harvesting       of organs within the People's Republic of China.\n\n(2) Updates of lists.--The President shall submit to the       appropriate congressional committees an updated list under       paragraph (1)--\n\n(A) as new information becomes available;\n\n(B) not…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cover startup costs  for expanding charter schools that already have a track record of  success. This is very important because you have a lot of families who  are on waiting lists for charters. We estimate that this measure could  potentially triple the number of students across the country who  receive this particular form of school choice of charter…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…show a  government-issued photo ID when casting a ballot.\n\nSecond, it directs the States to remove noncitizens from their voter  rolls by mandating regular reviews of those lists and giving States the  abilities and the tools to accomplish this critical task.\n\nFinally, it improves accountability by strengthening the enforcement  of the current law and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today in support of H.R.  1. We have a choice. We can continue down our current fiscally  unsustainable path where we have waiting lists for Medicaid,  insufficient border security resources, and are facing the largest tax  hike in American history, or we can change course.\n\nThe One Big Beautiful Bill Act ushers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693179/one-big-beautiful-bill-act"}, {"senator": "Josh Brecheen", "party": "Republican", "sentence": "…able-bodied individuals are added to Medicaid, truly needy  and disabled Americans are being displaced from priority services.  700,000 disabled Americans are stuck on Medicaid wait lists while able- bodied adults above the poverty line have access to taxpayer-funded  healthcare.\n\nThe goal of social programs should never be to gain able-bodied  enrollees, but…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690831/medicaid"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Mr. President, for the Committee on Commerce, Science, and  Transportation I report favorably the following nomination lists which  were printed in the Records on the dates indicated, and ask unanimous  consent, to save the expense of reprinting on the Executive Calendar  that these nominations lie…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699538/executive-reports-of-committee"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Sadly, my oversight dating way back to 2005 has  uncovered decades of corruption and mismanagement in this donation  system. It has left vulnerable patients to die on waiting lists while  unused organs from generous American donors go to waste.\n\nSpeaking of waiting lists, I have been concerned about the reports of  those on the waitlist being skipped…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…actually  think there is probably something else going on here as I have been  around this place long enough.\n\nThis is a chart that I have called the last frontier lockup. It lists  the 70 Executive orders and Executive actions all throughout the State  of Alaska to lock up my State--70 Executive orders and Executive  actions issued by the Biden administration…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…international issues.\n\nDr. Morris' efforts have ensured a graduation rate of 98 percent with  a growing academic proficiency rating. Cross County High School has  been included in the lists by U.S. News and World Report for both Best  High Schools and Best Charter High Schools. At the elementary school  level, Cross County Elementary Technology Academy has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695857/recognizing-nathan-morris-2026-arkansas-superintendent-of-the-year"}]