[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. FIGURES. Mr. Speaker, I have listened to many of my colleagues'  views on the issues before us today. I respect them all, and I respect  their views. I don't disagree with many of the points that my  colleagues…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693778/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…abused by a pedophile and his rich friends. It is about  the coverup that started with the rich and powerful and is still  coming from a gold-plated Oval Office.\n\nWe have listened to the survivors share their stories. They have made  many of us cry, but we won't stop at tears. We will work to bring  justice to these brave women, to do what they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…my time in the U.S. Senate, not only because of the  words and the facts that they conveyed but because of their raw  courage, their bravery.\n\nI had tears in my eyes as I listened to Luke and Brett Ganger telling  us for the first time in public in such a setting what it was like to  lose their sister Renee Good.\n\nThey said:\n\nIn the last few weeks,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…responsibilities to  a Department, the Department of Education, that they are seeking to  dismantle, that they want to abolish. That is what we are debating here  today, Mr. Speaker.\n\nI listened to every word of the chairwoman's address outlining every  component of the bills that we are considering, but for folks who are  watching, for those who have graced us with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and gas friends, and they  have sided also in this case with foreign manufacturers.\n\nMr. PALLONE.  Castor) who is the ranking member of our  subcommittee.\n\nMr. Speaker, I listened to the gentleman from Alabama (Mr. Palmer),  who I greatly respect. When he talks about prices, since President  Trump was inaugurated, prices have gone through the roof.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…American people, and it makes a mockery of Republican  promises to make America healthy again.\n\nI really believe, Madam Speaker, that this resolution is a  distraction. I listened to the President's speech last night, and it is  clear to me that neither he, nor the Republicans in the House, have  found a way to lower grocery prices. They haven't found…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…for material to be disclosed.\n\nThe Senate said the House shouldn't get involved with the $500,000  that each Senator should get for simply having a phone call noted--not  listened to, not documented, but noted. It is $500,000 for nine  Senators.\n\nThat money should go to the Epstein victims. Truth spoken. Justice  should be required.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…generous. They were  at 73 cents, so the House Republicans wanted to go back to 68 cents.\n\nHere is the real kicker: For a party that has preached fiscal  rectitude that I have listened to all of my years here--all of my years  here--voting for the balanced budget amendment, taking up all of these  pursuits in terms of fiscal rectitude, they are borrowing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…going to the  doctor; I will tell you that.\n\nMr. Speaker, I have talked a lot today, so I am going to be a little  briefer than I intended, but I am a preacher's kid, and as I listened  to the debate on the billionaire bonus bill, I couldn't help but think  of Matthew 25:31-46 where Jesus said that when He came into His glory  in Heaven and all the nations…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…any drug cartel in the world whenever he wants to, then our  Constitution, Article I, pretty much ceases to have meaning.\n\nWe just had an amendment to repeal the AUMFs. I listened to some of  those arguments. I support that amendment. I think it was a good  argument. The argument was for Article I, for the United States  Congress playing a role. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Ms. BLUNT ROCHESTER. I want to begin by thanking you so much, Senator  Booker, for your leadership, and thank you for the opportunity to ask  you a question.\n\nAs I stood and listened to you, I was reminded of why we are in this  place in the first place. I see my colleague--the Presiding Officer, a  member of my class--and I think one of the key things…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…it? They did it because Democrats had the audacity  to ask them to try to lower people's healthcare costs.\n\nWhile they sat on their couch for 8 weeks, we were working. We  listened to people who told us their health insurance premiums are  doubling and tripling. We heard from people who don't understand why  you guys moved at the speed of light to give…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…batteries. Let me  say that again so everyone can hear it. Last year, 94 percent of all  new electricity came from wind and solar and batteries.\n\nYou wouldn't know that if you listened to the White House. You  wouldn't know that if you listened to the Department of Energy or the  EPA because they are just lying about it. They are just flat-out lying  about…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…While the Republicans stayed silent, my colleagues and I stepped up.  We wrote to the Trump administration, demanded answers, and put  pressure on them to act.\n\nThey finally listened. Let's be clear: This didn't happen on its own.  It happened because we put pressure on them.\n\nNow the money is flowing, and I hope it is the entire $7 billion that  goes…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the  government.\n\nWhy do they do that? It is to meet their needs, to solve their  problems. It is an idea that sparked my imagination as a child. It is  an idea that as I listened to my parents tell stories of what their  life was like growing up during the Depression, growing up during Jim  Crow, where they didn't always have their needs met, not because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…billionaires. If you go look at this bill--everybody has  had an opportunity to read the bill. They actually read the whole bill  on the Senate floor. It only took 14 hours. If you listened, one of the  things you would find out, Mr. Speaker, is there are some new tax cuts  in this bill, but not for billionaires.\n\nIt would beg the question: Why does the other…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…am going to keep it that  way as long as I possibly can. But I tell you what, my wife and I every  day worry about what our children will be exposed to online.\n\nAnd I have listened to parent after parent come before this body,  take an oath, and testify about the ordeals their own children have  been through.\n\nAnother employee at Meta testified about…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…a nice lady. She made a mistake here, a bad mistake. She  took advice from a convicted pedophile. That is indefensible in this  discussion here today.\n\nMr. Speaker, I have listened to my colleagues defend the  indefensible. I have heard everything from this is old news to this is  just politics. Not a single person has disputed the key fact: written…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…suicide was her only way out of pain. Instead, she chose to fight and  founded The Gray Matters Collective, a nonprofit with chapters for  veterans and first responders. She has listened to hundreds of stories  like her own and like Blake's, and she has made it her mission to break  the stigma and offer real support.\n\nJon and Haley's partnership has made a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…won't make you live through my charts that show expensing, research and  development expensing and expensing. It has a cost in the 10-year  window.\n\nHopefully, everyone has listened to my dozens and dozens of speeches  walking through what expensing is. Expensing is nothing more than  depreciation. Do you take the expense in 1 year or, let's pretend,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…their  water and power on. Buckeye families have worked too hard to struggle  this much, and I am standing here today ready to do something about it.\n\nHouse Republicans have listened to hurting families, and we are  bringing forward legislation to help them get ahead. The Affordable  HOMES Act will cut through unnecessary and complicated red tape that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Washington forget: The most effective       solutions come from those closest to the problem and most       accountable to the people. It's with this understanding that       he listened first, acted decisively, and never left our       community's side.\n\nHe spoke to leaders at every level public health officials,       healthcare providers, and the community…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, as I sat here and listened to that panoply of  speeches or motions over the last few seconds, I was reminded of the  fact that when we say there should be no cuts to Medicaid, we are  saying there should…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693215/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, as I listened to the ranking member talk  about China's need for U.S. energy, thank God it is that way and not  the other way around.\n\nIf we followed the green new manifesto, with the regulatory…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697087/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…in North Carolina's 76th District.\n\nRepresentative Warren has been a steady, respected voice in Raleigh,  and folks back home knew that they could always count on him. He  listened, he worked hard, and he treated everyone with fairness and  respect.\n\nAs someone who represents Rowan County in Congress, I have seen the  impact of his work up close. He…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697946/recognizing-representative-harry-warren"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that instead of paying  to clean up the flood in Texas?\n\nThe fact of the matter is the people of Texas want their money to be  used for the things they care about.\n\nWe have listened to the minority leader come to the floor and lecture  us about the virtues of public radio and public broadcasting.\n\nYet, nevertheless, the truth is it took NPR through Texas…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…an emergency. The question for us in Congress 1 year later  in exercising our statutory responsibility to evaluate this question is  whether there is still an emergency.\n\nI listened to the debate on this issue with an open mind. I listened  to the comments of our very capable chair of the Homeland Security  Committee here in the House saying that actually…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Act.  She is now back to beg for the bare minimum. She told me that she  doesn't trust Republicans to protect her healthcare. Based on their  votes, she is right.\n\nCongress listened to her plea 35 years ago. Now, the wealthy  interests and Trump's pressure are just too much. Republicans won't  listen to a word from Julie or the 80 disabled advocates who…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I come to the floor having just listened  to my colleague, the senior Senator from New York, the minority leader,  talk about the upcoming efforts from the Republicans with regard to  America's economy.\n\nAnd if you…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689741/the-economy"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Hoosier Heartland Tour across Indiana's Sixth District.\n\nI participated in 45 events. I engaged meaningfully with 1,800  Hoosiers. I reported back on my work in Congress. I listened to their  concerns and priorities.\n\nI met with leaders in our communities, including our Governor, to  discuss how our Federal policies affect their lives. Together, we  explored…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}]