[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…from Pennsylvania tweeted:  ``Elon Musk is right to call out House leadership. I wish I had a  nickel for every time the House Freedom Caucus sounded the alarm and  nobody listened, only to find out the hard way that we were right all  along.''\n\nRight all along? From what he just said, I would have thought that he  voted against the bill or that the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…in the long run.\n\nMr. Speaker, it is just a real head-scratcher as to why Republicans  are bringing this bill in the midst of an affordability crisis, but I  think if you listened to the State of the Union Address last night,  that is a little bit illuminating because the President said that  everything is great in America. He solved it. There is no…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…stores and supermarkets rake in record  salaries.\n\nI just came from a congressional hearing of our Democratic Steering  and Policy Committee on food prices and food stamps. I listened to the  stories of working Americans with families who are hard-pressed and  were frightened to death of a $230 billion cut to the Food Stamp  program which would end that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…generous. They were  at 73 cents, so the House Republicans wanted to go back to 68 cents.\n\nHere is the real kicker: For a party that has preached fiscal  rectitude that I have listened to all of my years here--all of my years  here--voting for the balanced budget amendment, taking up all of these  pursuits in terms of fiscal rectitude, they are borrowing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…my opinion, if I  was the judge, would not impose these harsh mandatory penalties.\n\nMr. PALLONE. Mr. Speaker, I continue to reserve the balance of my  time.\n\nMr. Speaker, I listened to what the chairman of our Health  Subcommittee said, and I am not arguing with him that we have to look  at the fentanyl crisis in many ways, particularly at the border,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…childcare,  parents are often forced to choose between healing, caring for their  newborn, and keeping their job.\n\nAs a founder of the Congressional Mamas' Caucus, it is time we  listened to mothers who are urging our government to focus on families.\n\nRoughly 134,000 families are driven into poverty annually because of  the cost of childcare alone. This is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…KAPTUR. Mr. Chair, I yield to the gentlewoman from Illinois (Ms.  Budzinski).\n\nMs. KAPTUR. Mr. Chairman, I rise in opposition to this amendment.\n\nMs. KAPTUR. Mr. Chair, I listened to the gentleman, and he and I  share a piece of the continent in a way. Part of Pennsylvania drains  into Lake Erie believe it or not. I don't believe the gentleman's  district…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the  government.\n\nWhy do they do that? It is to meet their needs, to solve their  problems. It is an idea that sparked my imagination as a child. It is  an idea that as I listened to my parents tell stories of what their  life was like growing up during the Depression, growing up during Jim  Crow, where they didn't always have their needs met, not because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…for material to be disclosed.\n\nThe Senate said the House shouldn't get involved with the $500,000  that each Senator should get for simply having a phone call noted--not  listened to, not documented, but noted. It is $500,000 for nine  Senators.\n\nThat money should go to the Epstein victims. Truth spoken. Justice  should be required.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and gas friends, and they  have sided also in this case with foreign manufacturers.\n\nMr. PALLONE.  Castor) who is the ranking member of our  subcommittee.\n\nMr. Speaker, I listened to the gentleman from Alabama (Mr. Palmer),  who I greatly respect. When he talks about prices, since President  Trump was inaugurated, prices have gone through the roof.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…any drug cartel in the world whenever he wants to, then our  Constitution, Article I, pretty much ceases to have meaning.\n\nWe just had an amendment to repeal the AUMFs. I listened to some of  those arguments. I support that amendment. I think it was a good  argument. The argument was for Article I, for the United States  Congress playing a role. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Ms. BLUNT ROCHESTER. I want to begin by thanking you so much, Senator  Booker, for your leadership, and thank you for the opportunity to ask  you a question.\n\nAs I stood and listened to you, I was reminded of why we are in this  place in the first place. I see my colleague--the Presiding Officer, a  member of my class--and I think one of the key things…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…abused by a pedophile and his rich friends. It is about  the coverup that started with the rich and powerful and is still  coming from a gold-plated Oval Office.\n\nWe have listened to the survivors share their stories. They have made  many of us cry, but we won't stop at tears. We will work to bring  justice to these brave women, to do what they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Mr. Speaker, I listened to every word of my colleague from New York's  very long speech regarding the bills that the House is considering  today. I might perhaps offer a different picture that I…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…batteries. Let me  say that again so everyone can hear it. Last year, 94 percent of all  new electricity came from wind and solar and batteries.\n\nYou wouldn't know that if you listened to the White House. You  wouldn't know that if you listened to the Department of Energy or the  EPA because they are just lying about it. They are just flat-out lying  about…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…more black and white, and it is so  disappointing.\n\nMr. PERRY. I just have to ask you in this colloquy, Representative  Roy from Texas: You say, ``the radical left,'' but I listened to you  rattle off the statements of elected officials.\n\nMr. PERRY. Not just Members of Congress, but Members of the United  States Senate.\n\nMr. PERRY. Governors of States,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I come to the floor just having listened  to the minority leader talk about our nominees for various positions in  the Trump administration, and I am happy to report that this month,  December of 2025, we will confirm…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…this works.\n\nWe will do the work of the Rules Committee. We will continue to pass  this legislation and deliver real relief for working families in this  country. We have listened to a lot of rhetoric about millionaires and  billionaires. It sounds like Bernie Sanders is in the Chamber, but  really this is about the working people of this country.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…an emergency. The question for us in Congress 1 year later  in exercising our statutory responsibility to evaluate this question is  whether there is still an emergency.\n\nI listened to the debate on this issue with an open mind. I listened  to the comments of our very capable chair of the Homeland Security  Committee here in the House saying that actually…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Secretary of the Interior and Chairman of the  National Energy Dominance Council Doug Burgum flew to Alaska and held a  townhall on the North Slope with regional leaders and listened to their  concerns, showing respect for the Alaska Native people who live there.  During the townhall, the Secretary heard the testimony of Charles  Lampe, a resident of Kaktovik--the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…won't make you live through my charts that show expensing, research and  development expensing and expensing. It has a cost in the 10-year  window.\n\nHopefully, everyone has listened to my dozens and dozens of speeches  walking through what expensing is. Expensing is nothing more than  depreciation. Do you take the expense in 1 year or, let's pretend,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Washington forget: The most effective       solutions come from those closest to the problem and most       accountable to the people. It's with this understanding that       he listened first, acted decisively, and never left our       community's side.\n\nHe spoke to leaders at every level public health officials,       healthcare providers, and the community…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…a nice lady. She made a mistake here, a bad mistake. She  took advice from a convicted pedophile. That is indefensible in this  discussion here today.\n\nMr. Speaker, I have listened to my colleagues defend the  indefensible. I have heard everything from this is old news to this is  just politics. Not a single person has disputed the key fact: written…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Hoosier Heartland Tour across Indiana's Sixth District.\n\nI participated in 45 events. I engaged meaningfully with 1,800  Hoosiers. I reported back on my work in Congress. I listened to their  concerns and priorities.\n\nI met with leaders in our communities, including our Governor, to  discuss how our Federal policies affect their lives. Together, we  explored…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…in North Carolina's 76th District.\n\nRepresentative Warren has been a steady, respected voice in Raleigh,  and folks back home knew that they could always count on him. He  listened, he worked hard, and he treated everyone with fairness and  respect.\n\nAs someone who represents Rowan County in Congress, I have seen the  impact of his work up close. He…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697946/recognizing-representative-harry-warren"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that instead of paying  to clean up the flood in Texas?\n\nThe fact of the matter is the people of Texas want their money to be  used for the things they care about.\n\nWe have listened to the minority leader come to the floor and lecture  us about the virtues of public radio and public broadcasting.\n\nYet, nevertheless, the truth is it took NPR through Texas…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…am going to keep it that  way as long as I possibly can. But I tell you what, my wife and I every  day worry about what our children will be exposed to online.\n\nAnd I have listened to parent after parent come before this body,  take an oath, and testify about the ordeals their own children have  been through.\n\nAnother employee at Meta testified about…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Act.  She is now back to beg for the bare minimum. She told me that she  doesn't trust Republicans to protect her healthcare. Based on their  votes, she is right.\n\nCongress listened to her plea 35 years ago. Now, the wealthy  interests and Trump's pressure are just too much. Republicans won't  listen to a word from Julie or the 80 disabled advocates who…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, as I listened to the ranking member talk  about China's need for U.S. energy, thank God it is that way and not  the other way around.\n\nIf we followed the green new manifesto, with the regulatory…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697087/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…gotten married.\n\nMr. Speaker, there is one other thing I want to comment on tonight. I  was listening to a television program on one of the big conservative  networks, and I listened to a commentator make fun of socialism. She  talked about how much better capitalism was. I don't think she has a  good handle on why capitalism is good.\n\nFirst of all, we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}]