[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…reconstruction; and, quickly, a series  of measures were passed by States to suppress the opportunity of Black  Americans to vote in the South. These included poll taxes; they  included literacy tests; they included civics exams--rigged so that  only White Americans could pass. But we remedied that situation. We  took it on. It took a long time, unfortunately.\n\nIn…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…now S.J. Res. 7 threatens to cut off and constrict that  world.\n\nThe internet can be a tremendous educational resource, opening new  doors for curious students, and digital literacy skills are fundamental  to succeeding in this digital economy, but that economy also creates a  new system of haves and have-nots. In education, that divide is called  the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…the world would you not go to vote for your grandson?'' She said to me,  ``Sit down, son. Let me just tell you a story.'' She went to register  to vote, and they gave her a literacy test. She had to state the  preamble to the Constitution, my grandmother, in Louisiana.\n\nI finally got her to register to vote, and she voted until she  passed.\n\nThey gave…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the staff and volunteers have worked tirelessly to provide  students with tutoring and educational programs, as well as courses  concerning leadership development, financial literacy, and community  service. Through these activities, students are given the opportunity  to learn about the jobs of the future and to tour nationally ranked  colleges and universities…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and free Black men voted and  got elected to office. When Reconstruction ended, though, the former  Confederate States passed new constitutions, including such things as  literacy tests, poll taxes, and felony disenfranchisement. In the words  of E. Carter Glass in the Virginia constitutional convention of 1902,  he said these were intended to ``eliminate…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…My great-grandfather lived through the first backlash. He was a man  born on a plantation. His parents were enslaved. He exercised his right  to vote after he was given a literacy test. He got all the questions  right, and he heard the registrar say--and this is the only time you  will hear me use this word is in a direct quote--``I need more  questions…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…from Malvern, Arkansas, had to face  the poll tax. After Reconstruction, nobody wrote the word ``race'' into  a single suppression statute. They wrote poll taxes. They wrote  literacy tests, good character clauses. It was all race neutral on  paper but devastating in practice.\n\nThe SAVE America Act sits in that tradition. I will say it again. The  SAVE…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…working-class Americans.\n\nIn advancing it, Republicans invoke those historical policies that  were intended to disenfranchise Americans. Let me remind Members what  they were: literacy tests and poll taxes for eligible voters,  grandfather clauses that tied voters' rights to the grandfathers before  the Civil War, all-White primaries to eliminate Black voters'…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…withholding nearly $7 billion in congressionally  approved education funding.\n\nThis is money meant for public schools. These fund after-school  programs, teacher training, literacy training, and more. Without  warning, the administration froze them. The result has been delays and  potential cuts and layoffs. School districts, including the ones that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…War II already had high school diplomas and were  ready for postsecondary education.\n\nHead Start, the Elementary and Secondary Education Act, the Adult  Education and Family Literacy Act, the Individuals with Disabilities  Education Act, and the Higher Education Act are some of our Federal  laws that work to ensure that opportunities to learn and advance…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…people across the  United States, such as reproductive rights and ballot access.\n\nMr. Divine--if you can believe this, in this day and age, 2025--has  argued in  favor of literacy tests at the ballot box. Let me say that again. He  has argued in favor of literacy tests at the ballot box.\n\nHe states:\n\nIndividuals who aren't informed about issues and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…New York, Padron-Morales.\n\nAs co-founder of Hipocampo Children's Bookstore, Henry Padron-Morales  has created a space that celebrates culture, diversity, and the power  of literacy. Rooted in his Puerto Rican heritage, his vision and  leadership have fostered a love of reading while amplifying voices that  too often go unheard. Through this work, Henry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…harm. Many of these incidents are attributable  simply to AI's current technological immaturity and the growing pains  that come with its ongoing evolution. This is why AI literacy is  crucial for small businesses to keep up with their larger competitors  considering and adopting AI.\n\nThe AI-WISE Act will direct SBA to create online AI literacy  resources…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…neighbors informed on what is  happening in their local communities. Families will no longer have 24/7  access to Michigan's Learning Channel, which provides educational math  and literacy content for children all across my State.\n\nBut the biggest harm that these funding cuts will have on our  communities is the impact to emergency response and public safety.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…friends and collaborated on multiple school  projects together, including A Bear and a Book.\n\nA Bear and a Book was founded in the fall of 2023 as a way to promote  youth literacy. Like many others, when Lauren and Peyton were little,  they would line up their teddy bears and read them a story. If they did  not have someone to read to, they could always…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695353/a-bear-and-a-book"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…and credit unions will lead  to more consolidation and less options. I believe most Members here  share a common goal to ensure financial inclusion, as well as financial  literacy and  awareness. Frankly, this rule isn't going to accomplish that. My  friends on the other side of the aisle know it.\n\nAfter the bank failures of 2023, community financial…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…banker in Little Rock.\n\nKeaton exemplifies the ethos of a community banker, frequently  working with children, adults, and seniors to teach them the importance  of financial literacy. His efforts prove it is never too late or too  early to learn how to manage your finances.\n\nAs a former community banker, I admire his efforts to uplift his  community and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…off Read Across America Day,  marking the start of National Reading Month.\n\nEach March, teachers, students, parents, librarians, and more all  acknowledge the importance of literacy and reading for all Americans.\n\nFor more than 20 years, Read Across America has been a nationwide  tradition, held annually on March 2 in honor of Dr. Seuss' birthday.  Across…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688379/recognizing-read-across-america"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…contributions  from family members, employers, nonprofits, and government entities.  They will help set up the next generation for financial well-being--not  even just well-being, but literacy on what this can actually do.\n\nIt is not just these individual accounts. If taught right and if we  were able to educate properly on this and people can see it in their  own…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…thousands  of student teams from across the country, each tasked with investing a  hypothetical $100,000 in the stock market. The goal: to learn the  fundamentals of financial literacy, teamwork, and long-term investing.\n\nCompeting against students from every congressional district, the  Rock L. Butler team stood out not only for their strong returns but…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692754/recognizing-rock-l-butler-middle-school"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…time.\n\nMr. Speaker, I rise in strong support of the resolution as a woman  and as the chairwoman of the Republican Women's Caucus, not only for  election integrity but clearly literacy because Democrats have not read  the resolution. That much is clear.\n\nThis resolution is very simple. It ensures that only American  citizens can vote in our Federal elections.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…myself such time as I may consume.\n\nMr. Chair, just as some of my Democratic colleagues have done, I was  just thumbing through the actual document. I know this is crazy, and  literacy being sort of a lost art, but I am trying to find where this  heresy, these cuts are.\n\nThere is a discussion here that basically says we need not to just  purely stick this…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…January 26, 1926, the members of the  Kiwanis Club have been a crucial part of the community in Lock Haven.\n\nThe club has 43 members, and it works to help children by improving  literacy rates, health, and educational outcomes.\n\nLock Haven Kiwanis sponsors two Key Clubs, one at Central Mountain  High School and the other at Jersey Shore High School. It awards…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698269/recognizing-lock-haven-kiwanis-club-on-centennial-anniversary"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…them to pursue service and leadership, and I  know that is the case for countless of their peers.\n\nFrom organizing defense stamp drives during World War II to  supporting literacy and mental health initiatives today, the women of  Gamma Nu have consistently demonstrated a deep commitment to uplifting  and giving back to the community. Their efforts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…disgrace  of the sanctuary State in California.\n\nWhen it comes to California's failing public schools, which are just  about the worst in the entire country, we have the lowest literacy rate  of any State in the country. We continue to see attacks on high- performing schools from Governor Newsom and his enablers in the  legislature.\n\nWe also have some good…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…form of government.\n\nIncreasingly, however, civic knowledge is on the decline.\n\nA recent survey by the U.S. Chamber of Commerce found that 70 percent  fail a basic civic literacy test.\n\nAnother survey found that nearly 17 percent of Americans could not  name any branch of government.\n\nThis should be concerning for all of us.\n\nI would like to commend…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693285/civic-education"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of life for so many.\n\nSince its founding, ACCAP has provided essential services, ranging  from housing assistance and food programs to transportation and early  childhood literacy initiatives, such as Dolly Parton's Imagination  Library. These programs create pathways to brighter, more stable  futures.\n\nThis anniversary is not just a reflection on the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…High-Quality Charter  Schools Act that would make more opportunities like that available  throughout the country.\n\nWe have also held hearings in my subcommittee on teaching literacy  appropriately, which California is finally moving in that direction,  teaching math appropriately, getting back to basics, utilizing  education technology in the right way,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…left says, well, you don't have  to cut anything. Just raise taxes on rich people. That is not what even  their own economic literature says. Of course, that would require  literacy, wouldn't it? Someone would actually have to sit down and read  the stuff with a calculator.\n\nWe have a crisis. Having a society that is getting older is not  Republican or…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…counseling for  students and adult learners.\n\nThe Counseling for Career Choice Act would expand K-12 career  counseling services and provide more resources focused on financial  literacy, registered apprenticeships, dual enrollment programs,  internships, and even financing for college or other postsecondary  education.\n\nCareer counseling gives students the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695635/career-and-technical-education-caucus"}]