[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…the resource management plan. Grazing permits, resource  development projects, transmission rights-of-way, all of those leases  and permits, and so on, will be tied up in litigation if this  resolution is passed.\n\nIt makes no sense to me why my colleagues have chosen to take this  approach and endanger grazing permits in North Dakota when there is a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…President. Given that the U.S. Attorney for the       District is already appointed by the President, if passed,       this bill would concentrate all criminal and civil litigation       authority in the President, divesting the District and its       residents of any local control over these essential       functions.\n\nNo one knows or cares more about…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…He has resisted the orders of Federal courts--including the Supreme  Court--after they ruled against him and the State of Alabama in voting  rights cases. His role in that litigation was not confined to a  courtroom. After the Supreme Court recognized that Alabama's voting  maps likely violated section 2 of the Voting Rights Act, Mr. LaCour  helped State…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…in the predictions business, but I can  confidently predict--and it is why one of the reasons this exchange is  so important--that this particular exchange will appear in litigation 2  years from now, 3 years from now, 5 years from now, or 10 years from  now.\n\nThis is untested. The Congressional Review Act has never been used  before to repeal a resource…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…illegal usurpation  of our taxation authority by an unprecedented series of tariff  announcements.\n\nA great gauge of how corrupt things are right now is by seeing how  much litigation has already proceeded against the Trump administration.  We have seen over 220 lawsuits brought against them in their first 100  days. That is clearly a record.\n\nIt is also…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…means third parties can  be compelled to produce relevant documents, electronic records, and  other evidence early, facilitating settlement, reducing the need for  protracted litigation, and helping to resolve disputes sooner rather  than later.\n\nThis bill also expands the role of special trial court judges,  allowing them to hear additional cases and act…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…off-road access in this park unit.\n\nThis repeal is practically inviting a court to strike down whatever  fallback rule the administration tries reverting to, and when that  litigation ensues and they comb through the Congressional Record to  divine the intent of Congress, they will see pretty plainly that I  warned you folks that that was the case right…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…he has made direct and unambiguous public statements  threatening media outlets, current and  former officeholders, and advocacy organizations. He has pursued  meritless litigation, leveraged his public office for private gain, and  perverted the course of justice and the integrity of the judicial  system to extract tens of millions of dollars in putative…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…That is right. The bank lacked sufficient controls because of its  past mergers--too big to manage--and accidentally paid $900 million to  Revlon, which quickly went into litigation.\n\nThe bank did not correct their problems. Regulators fined them again  last year, but earlier this year, we learned that Citibank made another  big payment error. The bank--I…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…rights and reshape the housing landscape.\n\nAs director of housing justice at the Shriver Center on Poverty Law  and now as the director of a tenant advocacy clinic, Eric uses  litigation advocacy to advance housing equity in Illinois and beyond.  His work with the Illinois Fair Housing Coalition led to the passage of  a State law prohibiting discrimination…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…critical time, as my friend has been expressing before I came.\n\nI thank Mr. Johnson's staff, as well, for taking the time and effort  to put this together tonight and the Litigation Task Force for  convening on the floor tonight.\n\nI am proud to join my Democratic colleagues here to raise the alarm  that this administration's actions are rapidly undermining…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…President. Given that the U.S. Attorney       for the District is already appointed by the President, if       passed, this bill would concentrate all criminal and civil       litigation authority in the President, divesting the District       and its residents of any local control over these essential       functions.\n\nNo one knows or cares more about keeping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Congress, the  courts, and for we the people.\n\nOn February 10, House Democratic Party Minority Leader Hakeem  Jeffries formally established the Rapid Response Task Force and  Litigation Working Group, chaired by assistant leader   Joe Neguse and  co-chaired by Representatives Rosa DeLauro, Gerry Connolly, and Jamie  Raskin.\n\nThe task force itself is also…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…President. Given that the U.S. Attorney       for the District is already appointed by the President, if       passed, this bill would concentrate all criminal and civil       litigation authority in the President, divesting the District       and its residents of any local control over these essential       functions.\n\nNo one knows or cares more about keeping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…York Power Authority and will receive  $70 million from the power authority over 35 years.\n\nThis legislation will finally resolve the Akwesasne Land Claim after  43 years of litigation and 11 years of negotiation.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on the bill, and I  reserve the balance of my time.\n\nMs. RANDALL. Mr. Speaker, I urge support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697674/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…paychecks and  livelihoods.\n\nMy bill, Mr. Speaker, the Tipped Employee Protection Act, provides a  commonsense solution. It puts an end to hurtful regulatory confusion  and litigation. It preserves the tipped wage and protections in the  Fair Labor Standards Act. It provides clarity and simplicity in  categorizing workers as tipped employees. It seeks…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…meant real  opportunity for North Dakota communities: more jobs, more tax revenue,  and more energy produced for the entire Nation.\n\nAfter a decade of delays, protests, and litigation, Keystone XL was  finally approved in 2017 by President Trump, but on day one of the  Biden administration, that permit was canceled. It wasn't canceled  because the project…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…portion of the  revenue the Federal Government generated from responsible resource  development to help fund things like schools and rural roads.\n\nToday, thanks to endless litigation and opposition from environmental  groups, responsible development like mining and timber harvesting is  nearly  impossible. Our rural communities are losing jobs, economic…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the certainty that companies will be able to benefit from the  exclusivity protections Congress intended. Lowering the bar will create  regulatory uncertainty, leading to litigation, market instability, and  hesitation from investors who fund rare disease innovation. Lowering  the bar will set a dangerous precedent for copycat products with few  modifications,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…long, the Federal Government and environmental activists have  waged legal warfare on our farmers, small businesses, and job-creating  projects, causing endless delays and litigation.\n\nMr. Trump's vision is clear: America is building again.\n\nMy Judicial Review Timeline Clarity Act, which is included in this  vital permitting reform package, establishes…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and the factors impacting IPOs costs;\n\n(E) changes in the costs and availability of investment       research for small- and medium-sized companies; and\n\n(F) the impacts of litigation and its costs on being a       public company.\n\n(b) Report.--Not later than the end of the 360-day period       beginning on the date of the enactment of this Act, the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Tenth Circuit.\n\nIn 2009, Josh joined the very well respected law firm Pierce Atwood  in Portland, ME. During his 16 years at the firm, he has specialized in  complex civil litigation matters and currently serves as cochair of the  firm's appellate team.\n\nJosh is admitted to practice in multiple U.S. courts of appeal and  the U.S. Supreme Court. He has…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…its  original purpose. Now, it is a four-letter word, often weaponized to  bury infrastructure, housing, energy, and other critical projects under  a mound of paperwork and litigation.\n\nNEPA is more synonymous with red tape than a green light. One recent  study found that energy projects spend a median of 3 years from final  agency approval to a final…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…want to focus on stories  from my district and my home state of Florida.\n\nAs a successful Section 230 defense often results in the court  granting dismissal early in the litigation, the facts are often  accepted as plead. In these instances, the excerpts below reflect the  claims as plead by the victims and their families.  Only Fans Parent Company…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…maintained strict  control over Florida's decisions.\n\nHowever, Florida's successful permitting program, along with Michigan  and New Jersey, has been thrown into limbo by litigation stripping  Florida of its ability to run its program. The court's decision, which  is contrary to the position of both the Trump and Biden  administrations, has shifted permitting…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…quality in communities across the country.  This legislation will also allow reclamation organizations to clean up  abandoned mine land without fear of becoming trapped in a litigation  doom loop.\n\nMr. Speaker, I thank Congressman LaHood for bringing H.R. 167 to the  floor, and I yield back the balance of my time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…higher costs to consumers, not  to mention California being the worst business environment of any State  in the country.\n\nIt has repeatedly been rated as having the worst litigation  environment as well, which means that those costs are passed onto  consumers, too.\n\nInsurance: When it comes to fire insurance in many parts of our  State, you pay more…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…received a share of Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental regulations, has drastically affected county  revenue, creating very real economic impacts in its wake.\n\nFranklin, Garland, Hot Spring, Howard,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…flags in their office. And  you know what they did? Nothing. Do you know why?\n\nWell, here is what the legislative auditor in Minnesota said: He said  that the threats of litigation and the negative press affected how the  State politicians used their regulatory power. Here is what a fraud  investigator in the attorney general's office said. She said:…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Analytics Program;\n\n(IV) metrics on the number of public comments received,       responses provided, and community meetings held;\n\n(V) the number of projects subject to litigation based on       authorization deficiencies or inefficiencies;\n\n(VI) a list of Federal agencies that are not yet fully       compliant with the data standards published under…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}]