[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "The bills also do little to curb       the fraud, illegal activity and corruption that continues to       be prevalent in anonymous crypto markets.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "You always start with the little things  and work yourself forward.", "title": "Social Security Child Protection Act of 2025", "date": "2025-12-01"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "As I sat here, I sat in a little bit of amazement because these  aren't just statistics that we are talking about.", "title": "People, Not Statistics", "date": "2025-03-05"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Speaker, in closing, we know that providing a  little  more predictability and stability can help reduce the barriers that  keep small businesses from bidding on and winning government projects.", "title": "Transparency and Predictability in Small Business Opportunities Act", "date": "2025-06-03"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "That little boy is now 3 years old, full of life, laughter, and love  and obsessed with music and trucks.", "title": "Gop Tax Scam Hurts Everyone", "date": "2025-05-20"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "By the way, my guess is they  are not getting a big benefit from these tax cuts because they are  minimum wage or a little bit more.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Still, his mom says he is the happiest little 3-year-old in town.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Ignoring my legislation and other proposals that have been offered  from the Health and Human Services Office of Inspector General, another  inspector general that was fired by President Trump, Republicans  instead offer this minor bill that does little to address fraud, that  raises a myth concerning payments to the deceased, and perpetuates that  myth that Social Security should be, in the words of one Republican  Senator: pulled up by its roots and gotten rid of.", "title": "Ending Improper Payments to Deceased People Act", "date": "2026-01-12"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "The average is about $1,200 a month-- some more, maybe some a little bit less.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": "2025-10-08"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Four children who starved to death, ranging from 4 months old to 2  years old--picture that little child in your arm, their legs and arms  just a twig, their ribs showing every indentation, and then, finally,  their body, as it goes through malnutrition, starts to consume itself,  and they died of gastric arrest.", "title": "Providing for Congressional Disapproval of the Proposed Export of", "date": "2025-07-30"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "As the first Vietnamese American to represent Orange County's Little  Saigon community in Congress, I am humbled by the responsibility to  carry this history forward.", "title": "Recognizing Black April", "date": "2025-04-29"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "OK, it has been used in  multiple years, but it was used to resolve little anomalies in tricky,  little twists and changes in revenue bills or in policies' programs.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Little League champions: the Summerlin South Little League.", "title": "Congratulating Summerlin South Little League Team", "date": null}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "I will talk a little bit as we go forward about the promises that now  President Trump made during the campaign, especially with respect to  the economy.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Waters for the time, although I  must say that I am a little bit confused.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "It was enacted in 1938, and we all know  things have come a long way since then when families did not use  daycare services for their little ones and elderly parents lived with  their adult children until death.", "title": "Empowering Employer Child and Elder Care Solutions Act", "date": "2026-01-13"}, {"senator": "James Lankford", "party": "Republican", "sentence": "But this was a fascinating little plot  that went from 2022 all the way to the present to try to figure out how  to get an electric vehicle mandate in America without ever having a  vote in Congress.", "title": "Congressional Review Act", "date": "2025-05-22"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Speaker, first of all, due to when I was pushed  back to start this, my speech will go a little less than 10 minutes, if  anybody is planning around it.", "title": "Monitoring Big, Beautiful Bill Provisions", "date": "2025-06-05"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "We  have had meetings for our boy to be able to get into the situation  where he is in a thriving third-grade class at a public school and  where he has a little extra attention on things that he does well.", "title": "Advancing America First Policies", "date": "2025-03-26"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Every city gets a little bit of it.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Craig's approach to protecting his  family and loved ones is a little different.", "title": "Border Common Sense", "date": "2025-03-26"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "Speaker, I would like to bring down a little bit of the tone and  remind everyone in this Chamber that the chief executive, since it was  George Washington, has been charged by Congress to be the first to  interpret the faithful execution of the Constitution and the amazing  amount of laws that have been passed in our nearly 250 years.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-08"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "As everyone in rural America knows, particularly in Washington  State, if there were wolves in Bainbridge Island or in the suburbs of  Seattle, the wolf population in Washington State would be a little  different.", "title": "Support for Rural Schools", "date": "2025-12-09"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Once again, the left's pro-Big Government, Green New Deal agenda  harms the little guy.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator- Freezers''", "date": "2025-03-26"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "Each one only costs a  little bit.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''", "date": "2025-03-05"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "88, but I will clarify  one thing for my colleague on the other side of the aisle and add a  little bit more color or correct the truth with the other half of the  truth.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars Ii; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "James Risch", "party": "Republican", "sentence": "These strikes have been discrete; they have been intermittent, with  little risk, if any, to U.S.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "I commend them to those who have an interest in seeing that  moment in history and perhaps feeling just a little piece of what those  who saw it in person understood.", "title": "Calling on Elected Officials and Civil Society Leaders to Counter Antisemitism and Educate the Public on the Contributions of the Jewish American Community", "date": "2025-05-14"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "A little history: Administrative warrants were  originally passed in the Immigration and Naturalization Act of 1952, so  they have been around for nearly 75 years.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}]