[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…community with the same passion and dedication she brings to her  career. Her story is one of resilience and excellence, making a lasting  impact.\n\nNon-Profit of the Year--Little Hands VA: Little Hands Virginia is  transforming the lives of young children and their families by  providing essential items, such as diapers, safe sleep spaces, and  strollers,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Corkerns. His  Medicaid waiver is the reason he is able to live today.\n\nWhen Republicans attack Medicaid, they attack families like the  Corkerns. Cutting Medicaid means that a little boy born today with  Connor's medical needs might not make it to his high school graduation.  Connor and so many others need this service to live.\n\nMr. Speaker, if the Republicans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691496/gop-tax-scam-hurts-women-and-families"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…statistics, and  the data of how many people he has terminated and has laid off or  fired. Whatever my colleagues want to call it, people are out of a job.\n\nAs I sat here, I sat in a little bit of amazement because these  aren't just statistics that we are talking about. These are people.  These are real people. These are real lives. These are not just data  points…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…simply can't deliver.\n\nWe are blessed to live in a great country, and we can't forget how  unlikely our independence was. In 1776, we subsisted on gasps of hope,  our plan little better than a prayer for recurring miracles--not just  in Philadelphia but, later, on the icy currents of the Delaware, in the  snows of Valley Forge, by the sea in Yorktown.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to say  this costs nothing, that there is no additional debt.\n\nA scoring rule has been used in the past. OK, it has been used in  multiple years, but it was used to resolve little anomalies in tricky,  little twists and changes in revenue bills or in policies' programs. It  was always narrow. It always was honest about what it was trying to  solve and…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…spike in  healthcare premiums. I urge my colleagues in the Senate to do right by  families and act without delay to lower healthcare and help working  family people breathe a little easier.\n\nMake no mistake, the fight to lower costs is far from over. We have  got to put our foot on the gas when it comes to driving down those  healthcare costs and making…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698667/protecting-healthcare-for-millions-of-americans"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the aisle roll their eyes. They scoff at the idea of       what is environmental injustice. It is not a thing. We don't       need to talk about it. So I want to just add a little context       to it.\n\nEnvironmental justice initiatives are lifelines for       communities that are at a higher risk of adverse health       impacts from exposure to pollution…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to recognize East Fullerton  Little League's 70th birthday.\n\nLittle League's mission is to instill in children the values of  sportsmanship, honesty, loyalty, and courage, aiming to produce well- adjusted, stronger,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700082/east-fullerton-little-league-70th-anniversary"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…colleague from Massachusetts Senator Markey and several others  here have sought to counter this complacency. But the danger of a new  nuclear arms race has received far too little attention from Congress  and the administration, and with tomorrow's expiration of the New START  Treaty, it is staring us in the face.\n\nThe United States, and our allies,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker. I  want the American people to look at this chart. The red indicates the  $3 trillion that Trump's big, ugly bill will add to the deficit. Then  we see this tiny, little blue sliver. Thank God, I am wearing my  bifocals here. I can barely see it. That little, tiny blue sliver-- again, you might need a magnifying glass to see it--that is the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…tragedy to triumph has only just begun, and the story  of our people will continue to inspire generations to come.\n\nAs the first Vietnamese American to represent Orange County's Little  Saigon community in Congress, I am humbled by the responsibility to  carry this history forward. Little Saigon, home to the largest  Vietnamese diaspora in the world, is a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…on Medicaid are  working, and they are working very hard. By the way, my guess is they  are not getting a big benefit from these tax cuts because they are  minimum wage or a little bit more.\n\nSo we are really doing something that is so unjust and, I believe,  un-American in rewarding the wealthy--some of whom have worked hard to  get it, some of whom…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…for their governing failures, so they are  trying to curb the electoral power of the struggling Americans who  their destructive economic agenda is harming the most.\n\nI am a little bit of a student of history. What we are seeing right  now evokes the dark periods of the late 1800s.\n\nDuring the gilded age, low-income Black and White Americans across  the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…affordable for their constituents.\n\nAgain, this isn't partisan. People in my State and yours are being  crushed by rising costs. Washington Republicans have the power to do a  little something about it, but they choose not to. So if you really  want to do what is right by your constituents, if you want to do right  by kitchen tables across this country,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…pay that.  Medicaid does.\n\nHis lung function is compromised, so he needs a $12,000 machine to  breathe. He needs help in school. He wants to go to college, but he  needs a little help because he is severely handicapped by this terrible  disease.\n\nConner comes to my office almost every year to tell me about his  aspirations and to beg that we keep funding…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…thank the gentleman from Arizona (Mr.  Schweikert). We have engaged in a colloquy on his time. I am going to  start my 30 minutes. He, of course, is welcome to stick around a little  bit if he wants.\n\nI am going to just jump off from where he started, or I am going to  start from where he left off, and that is to talk about what we are  debating on the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…than provide food. It offers connection,  dignity, and a true sense of community.\n\nAt the heart of the community is the director, Lora Benzinger, who  has led the pantry for a little over a year after years and years of  service. Drawing on her background in social services, she has made it  her mission to ensure the pantry nourishes not only families'…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698960/recognizing-eastern-washington-universitys-adaptive-athletics-program"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…condolences to the families, friends, and loved ones.\n\nFirst, I offer my own condolences, prayers, and support to those who  are mourning the loss of a loved one. While it has been a little more  than a month since this tragic incident, there are still no words to  adequately express the heartbreak we all feel at their loss and no  words that can properly console…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…when they were in  control and they passed the Inflation Reduction Act, why didn't they do  all of these things that they talk about being so important right now?\n\nIt is a little confusing when they continue to repeat. They believe  that if they just continue to say the same thing over and over and over  and over, it makes it true, and it does not,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…at the Pine Valley Ice  Shelter in Cloquet, Minnesota. It was my first year at Bantam, and one  of our parents came running out of the Zamboni room. He had just  watched the little black-and-white TV. He said: We beat the Russians.  We beat the Russians.\n\nI remember sitting on the bench, thinking: Why is he yelling that?\n\nLittle did I know it would be…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…is time to end that  spending.\n\nWe are ending it in H.R. 1. We are ending it in this package here  today, and we won't stop fighting for taxpayers. We can cut spending in  little chunks and in big chunks.\n\nIn response to Mr. McGovern's obvious assertions, Members always have  a choice to vote up or down on legislation, be it a rule,  authorization,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…also oversaw the expansion of VisionCorps from one  facility in Lancaster to rehabilitation and employment sites in Adams,  Chester, Lebanon, and York Counties, as well as in Little Rock,  Arkansas.\n\nAdditionally, Mr. Steiner serves as the North America/Caribbean World  Blind Union representative for the National Industries for the Blind.  He is a board…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696276/congratulating-visioncorps-president-and-ceo-dennis-steiner-on-his-retirement"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Operation Yellow Ribbon. They opened their  airports. The Canadians opened their homes. The Canadians opened their  hearts to 33,000 Americans who were stranded.\n\nThere is a little town in Newfoundland called Gander. I remember  this, too, that Gander has 10,000 people, but they welcomed thousands  of American passengers. They fed them. They sheltered…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…led this effort. We  have had meetings for our boy to be able to get into the situation  where he is in a thriving third-grade class at a public school and  where he has a little extra attention on things that he does well. He  is reading well above a third-grade level, but he really struggles in  other areas. He is on the autism spectrum.\n\nThe attention…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…ideological bias, promoting things like critical race theory and the  LGBTQ agenda.\n\nFrom foreign aid to NPR, massive amounts of taxpayer dollars are  wasted every day with little to no government oversight. Congress  cannot continue to let blank checks go out the door without revisiting  the way that these funds are used to help the American people.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…When people talk about  destruction, what will not be destroyed is the spirit of the people of  Texas; the spirit of the people that those camps represent; the spirit  of the little girls who are already talking about wanting to go back;  the spirit of the people associated with Dick Eastland, the camp  director of Camp Mystic who gave his life trying…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Mr. McGarvey  said this is the way the Founding Fathers would want it. I totally  agree with that. One of the gentleman's constituents brought the  concern, and it took us a little while to get there, but we got there.\n\nMr. Speaker, we are working in a bipartisan fashion to remove  obstacles in the way of the growth for our disability community.\n\nMr.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691757/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…markets work. It is how innovation happens.  It is how costs come down.\n\nThe choice is simple. We can continue doubling down on a failing  system that promises coverage but little care, or we can offer  Americans a new path, one grounded in freedom, responsibility, and  trust in the people that we serve.\n\nI want to make this very clear, Mr. Speaker:…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…undermines national  security while ignoring the needs of everyday Alaskans. The plan also  designates more than 3.6 million acres as Areas of Critical  Environmental Concern with little or no justification.\n\nThe Biden plan restricts access to Alaska Native lands, violating  commitments made under the Alaska Native Claims Settlement Act. Sadly,  the plan also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "…despite clear evidence that they would not  meaningfully improve visibility. These requirements would impose  significant costs on South Dakota communities and businesses for little  to no environmental benefit, essentially burning money without  improving outcomes.\n\nThis CRA ignores the fact that South Dakota's emission sources have a  minimal impact…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698625/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]