[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Virginia, which I know  you, Mr. Speaker, care a lot about. You and I served together in the  State legislature there where we were able to find common ground across  the aisle a little more easily than we are able to do in Congress.\n\nIn Virginia, about 350,000 people benefit from the Affordable Care  Act premium tax credits, enhanced premium tax credits,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…lab-grown meat for any purpose.\n\nThe Rules Committee should not have made this amendment in order  because it is just not germane to this bill.\n\nMr. Chair, let me tell you a little bit more about why it is  important that this amendment be defeated. By preventing funding for  the Bioindustrial Manufacturing and Design Ecosystem partnership, or  BioMADE,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…year in medical bills--or over $820  billion in total.\n\nSo, no, this isn't just about Republicans defending against some  California power grab or fighting on behalf of the little guy, which  brings me to my final point--because it is not just why Republicans are  trying to undermine California's climate leadership; it is how they are  trying to do it.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…which shook the colonies and rattled       the crown, has been largely forgotten outside of Rhode       Island. It's been overlooked in U.S. history classes and       remains little studied by historians of the American       Revolution. The Washington Post reviewed six high school and       college U.S. history textbooks and found no mention of the…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…included a radio address from President  Reagan, warning about the danger of tariffs, and, apparently, that got  Donald Trump's feelings all hurt.\n\nTrump is letting his delicate little ego drive U.S. trade, whether it  is with Brazil, Argentina, or with Canada. The consequence is that  Americans are paying more.\n\nThis isn't a laughing matter, really--no.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…country, how difficult it is.\n\nWhen we talk about programs like SNAP, I have a news flash for you.  The majority of people on SNAP who are able to work, work. They earn so  little they still qualify for the benefit.\n\nBy the way, the benefit is on average of about $2 per person per  meal. You can't buy a cup of coffee in the United States Capitol  Complex…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…tragedy to triumph has only just begun, and the story  of our people will continue to inspire generations to come.\n\nAs the first Vietnamese American to represent Orange County's Little  Saigon community in Congress, I am humbled by the responsibility to  carry this history forward. Little Saigon, home to the largest  Vietnamese diaspora in the world, is a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…monthly $900 premium       was reimbursed by the government. Without the stipend, I       cannot pay this premium and I would have to look at the       bottom bronze plans. Very little is covered. My premiums       would be lower but my deductibles would be astronomically       high.\n\nI am an in-home senior caregiver working part-time so I can       take…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…armed conflict and daily corruption by  this administration to run a bill on rich people's showers for Donald  Trump? It is just absolutely amazing.\n\nMr. Speaker, I have a little less than a minute left in my time. I  would ask my colleague across the aisle one simple question: Did Mr.  Donald Trump ask him to run a showerhead bill today on the House…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…arrest people while leaving their hearings. They are punishing  people who are doing things the right way by showing up to court and  going through the process.\n\nIt can be a little easy in politics to point out the hypocrisy on the  other side and to point out people's inconsistencies when their own  party is in charge. Yet, I can't ignore the irony that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…that they shared a wonderful secret.\n\nMr. Speaker, if that is not enough, Trump had the audacity to imply  that domestic violence is not a crime. He said: ``If a man has a little  fight with the wife, they say this was a crime.'' Consistent with that,  he has cut Federal funds that support victims of sexual crimes,  including domestic violence.\n\nTrump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…for  their time.\n\nToo many Americans still work too hard but can't afford the basics,  such as groceries, rent, or utilities. Even more, they are struggling  to afford the little extras that give you a slice of the American  Dream, like owning a home, taking your family on vacation, or even  occasionally going out to a restaurant.\n\nYet, simply put,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…deportation.                           Recognizing Carlo Garcia\n\nMr. CORREA. Mr. Speaker, I rise today to recognize Carlo Garcia, a  DACA recipient in our community and to tell you little bit of his great  story.\n\nCarlo was brought to the United States as a child. In his early life,  even then he knew he would have to fight and work hard to achieve the  American…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…about what chaos at the Fed means for rising  housing costs, rising borrowing costs, rising inflation, then they  ought to conduct some oversight. Otherwise, their concerns are little  more than hot air.                                   Populism\n\nMr. President, now on Donald Trump's fake populism, yesterday, in  Michigan, Donald Trump once again tried to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Mr. Fry, a freshman to this body, for his stewardship of  this bill. The collection of this information is important and useful,  but the mere passive gathering of data does little or nothing to  actually improve officer effectiveness or public safety.\n\nIn fact, none of the bills we have considered from the majority  during this law enforcement week would…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…to prevent this  Congress from speaking to that rule. It would no longer be under the  Congressional Review Act.\n\nI told you this was technical. But this was a fascinating little plot  that went from 2022 all the way to the present to try to figure out how  to get an electric vehicle mandate in America without ever having a  vote in Congress. It was…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…and Indiana  all followed suit.\n\nMr. Chair, I ask my colleagues to end this experiment on our Armed  Forces and support my amendment No. 106.\n\nMr. GOSAR. Mr. Chair, I am a little bit confused here, so I want to  ask the question: If we do good faith advertising to the American  people, because that is what our job is, tell me why we would actually…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…celebrated for its beauty, pristine wilderness, otherworldly nature,  and function as a refuge for local wildlife.\n\nTybee Island was ranked fourth on the list, being praised as a little  island packing a big punch. Tybee contains over three miles of beaches,  hundreds of years of history, and countless opportunities to explore  nature making it one of the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…investments in their own military, it is time we roll out America's  next generation warfighter.\n\nThat is why I rise in strong support of this amendment that would  direct a little over $4 million to enhance gate security at military  installations set to receive the B-21 Raider, including Dyess Air Force  Base in the key city of Abilene, Texas.\n\nThe…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the new insurance rates for 2029 that would  not have the subsidies anymore in it the week before the Presidential  election in 2028.\n\nWell, that was clever. They set up a little political timebomb for  the Presidential election in 2028, saying they chose this certain date  in this certain time to do it so that right before the next  Presidential election,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…munitions.\n\nChina, Russia, Iran, and Cuba use the country as a platform for  intelligence operations in asymmetric warfare.\n\nInstead of considering this resolution, which carries little or no  consequences for hostilities that do not exist, this Chamber should  focus on supporting the President's efforts to deter the growing  national security threat from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Mr. PERRY. Mr. Chairman, I might sound like a little bit of a broken  record here, but, unfortunately, the broken record of $37 trillion in  debt and climbing continues as well, so we have just got to keep at it.\n\nFirst, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…$6,000 on their Social Security  benefits.\n\nAll of these enhanced deductions will ensure that those who are  experiencing the brunt of the affordability burden will have a little  more breathing room when tax day comes around next year.\n\nThe Biden administration created long-lasting harm with its  profligate spending habits. It is wasteful Washington…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…or for the elderly. Who can vote against that?\n\nIf the bill was billion-dollar program and needed a tax increase on  every American to pay for it, well, now that vote is a little  different. We don't do that. We never do that.\n\nNow what is going to happen? Well, there is going to be a lot of  posturing over the next week.\n\nHere is something that everybody…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we have  borrowed and have given to agencies, but they haven't been authorized  or haven't spent it.\n\nMr. Speaker, off the top of your head, will you raise your eyebrows a  little bit if we call this SF 133, so it is money that has been  appropriated, sitting in their accounts, so it is cash. We are paying  interest on it because that money was borrowed.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…appliance's interior temperature may rise  above safe food-storage conditions, jeopardizing food safety.\n\nOnce again, the left's pro-Big Government, Green New Deal agenda  harms the little guy. The Biden Department of Energy implemented a  policy that threatens small businesses, harms consumers, and drives up  costs, even as many Americans continue to struggle…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Pryor were waiting on a compromise in the House. But, in       the ``air war'' Bethune was gaining ground. He obtained       endorsements from pro-business groups such as The Little Rock       Chamber, Mack McLarty, then Chair and the Arkansas Industrial       Development Commission.\n\nThen, a miracle of legislative courage happened. On the       last day…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…markets work. It is how innovation happens.  It is how costs come down.\n\nThe choice is simple. We can continue doubling down on a failing  system that promises coverage but little care, or we can offer  Americans a new path, one grounded in freedom, responsibility, and  trust in the people that we serve.\n\nI want to make this very clear, Mr. Speaker:…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…President selected Ms.  Hermandorfer for the circuit court.\n\nThere is no one more qualified to take on this important role as an  appellate judge for our great Nation.\n\nNow, a little bit about her background. She is a Tennessee native.  She attended Nashville's Harpeth Hall School, and she was an  outstanding athlete and an outstanding student at the Harpeth…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693465/nomination-of-whitney-d-hermandorfer"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Americans and not be something specific to the  United States Senate.\n\nWe are correcting this now. We should pass it immediately. The Senate  should take it up and pass it. Also, a little personal message to the  Senate: Take this up and pass it, or you are not getting any support  from this Member for any of your measures that come over to this body.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696928/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}]