[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…support  families in crisis and ensure that they have the resources and  information they need to stay safe. Stripping $1.1 billion from public  broadcasting puts millions of lives at risk, including first responders  and families who depend on emergency radio systems and public  broadcasts to stay informed and stay safe.\n\nNow, I heard from a broadcaster…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…and life- affirming international assistance--another in a long line of cruel  decisions from this administration to abdicate U.S. leadership abroad  and put millions of lives at risk. If enacted, H.R. 4 will rescind over  $8.3 billion in foreign assistance funding already appropriated by  Congress on a bipartisan basis. The recissions in this bill will…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Constitution, to seek an authorization for  the use of military force from the Congress of the United States.\n\nThe administration, instead, acted precipitously, putting American  lives at risk, including the over 40,000 U.S. troops in the region, as  well as diplomats and American civilians stationed or visiting the  Middle East.\n\nWars are easy to start, but…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…hospitals close and when  Medicaid staff lose their jobs, tired communities lose access to care.  Ambulances end up having to drive farther and farther. Wait times  increase. Lives are at risk.\n\nThe ripple effects are vast. Schools will suffer when children with  disabilities lose access to Medicaid support services like physical  therapy, transportation, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Chair, today, I rise in opposition to this amendment,  which will put American lives at risk.\n\nThe gentleman from the other side of the aisle made a point to talk  about the Civilian Marksmanship Program and what it was intended to do  and what it is intended to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…critical work to keep us healthy.\n\nMusk and Trump are going so much deeper than firing the HHS  workforce, which is damaging enough to research programs and puts  Americans' lives at risk; they are throwing sand in the gears of the  NIH--their basic grant-making operations--to prevent scientists from  getting the resources they need to conduct lifesaving…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…conditioning on during heat waves is a death sentence. Experts warn  that heat wave-induced blackouts could kill 13,000 people. This bill  doesn't just cripple our grid; it puts lives at risk.\n\nThis bill will exacerbate devastating heat waves and extreme weather  events. It strips EPA funding, repeals protections against pollutants,  and ends longstanding air…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…building  want to gut it.\n\nTrump has proposed slashing billions of dollars from the NIH budget,  which would cripple research, stall medical progress, and put American  lives at risk. These cuts would mean fewer clinical trials, new  treatments and advances in the fights against the diseases that impact  millions of Americans. Every person in this country,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise today to bring attention to yet  another decision by the Trump administration that puts Americans' lives  at risk.\n\nOn April 1, 2025, almost the entire Division of Blood Disorders and  Public Health Genomics, a department of the CDC established to combat  blood infections in the wake…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690579/blood-transfusion-oversight"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…is just one action amid a comprehensive campaign to erase the  memory of what happened on that day. It is a slap in the face to law  enforcement who selflessly put their lives at risk to defend all of us.\n\nSome of them lost their lives, like Officer Brian Sicknick, a New  Jersey native, who tragically died following injuries he sustained that  day. Many…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…partnerships with our  local universities have been terminated.\n\nThese devastating cuts are not only costing people their livelihoods  here at home but are also putting lives at risk around the world.\n\nUSAID is a cornerstone of our national security, advancing global  health, powering research across the country, and reinforcing America's  leadership…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692405/trump-rescissions-request-and-usaid-cuts"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…X-ray       machines, all available for unregulated civilian use.                                  Conclusion\n\nDeregulating these ``less-than-lethal'' devices will put       lives at risk, especially the most vulnerable in society.       Because these devices would no longer fall under the legal       definition of ``firearm,'' they would be available to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…8,000 deaths. Dirty diesel will cost Americans over $90 billion in  health damages. Republicans are fighting for resolutions that are  hurting people's health and putting lives at risk.\n\nMadam Speaker, I urge my colleagues to oppose this resolution, and I  yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, on that I demand the yeas and nays.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Americans paid the price. Our  air traffic controllers went without pay. A system stretched thinner by  the day had a new strain put on that system, which put millions of  lives at risk. Americans depend on them to keep our skies safe.  Families who rely on SNAP and WIC, parents who are just trying to feed  their kids, were left wondering how they would…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…of the USGS  National Volcanic Threat Assessment. If it erupts, as it did in 1992  and 1953, ashfall could shut down air traffic, damage critical  infrastructure, and put lives at risk.\n\nH.R. 3176 is a straightforward, 5-year reauthorization that keeps the  program funded and operational. It maintains existing funding levels  but provides the U.S. Geological…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…spent on the LCS is  a dollar diverted from building a stronger, more capable fleet.  Retaining these ships compromises readiness, squanders limited  resources, and puts lives at risk.\n\nMy amendment restores the Navy's authority to make strategic  decisions about its fleet and frees up resources for platforms that  actually enhance our national security.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693683/department-of-defense-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the government, we will be happy to talk to you about some of  these issues, but you are not going to shut down the government, punish  the American people, put people's lives at risk, and think we are going  to sit down and negotiate with you under those circumstances. That is  not going to happen.\n\nWe told you 43 days ago, from bitter experience, government…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the border wall. President  Trump is gladly reversing this madness and making our border secure.\n\nPresident Biden's failed leadership continuously put innocent  American lives at risk as nearly 400 individuals whose names appeared  on the terrorist watch list attempted to enter the country and gang  members from MS-13 and Tren de Aragua invaded the interior…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…poison.\n\nThis is among the many reasons why President Trump was well within  his constitutional authority to take action against these  narcoterrorists who put American lives at risk. These recent strikes  fulfilled President Trump's constitutional duty to protect Americans as  their elected Commander in Chief.\n\nThis should come as no surprise. President…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}]