[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…expression--were integral to the  couple's success. Their partnership was a testament to the power of  collaboration and the beauty of shared purpose--and their legacy lives  on in the countless lives they touched through art and advocacy.\n\nPaul and I, and our entire family, mourn the loss of our very dear  friends Rob and Michele with profound sorrow. (And…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…that I proudly represent.\n\nThrough tireless advocacy, they have strengthened our neighborhoods,  expanded opportunity for those too often left behind, and improved the  lives of countless families across Orlando: Admiral David Brewer, Alvin  J. Cowans, Jennifer Desir Hilaire, Chet Glover,  Florida Supreme Court Justice James Perry, Anne Piervil, Lisa Williams,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700051/black-history-month"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…country honorably for 35 years, culminating  in his service as commander of the 455th Chemical Brigade in Sloan,  Nevada. Colonel Dinh's leadership positively impacted the lives of  countless servicemembers.\n\nI am certain that his dedication and achievement will have a lasting  impact on the Army's ability to fight and win our Nation's wars.\n\nUpon retirement,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…more than  $3 million and over one million volunteer hours into more than 100  local agencies. Through these efforts, the League has made a tangible  difference in the lives of countless residents across North Texas. This  year alone, JLA is providing $100,000 in grants to 10 community  organizations, continuing its long tradition of philanthropy and…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…invaluable assets to our community, and their  dedication to patient care is commendable. By providing accessible and  high-quality outpatient services, they have improved the lives of  countless individuals in our district. I, again, proudly recognize the  exceptional work of all the healthcare providers at Dallas Endoscopy  Center.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Son of Man did not come to be served, but to serve, and to give his  life as a ransom for many.'' Jim's life was one dedicated to serving  others in need, improving the lives of countless people throughout.  Jim's legacy will live on through his loving family, friends, and the  current and future generations of Grandview. As we celebrate and fondly  appreciate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…to eliminate FEMA.\n\nIn September 2024, western North Carolina was ravaged by Hurricane  Helene, the most devastating storm in our State's history. We lost over  100 lives, and countless communities were changed forever.\n\nIn the immediate aftermath of Hurricane Helene, FEMA provided  indispensable support to save lives, clear debris, and house families…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693055/president-trumps-proposal-to-eliminate-fema"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…and culminating as the Deputy Chief of Army  Reserve. A native of New Jersey and West Point graduate, Major General  Kotulich's distinguished service has impacted the lives of countless  soldiers and their families.\n\nAnd she has served in several key leadership roles throughout her  remarkable career. She served as the Director of the Army Recruiting…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…forgotten.                 recognizing alan hassenfeld of rhode island\n\nMr. AMO. Mr. Speaker, Alan Hassenfeld, another titan in Rhode Island,  spent his life bettering the lives of countless individuals in our  country and around the world.\n\nBorn in Providence in 1948, Alan dedicated his professional life to  bringing joy to generations of children as the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…organizations.\n\nIt is an honor to recognize Monica Gurell during Jewish American  Heritage Month. Her unwavering dedication to faith, education, and  community has enriched the lives of countless others and continues to  serve as a beacon of strength.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…about gun violence in our communities, and that is exactly  what I intend to do.\n\nThis is Gun Violence Awareness Month. This month, and every other  day, I mourn the lives of the countless people who have lost their  lives to senseless gun violence and those whom they have left behind.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692027/observing-gun-violence-awareness-month"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…critical illnesses, bringing joy and hope to families  facing immense challenges. Through the Wishes & Heroes Benefit Concert,  Corey has made a tangible difference in the lives of countless  individuals served by these two organizations.\n\nThe fifteenth and final Wishes & Heroes Benefit Concert marks the  culmination of an incredible journey. Corey's dedication,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…and community.\n\nPhil and Laurie Davis represent the very best of what it means to  serve. Their decades of dedication have strengthened our community and  improved the lives of countless veterans and their families. It is my  honor to extend deep appreciation and recognition for their unwavering  commitment to those who have worn our Nation's uniform.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697105/recognizing-phil-and-laurie-davis-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the bench, Judge Fender was an educator who shaped minds with  the same care and wisdom he brought to the law. His influence extends  far beyond written rulings. It lives on in the countless people he  taught, mentored, and served.\n\nThough retiring from full-time service, Judge Fender will continue  contributing as a senior magistrate judge on an as-needed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…tournament. During his twelve years as  chairman of the district baseball committees, he oversaw and organized  numerous successful district tournaments, enriching the lives of  countless young athletes.\n\nMr. Speaker, let us all join in recognizing Raymond E. Carlson for  receiving the prestigious honor of being named the 2025 Upper Peninsula  Veteran…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694083/recognizing-raymond-e-carlson-as-the-2025-upper-peninsula-veteran-of-the-year"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Assistant Chief of Army  Reserve. A native of Oregon and a proud graduate of the United States  Military Academy at West Point, Mr. Austin has left an indelible mark  on the lives of countless Soldiers, Army civilians, and their families.\n\nEven after retiring as a Colonel in the U.S. Army, Mr. Austin's  passion to serve endured. In June 2015, he returned to…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and honorable service, Timothy retired  from the United States Marine Corps. His experience, professionalism,  and devotion to country have left a lasting impact on the lives of  countless Americans. His legacy is one of sacrifice, integrity, and  duty, and we offer our deepest gratitude for his outstanding service to  the United States of America.\n\nMr.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…led musicals,  ensembles, and challenged students to become the best they could be.\n\nHaving taught at several schools and across all grade levels, Nancy  touched the lives of countless elementary students and gave them the  skills and encouragement needed to pursue their love of music. Beyond  the classroom, Nancy is an amazing musician herself, serving…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…posted it on her social media  accounts, instilling fear in and terrorizing those people who she  claims to care for.\n\nMr. Speaker, Democrats are injecting fear into the lives of countless  Americans, stoking their anxieties, disinforming them, dragging them  into the muck of the worst of political discourse, and for what? For  what?\n\nMr. Speaker, it is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…expertise have been of great value to Kentuckians,  building an endearing and longlasting fan base that I am honored to be  a part of. I salute Wayne for investing in the lives of countless  student athletes and giving Eastern Kentucky so much to be proud of.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…income & homeless clients. She  helps coordinate treatments and community resources to aide in the  health and wellbeing of all in the community. She has helped save the  lives of countless individuals.\n\nIt is clear Lori Ventura has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691248/recognizing-lori-ventura"}, {"senator": "John Carter", "party": "Republican", "sentence": "…years, chaired the Harker Heights Parks  and Recreation Committee for 12 years, and coached youth soccer for  over a decade. Her selfless work has positively impacted the lives of  countless young people. Today, she continues to serve as a Wounded  Warrior member and volunteer and has been a member of the Fort Hood  Retiree Council for the last five years.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689348/saluting-the-service-of-command-sergeant-major-angela-wilson"}]