[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…humanitarian crisis that continues, a peace that guarantees the  security of the Israeli people, an end to the humanitarian crisis in  Gaza, and the end of Hamas, so that all may live free of fear and  oppression.\n\nI hope that the memory of all who lost their lives on October 7 will  be a blessing and that we will never forget them and honor them through  action,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…``Father, Father, why have You forsaken me?''\n\nThis also parallels the story of Passover with the Jewish people  fleeing Egypt in search of a better life, where they could live free  from bondage and fear.\n\nAre we not to care for strangers in a strange land, to treat our  neighbors as we would want to be treated? Do we leave them to wander  the desert…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…associate with Dr. King because it speaks  to his militancy, in a sense, but it also speaks to things that people  don't want us to do. We have a State that has as its motto Live Free or  Die.\n\nWell, it is all right for a State to have that, but Dr. King's quote  was: ``A man who hasn't found something worth dying for isn't fit to  live.''\n\nA man, a person,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…not subjects to be ruled; we are citizens to be heard. This  is America. This is where freedom rings. And perhaps these sound like  lofty principles. Well, I am from the ``Live Free Or Die'' State.\n\nIn New Hampshire, we know that principles like freedom matter. We  know that they matter because people gave their lives for these  principles, and they…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…found supporting veterans throughout  northwest Indiana as they return home from service.\n\nIt is because of the sacrifices of veterans just like Oscar that we  are able to live in a free, democratic country.\n\nMr. Speaker, please join me in celebrating Black History Month and a  century of national Black history commemorations by recognizing the  selfless…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…with dialogue, and peace that insists, without  exception, that every single life matters.\n\nFrom Boston to the Middle East, our destinies are tied, and everyone  deserves to live free from fear and know peace.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…distracted, but let me say this: A threat to one  of us is a threat to all of us. A cage is a cage at a for-profit prison  or at a detention center.\n\nEveryone deserves to live free from fear. Policy is not abstract. It  is not a dusty document on a shelf. Policy determines who lives. Policy  determines who dies. Policy determines who survives. Policy…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…their own leaders and  their own path.\n\nI stand with the women of Iran. I stand with their courage. I will  continue fighting for a future where every person in Iran can live  free, speak freely, and dream without fear.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697722/free-iran"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…women, children, and marginalized communities will  live on for generations to come. Alice was a force to be reckoned with,  stopping at nothing to ensure that others could live free of abuse,  injustice, and discrimination. Her undeniable impact will continue to  grace Kansas City with inspiration.\n\nAlice's long history of advocacy began when as a high…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…first of the Articles of our Bill  of Rights, the First Amendment, because 250 years later, our President  does not seem to recognize them.\n\nWe were born from assembly. We live by free speech and a free press.  These are the core tenets of our United States. Yet, the President  floods American cities with lawless, thuggish ICE agents.\n\nTheir grotesque…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Chicago will not be intimidated, and I will not stop demanding truth  and dignity for Silverio, William, or the children in Cicero, and for  every family who deserves to live free from state terror.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…offenses to target political  foes or vulnerable communities. In a free society, anything that is not  specifically prohibited is allowed to you. That is what it means to  live in a free society. In an authoritarian society, anything that is  not specifically allowed to the population is considered prohibited and  a danger to the government.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for her steadfast  commitment to the conservative movement, to the United States, to  defending our country, and in service of the Lord almighty.\n\nI will keep to fighting to live free, and I will remember Diana  through those actions. I will miss her dearly, as will many of my staff  who counted her as a mentor.\n\nWhen I think of the people who have devoted…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…leaders and soldiers who defend our nations.  True freedom grows when people are willing to stand up for themselves  and others. As an American, I am fortunate enough to live in a free  country, and I stand for what freedom means.''\n\nI thank everyone who participated in this year's congressional speech  competition, and I congratulate our winners.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…life as God-fearing  Americans who say that we put our trust in God right above the flag  that those brave men and women wore into combat so that we could be  here and live supposedly free.\n\nWe are unable to live free because we are not secure. We are not  secure because radical politicians, judges, and NGOs are working  furiously for political gain and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Donald J. Trump for his work to secure peace and prosperity with our  friend and partner. The United States continues to stand with the  people of Azerbaijan and their right to live free.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699195/recognizing-the-36th-anniversary-of-black-january"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the very beginning of our Nation until this moment, millions of  Americans have stepped forward and said: I will risk it all so that my  children and those I do not know can live free lives. Knowing the  burdens of tyranny, knowing what it meant to live under the heel of a  King, our forefathers risked everything.\n\nIn nations around the world that I have…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…our friends in Israel that better days are  ahead. And these better days only come with sacrifice.\n\nAnd as I speak, people in Iran are sacrificing because they just want  to live free.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…home and abroad in defense of democracy--millions who have said: I will  risk it all so that my children and the children of others I don't know  and will never know may live free.\n\nFrom the very first shots at Lexington and Concord to the fields of  Gettysburg and Vicksburg, to the beaches of Normandy and Iwo Jima, to  the sands of Southwest Asia…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…live in the greatest Nation in the  history of the world. It is not even close.\n\nMy friends and colleagues, we are so blessed. We should not take it  for granted. We live in the most free, the most successful, the most  powerful, the most benevolent Nation that has ever been on the face of  the Earth, and there is a reason for that.\n\nThe reason that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}]