[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "However, is their priority to make people's lives easier, to make  people's lives better?", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "My parents were forced to flee because  they feared for their own lives in their home country.", "title": "Humanitarian Crisis in Gaza", "date": "2025-07-22"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Both of these men should still be here, and it breaks my heart that  their lives were cut so short from this disgusting act of cruelty.", "title": "In Memory of Officers Samuel Riveros and Darius Wong", "date": "2025-06-05"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "I have looked into  the eyes of students whose lives were changed.", "title": "Opposition to Job Corps Closures", "date": "2025-06-05"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "These delays have been putting people's lives on hold indefinitely  without any sort of timeline or transparency, and we must restore  timely adjudication of these applications.", "title": "Korean-American Day", "date": "2026-01-12"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "They have devoted their lives to  caring for veterans, and now, with the sweep of a hand, they get the  back of a hand from Elon Musk, who has never ever even thought about  wearing the uniform of the U.S.", "title": "-9999", "date": "2025-04-29"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "They dedicated their lives to ensuring not  only that their children but every child had a good education.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "The kids who rely on SNAP, the nutrition assistance program, may not  quite understand it, but make no mistake about it: What we are about to  do in the next few minutes here will have a profound effect on their  lives, not to mention the millions of Americans who may not be on  Medicaid, Medicare, SNAP, or the ACA, but who rely on a hospital in a  rural area, who now may see that hospital close because of the cuts  that are in this piece of legislation.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "In my home State of New Jersey, 190 veterans tragically lost their  lives because of the COVID outbreak at the veterans homes in Paramus,  New Jersey, and Menlo Park.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "This is not the way to improve  Americans' lives.", "title": "Opposition to Permitting Bills", "date": "2025-12-12"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Sinkholes can open without  warning and wreak havoc on our infrastructure, damaging roads, bridges,  buildings, and utilities and putting people's lives and livelihoods at  risk.", "title": "Sinkhole Mapping Act of 2025", "date": "2025-07-14"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "This experience as a congressional staffer provided  George with invaluable knowledge about how a legislative office works  and how to best collaborate with me and my staff to improve the lives  of Skokie residents.", "title": "Recognizing the Career of Skokie Mayor George Van Dusen", "date": "2025-03-14"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "We miss her, and we know that her work in  Ohio has made a difference in the lives of our 12 million people.", "title": "Trump's Reckless Tariff Policies", "date": "2025-07-23"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "It denounces anti-Semitism, condemns the horrific attack in my  community, and lifts up the organization Run for Their Lives, which was  heinously targeted by this terrorist.", "title": "Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-11"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "These projects, they reflect what I believe Federal funding should  do: listen, work with localities so that we can invest in practical  needs that improve daily lives.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "The people in Minnesota, many of them, not only can't afford  an EV, these vehicles are not compatible with our daily lives.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "As someone who lives with  the burden of a rare disease, Liz has not only used her personal  journey to advocate for others but has also dedicated herself to  advocating on Capitol Hill for those living with rare diseases.", "title": "Recognizing Elizabeth Kennerley's Tireless Rare Disease Advocacy", "date": "2025-03-10"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "We created Trump investment accounts for every new child born in  America, $1,000 in seed money to transform their lives, and every  single Democrat voted against it.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "The lives of so many lie in the balance.", "title": "Stop Forced Organ Harvesting Act of 2025", "date": "2025-05-05"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Speaker, I rise today with a heavy heart not  just to speak but to mourn, to honor, and to demand that we never grow  numb to the unimaginable loss suffered by those who dedicate their  lives to protecting ours.", "title": "Congratulating Larry Haskell on His Retirement", "date": "2025-07-15"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "As a longtime educator at  Patti Welder Middle School, a legendary radio voice on Majic 95.9, and  Victoria's undisputed ambassador of joy, he has touched countless lives  with his infectious smile and genuine love for every person he meets.", "title": "Recognizing Brother Gary Moses", "date": "2025-12-03"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "It lives on in the countless people he  taught, mentored, and served.", "title": "Retirement of Judge Ronnie Fender", "date": "2026-02-04"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "It is time for fair  punishment for the people who interfere with people's daily lives,  specifically those with prior convictions.", "title": "DC Criminal Reforms to Immediately Make Everyone Safe Act", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Speaker, I am going to let you go back to your lives.", "title": "Fun with Math", "date": "2025-12-17"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Their dedication has energized ten homesteads and countless lives,  creating a legacy of service that embodies the true spirit of  cooperative values.", "title": "Recognizing Alan Sowerby", "date": "2025-06-12"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Renaming this refuge is a fitting  honor to Jocelyn's life that ensures that her memory lives on.", "title": "Jocelyn Nungaray National Wildlife Refuge Act", "date": "2025-07-14"}, {"senator": "Max Miller", "party": "Republican", "sentence": "She was heavily involved in the lives of her three children: Karen,  Ronald, and Loree, always providing a welcoming home where their  friends could gather.", "title": "Congratulating the Independence Police Department", "date": "2025-12-09"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Their dedication has energized ten  homesteads and countless lives, creating a legacy of service that  embodies the true spirit of cooperative values.", "title": "Recognizing Gary Steele", "date": "2025-06-17"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "The reality is that Maduro's capture and prosecution will save  American lives, and I commend the Trump administration for taking this  decisive action.", "title": "Successful Operation to Arrest Nicolas Maduro", "date": "2026-01-12"}]