[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Studies have  shown that a higher percentage of veterans are turned down for loans."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "Over the past several weeks, I have been in touch with businesses and non-profits throughout Maryland, and some have expressed concerns that Treasury has not clarified the timeline and process for loan forgiveness under the PPP."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "In addition to much needed funding for the Maryland-based National Institutes of Health and the Centers for Disease Control and Prevention, the bill also includes additional funding to help small businesses obtain low-interest disaster loans through the Small Business Administration (SBA)."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Durbin and Schakowsky's legislation, Health Heroes 2020 Act, would address these challenges and entice promising students from diverse backgrounds--physicians, dentists, mental health professionals, nurses, and physician assistants--into primary health careers in underserved communities by providing historic new funding levels for scholarship and loan forgiveness options in exchange for a service commitment in an urban or rural area with a shortage of providers."}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "It also helps rural America by providing $1 billion in single family  direct home loans, $120 million over the House level, and funding water  and wastewater programs at $446 million, both issues that Democrats  tried to address in full committee."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Shaheen was a lead negotiator of the bipartisan Coronavirus Aid, Relief, and Economic Security (CARES) Act, which created the PPP and Economic Injury Disaster Loan (EIDL) grant program."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Let's pay attention and work together to shore up small businesses  with low-interest loans and with grants to see them and their employees  through this difficult time."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) today spoke with members of the Illinois Community College Trustees Association about her personal experience with student loan debt and her work to make higher education more affordable, accessible and effective."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "We respectfully request that you issue a SBA Economic Injury Declaration that includes all counties for which the Governor has requested such assistance, and that the loans also be offered to the counties that are contiguous to the declared counties."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "The bill, which now goes to the President's desk to be signed into law, extends the PPP loan forgiveness period from 8 weeks to 24 weeks, and allows businesses and non-profits to spend more money on other business expenses, such as utilities and rent by altering the threshold that must be directed to employee wages from 75 percent to 60 percent."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Small Business Administration loans are critical to helping small businesses in New Hampshire stay afloat during these difficult times and this emergency declaration is an important step toward getting resources out the door."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "China  is flooding developing countries with infrastructure loans and digital  surveillance systems."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Hospitals would not be required to start paying down the loan for four months, and would also have at least 12 months to complete repayment without a requirement to pay interest."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "The rule that she came up with at the Department of Education makes  it almost impossible for student loan borrowers, including many, many  veterans, who have been defrauded by their schools--these are usually  for-profit schools--to have Federal student debt discharged because of  the fraud under the Higher Education Act's borrower defense provisions."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "In passing the CARES Act, Congress conferred on you, as the Treasury Secretary, significant discretion in the allocation of $500 billion in loans and investments under the Act."}, {"senator": "Roy Blunt", "party": "Republican", "sentence": "Small business owners are utilizing the Paycheck Protection Program and the Economic Injury Disaster Loan Program to keep their employees on the payroll and cover other expenses."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "His legislation also created the Paycheck Protection Program, which is helping more than 45,000 Kentucky small businesses access over $5 billion in loans to keep their lights on and employees on payroll."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "These funds are not loans and do not need to be repaid."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Department of Agriculture's (USDA) Farm Service Agency (FSA) is expanding its Disaster Set-Aside (DSA) loan provision to cover farmers impacted by the coronavirus disease 2019 (COVID-19) pandemic."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "His legislation also created the Paycheck Protection Program, which is helping more than 45,000 Kentucky small businesses access over $5 billion in loans to keep their lights on and employees on payroll."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "I would like to commend the Federal Reserve for expeditiously creating both the Main Street New Loan Facility (MSNLF) and the Main Street Expanded Loan Facility (MSELF)."}, {"senator": "John Thune", "party": "Republican", "sentence": "And one has to do with the fund that would be available for businesses to get access to loan capital to help provide liquidity for their businesses and what kind of conditions should be imposed there."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "The Central Power project was supported by more than $20 million of federal loans from the U.S."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "And I remember going over, convincing our team, our leaders to-convincing that we should be providing for loan guarantees."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "It comprises policies from various bipartisan task forces to deliver relief through immediate payments, deferred tax collection, small business loans, stabilization for the hardest hit sectors of the economy and expanded unemployment insurance available to more workers than ever before."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "As we know, those low- interest loans can be used to cover everything from payroll, to supply  chain disruptions, to rent or mortgage."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Senators Lisa Murkowski and Dan Sullivan, and Congressman Don Young (all R-Alaska) today welcomed a rule change released by the Treasury Department that enables seasonal businesses, to choose a different 12-week expense period when applying for a Paycheck Protection Program (PPP) loan, a period that more accurately reflects their operating payroll."}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "\"A large portion of this funding is authorized under Title IV of the CARES Act, which provides significant resources for loans, loan guarantees, and other investments from Treasury and the Federal Reserve's 13(3) emergency lending facilities and programs in support of eligible businesses, States, municipalities, and Tribes."}]