[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of fighting for the American people, President Trump and  Republicans have spent the past year seeking to strip millions of  Americans of healthcare, food assistance, student loan support, and  much more that is vital to their quality of life and, for many of them,  their very survival.\n\nDemocrats have been sounding the alarm over the ongoing threats…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696436/healthcare"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…climate risk to insurance collapse, to  mortgage market failure, to property value crash transpires, the banks'  balance sheets collapses. Its collateral value is gone. Its loan-to- value ratio makes it insolvent. And now you have a bank crash laid over  the underlying great climate insurance collapse.\n\nThat is not from me. That is not from the League…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…waivers with full knowledge  that they are not actually rules, other Agencies will now be free to  submit any type of action, going back to 1996. Think licenses, permits,  leases, loan agreements, drug approvals. There would be no limit.\n\nNow, we have been safe from this kind of abuse until now because the  Senate has a process in place for the Government…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…moving programs out of the Department of  Education as part of the dismantling of the Department--I could not  resist this example--President Trump proposes to move the student loan  portfolio to the Small Business Administration, which has neither the  capacity nor the expertise needed to handle this massive program. The  SBA is one of the smallest Federal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…that financial institution. If you wanted to deal with others,  you would go elsewhere. If you wanted to deal with several, you would  call several.\n\nWhen you seek a mortgage loan, of course the mortgage lender has to  look at your credit report, so they call Equifax or whoever or email  Equifax and get your credit report. Then the credit bureau sells…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…the same messages repeated every single day: Small businesses don't  need special treatment. In fact, they are just asking for a fair shot  in this economy.\n\nThe SBA's 504 loan program is designed to provide that fair shot  through basic good policy and affordable, long-term financing. The  financing helps small businesses buy buildings, buy property,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…happen at the snap of a finger.\n\nIt takes large investments and longtime horizons. This bill is a way  to approach filling the gaps in manufacturing financing. It raises the  loan limits for the SBA 7(a) and 504/CDC loan program from $5 million  to $10 million for small manufacturers.\n\nIn fact, helping small firms with the upfront capital investment is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…centers  reduces competition, and it results in Americans paying higher prices  for their banking services. That means higher credit card interest  rates, higher fees, higher auto loan payments, and unaffordable  mortgages. And when these banks become too big to fail, the entire  economy feels the pain when those banks' risk-taking blows up, and  taxpayers…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and corporate donors.\n\nLet's take a look at some of these broken promises. Donald Trump said  he would put America first. He has not. What he has done is given a $40  billion loan to Argentina. He stabbed American ranchers in the back,  proposing that we import beef from South America. He threw a fancy  party at the White House for a Saudi Prince who…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…earners are going to get at least 68  percent of the benefits in the bill, while Oregonians and Americans who  benefit from Medicaid and SNAP will be left to suffer.\n\nStudent loan borrowers could be in debt until they die because of  this big, bad bill. Many students who get Pell grants will be harmed.  The bill will raise monthly student loan payments…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…living is just too  high.\n\nI feel it, too, as the daughter of a single mom who made everything  work because of access to affordable childcare, as a millennial with  student loan debt that I am still years away from paying off, and as a  first-time homeowner who finally was able to buy a house in the  district that I represent after renting for over…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…affordability and, once again, places students who are already at a  disadvantage further from the finish line. In addition, he signed an  executive order refusing Public Service Loan Forgiveness to non-profits  that he does not like.\n\nPresident Trump further is targeting higher education institutions as  if they were the enemy, withholding billions in research…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Reinstated, or FAIR Act, to reinstate the VASP  program and make it clear that VA's job is to help veterans stay in  their homes, not push them into homelessness.\n\nThe VA Home Loan Program has been a pillar of the American middle  class since the original GI Bill. It helped returning World War II  veterans achieve economic security through homeownership.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…doubling. Forty billion dollars would restore food assistance for  families that will be hurt by Donald Trump's cuts. Forty billion  dollars would cancel a chunk of student loan debt for nearly 4 million  borrowers. Forty billion dollars would fund public media.\n\nMs. WARREN. OK. I am almost there.\n\nAm I recognized to do that, Mr. President?\n\nMs. WARREN.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…am proud to co-lead  with my colleague, Congressman Meuser, to bring better oversight and  real accountability to one of the Small Business Administration's most  important loan programs, 7(a).\n\nMr. Speaker, small business owners aren't asking for easy. They are  asking for a fair shake and a real shot. That is what the 7(a) loan  program is supposed…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691853/9999"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…elitist universities accountable by increasing the  endowment tax on large universities.\n\nIt protects hardworking taxpayers by canceling Biden's illegal and  unfair student loan bailouts.\n\nIt ends taxpayer-funded gender transition procedures.\n\nIt is a once-in-a-generation chance to revolutionize our Nation's  defense capabilities and protect the homeland…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Americans, especially the most  vulnerable.\n\nFor example, the Biden-Harris administration attempted to spend as  much as $1 trillion through his illegal and irresponsible student loan  bailouts. Virtually nothing was done to control the cost of Federal  student loan programs, meaning students will be able to take on even  more in student loan debt and drive…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…payment of reasonable compensation to the       corporation's employees for services undertaken on behalf of       the corporation.\n\n``(d) Loans.--The corporation may not make a loan to a       director, officer, member, or employee.\n\n``(e) Immunity From Liability.--Members and private       individuals are not liable for the obligations of the       corporation.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697185/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…struggled under crushing inflation driven by the Biden- Harris administration's outrageous spending. Even worse, the Biden- Harris administration spent billions on reckless student loan repayment  pauses, forcing Americans who never set foot on a college campus to  cover the costs of elite Ivy League degrees.\n\nHouse Republicans have the chance to right those…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693154/one-big-beautiful-bill-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…director of the  Economic Development Corporation of Erie County, where he assisted in  the management of three industrial parks, a new incubator facility, and  a revolving loan fund program.\n\nIn 1990, Stan was named the executive director of the Moshannon  Valley Economic Development Partnership, a role he has held ever since.\n\nFor 35 years, Stan has…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Beautiful Bill Act, 10 commonsense reforms  that too often get overlooked.\n\nOne, the bill modernizes our air traffic control system;\n\nTwo, it reforms student loans to reduce student loan debt and debt  burdens;\n\nThree, it helps farmers by increasing reference prices and  strengthening crop insurance;\n\nFour, it ensures EV drivers pay their fair share for the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692871/ten-commonsense-reforms"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…fleet, modernize our air traffic control system, and  restock the munitions America needs to defend itself.\n\nFinally, this bill is pro-common sense. There are no more student  loan bailouts, no more tax dollars for abortions or transgender  surgeries on minors, and no more benefits for illegal immigrants who  break our laws.\n\nWe are making universities…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…opportunity.\n\nI had a really hard time deciding what to talk about tonight because  there are so many great things about the One Big Beautiful Bill Act.  Should I talk about student loan reform and the impact that is going to  have on driving down the costs of education and minimizing the amount  of loan debt that people have when they graduate from college,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Medicaid in California itself. The cost has ballooned for  this year to $10 billion, over three times what was initially  estimated. The Governor has had to take out an emergency loan and then  separately go to the legislature in the middle of the year for a  bailout.\n\nThe Governor has finally acknowledged this, that the policy should  never have been enacted,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…fraudsters, and  bureaucrats, Republicans are standing up for the American people,  putting more money in their pockets. President Trump promised no tax on  tips, overtime pay, or car loan interest, and tax relief for seniors.  We are delivering on all of those items and more.\n\nFamilies win in the One Big Beautiful Bill Act. Over 40 million  households will benefit…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…there is no way to check the data  that is being filled out because we want to protect their privacy.\n\nSome of that is not privacy. They are asking for a government-insured  loan over here, and we can't check the death file? What idiots allowed  this to happen? Yet, we get protesters in front of our congressional  offices saying: Don't let DOGE and those…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…or are we going to fix that?\n\nAre we going to fix the debacle that is the higher education system?  Are we going to restrain their ability to abuse Federal grants, student  loan subsidies, or are we going to continue to subsidize Harvard, Yale,  Cal Berkeley, the University of Texas at Austin, and the University of  Virginia, both my alma maters? I…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…their  efforts to expand access to affordable housing across our State. By  engaging with local communities, listening to stakeholder feedback, and  leveraging the Federal Home Loan Bank of Topeka's Affordable Housing  Program, FNBO has become a driving force in promoting homeownership  across Nebraska.\n\nTheir dedication was recently recognized when FNBO…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the  data. Why can't they bounce against each other saying, hey, this person  is on the death file. Maybe they are not actually applying for a Small  Business Administration loan.\n\nMr. Speaker, some of our Democrat colleagues remark that, oh, waste  and fraud doesn't really exist except for the billions of dollars we  are identifying.\n\nLet's walk through…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Why should we not tax these big university endowments and these  universities that are engaging in political activism and taking massive  Federal money and Federal student loan support? Why shouldn't we tax  them on it? The Senate reduces our tax on university endowments to  raise revenue by 20 percent.\n\nWhy shouldn't we stop China from getting taxpayer…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}]