[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…their homes, because it was the only way they could access their  homework.\n\nNow, to combat that homework gap, Congress established a fund in 2021  for schools and libraries to loan Wi-Fi hotspots to students and  educators. The program was an enormous success, ensuring nearly 18  million students at over 10,000 schools and libraries could get online.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…climate risk to insurance collapse, to  mortgage market failure, to property value crash transpires, the banks'  balance sheets collapses. Its collateral value is gone. Its loan-to- value ratio makes it insolvent. And now you have a bank crash laid over  the underlying great climate insurance collapse.\n\nThat is not from me. That is not from the League…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…waivers with full knowledge  that they are not actually rules, other Agencies will now be free to  submit any type of action, going back to 1996. Think licenses, permits,  leases, loan agreements, drug approvals. There would be no limit.\n\nNow, we have been safe from this kind of abuse until now because the  Senate has a process in place for the Government…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…moving programs out of the Department of  Education as part of the dismantling of the Department--I could not  resist this example--President Trump proposes to move the student loan  portfolio to the Small Business Administration, which has neither the  capacity nor the expertise needed to handle this massive program. The  SBA is one of the smallest Federal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…electronically.\n\nAbu Dhabi has announced they are investing $2 billion in Trump  stablecoin, $2 billion in Trump's hands where he has to pay nothing,  zero percent, on the loan. He invests the money, makes $2 million a  week, up until Abu Dhabi demands its money back, which they are never  going to do as long as our foreign policy meets the needs of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…the same messages repeated every single day: Small businesses don't  need special treatment. In fact, they are just asking for a fair shot  in this economy.\n\nThe SBA's 504 loan program is designed to provide that fair shot  through basic good policy and affordable, long-term financing. The  financing helps small businesses buy buildings, buy property,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…happen at the snap of a finger.\n\nIt takes large investments and longtime horizons. This bill is a way  to approach filling the gaps in manufacturing financing. It raises the  loan limits for the SBA 7(a) and 504/CDC loan program from $5 million  to $10 million for small manufacturers.\n\nIn fact, helping small firms with the upfront capital investment is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…doubling. Forty billion dollars would restore food assistance for  families that will be hurt by Donald Trump's cuts. Forty billion  dollars would cancel a chunk of student loan debt for nearly 4 million  borrowers. Forty billion dollars would fund public media.\n\nMs. WARREN. OK. I am almost there.\n\nAm I recognized to do that, Mr. President?\n\nMs. WARREN.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and corporate donors.\n\nLet's take a look at some of these broken promises. Donald Trump said  he would put America first. He has not. What he has done is given a $40  billion loan to Argentina. He stabbed American ranchers in the back,  proposing that we import beef from South America. He threw a fancy  party at the White House for a Saudi Prince who…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…potential from these cuts is wrong  for students, the country, and the economy. This bill will slash  billions of dollars in federal funding for higher education, raising  student loan payments for working and middle-class borrowers, and  making it harder for students to access an affordable college  education. The bill eliminates PLUS loans for parents and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…living is just too  high.\n\nI feel it, too, as the daughter of a single mom who made everything  work because of access to affordable childcare, as a millennial with  student loan debt that I am still years away from paying off, and as a  first-time homeowner who finally was able to buy a house in the  district that I represent after renting for over…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…affordability and, once again, places students who are already at a  disadvantage further from the finish line. In addition, he signed an  executive order refusing Public Service Loan Forgiveness to non-profits  that he does not like.\n\nPresident Trump further is targeting higher education institutions as  if they were the enemy, withholding billions in research…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…2024, over 17,000 veterans have been able to  avoid foreclosure and remain in their homes.''\n\nThis represents 0.46 percent of the 3.7 million total loans under the  VA home loan program.\n\n``VASP was established as a last resort option within VA's Home  Retention Waterfall to help veterans impacted by the COVID-19 pandemic.  During this emergency, Congress…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…centers  reduces competition, and it results in Americans paying higher prices  for their banking services. That means higher credit card interest  rates, higher fees, higher auto loan payments, and unaffordable  mortgages. And when these banks become too big to fail, the entire  economy feels the pain when those banks' risk-taking blows up, and  taxpayers…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…am proud to co-lead  with my colleague, Congressman Meuser, to bring better oversight and  real accountability to one of the Small Business Administration's most  important loan programs, 7(a).\n\nMr. Speaker, small business owners aren't asking for easy. They are  asking for a fair shake and a real shot. That is what the 7(a) loan  program is supposed…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691853/9999"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…elitist universities accountable by increasing the  endowment tax on large universities.\n\nIt protects hardworking taxpayers by canceling Biden's illegal and  unfair student loan bailouts.\n\nIt ends taxpayer-funded gender transition procedures.\n\nIt is a once-in-a-generation chance to revolutionize our Nation's  defense capabilities and protect the homeland…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``7(a) Loan Agent Oversight       Act''.       SEC. 2. REPORT ON 7(A) AGENTS.\n\nSection 47 of the Small Business Act (15 U.S.C. 657t) is       amended by adding at the end the following…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…billion just for this year.\n\nBecause of that enormous cost overrun, because of the resulting  shortfall of some $6 billion, Governor Newsom has just taken out an  emergency loan from the general fund in order to cover payments. On top  of that, he has asked the legislature to appropriate even more money,  billions more.\n\nThink about what this means…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Americans, especially the most  vulnerable.\n\nFor example, the Biden-Harris administration attempted to spend as  much as $1 trillion through his illegal and irresponsible student loan  bailouts. Virtually nothing was done to control the cost of Federal  student loan programs, meaning students will be able to take on even  more in student loan debt and drive…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…director of the  Economic Development Corporation of Erie County, where he assisted in  the management of three industrial parks, a new incubator facility, and  a revolving loan fund program.\n\nIn 1990, Stan was named the executive director of the Moshannon  Valley Economic Development Partnership, a role he has held ever since.\n\nFor 35 years, Stan has…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…McCLINTOCK. Mr. Speaker, the Romans had a saying: ``Time is  fleeting, remember death''; ``Tempus fugit, memento mori.'' It reminds  us that life is not a gift. It is just a loan, and when it comes due,  all that matters is what we have given to others.\n\nDoug LaMalfa was the kindest and most sincere person I have  encountered in more than 40 years of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698711/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…fleet, modernize our air traffic control system, and  restock the munitions America needs to defend itself.\n\nFinally, this bill is pro-common sense. There are no more student  loan bailouts, no more tax dollars for abortions or transgender  surgeries on minors, and no more benefits for illegal immigrants who  break our laws.\n\nWe are making universities…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE.  901, a bill to amend the Small Business Act and the  Small Business Investment Act of 1958 to increase the maximum loan  amount for certain loans, and for other purposes, and be referred to  the Committee on Small Business and Entrepreneurship.", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694427/discharge-and-referral-s-901"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…billion. Since  that time, the cost, just for the first year of coverage, has exploded  to $9.5 billion.\n\nAs a result, Governor Newsom, number one, took out a $3.44 billion  loan from the State's general fund. That is the maximum allowed by law.  Of course, that wasn't enough to close the gap, so then, he had to go  and ask for a bailout of the program…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…fraudsters, and  bureaucrats, Republicans are standing up for the American people,  putting more money in their pockets. President Trump promised no tax on  tips, overtime pay, or car loan interest, and tax relief for seniors.  We are delivering on all of those items and more.\n\nFamilies win in the One Big Beautiful Bill Act. Over 40 million  households will benefit…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…databases talk to each other and know this is a  fraudster, this person isn't with us anymore, they have gone on to  their reward, but somehow they are out here asking for an SBA loan, is  that Republican or Democrat? It is just technology. Yet you have  protesters out there saying we can't allow the databases to talk to  each other. Have we lost our minds?…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Why should we not tax these big university endowments and these  universities that are engaging in political activism and taking massive  Federal money and Federal student loan support? Why shouldn't we tax  them on it? The Senate reduces our tax on university endowments to  raise revenue by 20 percent.\n\nWhy shouldn't we stop China from getting taxpayer…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…unqualified  entity. This entity, which was seeking to sell its business when it was  awarded a license, ultimately surrendered its license before it could  even make a 7(a) loan.\n\nThis legislation puts the guardrails back and restores integrity to  the 7(a) program, ensuring taxpayer dollars are safe. I am confident  that the 16 SBLCs can and will be…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…there is no way to check the data  that is being filled out because we want to protect their privacy.\n\nSome of that is not privacy. They are asking for a government-insured  loan over here, and we can't check the death file? What idiots allowed  this to happen? Yet, we get protesters in front of our congressional  offices saying: Don't let DOGE and those…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…or are we going to fix that?\n\nAre we going to fix the debacle that is the higher education system?  Are we going to restrain their ability to abuse Federal grants, student  loan subsidies, or are we going to continue to subsidize Harvard, Yale,  Cal Berkeley, the University of Texas at Austin, and the University of  Virginia, both my alma maters? I…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]