[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…while communities like mine in Arizona face record  heat, drought, and wildfires and continue to deal with the devastating  impact to our water, land, and environment.\n\nThe gun lobby spends millions to stop lifesaving reforms while my  friend Congresswoman Gabby Giffords continues to fight for commonsense  gun laws so that tragedies like that mass shooting…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…when you walk into my office  now, the first thing you see is a person with a gun. When I first got  elected to Congress, we didn't have police officers sitting out in the  lobby. You walk in now and the first thing you see is a person with a  gun. Why? Because of this kind of ignorant behavior on behalf of the  President. By the way, I am being kind…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…House Republicans would be doing something,  anything, anything at all to fight these high prices. Instead, we are  here talking about a bill that requires a Big Oil and Gas lobby group  to put together a report. That is it.\n\nI cannot stress enough that this report is simply not needed,  regardless of who does it. In fact, it is almost an insult,  particularly…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…don't always  have a voice or a platform from which to plead their case. That is why  we are here, for those who may not have a voice, may not have a  platform, may not have a lobby, may not have a group to fight for them.  We are fighting for them every single day regardless of their name,  background, even party because when we are elected to Congress,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…if it becomes law, will constitute one of the greatest       deteriorations of sound securities law ever. The Securities       Industry and Financial Markets Association, the lobby that       represents firms that underwrite and help investors trade       stocks, shares this concern. Recently the association wrote       to the Securities and Exchange…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…tried to overturn our democracy. She ignored repeated lawful  orders from Capitol Police. She pushed to the front of the crowd. She  helped to smash a window into the Speaker's Lobby and attempted to  force her way through a barricaded door while she was armed  with a weapon. She did not die defending her country; she died trying  to tear it down.\n\nMilitary…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…do support, had to put  out their own tweet. They basically said that it doesn't fix the failed  system that produced the accident in January. So the families are  having to lobby.\n\nSo who is not listening? Who is not listening to the ranking members  of committees? Who is not listening to the NTSB? Who is not listening  to the families of the victims?…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and steadfast against the Trump administration's sellout.\n\nYou heard it from Senators Whitehouse and Markey: These rollbacks are  a gift. They are literally a payback to the lobby--the anti-environment  lobby, the fuel and oil and gas lobby--that has so infiltrated and  permeated our government, including, now, the Environmental Protection  Agency.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…legally but who was still detained by ICE.  Dylan did everything right--followed the rules, showed up to his  hearing--and was still arrested by ICE in the middle of a courthouse  lobby, if you can believe that; and Raiza is here tonight, fighting to  bring her child home. It is amazing that Americans have to come and do  this.\n\nThird, we have Gearoid Keogh,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…countries.  House Republicans continue to block all legislation to address this  crisis.\n\nIt is past time that we put the safety of our children before the  profits of the gun lobby and finally pass laws to protect our  communities and young Americans from gun violence particularly in  school.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695281/gun-violence-in-schools"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…It was just that, one step. It was a step that needs  to be followed up with more steps, more action, more help, and more  signals that we are bigger and better than the gun lobby.\n\nSince then, since that one step, mass shootings have surged. Right  now, families are afraid to go to the mall, the movie theater, schools,  grocery stores, concerts, and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Crimes, Movement       for Black Lives, Movement for Freedom.\n\nNational Association of Social Workers, National Education       Association, National Women's Law Center, NETWORK Lobby for       Catholic Social Justice, People For the American Way, People       Power United, Public Citizen, Seed the Vote Action, SEIU,       Stand Up America, The Workers Circle,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…hit the hardest.\n\nThey can't plan for the future. They don't have the luxury of time.  The threat is here right now. They certainly don't have the resources  to personally lobby the President like the massive tech companies who  got exemptions did. President Trump's so-called tariff policy is  literally killing our small businesses.\n\nMr. Speaker, Congress…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…politics. In the 2024 election, crypto emerged as the biggest corporate  spender, accounting for nearly half of all the corporate money spent.  Crypto outspent every other business lobby by tens of millions of  dollars.\n\nWhile the crypto industry's political spending is enormous, what  really sets it apart is the brazenness with which the industry buys  influence…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…over people. That is exactly what they  are doing in this bill.\n\nInstead of focusing on supporting our veterans, they have added one  of the most reckless giveaways to the gun lobby that we have ever seen,  gutting the National Instant Criminal Background Check System, the very  system that keeps guns out of the hands of abusers, felons, and people  who…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692961/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…curb these costly, limiting, and anti-natural  gas standards from the final days of the gasping Biden administration  that were finalized at the behest of his radical climate lobby.\n\nMr. Speaker, the epiphany that those on the other side of the aisle  now have--and they are so concerned about costs and economic concerns-- when they fought us tooth and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…friends in  politics and former bosses like Senator Ted Cruz and Governor Rick  Perry, both of whom are dear friends of mine.\n\nShe led a storied life. She rode her horse into the lobby of The  Mayflower Hotel in Washington, D.C. She acted in Hollywood where she  would go on to meet future President Reagan when she was in Hollywood  in that Golden Age. She…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…still baffled and horrified that, for 4 years, our  government intentionally tried to impose energy poverty on the American  people, all to please the vocal but minority climate lobby.\n\nWhen the Powder River Basin turns off, so does America.\n\nEnergy security is national security. The Biden administration's RMPA  undermines both. By restricting access to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Europe in  2023. Unfortunately, in 2024, the Biden administration took politically  motivated actions to place an indefinite ban on LNG export permits to  appease the climate lobby. This legislation ensures that future  administrations cannot unilaterally prohibit exports of LNG for  political purposes.\n\nNothing in this legislation limits the authority…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…policy. Let's not be fooled by  their rhetoric. The reality is that many on the other side of the aisle  are beholden to a vocal and uncompromising wing of the environmental  lobby, groups that would rather see American workers laid off,  manufacturing plants shut down, and entire communities economically  gutted than support balanced, commonsense regulatory…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that is critical to  the State of Texas and this entire country.\n\nThat is the fact that America, Texas, and Western civilization are  under attack from within. The cheap labor lobby, leftwing NGOs, radical  progressive Democrats, Marxists, globalist organizations, and the  United Nations have mobilized a coordinated effort to subvert our  security and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…they have no understanding of the math, the mechanics, but  somehow there were Medicaid providers in your State that had plenty of  cash lying around to fly people out to come lobby. So we did this, we  pulled open another Wall Street Journal article from a week or two ago  talking about how many people in the Medicaid systems in the United  States are…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…getting off of it.\n\nIs it moral with taking hard-earned money, rare resources--remember,  it is borrowed money now--and say: Go eat crap.\n\nNow the people who sell onion rings come lobby us and come attack us  and say: People should have the choice. They should with their own  money.\n\nThe fact of the matter is, when we looked at some of the data of the  7 million…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to  women. A big study, the biggest study ever done, found that 1 in 10  women experienced serious adverse events.\n\nMr. Speaker, that is not what you hear from the abortion lobby. You  hear about how safe it is. It ain't safe. They suffer things like  sepsis, infection, and hemorrhaging, all within about 45 days.\n\nLet me also say to my colleagues, another…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]