[{"senator": "Nelida Pou", "party": "Democrat", "sentence": "…everywhere. It undermines  the 50 years of vital, clean water progress and weakens the ability of  States like New Jersey to control pollution in its own waters.\n\nSupporting localities in their efforts to provide clean water is one  of my top priorities as a member of the Water Resources and Environment  Subcommittee. I know firsthand the danger of aging…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698035/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…security programs, including by terminating initiatives that monitor  foreign disinformation and cutting the funding of systems that detect,  deter, and alert States and localities about cyber and physical attacks  on election infrastructure.\n\nThis dismantling of CISA is fundamental and deeply alarming, but at  the Department of Justice, things are…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…State legislatures, mayors, cities, and       counties, we are committed to working collaboratively to       strengthen the Medicaid program so that the States and       localities can continue to meet the needs of their residents       effectively. We write to express concern over proposed       changes to Medicaid financing and requirements that could…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…eliminate large portions of this program.\n\nAs we look ahead to an election year, this bill increases funding for  election security grants by $30 million, providing States and  localities with the resources that they need to shore up our election  infrastructure and defend our democracy against any form of  interference that could deny us the most basic right.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…need to be making decisions about restaurants in Charleston, South  Carolina, or bars in El Paso, Texas, or what have you. Why don't we let  the people of the States and the localities make those decisions.\n\nMr. Speaker, I thank my colleague for his excellent presentation of  the bill. I wish it were one that we could be together on, but I think  it just…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…today. What we are voting to do is allow D.C. to make  their own decisions. That is something my Republican colleagues used to  talk a lot about, home rule, the ability for localities and people to  elect their representatives to a body and those representatives to do  something.\n\nIf my friend has a problem with local D.C. laws, then pick up a damn  clipboard,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…domestic failures. Donald  Trump, as I said, campaigned on getting out of foreign entanglements.  But let's just review. He has launched military action in nine  different localities across the world: seven countries, two seas.\n\nWe went back and looked. That is the single greatest number of  countries with military action that any President has taken…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and other attacks on D.C.'s autonomy are       emblematic of larger efforts to allow state and federal       legislatures to exert control and authority over Black       localities and roll back democratically authorized criminal-      legal and police reforms. We call on you to fight this trend       and vote NO on H.R. 5107 and H.R. 5214. If you have…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…there were zero instances of  noncitizens illegally voting over the past 20 years.\n\nLet's be honest, these accusations erode public trust and threaten  our democracy.\n\nSome localities are stepping up to fight those accusations. Two of  those localities in my district are Prince William County and Fairfax  County, which recently won the U.S. Election Assistance…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…need to pursue  a significant public outreach campaign to educate voters about changes  in the law.\n\nBut the SAVE Act provides zero dollars to cover these costs. States  and localities will need to cover this unfunded mandate.\n\nWell, why is the Trump administration imposing these costs and  interfering with Americans' fundamental rights as citizens to vote?…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…military should  pay an energy tax refund to U.S. taxpayers. Think about it.\n\nU.S. energy prices are rising and even doubling across Ohio, our  Buckeye State, and many other localities across our country due to the  rise of data centers. Meanwhile, this administration is cutting off  funds for modern energy systems. Wouldn't such a rebate not only be  sensible…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…categories of immigrant entrepreneurs,       these bills risk driving more individuals into the shadow       economy, undermining transparency and accountability. States       and localities have a strong interest in knowing which       businesses are operating in their communities, including       street vendors and other informal enterprises. Instead of…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…radio stations--are disappearing on a frightening level,  it is important to recognize and salute those organizations that are  continuing to provide information about our localities, the lives and  times of the individuals of our communities.\n\nIn the Bronx--specifically, in Co-op City--we have a public debt of  gratitude that we owe to the Co-op City…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698631/recognizing-co-op-city-times"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…dismantle the  Department of Education will ensure that these gaps remain. The  administration claims that it is just returning control of public  education back to States and localities. States and localities have  always had that control, but they have not always had the will or the  ability to ensure that every child can get a good education.\n\nIn my own…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…for Patients and Communities, otherwise known as the SUPPORT  for Patients and Communities Act, was signed into law.\n\nIn the years since, the bill has provided States and localities with  the tools to combat the opioid crisis.\n\nThe crisis, the scourge of this Nation, as of 2024 has taken the  lives of nearly 80,000 Americans. That is nearly 240 Americans…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691875/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…describing--\n\n(1) the States that have adopted recommendations from the       guidelines and best practices, pursuant to section 4 of this       Act;\n\n(2) a summary of the localities that have adopted       recommendations from the guidelines and best practices,       pursuant to section 4 of this Act;\n\n(3) a list of States that adopted a State zoning…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…dangerous offenders as a condition of pretrial release;  my Keep Violent Criminals Off Our Streets Act, which would ban the  award of certain Federal funds to States and localities across the  country that limit the use of cash bail; my Federal Carjacking  Enforcement Act would empower Federal prosecutors to hold carjackers  accountable; my Restoring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…passing funding bills, it  is an opportunity to bring back Nebraska tax dollars that we send to  Washington every single year. To do this, my team works really closely  with localities back home. We make sure to get their  input on how their Federal tax money is spent.\n\nIn the funding bills that we passed thus far, I am proud to have  secured millions of…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…housing affordability and community development  by providing $3.3 billion for the Community Development Block Grants  and $1.25 billion for the HOME program, giving States and localities  flexible tools to expand affordable housing.\n\nIt also eliminates waste, including $929 million from the failed  California High-Speed Rail project, which has been totally…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…local boundaries, this is  sometimes not the case.\n\nH.R. 3095 creates new ZIP Codes for local communities listed in the  bill and will help address concerns raised by these localities.\n\nMr. Speaker, I thank the bill's sponsor and my colleague on the House  Oversight Committee, the gentlewoman from Colorado (Ms. Boebert), for  leading this legislation.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…approved in Indianapolis, in my district,  new standards for stormwater management. These updates were an aid to  ensure that Hoosiers had access to clean water and that our localities  were able to deliver on this responsibility. In early '24, under the  Biden EPA, this approval was revoked for the infrastructure updates  that were already well underway,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698043/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…There are currently over 41,000 ZIP  Codes in the United States. In some cases, ZIP Codes are misaligned  with local boundaries. H.R. 672 addresses the concerns of various  localities and establishes new ZIP Codes for communities across the  Nation.\n\nMr. Speaker, I thank the gentleman from Florida (Mr. Diaz-Balart),  the bill's sponsor, for putting this…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693860/establishing-new-zip-codes"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…in support of H.R. 4058, the Enhancing  Stakeholder Support and Outreach for Preparedness Grants Act, with the  understanding that FEMA's preparedness grants for States, localities,  urban areas, and Tribal and territorial governments are vital to  strengthening the security of this great Nation.\n\nThis legislation will require FEMA to engage with and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}]