[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Food Bank of Western Massachusetts more important  than ever.\n\nEvery November, an incredible team of antihunger advocates, concerned  neighbors, and Federal, State, and local officials embark on a 43-mile  walk to raise funds for and awareness about the terrible problem of  hunger.\n\nAs always, NEPM's incredible radio host Monte Belmonte led the group,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…opportunities to China.\n\nThis is true in my home State of Rhode Island, where offshore wind  companies worked hand in hand with the local communities, labor  leaders, and local officials to invest in good-paying jobs for Rhode  Island. The President's actions threaten that process.\n\nSo I look forward to voting in favor of this resolution when it comes…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…since the markup, this  administration has recklessly and dangerously deployed the National  Guard to American cities without the request or permission of either  State or local officials.\n\nFor good reason, the Governor of each State makes the decision about  when and where to deploy National Guard, not Presidents who are trying  to score cheap political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…used by Pep  Boys, is opposed by Republicans and Democrats of that area, including  Republican County Executive Steve Neuhaus, a U.S. Naval Reserve  officer, and State and local officials on both sides of the aisle.\n\nThe mission to warehouse large numbers of humans is the exact  opposite of what the President and DHS Secretary  Kristi Noem constantly proclaim:…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…months targeting the vote.  At DHS, a senior Department leader, Heather Honey, an election denier  and conspiracy theorist in her own right, reportedly told State and  local election officials that the administration could declare a  ``national emergency'' based on the claim that the 2020 election was  stolen to obtain ``additional powers that don't exist…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…ensure children without financial means to go college can do so  without incurring more debt than they can ever pay off.\n\nWithout the Department of Education, State and local officials in  Virginia and across the country are worried that they do not have the  funding or the staff to handle the workload, especially in the area of  special education, especially…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the long process of restoring trust. When the immigration agents  fail to follow the code of conduct, the Department of Homeland Security  must coordinate with State and local officials to conduct a fair and  independent investigation.\n\nIn conclusion, as these negotiations continue to play out, I will  continue to do my part to hold the administration…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Threats Act.\n\nMany of us became aware of this issue in the San Joaquin Valley in  2023 when an illegal biolab was discovered operating in my district in  Reedley, California. Local officials uncovered a clandestine operation  storing biological materials, laboratory equipment, medical waste, and  dangerous, dangerous pathogens like malaria, like COVID, like…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…necessary to keep ``very       bad officers'' off the force (see page 173 of the Report by       the Police Reform Commission). And it would override the       decisions of local officials who are accountable to the       people who live in the District.\n\nCongress should respect the District's authority to govern       itself, especially on matters of public…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…than 700,000 residents who call the       District home know and care deeply about the local issues       that uniquely impact our lives. Our democratically elected       local officials work closely with policy experts, local law       enforcement, and other community stakeholders to pass laws       that are in the best interests of all Washingtonians.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…always had that control, but they have not always had the will or the  ability to ensure that every child can get a good education.\n\nIn my own State of Virginia, State and local officials and educators  right now fear that local agencies and the Virginia Department of  Education will not have the funding or the staff to handle the  workload, especially…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…For months, Trump has fabricated claims of chaos and crime on  American streets to justify false claims that  there is a need to deploy troops into our cities against local  officials' wishes--first to L.A., then DC. And he isn't stopping there.  He is also attempting to deploy troops to Portland, though a Federal  judge he appointed blocked his efforts…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…than 700,000 residents who call the       District home know and care deeply about the local issues       that uniquely impact our lives. Our democratically elected       local officials work closely with policy experts, local law       enforcement, and other community stakeholders to pass laws       that are in the best interests of all Washingtonians.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…While the sample size is small, these sustained       terminations are unquestionably the right outcomes for MPD,       our residents and visitors, and the local and national       elected officials that MPD serves.\n\nThe law enforcement disciplinary reforms implemented by the       District were long overdue. They transformed a process where       the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…this bill. As a reminder, it would eliminate  commonsense criminal justice reforms that have been widely implemented  by State and local governments across the country.\n\nLocal officials here in D.C. passed these laws. The voters made these  decisions, and D.C. should have a right to govern itself.\n\nThis bill undermines trust between police and the community…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…detail, and tireless work ethic have not only  ensured the responsible management of county finances but have also  earned her the respect and admiration of colleagues, local officials,  and community members alike.\n\nMs. Krzysiak's career reflects a deep sense of duty and pride in her  work. Her efforts have directly contributed to the effective operation…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…which we addressed appropriately, although  they announced the closures after they actually did it.\n\nThanks to the efforts of myself, Congressman Clyde, and our amazing  local officials, State legislators, and county commissioners, we were  able to reverse most of these closures and keep almost all of our parks  open under the control of our local governments.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Rives in Obion County basically underwater.\n\nAfter the initial flooding, I visited Rives with our Governor of  Tennessee, Bill Lee, to survey the damage and to meet with local  officials and residents. For the Rives community, recovering and  rebuilding is not going to be easy and is not going to happen  overnight.\n\nI am sure that my colleagues who have…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…even the notoriously liberal Ninth Circuit Court ruled that the  President has the clear authority to federalize the National Guard to  restore order whenever State or local officials are derelict in their  duty to protect the public and enforce the law.\n\nRemember how all this started: ICE agents attempted to execute court- ordered warrants on criminal…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…yet another illegal,  dangerous biolab run by Chinese nationals.\n\nIn 2023, when the secret lab in Reedley, California, came to light,  thanks to the tremendous efforts of local officials there, I gave  several speeches on this floor calling attention to the danger that  this posed to all Americans. I noted that we don't know how many  similar such labs…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…show up to do the work. They know senior citizens  who are being defrauded out of life savings. They have seen kickback  schemes in their local counties and cities, where local officials go  hire a friend and make a contract there at these enormous rates.\n\nI do think that what has happened in Minnesota has caused the  American people to look more closely…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Westerman noted, this is not creating a new  wilderness area but simply designating additional land. It has wide  support, as noted by my friend, including our local county and city  officials in the county where it is located: Governor Sarah Sanders,  Arkansas Parks & Tourism, the leadership of our Game and Fish  Commission, and many other local  leaders…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…have worked diligently to resolve the Akwesasne  land claim in northern New York in my district. The last decade has  seen very focused efforts between the Tribe, local, and county  officials, and our congressional office to realize this long-sought  agreement dating back to the 1796 Treaty with the Seven Nations of  Canada.\n\nThis historic settlement…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…to, Wichita, Kansas, colloquially known as the       ``Air Capital of the World'' for the city's historic role in       aviation; and\n\nWhereas many Federal, State, and local officials have       cooperated to respond to the emergency, investigate the       accident, and provide assistance to families devastated by       the loss of loved ones: Now,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…January that he was  open to working with the Trump administration, he instead signed new  legislation in May that expands protections for illegal immigrants,  even after local officials raised serious concerns.\n\nMy community, meanwhile, is doing the work. El Paso County and the  Colorado Springs Police Department are partnering with ICE and the DEA.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…people to obey the  law in this country: Do away with sanctuary cities.\n\nSenator Murphy is from Connecticut. It is 1 of 12 sanctuary States.  What does that mean? Local officials, State officials, refuse to work  with the Federal Government to turn people over to the Federal  Government as required by Federal law. So you want to obey the law in  Connecticut?…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Medal, and numerous other decorations. Later in his Air Force career,  he cross-trained in journalism, working in public relations and  advertising and coordinating with local officials for USAF Thunderbirds  aerial demonstration performances.\n\nTom's commitment to community extends beyond elected office. He is a  former member of the Rockwall County Appraisal…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…around the  country, in essence saying: We are going to stand in the way of  enforcing our immigration laws.\n\nIt is time for the American people to stand up and tell their local  officials that we want our immigration laws enforced. It is very  difficult to enforce them if local law enforcement or social services  are not on board.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688662/highlight-of-trump-administration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…while others were labeled in a code that was never deciphered.\n\nAt first the CDC--this was during the Biden administration--refused  to investigate and even hung up on local officials who asked for help.  After Representative Costa got involved, the CDC did an inspection and  found at least 20 potentially infectious agents, including HIV,  tuberculosis,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}]