[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "It will even mean more good paying jobs--J-O-B-S--at Albany NanoTech  and the local economy.", "title": "National Semiconductor Technology Center", "date": "2025-07-14"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "By  incentivizing companies to capture lost revenue, the Methane Emissions  Reduction Program and the methane polluter fee spur American  innovation, strengthen businesses, and boost local economies.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Through partnerships with local organizations and tireless  service for the Hampton community during the COVID-19 pandemic, they  have strengthened the church's legacy of compassion and service.", "title": "Recognizing the 70th Anniversary of Bethel Temple Church in Hampton, Virginia", "date": "2025-10-24"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "This bill reflects how modern public-private partnerships should  work, by empowering local governments and stakeholders to align Federal  resources with local needs.", "title": "Apex Area Technical Corrections Act", "date": "2025-05-13"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "It was big talk about standing up to protect  the State and local tax deduction.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Had it not been for that footage, which was recorded  and released by that local police department, the public would not have  had access to the circumstances surrounding Mr.", "title": "Introduction of the Federal Police Camera and Accountability Act of 2025", "date": "2025-08-29"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Well, Mekhiya already works at a job, in fact two jobs; one for  her local school district and one as a manager at McDonald's.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "With over 60 percent of K-12 educators in the United States teaching  within 20 miles of the high school they attended, creating pathways for  local talent to enter the teaching profession plays a critical role in  addressing our nation's shortage of teachers.", "title": "Recognizing the 10th Anniversary of Educators Rising", "date": "2025-03-04"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Instead of listening to us, the people from L.A., the President  escalated this drama, deploying the National Guard and the Marines to  Los Angeles without a request from local law enforcement, the Governor,  or the mayor.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Speaker, I rise to strongly support this resolution because we  strongly support our local law enforcement officers.", "title": "Expressing Support for Local Law Enforcement Officers", "date": "2025-05-13"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Speaker, 100 days: exonerated violent criminal behavior from the  January 6 insurrection; unethical efforts to end investigations on  allies and donors; firing talented, career-committed professionals and  replacing them with blind loyalists; insulting Canada, Mexico, Denmark,  and the European Union; disruption of programs; threats to  universities, law firms, State and local governments, the Federal  workforce, and the media; and threats to elected officials.", "title": "Trump's 100 Days", "date": "2025-04-30"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Tuckahoe local government has all of the responsibilities of any  municipal entity: police protection, sanitation, parks and recreation,  planning and land use functions, and more.", "title": "Recognizing Omayra Andino", "date": "2025-12-03"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Sheriff Anderson was an active member of many local organizations, as  my colleague shared, serving as a board member of the Make-A-Wish  Foundation of the Hudson Valley and chairman of the March of Dimes.", "title": "Sheriff Adrian ``butch'' Anderson Post Office Building", "date": "2025-12-09"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Speaker, today, I rise to address the unfair double  taxation that my constituents are facing due to the State and local tax  deduction cap.", "title": "Eliminate the Salt Cap", "date": "2025-05-06"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Unfortunately,  we have not had from the majority a single bill that  they are willing to bring to the floor to increase any funding for  local law enforcement.", "title": "Leosa Reform Act", "date": "2025-05-14"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Our North Slope       residents are keenly aware that advances in our communities--      running water, local schools, health care, public safety,       electricity, and more--have come because of the coordination       and cooperation of Alaska Native leaders and entities across       the region.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Speaker, I rise today to acknowledge and thank John  McIntyre (Mac) Tolar for dedicating over three decades of service to  our Nation's military, state, local, and federal governments, including  the past thirteen years as an employee within the United States House  of Representatives.", "title": "Thanking John McIntyre (Mac) Tolar for His Dedicated Service to Our Nation", "date": null}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Richard helped run the Toys  for Tots program in Illinois and served as an ombudsman for local  nursing homes.", "title": "Recognizing United States Marine Sgt Richard Loughran As July 2025 Veteran of the Month", "date": "2025-07-10"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "In the early morning of July 4, Scott, along with other local and  Federal first responders, was dispatched to aid in rescue efforts at  Camp Mystic in Kerr County as flooding from the nearby Guadalupe River  hit the camp.", "title": "Recognizing Uscg Petty Officer Scott Ruskan", "date": "2025-07-23"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "I commend the entire  team for their efforts on this worthwhile endeavor and for their  ongoing service to our local community.", "title": "Recognizing Alan Sowerby", "date": "2025-06-12"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "New York City has  allowed noncitizens to vote in local elections.", "title": "Veterans Accessibility Advisory Committee Act of 2025", "date": "2026-02-11"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "It is time for the American people to stand up and tell their local  officials that we want our immigration laws enforced.", "title": "Highlight of Trump Administration", "date": "2025-03-06"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Richard Parker Memorial Wing, pays tribute to a local hero who made the  ultimate sacrifice in Operation Iraqi Freedom in 2007.", "title": "225th Anniversary of the Town of Strong", "date": "2026-01-28"}, {"senator": "Young Kim", "party": "Republican", "sentence": "It recognizes a right to assemble and  protest peacefully, and it condemns unequivocally the violence  perpetrated against Federal, State, and local law enforcement.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "The company's concrete  has been used to build homes, fire and rescue buildings, shops,  offices, and even barns for local farmers.", "title": "Wabeno Economic Development Act", "date": "2025-07-22"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "As the only intelligence agency with a duty to share information with  State and local law enforcement, it is imperative the Office of  Intelligence and Analysis analysts have effective partnerships within  the intelligence community.", "title": "Dhs Intelligence Rotational Assignment Program and Law Enforcement Support Act", "date": "2025-11-17"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "title": "Recognizing Gary Steele", "date": "2025-06-17"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "They care  what happens in their family and their local communities.", "title": "Elections Matter", "date": "2025-06-24"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "WTOC-TV represents the very best in local journalism, combining  heart, hustle, and hometown pride.", "title": "Recognizing Wtoc-Tv in Savannah, Georgia", "date": "2025-06-26"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Traditionally, that means an injured party seeks redress  through his local district court.", "title": "No Rogue Rulings Act of 2025", "date": "2025-04-08"}]