[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…individuals to grow their digital collection, for nearly three decades,  the Internet Archive has worked to preserve everything from academic  research to personal blogs, local news stories to international  breaking news, and troves of official government records--including the  archival of websites from every Presidential administration since 2008.…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696412/recognizing-the-internet-archives-one-trillionth-web-page"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…BOYLE of Pennsylvania. Mr. Speaker, I rise today to congratulate  Bernie Prazenica on his retirement as President and General Manager of  WPVI-TV, Philadelphia's most-watched local news and entertainment  television station.\n\nA graduate of Temple University, Prazenica's illustrious 43-year  career in television saw stops in Pittsburgh, Richmond, and Raleigh…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…LATIMER. Mr. Speaker, in the ever-changing landscape of community  media, I am pleased to salute the 17th anniversary of the launch of  Scarsdale10583, the online source for local news and information in the  village of Scarsdale and in the neighborhoods of Hartsdale and Edgemont  in the town of Greenburgh.\n\nJoanne Wallenstein, an advertising and marketing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…vulnerable people; and to ensure the American people have no faith in  their government.\n\nThis bill will shut down rural television and radio stations, cutting  off coverage of local news, eliminating emergency information like  severe weather alerts, jeopardizing access to PBS KIDS, children's  programs like Sesame Street--yes, Sesame Street.\n\nThis bill rips…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Members considering voting for this own the reckless cuts done by  Elon Musk.\n\nThis is a bill to shut down rural television and radio stations,  cutting off coverage of local news, eliminating emergency information  like severe weather alerts, and jeopardizing access to PBS KIDS  children's programs like ``Sesame Street.''\n\nThis is a bill to rip lifesaving…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and educational  programming for millions of households across America and are  particularly important in rural areas, where public stations are often  the only source of local news.\n\nThis is a $1.1 billion cut, Mr. Speaker. Let's compare that to the  big, ugly Republican reconciliation bill, which adds $3 trillion to the  deficit and--get this--includes…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…everyday Americans to this  authoritarianism give me heart.\n\nA couple of weeks ago, after an ICE raid at a pizzeria in Honesdale,  Pennsylvania, two people gave quotes to local news that have been  making the rounds. One of them said: ``It is just made to instill fear,  and I am not sure why we need fear in our communities instead of love  and caring…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…one-tenth of 1 percent of the  Federal budget. Yet it is delivering information and research that are  absolutely vital to our economic prosperity.\n\nThe reports we see on the local news, on the Weather Channel, and all  our smart phones are built on forecasts and information generated by  the National Weather Service and its array of scientists, satellites,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…when they said they wanted to cut it--you know, Donald Trump  doesn't seem to like it--how much it helps our rural communities? It is  the only place they can rely on for local news, for weather reports.  And farmers across rural America depend on public broadcast to get  weather reports because there is no other way. Did they know that it  guts international…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…including the disproportionate impact it will  have on rural communities.\n\nOne in four Wisconsinites lives in a rural community, and many rely  on public broadcasting for local news, emergency alerts, and free  educational programming, especially for children. Wisconsin Public  Radio is the primary broadcast relay for Wisconsin's Emergency Alert  System,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…response helped the runner regain a pulse, ultimately saving his  life.\n\nDuring the emotional ordeal, Dan missed seeing his fiancee cross the  finish line, but he told a local news outlet that if he had to do it  all over again, he would still jump in to help.\n\nFor his heroic actions, I want to extend my sincere gratitude to Dan  and members of the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696700/recognizing-dan-molnar-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Harrison Herald, the  Larchmont Ledger--as you can see, alliteration still has its appeal-- and the New Rochelle Review.\n\nEditors Cynthia Pena and Joyce Farrell ensure timely local news  reaches the readers in each community, as well as the readers of  Westchester Jewish Life, which is always available in the local  synagogues and temples. Other key Shoreline…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the Record two articles on New Gold:\n\nhttps://www.northernontariobusiness.com/ industry-news/mining/new-gold-fined- for-2016-discharge-772366\n\nhttps://www.tbnewswatch.com/local-news/new-gold-inc-fined-100000- after-sediment-spill-from-dam-988742\n\nMr. Speaker, the mine was fined nearly $200,000 for discharging 19  million liters of pollution into the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…ensure       that no rescission of funding for the Corporation for Public       Broadcasting impedes or stops public television stations from       producing or broadcasting local news and homegrown content to       rural, remote, and underserved communities.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693628/hr-4"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…recordings. There is no live person at those radio stations--just  equipment. So they are playing their music and whatever programs they  wish, but they couldn't send out local news because there was no one  there to send it. It was the public broadcasting station--the public  radio station--that kept the people of Macomb and McDonough County  safe.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…the D.C. courts and their refusal to hold criminals  accountable. We need to start with recognizing that 19- to 24-year-olds  shouldn't be treated as youthful offenders.\n\nLocal news has recently reported that the number of juveniles  arrested in Washington, D.C., has increased every year since 2020 and  that 60 percent of carjackings in the District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Union-Bulletin for covering this story. It is a reminder that while we  can sometimes be frustrated with the way media covers things  politically, we always appreciate a local news source for these types  of stories.        Recognizing Driver and Lindsey Families of Pend Oreille County\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to recognize the Driver…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…CEO of Fuller Broadcasting Company, Inc. from 1985 until  1998. His six stations (WKKR, WMXA, WZMG, WTLM, WCJM and WPLV) received  numerous awards for community service and local news coverage. In 1988,  WZMG and WKKR became the first stations in Alabama to earn the National  Association of Broadcasters Crystal Award for community service. He was  also…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}]