[{"senator": "George Latimer", "party": "Democrat", "sentence": "…pursue a career as an educator. Over the years, she was an elementary  school teacher, a reading teacher, an assistant principal, and retired  as the principal of P.S. 112, located in the Edenwald neighborhood of  the Bronx.\n\nLynne spent her entire career in public education and felt it was her  responsibility not only to educate but to provide care…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…oceans.\n\nMany of these harmful collection practices occur in international  waters, particularly in regions such as Southeast Asia, where most of  the world's coral reefs are located. In many of these countries, there  are weak or insufficient regulations to prevent destructive collection  methods. As the largest importer of ornamental reef fish and corals,…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…not going to be good for hospital       providers and health care in general,'' Vincent Capece,       president and CEO of Middlesex Hospital, an independent       hospital located in Middletown, CT. ``There's going to be       less money available, but exactly how much and how that all       works out when the dust settles is really hard to       calculate.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…support of H.R. 1729, the Bolts Ditch Act,  introduced by my colleague and good friend from Colorado (Mr. Neguse).\n\nMr. Speaker, the Bolts Ditch Headgate and ditch segment are located  within the Holy Cross Wilderness in Colorado's White River National  Forest. This infrastructure is essential for delivering water to the  Bolts Lake Reservoir, supporting…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…adjacent to the Ninth  Congressional District. We will call it, for our purposes today, the  old 18th Congressional District, and you will understand better why in  just a moment, located adjacent to the Ninth Congressional District. In  fact, if you look north and south, the 18th was at the top, and the  Ninth was under the 18th. The Ninth Congressional District…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…things) the White House, the       Capitol Building, the United States Supreme Court Building,       and the Federal executive, legislative, and judicial office       buildings located adjacent to the Mall--will not become part       of the new State and will remain under the sovereignty of the       federal government.\n\nSome critics have argued that the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…prices of power and electricity that continues  to go up.\n\nMr. Speaker, I include in the Record a document from the Joint  Economic Committee, as well as a link to the document located at:  https://www.jec.senate.gov/public/_cache/files/22e24fd6-4db7-44c6-93a9- 9710c6f48b85/electricity-bills-report.pdf          [From the Joint Economic Committee Minority,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…charter of the National Woman's Relief Corps to formally change its  principal office from Springfield, Illinois, to Murphysboro, Illinois,  where I understand it is already located. It also moves its place of  incorporation from Washington, D.C., to Illinois.\n\nThe Woman's Relief Corps was formally organized in 1883 to preserve  the memory of those who…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…colleagues  just heard described, the highly invasive sea lamprey, one of the most  disgusting things I have ever witnessed in my life.\n\nThe USGS Great Lakes Science Center is located in my district. It  meets the Nation's need for scientific information used to restore,  enhance, manage, and protect the freshwater fisheries and habitats of  the Great Lakes.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698194/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…an extensive history of joint activities, such as support for the  development of the Vera C. Rubin Observatory, a world-class tool for  scientific discovery and astronomy located in Chile. We are proud of  that partnership.\n\nA testament to the power of these collaborations, this observatory  just reached a major milestone with the installation of the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to humbly honor  and celebrate the heroic accomplishment of the Saint Augustine High  School 1975 Football Team, proudly located in Louisiana's 2nd  Congressional District, of which I represent in Louisiana.\n\nFrom 1951, its first year as a Catholic high school in New Orleans,  through the mid-1960s,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…founding and development of  our country are countless.\n\nFinally, because John Adams was the first to live in the White House,  it is only fitting that this memorial will be located nearby. We can  only hope that the hard work, wisdom, and dedication of these American  heroes rub off on the current and future residents of the White House.\n\nI thank Representative…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…(SBA) to relocate any       regional, district or local SBA office housed in a `sanctuary       jurisdiction', ignores the fact that millions of small       businesses are located in or near cities that could be       designated as a `sanctuary jurisdiction.' Moving offices       farther away from the small businesses they were intended to       support…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…space, and no real home, but now these treasures are coming to  northwest Ohio to the world-class Toledo Museum of Art.\n\nThe American Numismatic Society has chosen Toledo, located on  beautiful Lake Erie, as the place where its future can flourish. We are  so grateful that the society saw what we know so well: a community that  opens its doors wide…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Office grew, there was one glaring gap in its  services. People living in rural areas would need to venture to the  nearest Post Office to access their mail, which could be located miles  away. While Americans living in more populous locations had access to  free home delivery for decades, rural Americans were still walking for  miles to retrieve their…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…U.S.C. 1615(b)), Cape       Fox shall not be required to select or receive conveyance of       the approximately 185 acres of unconveyed land described in       subsection (b) located within the township in which the       Native Village of Saxman, Alaska, is located.\n\n(b) Land Described.--The land referred to in subsection (a)       is as follows:\n\n(1)…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Surveillance, and       Reconnaissance,'' the statement adds.\n\nMoreover, the State Department noted that the ``principal       contractor will be Sierra Nevada Corporation [SNC], located       in Sparks, NV'', adding that at this time, the ``U.S.       Government is not aware of any offset agreement proposed in       connection with this potential sale.''…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…lengthy permitting timelines for mitigation banks  are making it more challenging to bring new credits to the market.  Moreover, the requirement to purchase mitigation credits located within  the same hydraulic unit code--geographic area determined by surface  hydraulic features--can mean that credits available at a nearby wetland  bank cannot be used if…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…of which is classified in sector       31, 32, or 33 of the North American Industrial Classification       System; and\n\n``(2) all of the production facilities of which are located       in the United States.''.       SEC. 3. SMALL BUSINESS ACT LOAN LIMITS FOR SMALL                     MANUFACTURERS.\n\nSection 7(a) of the Small Business Act (15 U.S.C.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…4,200  arrests, including hundreds of warrant arrests for domestic violence,  aggravated assault; and dozens more for narcotics, sexual assault, and  homicide. They also have located more than 120 missing children and  have recovered 970 illegal firearms and 560 stolen vehicles.\n\nWith President Trump and AG Bondi and Kash Patel, and the commitment  that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…CARTER of Georgia. Mr. Speaker, I rise today to recognize one of  our Nation's greatest World War II museums, the National Museum of the  Mighty Eighth Air Force.\n\nThe museum, located just outside of Savannah in Pooler, Georgia,  received a preserved B-24 Liberator from the National Museum of the  U.S. Air Force at Barksdale Air Force Base.\n\nThe aircraft…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693104/recognizing-the-national-museum-of-the-mighty-eighth-air-force"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…The Farm Family of the Year is awarded by the Cambria County Farm  Bureau to a multigenerational family farm that has been active and well  respected in the farm bureau.\n\nLocated in Nicktown, Pennsylvania, Barr Ridge Farms produces  approximately 1,200 gallons of milk every day.  The Lieb family also grows corn, soybeans, and a variety of grass to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and love.\n\nMy home State of Pennsylvania produces 9.8 billion pounds of milk  annually from the nearly 465,000 dairy cows that reside in  Pennsylvania. The 4,850 dairy farms located throughout Pennsylvania  represent nearly 20 percent of our Nation's dairy farms. These farms  provide 52,000 jobs across the Commonwealth and bring in more than $10  billion…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in North Texas. Alliance is home to a number of important  businesses, residential neighborhoods, and a thriving island inland  port that boosts our country's supply chains. Located along an  interstate with rail and air access, at 27,000 acres, Alliance is  nearly double the size of Manhattan. From its inception in 1990 until  today, Alliance has had…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…suspend the rules and  pass the bill (H.R. 804) to require the Administrator of the Small  Business Administration to improve access to disaster assistance for  individuals located in rural areas, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 804\n\nBe it enacted…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…shareholder, the Navajo       Nation. NTEC owns and operates three surface coal mines       within the Powder River Basin, including one mine--the Spring       Creek Mine--located in Montana and within the U.S. Bureau of       Land Management's Miles City Office's Resource Management       Planning Area.\n\nAs NTEC's Chief Executive Officer, I've seen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…subsidies, and the       infringement of intellectual property rights, have on the       advanced technology economy of the United States and the       ability for United States located firms to develop innovative       technologies.\n\n(13) Other barriers to the ability of the United States to       compete globally in an increasingly connected and digital…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize and celebrate  the 100th anniversary of Solebury School, located in beautiful New  Hope, Pennsylvania. Solebury School has been a cornerstone of  independent education in Bucks County, known for its close-knit  community, academic excellence,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696356/recognizing-the-100th-anniversary-of-solebury-school"}, {"senator": "James Risch", "party": "Republican", "sentence": "…The proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractors will be The Boeing Company,       located in Arlington, VA; and RTX Corporation, located in       Arlington, VA. At this time, the U.S. Government is not aware       of any offset agreement proposed in connection…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…legislation  that fully delivers on the promises the President and House Republicans  have made the American people.\n\nMr. Speaker, if we look in this beautiful Chamber, I have only  located one quote from our past that is displayed here, and it is up  above you up close to the ceiling. We are getting close to celebrating  the 200-year anniversary of those words…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]