[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…big and small  came together to make sure our neighbors who had just lost everything  had a warm meal, a roof over their heads, and a shoulder to cry on.\n\nFederal, State, and local governments mobilized to get families the  help they needed, help that has made a tremendous impact on our road to  recovery and rebuilding. Emergency operation hubs were propped…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…social service providers that work in strong immigrant communities.  Immigrants that, by the way, pay into Medicaid that they never get.\n\nWhat they are doing is undermining local governments and local  agencies who know best what their communities need. You see, community  health centers exist to serve an entire community, regardless of their  income,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Conservation and Recovery Act proposes a competitive grant program to  support the conservation and recovery of these species. This grant  program will provide vital funding to local organizations, government  entities and academic institutions to develop and implement science- based, coordinated conservation strategies that protect Hawaii's native  species.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…have given all in the  line of duty. They will not be forgotten.\n\nAs we look ahead to the next 100 years of the NCPD, I will continue  to work with Commissioner Ryder and our local partners to ensure that  officers have the resources they need and the training they need to  keep Long Islanders safe.\n\nI am proud to stand alongside Nassau County Police…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690168/congratulating-nassau-county-police-departments-100-year-anniversary"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…binational tri-state community has the knowledge,  resources, and support needed to lead healthy and productive lives.\n\nFor three decades, the foundation has partnered with countless local  and national organizations to address some of the most critical  challenges in the borderland--from chronic disease prevention,  expanding mental health support, and helping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695206/recognizing-the-30th-anniversary-of-the-paso-del-norte-health-foundation"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and federal       partners to sustain momentum on reducing crime and improving       quality of life for every resident.\n\nWe have worked collaboratively with this Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Pretti.\n\nThese are just a few of the examples of commonsense practices that  strengthen accountability and help ensure the safety of both law  enforcement and our communities. Our local law enforcement personnel  already follow them, and we shouldn't expect anything less from our  Federal law enforcement.\n\nThere is no question that immigration enforcement…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…would raise penalties for safety violations and  address the exact equipment failures that caused the East Palestine  derailment.\n\nThe RAIL Act is supported by rail workers, local governments, and a  bipartisan group of lawmakers, Democrats and Republicans in and out of  Ohio. Yet, for two consecutive Congresses, House Republican leadership  has refused…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…are already facing negative       health impacts from oil and gas development on their lands       and are struggling to provide for their families due to       impacts on the local fish and wildlife populations.\n\nMr. Speaker, these words remind us that the climate crisis is here,  it is real, and it is exacerbated by this administration's relentless…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…its population has nearly tripled. It is  the home of more than 1,200 businesses and is the fastest growing city  in Summit County.\n\nCommunity members, elected leaders, and local businesses have all  expressed their overwhelming support for a single ZIP Code reflecting  the city's name.\n\nThe current multitude of ZIP Codes creates obstacles for these…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…who cofounded GrassRoots in 1975, poured more than  half of her life into the store. GrassRoots wasn't just a business. It  was part of the rhythm of Newark, a reminder that local businesses  create connections and build community.\n\nAs GrassRoots closes this chapter and Marilyn begins a well-earned  retirement, Delaware wishes her all the best and thanks…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…this program is that it doesn't come in and dictate how  communities reach their clean energy goals. It is a partnership program  that values and appreciates the perspective of local and Tribal  communities, actively listening and incorporating community feedback.\n\nIn Hawaii, the Energy Transitions Initiative has provided technical  assistance to the City…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…actions  have unnecessarily harmed America's disaster response ecosystem.\n\nLast week, I demanded an investigation into what role, if any, the  administration's staff cuts to local and National Weather Service  stations played in this tragedy. It is now clear that the  administration fired key FEMA personnel during and, sadly, after the  tragedy. So,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Congress and on the ground in our communities.\n\nFor decades, SRS has been more than an abstract Federal program. It  has been a promise, a promise that when Federal lands limit local tax  revenue, Congress will stand with rural communities and school  districts so that they continue to provide the basic essential services  that every American family deserves.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…these awards  are not restored in the next 45 days, they will be forced to lay off 50  percent of their workforce. These are people's lives we are talking  about.\n\nAnd their local partners and collaborators who were anticipating  growth opportunities because of the investment are being left in the  cold. In Socorro, NM, one technical university lost…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…low-income and high-income backgrounds. We see it  happen to ordinary Americans, people who never imagined that they would  become victims themselves.\n\nEfforts by Federal, State, and local law enforcement and advocates to  eliminate trafficking and to support victims have increased awareness,  reporting, and prosecution of sex traffickers across the country.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Mr. Speaker, I rise today to acknowledge and thank John  McIntyre (Mac) Tolar for dedicating over three decades of service to  our Nation's military, state, local, and federal governments, including  the past thirteen years as an employee within the United States House  of Representatives.\n\nAfter graduating from the University of South…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…our sincerest appreciation to Scott Gatto  for his outstanding military service and for his excellent acts of  leadership that have protected our country and also helped his local  community. His story is a testament to the American spirit of service,  sacrifice, and leadership, and it is an honor to recognize him as our  Veteran of the Month.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Coast Guard, Scott participated in and  completed rescue swimmer training and was stationed in Corpus Christi,  Texas.\n\nIn the early morning of July 4, Scott, along with other local and  Federal first responders, was dispatched to aid in rescue efforts at  Camp Mystic in Kerr County as flooding from the nearby Guadalupe River  hit the camp.\n\nScott, while…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694141/recognizing-uscg-petty-officer-scott-ruskan"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…to close. In doing so, the mine  would have to lay off hundreds of workers and devastate the surrounding  communities that depend on the coal mining industry to drive their  local economies.\n\nWith tears in his eyes, this electrician asked me to save his job and  save his livelihood so he could continue to provide for his family and  energy for America.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…matters.  Sovereignty matters. Americans alone must decide America's future.\n\nYet radical Democrats have abandoned the standard. New York City has  allowed noncitizens to vote in local elections. Washington, D.C., has  done the same, granting political power to foreign nationals in the  Capital of our Nation.\n\nGeorgia's own Senator John Ossoff, who once said…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Americans watched with their own  eyes as marauding mobs under foreign flags set cars on fire, threw  concrete blocks at police, terrorized motorists, and vandalized and  looted local shops.\n\nThe Democratic vice mayor of Cudahy has called on criminal street  gangs to attack Federal law enforcement.\n\nThe Democratic mayor of Los Angeles said that for the riots…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Costa, Dusty Johnson, and\n\nJimmy Panetta, I will continue to fight to remove unfair trade  barriers, open new markets for Iowa products, and promote policies that  keep our local family farms strong and competitive.\n\nYesterday, when Secretary Rollins was in our State of Iowa, she  remarked upon our productive farmers and ranchers and added she will…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…by several States.  Congress does have the constitutional authority to regulate activities  within the Federal District. When it is said that somehow Congress is  now eroding local control, that is simply not true.\n\nAny local powers by the D.C. Council have been granted to the D.C.  Council by Congress, and Congress is the seat of authority when it  comes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…reminds us  that service to our neighbors does not start in Washington, D.C. It  starts in the heart and in the home, and it extends to every corner of  this Earth.\n\nOrganized by local citizen leaders, churches, nonprofits, and  volunteers of all ages, Love Thy City is a day of service to others,  rooted in the great command to love our neighbors. That is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Office of Intelligence and Analysis collaboration with the wider  intelligence community.\n\nAs the only intelligence agency with a duty to share information with  State and local law enforcement, it is imperative the Office of  Intelligence and Analysis analysts have effective partnerships within  the intelligence community.\n\nIn addition, I also want…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…founded by C. W. Taubert, an immigrant from Germany who grew  enamored with the cowboy spirit and the allure of the West.\n\nFrom its beginnings as a hardware store catering to the local  agricultural community, Lou Taubert has grown to be a cornerstone of  the Casper community. Now, over 100 years later, it does not matter  whether you are a rancher, a cowboy,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699737/recognizing-lou-taubert-ranch-outfitters"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…the mission of this event is simple but  powerful: to create a welcoming place where families can celebrate  Christmas, give back, and support one another.\n\nMore than sixty local businesses and organizations have stepped up  with donations of toys, food, gift certificates, equipment, and  financial support. The Extravaganza will also feature musicians…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…recognizing their exceptional coverage of  Savannah's 200th Saint Patrick's Day celebration, a signature event in  the city's history and culture.\n\nWTOC-TV represents the very best in local journalism, combining  heart, hustle, and hometown pride. Covering Savannah's Saint Patrick's  Day is no small task. It is an all-hands-on-deck event that calls for  early…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693027/recognizing-wtoc-tv-in-savannah-georgia"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…there are many examples of  the District's poor governance that warrant scrutiny, the issue before  us today is whether the D.C. Council should be permitted to decouple  its local tax code from the historic tax relief enacted through the  Working Families Tax Cuts Act.\n\nThis landmark legislation, passed by House Republicans last July,  delivers meaningful…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699684/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}]