[{"senator": "Susie Lee", "party": "Democrat", "sentence": "…and welcoming spirit have made this first year a  resounding success.\n\nAs we celebrate this anniversary, let it serve as a testament to what  can be accomplished when local government, public servants, and  community members come together with a shared vision. This is a great  milestone in our community.\n\nI look forward to many more years of growth,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691298/recognizing-the-one-year-anniversary-of-the-silverado-ranch-community-center-in-clark-county-nevada"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia Home Rule       Improvement Act, make the District less efficient,       competitive, and responsive to the needs of a highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only       adds costs and uncertainty, making it more difficult to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…and contractor jobs.\n\nThroughout his tenure, Gene represented the interests of Naval Base  Ventura County with distinction, communicating its needs and priorities  to local government leaders, educational institutions, and business  partners, while building enduring partnerships among military commands,  public agencies, and the private sector. His…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…southeastern Colorado--to build on their efforts to deliver  clean drinking water. The effort to complete the conduit has always  been a partnership between the Federal and local government, driven by  the leadership of the Southeastern Colorado Water Conservancy District.\n\nIn the face of rising costs and materials and labor, once again,  southeastern Coloradans,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…established  locally elected chief executive officer and legislature. The purpose of  the Home Rule Act is to ``grant to inhabitants of the District of  Columbia powers of local government'' and ``relieve Congress of the  burden of legislating upon essentially local District matters,'' yet  the House today is denying D.C. residents local self-government…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…afford it, and they tend to be the ones more  frequently abused by police.\n\nThat is why I am introducing the Stop Body Camera Paywalls Act to  prevent any State or unit of local government that creates a paywall  for access to these public records from receiving Federal law  enforcement grants.\n\nAgain, we must make sure that we have transparency, especially…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…male  councilmembers from harassing or intimidating her.\n\nIn 1999, she was elected as the city's first Black female mayor. Her  leadership spanned decades, influencing local government and paving the  way for future Black women in politics throughout west Michigan.\n\nHattie Beverly, Teacher Extraordinaire: In 1899, Hattie became the  first African-American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…year. Third, this bill would treat D.C. as a state under  the National Culvert Removal, Replacement, and Restoration Grant  Program. Currently, only states and units of local government are  eligible for these grants, and the U.S. Department of Transportation  (DOT) has held that D.C. is ineligible, even though D.C. operates as  the functional equivalent…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698538/introduction-of-the-district-of-columbia-transportation-funding-equality-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…provide--\n\n(A) employment records that have been maintained by the       Social Security Administration, the Internal Revenue Service,       or any other Federal, State, or local government agency;\n\n(B) bank records; or\n\n(C) at least 2 sworn affidavits from individuals who are       not related to the alien and who have direct knowledge of the       alien's…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia Home Rule       Improvement Act, make the District less efficient,       competitive, and responsive to the needs of a highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only       adds costs and uncertainty, making it more difficult to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…temporarily set aside. These decisions were made       through the District's legislative process and are the same       type of policy judgments that every state and local       government routinely makes on behalf of their residents.\n\nThe timing of these resolutions are especially problematic.       The District is already a month into the 2026 tax year…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and as a representative with the  Southwest Georgia Regional Commission. Throughout his long career he  has been a steady and principled leader, working to strengthen local  government, improve services for residents, and support community  development across southwest Georgia.\n\nHis commitment to service has earned him numerous honors, including  the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…Crapo and Wyden in the  Senate.\n\nIn central and southern Oregon, my district, the Federal Government  owns over 3 million acres of forestland that pays no taxes to our local  government. Generations of families built their lives and livelihood  around Federal timber harvest, and counties relied on revenue shares  from those sales to fund public services.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697662/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Derry  citizens, including renovating and constructing long-awaited roads,  conserving land, and expanding police and fire stations. Throughout his  43 years of working in local government, David consistently ensured  Granite Staters received the support they deserved, greatly helping  residents across the state in Jaffrey, Londonderry, North Hampton,  Belmont,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…when they think they  can score political points, taking away the democratic rights of people  here in D.C. and home rule.\n\nThe Framers expected Congress to establish a local government for  D.C., and Congress has established various forms of local government  for D.C. since 1802.\n\nThe Supreme Court has held that Congress may delegate to D.C.  legislative…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…are allowed to prosecute  criminals as old as 25 years old as minors.\n\nWhile President Trump has restored law and order to the District, I  am not surprised that D.C.'s local government continues to protect the  criminals and ignore victims. The D.C. CRIMES Act puts an end to this  madness and ensures safety and security across D.C.\n\nAt 18 years old,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…located in the town of Loomis.  He manages the youth and community services unit, which oversees public  outreach and school resource officers, and works closely with local  government and business leaders.\n\nLieutenant Jason Doolittle's service does not stop there. He also  serves as an adjunct instructor at Sierra College's modular police  academy…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Comptroller General, in       the course of the performance of the duties of the Government       Accountability Office;\n\n(v) may not, if provided to a State or local government or       government agency--\n\n(I) be made available pursuant to any State or local law       requiring disclosure of information or records;\n\n(II) otherwise be disclosed or distributed…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…following:\n\n``(4) Definitions.--In this subsection:\n\n``(A) Firefighter.--The term `firefighter' means any       employee of the Federal Government, a State, a unit of local       government, or an Indian Tribe who performs work directly       related to suppressing fires, including wildland fires.\n\n``(B) Law enforcement officer.--The term `law enforcement…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…dwelling units       that the Secretary has determined in advance to be       appropriate.\n\n(3) Eligible entity.--The term ``eligible entity'' means--\n\n(A) a unit of general local government, as defined in       section 102(a) of the Housing and Community Development Act       of 1974 (42 U.S.C. 5302(a)); and\n\n(B) an Indian Tribe, as defined in section 102(a)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…investment in the United States from responsible       private-sector entities based in trusted countries.\n\n(10) Innovative and noteworthy initiatives by State and       local government to attract foreign investment from       responsible private-sector entities based in trusted       countries.\n\n(11) Initiatives by other countries to identify best…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…in the Nation. Oil and gas development  funds their schools, their public safety, their utilities, their  clinics, basic services that most Americans assume that their local  government can provide. On the North Slope, that stability exists  because responsible development exists, and we have a duty to ensure  that it continues.\n\nAlaska's business community…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Georgia. During  his nearly seven-year tenure here, he led with vision, steadiness, and  a keen sense of public service, culminating in an impressive 48-year  career in local government.\n\nOne of Steve's signature achievements for Green Cove Springs is the  redevelopment of Walnut Street, where he oversaw the major redesign and  reconstruction project…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…tsunami inundation zone.\n\n(c) Consultation.--In developing each preparedness plan       under subsection (a), the Commandant shall consult relevant       State, Tribal, and local government entities, including       emergency management officials.\n\n(d) Briefing.--Not later than 14 months after the date of       enactment of this Act, the Commandant shall…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…City's water supply will support the growing number of  businesses and families that call The Dalles home. This legislation is  straightforward, timely, returns power to local government, and saves  taxpayer money. I thank Representative Bentz for sponsoring this  critical measure.\n\nMr. Speaker, I urge my colleagues to support H.R. 655, and I yield  back…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…then why doesn't somebody  build some? Well, the private sector is trying, but in many States--not  all, but in many States and many cities, they are being stopped by  local government.\n\nAnd you say: Whoa. Why? Why would a councilwoman or a councilman in a  city of 100,000 people in Colorado not want to see more houses built?\n\nI will tell you why: because…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…days with local elected officials and  continues to make vital community connections to grow the affiliate's  presence. Charlie has continued to build relationships with local  government members and stresses the need for private and public  partnerships. As Habitat's footprint continues to grow throughout its  service area, Charlie Rogers will keep pushing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…residents in towns like Silver Cliff,  Colorado, who are overcharged for insurance because their ZIP Code  inaccurately places them in a higher risk area.\n\nThink of the local government already stretched thin that loses  millions of dollars in vital sales tax revenue because transactions are  mistakenly attributed to neighboring jurisdictions.\n\nThese…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…community'' has the meaning given such term in section 3(4)       of the National Security Act of 1947 (50 U.S.C. 3003(4)).\n\n(9) Locality.--The term ``locality'' means any local       government authority or agency or component thereof within a       State having jurisdiction over matters at a county,       municipal, or other local government level.\n\n(10)…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…roads. It destroyed  homes. It took lives. It changed so many things.\n\nI will say the good news is the resilience of North Carolinians, not  only in government, not only in local government, but also in  volunteers and the faith community. I see my good friend, Congressman  Harris, over there. The churches stepped up in such a tremendous way to  help folks…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}]