[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…is where the rubber meets the road, colleagues. Most of you  were not here last night in the wee hours of the morning when I  explained that California, at the State and local level, has already  done almost all they can to push the most ambitious regulatory agenda  in the country to reduce emissions. They have done what they can from  what is within…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…work as a team, one of the strongest teams in  the country--a coordinated effort between our Federal delegation, our  Governor, and our county executives and mayors on the local level. It  is true in good times, it is true when we face adversity, and it was  never truer than we saw 1 year ago today.\n\nGovernor Moore and Mayor Scott raced to the bridge.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…all students.\n\nThe Department of Education does not influence public school  curriculum, instruction, or instructional materials. Those decisions  are already made at the local level by local boards of education.\n\nI am trying to state the facts, to lay them out so that the people at  home understand what is happening right now. This is not an emotional…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…congressional lead.\n\nDavid has hosted numerous congressional outreach meetings to bring  together staffers and federal agency representatives, to keep our  government engaged at the local level with trends in immigration cases.  Throughout the course of his career, David consistently ensured Granite  Staters received the support  they deserved and was able to help…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…national  importance, they can bring forward a bill that enforces it nationally.  I will not vote for these attempts to decide those issues for a single  district at the local level, whether in the District of Columbia or in  the districts of any Member here.\n\nOne of the bills before us last week, H.R. 884, would repeal D.C.'s  local law that allows…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692632/opposition-to-hr-hr-and-hr-2096"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…our own citizens can't get through to the Social  Security office because you have cut the staffing back so much? Do you  have any idea what is actually happening at the local level in this  country? No one in this Chamber is a fan of Maduro, and the people of  Venezuela have a humongous, difficult task of building their country  forward now, but why…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…lot of Governors, mayors, and local  elected officials said, no, they don't want a Federal income tax  because that will stop them from raising the taxes at the State and  local level. Since America's founding, government was mainly paid for  at the State and local level through State and local taxes. The Federal  Government was funded by tariffs, quite…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…economical energy  sources. The last one, Chevron, is doing both.\n\nI must say I am reminded, as I sit here, to the same arguments 30  years ago having been involved at the local level in California about  secondhand smoke and tobacco when the tobacco industry was insisting  that the Tobacco Institute do studies about the cost to smokers by  passing secondhand…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…keep hearing people say about how this big, ugly bill is a tax  cut, but what it is doing to me is forcing me to either cut services or  raise taxes at the State or at the local level.\n\nCongress has 22 days for Republicans to decide whether we are going  to have a government shutdown because they have made clear from day one  that they are in charge.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…not override these important  budgetary decisions enacted by the D.C. City Council. I will not vote  for these attempts to decide those issues for a single district at the  local level, whether in the District of Columbia or in the districts of  any Member of Congress.\n\nMr. Speaker, I respect the will of D.C. residents to shape their  local government…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699844/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…commerce or assault on  a Federal officer in doing his or her duty, or seditious conspiracy  against the Union, which is why the vast majority of crimes are  prosecuted at the local level like assault, murder, armed robbery,  theft, and so on.\n\nFederal law would also be limited, the Founders thought, according to  number because the Federal criminal laws…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…project represents a step toward our clean energy future and  underscores the support for renewable energy development and  infrastructure, particularly at the State and local level.\n\nH.R. 1043, led by Congressman Gosar and Arizona Senators Gallego and  Kelly, reflect the kind of bipartisan cooperation we need more of in  Congress.\n\nAfter Republicans'…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693917/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and meet their educational goals.\n\nSuch supports are critically needed, and include:\n\nExplicit protections under Title IX\n\nNondiscrimination protections at the state and local level\n\nAccessible and affordable child care, and increased funding       for on-campus child care\n\nAccess to early education and pre-kindergarten services\n\nTransportation access…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…horrific floods and  tragic loss of life.\n\nWhat happened in this policy is that Republicans at every level of  government in our State failed the people of Texas. At the local level,  they refused to have support grants from the Biden administration that  would have put in place critical sirens and warning equipment that  would have warned these kids…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…money that goes back to the  States, the counties, and the towns to open up the centers,  particularly for young people. That is where this all happens. It  happens at the local level where people are treated, where the  education programs take place. That billion dollars is gone. I am sure  it is in the courts and the courts may say you can't do it,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Homeland Security  has monitored these trends closely.\n\nA recent cyber-threat snapshot shows that the majority of States have  experienced significant cyber incidents at the local level this year,  and many of those incidents targeted smaller jurisdictions that have  limited staff, outdated systems, and fewer resources to defend  themselves.\n\nFinally, this…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…still enjoy the benefits of such tax relief with  their Federal tax filings, they are being stripped of corresponding  relief that should also be afforded to them at the local level. In  other words, the D.C. Council has rejected tax provisions that help  relieve the burdens faced by D.C. residents and businesses.\n\nThere are nine tax provisions that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Democratic colleagues on the  other side of the aisle?\n\nWhich one of our Democrat colleagues from the other side of the  aisle, whether at the Federal level, the State, or the local level has  come out to denounce the treatment by law enforcement at the hands of  these people that are trying to thwart them and put their lives in  danger for the sake of murderers?…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "French Hill", "party": "Republican", "sentence": "…framework.--The term ``local zoning       framework'' means the local zoning codes and other       ordinances, procedures, and policies governing zoning and       land-use at the local level.\n\n(4) Secretary.--The term ``Secretary'' means the Secretary       of Housing and Urban Development.\n\n(5) State zoning framework.--The term ``State zoning       framework''…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…reliability and promote long-term resource  sustainability. EMWD and I have worked closely to advance critical  water projects in both EMWD's service area, and the arid west.\n\nOn a local level, I have worked with EMWD on a sewer solution in  Quail Valley a community that is reliant on antiquated, and failing  septic systems. One part of the community's septic…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…subsequently dies.\n\nI am for these agencies actually serving the taxpayers, not being  engaged in things like that. We respect the police and want it done  right. At the local level, God bless them. I have not been for  defunding them. We are for honoring local police, like this good  sheriff, this Member of Congress, and what they do day in and day…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}]