[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today to commend the Isleta Police  Department and local law enforcement for their commitment to protecting  New Mexico's communities. On November 17, 2025, the U.S. Department of  the Interior and the Bureau of Indian Affairs reported a…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697564/commending-the-isleta-police-department-and-local-law-enforcement"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…information with Congress.\n\nBut these are not ordinary times. We must go farther to stand up to  an administration that is currently diverting the military to conduct  local law enforcement operations. That is conducting unlawful military  operations in service of regime change and threatening further actions,  including troops on the ground.\n\nOur military…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…have been impacted by these crimes, who have seen these  crimes, and who all reject this political violence.\n\nI want to take this time to thank State, Federal, and local law  enforcement for their tireless work to bring the perpetrator to  justice.\n\nWe should be clear: Political violence against anyone is an attack on  our democracy and all of us.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in effect, three local D.C. laws       pertaining to three inherently local issues, namely the       administration of local elections, the allocation of finite       local law enforcement resources, and the processes for       disciplining local police officers if they engage in       misconduct. The D.C. Council--whose members are elected by       and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…resolution under consideration.\n\nWe have heard our colleague distort the facts already through this  debate. I want to remind the American people and everybody that it was  local law enforcement that got the situation under control before the  National Guard and the Marines showed up. I know because I was on the  phone with the sheriffs and local law enforcement…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Long Island. The bomb threats against my  offices came with the email subject line ``MAGA'' and from an email  address alleging the ``2020 election was rigged.''\n\nLocal and Federal law enforcement responded immediately and are  conducting full security sweeps, and investigations are ongoing.  Everyone, thank God, is safe, and I am grateful for the quick…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697230/political-violence"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…cares more about keeping DC safe than DC       residents who work, live and raise their families here. Our       democratically elected officials work closely with local law       enforcement, policy experts, and community leadership to pass       laws that are in the best interests of all Washingtonians.       Substituting the will of DC voters with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…honorees from Fauquier County, individuals who  embody courage and service.\n\nSponsored by the Fauquier Chamber of Commerce, the Valor Awards  highlight the critical work local law enforcement and first responders  do every day to keep our communities safe.\n\nAmong this year's Lifetime Achievement Awards was Warrenton Police  Chief Tim Carter. A native of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690556/recognizing-valor-award-winners-and-honorees-from-fauquier-county"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…future.\n\nRepublicans had the opportunity to bring a resolution introduced by  my colleague, Representative Barragan, condemning violence and bad  actors, and thanking local law enforcement for their work. Instead,  Republicans chose to use the unrest in Los Angeles to play partisan  games and attack Democrats in California.\n\nMr. Speaker, it is our duty…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…partnered with my office for our annual Fish `n' Kids and  Kids `n' Kites events, which give kids the opportunity to engage in  outdoor activities, build relationships with local law enforcement, and  interact with members of the community.\n\nMr. Speaker, I am proud of the work that Baldwin and Crystal Hamilton  and It's About the Kids Mentor Program have done…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in effect, three local D.C. laws       pertaining to three inherently local issues, namely the       administration of local elections, the allocation of finite       local law enforcement resources, and the processes for       disciplining local police officers if they engage in       misconduct. The D.C. Council--whose members are elected by       and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…violence to sue  manufacturers and dealers who engage in firearm transactions prohibited  under the Foreign Narcotics Kingpin Designation Act.\n\nWe also must provide local and Federal law enforcement with the  resources they need to fight against the highly armed cartels.\n\nThese Agencies are on the frontlines protecting our communities from  fentanyl and other…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…to explain it.  They didn't even know it was happening.\n\nOf course, they unleashed DOGE on the Department of Justice and  hundreds of millions of dollars in State and local law enforcement,  victim assistance, rape survivor organization grants, all of that was  cut by them. Of course, they are also cutting more than a billion  dollars in law enforcement…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…grateful that this is one of the areas where  we have a lot of bipartisan support because this body I would say  unanimously believes that we have to do more to help local law  enforcement.\n\nI see it in my State. We have real challenges--challenges with  recruitment, challenges with officers who are in incredibly stressful  situations for their mental…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…authorities initially lacked the clear tools and resources to  determine what hazards they were dealing with or how to safely respond.  The situation placed local law enforcement officers, code enforcement  staff, and nearby residents at serious risk.\n\nIt required coordination of local, State, and Federal agencies to  fully assess the threat and dismantle…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…resolution is very simple. It recognizes a right to assemble and  protest peacefully, and it condemns unequivocally the violence  perpetrated against Federal, State, and local law enforcement. It calls  on local and State-elected leadership to work with the Federal  Government and restore peace. It also expresses gratitude to our local,  State, and Federal…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…event.\n\nI am focused on making sure that we have a conversation around how do  we prevent this from happening again. Unfortunately, in sanctuary  States like Colorado, local law enforcement is prohibited from sharing  information with their Federal counterparts, Mr. Speaker. This terror  attack in Boulder is an example of why these sanctuary policies are…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today in support of my bipartisan  resolution honoring the brave men and women who serve in local law  enforcement.\n\nThese officers work tirelessly to protect and serve, putting their  lives on the line every day to uphold the rule of law.\n\nAs a former sheriff, a son of a police…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…and install it himself, giving this resident the peace of  mind that she had been missing.\n\nThis story is just one example of the many behind-the-scenes ways  that our local law enforcement serves their communities every single  day. Officer Hobson's actions reflect the care, professionalism, and  compassion that define the men and women who protect our…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…cosponsored Mr. Evans' resolution.\n\nNumber three, it says: Be it resolved that the House of  Representatives ``affirms that free and open communication between  State and local law enforcement and their Federal counterparts remains  the bedrock of public safety and is necessary in preventing terrorist  attacks.''\n\nIt seems reasonable to me.\n\nNumber four says:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…for annually thereafter.\n\n(5) A description of active and past first responder       cooperative agreements made between each impacted Coast Guard       facility and local law enforcement or first responders for       search and rescue operations.\n\n(6) The average response time for all search and rescue       operations at each impacted Coast Guard facility…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…protections and  less vetting.\n\nBut the following week after Thanksgiving, another parolee nearly  committed a terrorist attack in Fort Worth, TX. Thanks to the Federal  and local law enforcement, they were able to apprehend him and prevent  him from carrying out that attack.\n\nI am grateful to the Department of Justice, including the FBI, and  our State and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…by discretion of the committee.\n\nMr. Speaker, again, I would like to make the emphasis what it should  be today, which is on safeguarding our elections, supporting local law  enforcement, and trying to eliminate the deadly scourge of fentanyl  across the United States.\n\nMr. Speaker, many of the entities that my colleague on the other side  of the aisle…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…passage of the National  Defense Authorization Act. These new laws will expand access to Federal  support for law enforcement and their families and help State and local  law enforcement combat online child exploitation.\n\nThe National Defense Authorization Act also expanded counterdrone  authorities for State and local law enforcement agencies using…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…badge, and who protect our communities.\n\nMr. Speaker, I thank specifically our El Paso County Sheriff's Office  and our Colorado Springs Police Department and all of the local law  enforcement in Colorado. They put themselves on the front lines every  single day.\n\nI have had the pleasure of doing ride-alongs with our sheriff's  office and our Colorado Springs…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…principles, and  ensures that taxpayer dollars are spent on public safety and national  security, not bloated bureaucracy.\n\nIt provides strong support for State and local law enforcement  partnerships, and it defends the Second Amendment and America's right  to bear arms.\n\nRepublicans are working to advance regular order and deliver results  for the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…enforce the law.\n\nRemember how all this started: ICE agents attempted to execute court- ordered warrants on criminal illegal aliens. When a mob intervened, ICE  called for local law enforcement. The mayor reportedly stopped them  from responding, and the Governor did nothing. Now, we saw during the  George Floyd riots what happens when leftist officials refuse…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…of Intelligence and Analysis collaboration with the wider  intelligence community.\n\nAs the only intelligence agency with a duty to share information with  State and local law enforcement, it is imperative the Office of  Intelligence and Analysis analysts have effective partnerships within  the intelligence community.\n\nIn addition, I also want to take…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696795/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…rule of law that he so artfully described with  respect to our jails and the enforcement of laws in our communities,  but also to enforce our border in concert with local law enforcement  and how important it is that we stand alongside them, that we stand up  and hold ourselves accountable for doing that work and the proper  oversight and the proper…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…high-income backgrounds. We see it  happen to ordinary Americans, people who never imagined that they would  become victims themselves.\n\nEfforts by Federal, State, and local law enforcement and advocates to  eliminate trafficking and to support victims have increased awareness,  reporting, and prosecution of sex traffickers across the country.  However,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}]