[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…a rule to  kick even more families off of their healthcare. The rule we are  talking about today would shorten the open enrollment periods and  introduce much more redtape, locking eligible families out of getting  their health insurance.\n\nWe should be making it easier, not harder, for Americans to see a  doctor. We should be making healthcare more affordable,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…companies, people just trying to make a  living. They are not only deporting people who came here illegally.  They are going after legal green card holders and asylum-seekers,  locking them up with no due process. Students who had the gall to write  an op-ed expressing their opinion on a political issue are being locked  up for deportation.\n\nIt is all to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…roof over their head.\n\nWe also have to confront the root causes of this crisis. Large  corporate investors are buying up single-family homes, driving up  prices and rents, and locking families out of homeownership.\n\nThat is why, last summer, I introduced the HOMES Act, which cracks  down on investors buying 50 or more single-family homes, shines a light…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…billionaires, and the impact has been devastating.\n\nLast month alone, the Social Security website crashed four times in  10 days for hours, in one case for almost an entire day, locking  retirees out of their accounts.\n\nPeople who try to call the Social Security offices are on hold for  hours because all the staff in the offices have been fired.\n\nNow, they…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…parents with  protection when supporting their children's health. Republicans refused  a vote on both.\n\nWe should be empowering doctors to take care of their patients, not  locking them up. I will be relentless to keep politicians out of the  exam room.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698347/protect-childrens-innocence-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…in the  dismantling of civil rights protections. We see it in efforts to attack  birthright citizenship. We see it when they invoke legal powers that  once falsely justified locking up over 120,000 Japanese Americans.\n\nLooking back, what would have changed if someone had just stepped in,  if the books had been saved, the pictures restored, the stories…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…decreasing demand  for coal.\n\nAt the same time, the plan allowed existing mines to continue to  operate through the end of their current leases. Rescinding this plan  means locking us into unnecessary emissions and energy costs at a time  when the planet and the American people cannot afford it. It also puts  us on a treadmill of litigation and uncertainty,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…persecution.\n\nEarlier this month, the Trump administration deported roughly 300  men, women, and children seeking refuge in the United States to Panama  on U.S. military aircraft, locking them in hotel rooms without access  to basic rights or counsel.\n\nThis includes asylum seekers from Iran, China, and other countries  known to persecute religious minorities.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to families across the Midwest.\n\nIn June, the Trump administration's EPA proposed a rule to allow coal  and gas power plants to emit unlimited amounts of climate pollution,  locking us into a dirtier and more expensive future.\n\nIn July, Republicans passed their big, ugly bill, which will saddle  American families with price hikes of at least $110 next…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…bills are among  the highest in the Nation. Blocking Revolution Wind undermines efforts  to make energy more affordable. It undercuts our work to lower prices  for consumers, locking in higher bills for decades and impacting, as  well, jobs.\n\nRevolution Wind is providing thousands of jobs in Connecticut and  Rhode Island. More than a thousand local union…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…heard from many constituents who  are extremely worried about the already high cost of living. The  Republican health care cuts and the increased costs the Republicans are  locking in with this bill will make life harder, not easier, for the  people we represent. The Republicans who crafted these policies might  change their minds if they actually showed…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…workers out of our economy. They are spreading fear in  communities where families should feel safe, and they are doing it with  our taxpayer dollars.\n\nLet me be very clear. Locking up people who pose no danger to our  communities does not make us safer. It weakens us. It destabilizes  families. It wastes resources that should be used to pursue violent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…him show no criminal record, but it  also got his name wrong several times and used two different  identification numbers. Those are pretty major errors to make when you  are locking someone away, the kind of errors that due process helps to  avoid.\n\nThat is not some theory. We are seeing it happen in another case  right now. There is a couple that Trump…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…supports jobs for Inupiaq shareholders and  residents. It underwrites the continuation of our communities, even as  we maintain our subsistence way of life. By arbitrarily locking away  vast portions of the NPR-A, BLM's rule threatens these essential  services and imposes disproportionate burdens on our people.''\n\nEqually concerning, BLM failed to engage…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…three CRA resolutions that reverse the Biden administration's Bureau of  Land Management Resource Management Plans that attack Alaska, attack  North Dakota, and attack Montana, locking up millions of acres of land  from responsible oil and gas and coal development.\n\nLast year, on their way out of office, the Biden administration  finalized these three resource…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…penalties for  carjacking and robbery. As a matter of policy, they are choosing  criminals over innocent Americans.\n\nMr. Speaker, we hear from the other side of the aisle that locking up  criminals by some weird and bizarre logic increases crime. The reality,  which we all know because it is self-evident, is that when a criminal  is in jail, by definition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Notification.                      Subtitle E--Coast Guard Academy  Sec. 261. Modification of Board of Visitors. Sec. 262. Study on Coast Guard Academy oversight. Sec. 263. Electronic locking mechanisms to ensure Coast Guard Academy                cadet room security. Sec. 264. Report on existing behavioral health and wellness support                services facilities…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the Interior, saying: Don't lock up my lands. Don't lock  up my lands. She never met with them. She never met with them.\n\nMy colleague from New Mexico has been the leader in locking up  Alaska. I mean, I have come down to the floor and raised a little bit  of heck on all of the actions he has taken to lock up my State.\n\nSo, look, the Democrats really…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…override State expertise here, it sets a dangerous  precedent for every energy-producing State in the U.S. Congress must  reassert its role to prevent unelected bureaucrats from locking up  resources, raising costs, and undermining our energy security.\n\nMr. Speaker, I urge my colleagues to support this resolution. Stand  with innovation. Stand with American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Act  passed unanimously in both the House and Senate, a rare feat that  demonstrates the overwhelming support for opening more of our public  lands to outdoor recreation, not locking up our lands and throwing away  the key.\n\nIn keeping with that, I strongly urge my colleagues to vote ``yes''  on this important joint resolution, which will restore off-highway…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that we can win in that competition.\n\nBy passing this CRA, we are restoring the BLM's multiple use and  sustained yield mandate and preventing future administrations from  locking up America's natural resources. The era of curtailing multiple  uses of our Federal lands hopefully is over. It is time to usher in a  golden age of unleashing our energy…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…so that families in America can finally start living  the American Dream again. That is what this bill focuses on, Mr.  Speaker.\n\nHow do we do it? We do it, number one, by locking in rates for  everybody. Nobody's taxes go up, Mr. Speaker, nobody's. Now, the other  side is upset about that, and I understand it. They don't want just the  billionaires'…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…authorization. Designation of ACECs  that remove lands from operation of the public land laws is a de facto  withdrawal and an insult to Congress's express intent in ANILCA,  locking up critical resources that our Nation needs to counter our  dependency on hostile foreign powers.\n\nDoyon, the largest Alaska Native Corporation stakeholder in the  Central…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…management plan  ignores that record of responsible energy development. Instead, the  North Dakota resource management plan seeks to curtail coal, oil, and  gas production by locking away taxpayer-owned energy reserves and  jeopardizing our Nation's energy security.\n\nUnder this plan, nearly 213,000 acres--or 45 percent--of Federal oil  and gas acreage…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…impacting 225,000 acres of federal       lands in northeast Minnesota. It has prevented responsible       development of these resources from moving forward, in       addition to locking out any future exploration and mining in       the region for 20 years.\n\nCritical minerals are vital for every aspect of our modern       lives, and reliable access to them…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…renege on the deal they just passed. The numbers in the budget end up  not being of consequence because the spending goes on unabated.\n\nThis week, Congress will likely vote on locking in spending levels.  The spending levels will be the same spending levels that Republicans  criticized as the Biden spending levels last December. So when there  was a Democrat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…critical to reverse the overreach of BLM's 2022 NPR-A IAP       record of decision.\n\nRDC is concerned with the alarming trend from the last       administration of ``locking up'' oil-rich lands in NPR-A and       providing for less leasing and less access. Much of the most       prospective acreage could be removed from leasing under the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…little over 3 percent.\n\nWe picked a conservative number, but we know we will outperform it  with good energy policies, work incentives, deregulation, America First  trade, and locking in low taxes from TCJA.\n\nThat 2.6 annual average, that conservative growth assumption, will  yield $2.5 trillion over the 10-year budget window. If you stack the  spending…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}]