[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "President Trump has canceled 20 energy projects in Virginia since he  became President: an offshore wind staging project in Portsmouth, an  offshore wind logistics project in Norfolk, a project dealing with  electric vehicles in southwest Virginia, an electric vehicle  infrastructure apprenticeship program and workforce training program in  Northern Virginia--20 projects."}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "In addition to the CAG, Major General Kotulich has served in several  joint positions to include Chief of Staff at the United States  Transportation Command and three different assignments at the Defense  Logistics Agency."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Wendy Dawson, our director of press logistics, brought to the team  extensive industry experience covering numerous political conventions,  State of the Union Addresses, and six Presidential inaugurations."}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "She rose  through the ranks as a driver, lieutenant, battalion chief and division  chief, deputy chief of logistics and deputy director until she was  appointed Fire Chief by former Mayor Jim Strickland on January 1, 2016."}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "Nearly 500 personnel battled the blaze from  across agencies including the California Department of Forestry and  Fire Protection, Alameda County Fire Department, South San Joaquin  County Fire Authority, San Joaquin County Sheriffs Office, California  Highway Patrol, Tracy Police Department, Manteca Fire Department,  Lathrop-Manteca Fire District, Defense Logistics Agency, and more."}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Good360's innovative use of advanced data and resource matching  technology accelerates donation routing and optimizes logistics."}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Indeed, businesses across the economy--including in labor-      intensive and low-paid sectors like construction, home and       health care, janitorial and       building services, hotels and hospitality, and warehousing       and logistics--use similar contracting arrangements to       insulate themselves from accountability."}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "The Apex Industrial Park is a critical driver of job creation,  logistics, and advanced manufacturing in southern Nevada and the  critical update provided by this bill would open the door to more  efficient growth, infrastructure investment, and regional coordination."}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "She spent 29 years at Eastman Kodak Company, where  she worked in the supply chain and logistics department."}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "I represent a district that is home to Robins Air Force Base, Fort  Benning, and Marine Corps Logistics Base Albany."}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "His mastery of military       logistics proved that excellence and leadership flow from       capability, not ancestry."}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "On Guam, the military must deploy snake-proof fencing, trap-and-bait  programs, and train detection dogs to prevent brown tree snake  incursions on military equipment and cargo, significantly complicating  logistics, readiness, and training activities."}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "According to the statement, the ``government of Lebanon has       requested to buy support equipment, and other related       elements of a logistics program and support.''\n\n``This proposed sale will support the foreign policy and       national security of the United States by improving the       security of a partner country that continues to be an       important force for political stability and economic progress       in the Middle East,'' the statement read."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government       and contractor engineering, technical, and logistics support       services; and other related elements of logistics and program       support."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government and contractor       engineering, technical, and logistics support services; and       other related elements of logistics and program support."}, {"senator": "James Risch", "party": "Republican", "sentence": "Non-Major Defense Equipment: The following non-MDE items       will be included: A Cooperative Logistics Supply Support       Arrangement (CLSSA) Foreign Military Sales Order (FMSO) II       case to requisition orders for centrally managed spares and       repair parts."}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Since  October 2024, he has been the Logistics Flight Commander of the 612th  Air Base Squadron out of Soto Cono Air Base, Honduras."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government and contractor       engineering, technical, and logistics support services; and       other related elements of logistics and program support."}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "Unfortunately, outdated systems and fragmented logistics have created  real obstacles within the VA."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government and contractor engineering,       technical, and logistics support services, and other related       elements of technical support."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government and contractor engineering,       technical, and logistics support services; and other related       elements of logistics and program support."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government and contractor       engineering, technical, and logistics support services; and       other related elements of logistics and program support."}, {"senator": "Sam Graves", "party": "Republican", "sentence": "(4) An evaluation of the ability of the Port of Point       Spencer, Alaska, to serve as a port of refuge and as a       staging, logistics, and operations center to conduct and       support maritime emergency and spill response activities."}, {"senator": "James Risch", "party": "Republican", "sentence": "Government and contractor engineering, technical, and       logistics support services; studies and surveys; and other       related elements of logistics and program support."}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Karen is a role model for young adults, particularly women, to consider  trucking and logistics as a career."}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "But around the clock,  Louisville is also a hub for global shipping and logistics, business  supplies, consumer goods, and Christmas gifts."}]