[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Club Fellow, Honorary Member, and Explorers Club  Medalist, by L. M. Levie:\n\nThere's a tale explorers tell, of a girl with drive and       dreams, Who was born in Hampstead, London in a home of modest       means, With a small toy chimp named Jubilee clutched close       against her heart, And a yearning for the wilderness,       imprinted from the start.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…His & Hers Accessories, and the Albany Christian  Book & Gift Store.\n\nHis ministry and mission were global in scope--Bishop Williams  traveled extensively to Haiti, Africa, London, Paris, Amsterdam,  Belize, Jamaica, Honduras, Mexico, and beyond, and he established two  ministries in Liberia. He served as Bishop Ordinary for the Diocese of  St. James…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…flew President Joe  Biden to Europe for a secret trip to Ukraine during the war.\n\nWhen people see Air Force One on TV, when they see it land in other  countries--whether in London or Tokyo or Brazil--they immediately know  that America has arrived. It represents not just the weight of the  Presidency but America itself, generations of history and international…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…when the Trump administration, just months ago in late August, issued a  stop work order, grinding this project to nearly a complete halt--men  and women on the job in New London, offshore, onshore, stopped from  going to work, out of jobs; investors, construction companies, supply  chain suppliers, all of them grinding to a nearly complete halt.\n\nThe…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…handled Wall Street's major oil trader called e- bond's from the Middle East through its New York World Trade Center  offices by denominating them in dollars. It also ran a London Office.  Had the London office not existed on 9-11, it is likely the U.S.  financial bond markets would have collapsed that day. Chaos would have  reigned across our entire…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…dedication, professionalism, and unwavering commitment to public  service exemplify the very best of diplomatic tradition. Nick is  transitioning back to the Foreign Office in London, and I wish him the  very best for his future endeavors.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…September 1955, when Bartholomew was studying in Istanbul, he  witnessed a massive pogrom against the city's Greek neighborhoods that  left them looking ``like the bombed parts of London during the Second  World War,'' as one British journalist reported. While the police  ``stood idly by or cheered on the mob,'' according to a report of the  U.S. consul, 4,000…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the water line       early on the morning of June 10. Then the gunpowder on board       exploded, sending pieces of the ship flying.\n\nAs news of the attack made its way to London, British       leaders seethed. In a royal proclamation, King George III       offered a reward of up to 1,000 pounds sterling--more than       $150,000 in today's currency--to…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Coast  Guard statutes regarding protecting victims of sexual assault and  harassment both within the Coast Guard service and also the Coast Guard  Academy. I represent New London, Connecticut, which is home to the  Coast Guard Academy that is an outstanding institution that builds  future leaders for the Coast Guard. It actually has a large  international…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…reputation. It is a moment of profound historic challenges that has  been recognized with massive marches here in the Nation's Capital, in  Connecticut, around our State--New London, New Haven, Westport, New  Britain. I have been to many of them.\n\nVeterans are one of most powerful voices in our country, and I urge  them to use those voices and their faces…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Democrats or Republicans. They are there as  people who are doing their job day in and day out.\n\nI visited one of those hospitals last week, Lawrence Memorial  Hospital in New London, Connecticut. Over 40 percent of their patient  census is on Medicaid. It is in the heart of New London, a wonderful,  historic community, but it has a high Medicaid population.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692841/stop-this-insane-attack-on-healthcare-that-affects-every-single-american"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…foreign misinformation that is  taking place. Last week, I asked Secretary Bessent from the Treasury  whether he had been discussing TikTok at meetings with Chinese  officials in London. He said they had not.\n\nI am concerned that these extensions of the TikTok deal are illegal.  Note that Congress passed this law, and the President extending the  deadline…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…world from roughly 1650  to 1700, there are still people and families in the Netherlands who are  benefiting. Notwithstanding the fact that they moved their headquarters  to London, they are benefiting from the fact that, at one time, their  nation was the number one economic nation in the world.\n\nI want that for the United States. I want us to be the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Matthew: PBS NEWSHOUR; Logan, Tonya: C-SPAN; Lohr, Paul: NBC       NEWS; Lokay, James: WTTG-FOX TELEVISION; Loker, Jessica: FOX       NEWS; Lombardi, CHARLES: NBC NEWS; London, Michelle: CBN       NEWS; Londono, Cristina: TELEMUNDO NETWORK; Long, Colleen:       NBC NEWS; Long, James: NBC NEWS; Longmore, JOSHUA: THE       NATIONAL NEWS; Longo, Adam:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Charlie Bain, 12th grade, and Nesa  Garcia-Perez, 10th grade, in congressional debate, and Leah Johnson,  10th grade, and Ashley Toapanta, 10th grade, in policy debate. Students  London Basham, Harper Rocovich, and Caroline Loveday also competed  admirably at the regional and State semifinal levels.\n\nSpecial thanks go to Assistant Coach Rachel Wurster for…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Moriah: Associated Press; Ball,       Emily: Wall Street Journal/Dow Jones; Ball, Michael: Argus       Media; Ballard, Mark: Baton Rouge Advocate; Balls, Kathryn:       Times of London; Balz, Daniel: Washington Post; Banks,       Adelle: Religion News Service; Baptiste, Nathalie: Huffington       Post; Barber, Charles: Wall Street Journal/Dow Jones; Barber,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "John Carter", "party": "Republican", "sentence": "…exceptional character and unwavering  commitment to service.\n\nOn active duty from 1973 to 1997, Lt. Col. Smith served in various  locations around the globe, including Quantico, London, Brussels, Hong  Kong, Australia, and Turkey. In 1990, Lt, Col. Smith was deployed to  Kuwait in support of Operation Desert Shield/Desert Storm He played a  critical role…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…is:  ``Allah is our objective. The Prophet is our leader. Koran is our law.  Jihad is our way. Dying in the way of Allah is our highest hope.''\n\nMeanwhile, Europe has fallen. London and Paris are mere shells of  their former strong selves. You watch veterans who fought to defend the  United Kingdom in World War II. Those still alive tear up and cry,  wondering…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor Kaley Stidham for her  service to the House Committee on Energy and Commerce.\n\nA London, Kentucky native, Kaley began her career as an intern for  her hometown member and Dean of the House Congressman Hal Rogers (KY- 05) followed by an internship with Senate Republican…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691969/recognizing-kaley-stidham"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…may       establish concurrent jurisdiction between the Federal       Government and the State of Connecticut over the lands       constituting the Coast Guard Academy in New London,       Connecticut, as necessary to facilitate the ability of the       State of Connecticut and City of New London to investigate       and prosecute any crimes cognizable…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Kentucky. Mr. Speaker, I rise today to recognize the  heroic efforts of first responders in London and Laurel County who  swiftly responded to rescue individuals after a deadly EF-4 tornado  ripped through our region, leaving behind a 55-mile trail of  destruction through…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Anniversary of D-Day in 2024, the World Peace  Parade in 2019, the Bands of America Grand National Championships in  2019 and 2002, the 75th Anniversary of Pearl Harbor in 2016, the London  New Year's Day Parade in 2012 and the Macy's Thanksgiving Day Parade in  1995.\n\nDr. Bodiford served as Director of the Spirit of JSU Drum and Bugle  Corps from 2001 to 2007,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696619/recognizing-dr-kenneth-g-ken-bodiford-for-his-extraordinary-service-to-jacksonville-state-university-and-the-field-of-music-education"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…talked about restrictions on free speech in Europe. Usually, when I  think of Europe, I think of Europe as being kind of like the United  States, right? You take an airline to London or Paris or Rome, and you  expect the same freedoms and prosperity you do in the United States.\n\nIn this hearing, we heard of a woman who is a member of the Finnish  Parliament.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…of the USS Iowa, the Navy's newest Virginia-class,  nuclear-powered, fast-attack submarine.\n\nI had the honor this weekend to attend the ceremony at Naval  Submarine Base New London, alongside Governor Kim Reynolds, veterans,  and the families of over 140 crew members.\n\nIt was a powerful moment marking the beginning of a new era. The USS  Iowa is the third…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689656/recognizing-the-uss-iowa"}]