[{"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…veterans, survivors, and their families.\n\nInstead of continuing senseless mass firings of VA personnel, this  bill provides funding so that the VA can recruit and hire to fill long- term clinical vacancies that are contributing to long wait times for  care in Georgia and across the country.\n\nAsserting our constitutional power of the purse, this bill mandates…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…profits and protect their advantage  with unlimited political spending. Although Citizens United did not  create these problems, it enabled them to persist and grow.\n\nWhile the long-term goal must be to overturn Citizens United through  a constitutional amendment, Congress has the power and the  responsibility to act immediately to limit its damage.\n\nThe…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Mr. Speaker, 83 percent of the tax breaks go to 1 percent of  Americans. What do these Medicaid cuts mean? It means the closure of  hospitals and seniors denied coverage in long-term care.\n\nElon Musk talks about reducing deficits, but this bill would add $2.8  trillion to the deficit, taking it to $24.9 trillion.\n\nHere is what is going on in the Republican…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688273/medicaid-cuts-mean-hospital-closures"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…immensely proud to have secured $750,000 in Community Project  Funding to support this endeavor. The Robin offers flexible housing  options, ranging from transitional stays to long-term accommodation.  The project is committed to providing equitable access to  transportation and is thus located along the Metro Transit line to  ensure easy and reliable access…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…discuss how to solve these problems in good faith  across the aisle. We should be extending the ACA premiums now and  making sure these prices don't rise and continue to work on long-term  solutions to make health insurance more affordable for Americans.\n\nSo I urge my colleagues to continue to work with us. The ACA tax  credits expiring at the end of this…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the only authority to declare war. This President, like  many others of both parties, has ignored that requirement and, I think,  at his own peril. They are engaging us in a long-term conflict which  could cost us dearly, and they are not engaging the American people in  the discussion and rationale of our ultimate goals in the region.\n\nThis briefing this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…across the country losing health  insurance coverage, and people with disabilities will be the hardest  hit.\n\nMedicaid is the primary program for comprehensive health and long- term care coverage to one in three people with disabilities.\n\nMy colleagues across the aisle are so focused on giving tax cuts to  billionaires, I think they have lost sight of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…close that gap. It ensured that  public schools could keep teachers in the classroom, that buses could  run safe routes on rural roads, and that county governments could plan  long-term budgets with certainty.\n\nIt ensures that children growing up in frontier communities receive  the same shot at a quality education as anyone in major cities in my  district,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…attacks on workers' rights,  stripping collective bargaining rights.\n\nWhat happened? Our School of Education had a two-thirds drop in  people applying to be teachers. We lost long-term public employees.  That affected services.\n\nThis bill will restore longstanding collective bargaining protections  and ensure that any future administration cannot demolish…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697978/protect-americas-workforce-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the State can demonstrate that no action  would be the reasonable course.\n\nSouth Dakota took no action in its latest regional haze plan to  address haze pollution over the long term. It made no updates to  significantly out-of-date controls at its three major emitters--a coal  plant, a cement plant, and a lime plant--and it failed to demonstrate  that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…technology, and budget issues. He served in that role until 1999, when  he became GAO's Chief Operating Officer, the agency's number-two  position, helping guide the direction and long-term vision of the  workforce.\n\nAfter 35 years of service, when many might have chosen to step away,  Gene accepted an appointment as Acting Comptroller General in 2008. He  was…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…went  back to work and they published a new rule that achieved a better  balance.\n\nThe updated rule, which is being targeted today, balances visitor use  and access with the long-term stewardship and management of park  resources.\n\nDespite some of the rhetoric that we may hear from the other side of  the aisle, the Park Service did not shut off access…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…37 percent, NOAA by 24 percent, the EPA by 54 percent, NASA's  science arm by 46 percent, and the Department of Energy Office of  Science by 14 percent, among many others.\n\nLong term, these cuts will have detrimental impacts on scientific and  technological innovation and cause irreparable damage to our global  competitiveness. So this discussion could…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…million in dislocated worker grant funding. While this is a step in the  right direction, the livelihoods of displaced workers, the health of  our local economy, and the long-term trajectory of Maui's recovery  remain in the balance.\n\nWe must continue working to secure all remaining dislocated worker  funds available--$8 million--to ensure the program…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689959/maui-dislocated-workers-program"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…select cases, like the       Japanese semiconductors, we've taken steps to stop unfair       practices against American products, but we've still       maintained our basic, long-term commitment to free trade and       economic growth.\n\nSo, with my meeting with Prime Minister Nakasone and the       Venice economic summit coming up, it's terribly important…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…high-performance computing, keeping us at the forefront  of research and development.\n\nAdditionally, their collaborative work on nuclear energy is vital to  establishing a long-term human presence on the Moon and next-generation  in-space propulsion. However, these joint technological breakthroughs  not only aid our space endeavors, but they also can…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…engagement. Through active collaboration with state and federal  partners and elected officials, the district has advanced policies that  strengthen water reliability and promote long-term resource  sustainability. EMWD and I have worked closely to advance critical  water projects in both EMWD's service area, and the arid west.\n\nOn a local level, I have worked…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…collaboration among local water providers. His leadership helped bring  about the creation of Central Iowa Water Works, a new regional utility  model built on cooperation and long-term planning.\n\nTed guided the DMWW through both steady progress and unforeseen  challenges, including the COVID-19 pandemic. At a time when basic  services could not be taken…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…applauding this. I have talked to Memphians who have been  here this week, and they are so pleased to see the President's  commitment so that they know this is going to be a long-term effort to  make certain that we address crime.\n\nNow, in the Senate, we have several bills that are supporting this  effort. My Ending Cashless Bail in our Nation's Capital…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…shutdown was completely avoidable.  On September 19, House Republicans passed a continuing resolution that  funded critical services and would have given us time to negotiate  long-term solutions. It was a yes vote to keep the government open and  to pay our troops, air traffic controllers, and Federal employees.\n\nEvery Democrat but one voted no. Every Democrat…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…that the LPTA criteria are not always  appropriate for agencies seeking complex or technically innovative  services.\n\nFor instance, this can result in agencies sacrificing long-term value  for short-term savings. We also do not want the LPTA to be used in a  manner that jeopardizes national security.\n\nThis bill requires the Director of the Office of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…enter into a       memorandum of understanding to explore and address the impact       that the record of decision entitled the ``Supplement to the       2016 Glen Canyon Dam Long-Term Experimental and Management       Plan Record of Decision'' and dated July 2024 (referred to in       this section as the ``record of decision'') has on the Upper       Colorado…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Dream.\n\nFor generations, owning a home has symbolized stability,  independence, and opportunity. It strengthens families, builds  communities, and lays the foundation for long-term financial security.\n\nYet, today, that dream feels out of reach for too many, especially  first-time buyers, young families, and those in rural and working-class  communities.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693119/recognizing-national-homeownership-month"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…officials, and our congressional office to realize this long-sought  agreement dating back to the 1796 Treaty with the Seven Nations of  Canada.\n\nThis historic settlement provides long-term certainty and remedies in  terms of lands, land acquisition, payment of past property taxes, and  will greatly benefit our North Country community.\n\nFor the Saint Regis Mohawk…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…them. They teach kids structure, respect, understanding and so much  more in a loving environment. The team really cares, and each member is  deeply invested in the kids' long-term success.\n\nIt is clear Daniel Flores has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690224/recognizing-daniel-flores"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…during these  negotiations, we will send a very strong signal to China that their  tactics will not work.\n\nThat is how we secure better market access for our producers for the  long term. That is exactly what President Trump did in his first term  in the negotiations with China. We worked with him on the Market  Facilitation Program to keep our farmers in…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696017/9999"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…that goes to the  heart of Congress' constitutional responsibility to authorize sustained  military engagements, define the limits of executive authority, and  protect the long-term interests of both the United States and the  Venezuelan people.\n\nNicolas Maduro is a narcoterrorist and international drug trafficker  whose actions led to the addiction…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…appropriations made in advance for such purpose, the Director       of the United States Geological Survey shall establish a       program to--\n\n(1) study the short-term and long-term mechanisms that       cause sinkholes, including extreme storm events, prolonged       droughts causing shifts in water management practices,       aquifer depletion, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…where he advocated  tirelessly for policies that advanced Indian gaming, economic  development, healthcare, higher education, and the preservation of the  Oneida language. His long-term vision was to build a strong,  sustainable economy not solely reliant on gaming and to enhance  communication between tribal governance and the General Tribal Council.\n\nA…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…elevating our national response by coordinating Federal,  State, and community resources. This action by President Trump will  expand access to treatment, to prevention, to long-term recovery, and  support millions of Americans and their families.\n\nThis initiative recognizes what addiction truly is, a chronic,  treatable condition. This comprehensive…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}]