[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of the very  people whom Donald Trump promised to help but whom he has left behind.\n\nFirst, I am honored to welcome Emma Larson, a 12-year-old middle  school student from Long Island with a rare genetic disease which has  been treated thanks to NIH-funded research. Emma was diagnosed with  spinal muscular atrophy as a 1-year-old. At the time, there was…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…sheets to say it doesn't matter.\n\nMr. SCHUMER. Will my colleague yield again?\n\nMr. SCHUMER. So, just today, I visited a nursing home on Staten  Island and a nursing home on Long Island--both in Republican  congressional districts--and I spoke to people there.\n\nAt the nursing home I visited, if Medicaid were cut significantly,  the nursing home would close,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…will vote on a bill to  reduce clean water standards, setting our country back in our fight for  clean water. I worked for three decades to improve the water quality in  the Long Island Sound. Having seen the progress we have made, I know  that we cannot stop our commitment now.\n\nJust last week, I attended a roundtable with Long Island Sound  Citizens Advisory…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693947/protecting-and-preserving-long-island-sound"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Speaker, today, I rise to address the unfair double  taxation that my constituents are facing due to the State and local tax  deduction cap.\n\nHardworking families across Long Island and across our State and many  other States already face some of the highest tax burdens in the  Nation. For 8 years, they have been unfairly penalized and subject to  double…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690752/eliminate-the-salt-cap"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…of H.R. 4275, the bipartisan Coast  Guard Authorization Act of 2025, which includes my provision to improve  navigation in the East Rockaway Inlet off the South Shore of Long  Island and to strengthen maritime drug enforcement in our waters.\n\nMadam Speaker, East Rockaway Inlet is a critical Federal navigation  channel, which Long Islanders rely on for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…visionary leader who turned  an unimaginable tragedy into a lifelong mission to protect others.\n\nCarolyn was a tireless advocate for the South Shore of Nassau County  on Long Island and a fearless champion in the fight against gun  violence. After the heartbreaking loss of her husband and the injuring  of her son in a horrific shooting, Carolyn could…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise to demand that Congress restore the  full State and local tax deduction which would cut taxes for Nassau  County residents.\n\nOn Long Island, we pay some of the highest taxes in the country, and  we send far more to Washington than we get back.\n\nFor the past 8 years, this cap has hiked tax bills for hardworking…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…crash.  Drunk driving remains the leading cause of death on our highways.  Unfortunately, the problem is getting worse every year, despite  interlock devices.\n\nFar too many Long Island families know the pain of a life cut short.  I know several families who have lost their children to drunk drivers.\n\nMr. Chair, these tragedies are absolutely preventable,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699283/amendment-no-1-offered-by-mr-massie"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, this morning, I was informed by New York  law enforcement of multiple bomb threats made against my offices in  Rochester, Binghamton, and Long Island. The bomb threats against my  offices came with the email subject line ``MAGA'' and from an email  address alleging the ``2020 election was rigged.''\n\nLocal and Federal…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697230/political-violence"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…GILLEN. Mr. Speaker, I rise today to raise the alarm on Senate  Republicans' plan to rip Medicaid from 1.5 million New Yorkers,  including children, seniors, and veterans on Long Island.\n\nMr. Speaker, Medicaid is not a luxury. It is a lifeline. In Nassau  County, one in four children depend on Medicaid for their healthcare,  and two in three seniors in…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…States--has       searched for more suitable quarters. Plans to move to the       University of Chicago fell apart, as did those to move to the       University of Pennsylvania, Long Island City in Queens and a       warehouse in Fall River, Mass.\n\nThen came a bit of numismatic serendipity. It just so       happened that Adam M. Levine, the president and director…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…and  mandate Federal agencies to use clear and accessible language in their  contracting opportunities.\n\nI am proud to co-lead this bill, and I thank the gentleman from Long  Island (Mr. LaLota) for working with me to improve the SBA and simplify  the Federal contracting process. Let's continue to empower local  businesses and ensure that every entrepreneur…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…digress.\n\nIn New York's 2lst Congressional District, currently represented by  Congresswoman Elise Stefanik, approximately 44,000 New Yorkers will  lose their healthcare.\n\nIn Long Island, Suffolk County, part of Long Island, currently  represented in Nassau County by two amazing colleagues,  Tom Suozzi and  Laura Gillen, but in Suffolk County, New York's…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…friends. They were pillars in their  department and in their communities, whose courage will never be  forgotten, and their sacrifice will never be in vain.\n\nOn behalf of all of Long Island, we will never forget those who laid  down their lives in service to others. As we mark Police Week, may God  bless the officers who gave up their lives to keep Americans…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…most respected  and well-trained law enforcement agencies in America.\n\nToday, Nassau County law enforcement officers stand as a symbol of  strength, courage, and service to Long Island.\n\nI also recognize the brave NCPD officers who have given all in the  line of duty. They will not be forgotten.\n\nAs we look ahead to the next 100 years of the NCPD, I will…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690168/congratulating-nassau-county-police-departments-100-year-anniversary"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…service to his community. In  his long career in public service, Mr. Ellis has made immense  contributions to keeping Suffolk County safe and prosperous.\n\nSoon after moving to Long Island from Brooklyn as a child, Mr. Ellis  followed the example of service set by his father, who saw combat in  the South Pacific while serving in the Navy during World War II.…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…rise today to honor Kaitlyn Peterson for  her service to the House Committee on Energy and Commerce.\n\nA graduate of the University of Minnesota and native of Massapequa,  Long Island, New York, Kaitlyn began her career in Washington, D.C. as  a Staff Assistant and Deputy Scheduler for former Chairman of the House  Committee on Energy and Commerce, Rep.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Representatives and the Committee on Commerce, Science,       and Transportation of the Senate a report of the navigable       waterway of the East Rockaway Inlet located on Long Island,       New York.\n\n(b) Contents.--The report under subsection (a) shall       include--\n\n(1) an evaluation of potential hazards to navigation       present in the East Rockaway…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…statement, Tower       quoted from conservationist and Republican President Theodore       Roosevelt. I had recently been at Theodore Roosevelt's home,       Sagamore Hill on Long Island, seen the quote and recommended       to Senator Tower for inclusion:       The civilized people of today look back with horror at their       medieval ancestors who wantonly…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…of  Veterans Affairs continues to hide behind a familiar excuse: We don't  have enough data.\n\nLet me tell you what we do have. In 2018, the Northport VA Medical  Center on Long Island, right in the heart of my district, conducted the  first of its kind study on this issue. From a small sample of 50  Vietnam veterans, 24 percent tested positive for exposure…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…cybersecurity, financial crimes enforcement, and  oversight of our adversaries' investments.\n\nIt preserves community development funding to help small businesses  and manufacturers on Long Island grow, create jobs, and strengthen  supply chains without raising taxes.\n\nThis legislation also protects taxpayers by modernizing, not  weaponizing, the IRS. It cuts excessive…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699046/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]