[{"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Respect for Marriage Act, to escorting Former  President Obama during the 2024 Inauguration, Matt was always willing  to seize the opportunity.\n\nA proud University Albany alum and Long Islander, Matt brought the  New York spirit to our office. Given his love for New York, Matt was  always happy to help at events in the district, and I have particularly  found…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…from the criminal element coming  from their city neighbors.\n\nThat is one way for a suburb to act toward the city next door,  although it may make it more difficult for the Long Island Mets fans to  get to Citi Field or the Queens fans of the New York Islanders to get  to UBS Arena. There is another way.\n\nNorth of New York City, Westchester County and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…regional water  supply management while protecting the wilderness area.\n\nIt would also support higher in-stream flows for Cross Creek, reduce  energy consumption, and foster long-term economic benefits for Eagle  County. This is a priority for this community, and I thank  Representative Neguse for his hard work and leadership.\n\nMr. Speaker, I urge my…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Nation approaches the 200th anniversary of its founding, it  is particularly appropriate to assure those persons who live in our  Capital City rights and privileges which have long been enjoyed by most  of their countrymen.''\n\nThe over 700,000 D.C. residents, the majority of whom are Black and  Brown, are capable and worthy of governing themselves.\n\nMr.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…access for students across  Colorado.\n\nAppointed President of Pikes Peak State College in 2001 and later  President of Colorado State University-Pueblo, Chancellor Garcia has  long advocated for expanding higher education access and student- centered programs. Through these roles, he also successfully grew  enrollment and strengthened public-private partnerships.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…publicly congratulate him  on the House floor on assuming the chairmanship of the Energy and  Commerce Committee.\n\nWhat I can tell you about Mr. Guthrie, having known him for a long  time, is he has always acted and led with civility, kindness, and  respect, going all the way back to the time in the State Senate in  Kentucky.\n\nI have never served a day…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…enough is enough?\n\nTo the families who have suffered the unspeakable tragedy of losing a  loved one, I hear you, I see you, and I will not stop fighting for the  change we are long overdue for.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690802/mourning-marshaun-futrell-jr"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…documents from the  Epstein files.\n\nThe DOJ claims it is in full compliance with the Epstein Files  Transparency Act, but that is simply not true. It is just the latest in  a long line of lies and excuses from this administration.\n\nTo date, the DOJ has only released half of the files, in direct  violation of Federal law.\n\nThe survivors of Jeffrey Epstein's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699644/another-trove-of-epstein-files"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…guiding others who are pursuing careers in the field. Her vision and  artistry distinguish her work in family portraits, headshots, and  commercial photography.\n\nMs. Merkling has long demonstrated a deep commitment to the arts. She  previously served as the Co-Executive Director of the Lakeside Legacy  Foundation, an organization dedicated to preserving The…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Ms. RANDALL. Mr. Speaker, as the Representative of a district full of  forests, mountains, and rugged coastlines that are beautiful but often  mean a long drive to the hospital, I know that preserving rural  healthcare access is literally life and death in our communities.\n\nTribal health clinics, federally qualified health centers,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…if they have the time [to call] the       next day.\n\nThat is testimony from the frontlines, from one who works at the  Social Security Administration--lines that are 8 hours long.\n\nOr another:\n\nI went to a [Social Security] office yesterday because I       need[ed] to change my direct deposit for my monthly benefits.       The doors were locked . . .…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and the Federal Highway Administration to examine how to  reduce train noise and vibrations. A GAO report on reducing train noise  and vibrations can help us identify viable, long-term solutions for  communities.\n\nI urge my colleagues to support this bill.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689433/introduction-of-the-train-noise-and-vibrations-reduction-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…only established the Government of the PRC as a  representative for China at the U.N. It did nothing to define or  determine a role for Taiwan.\n\nThis bill codifies what has long been the United States' position;  that is, to oppose Beijing's actions to misinterpret and distort U.N.  Resolution 2758 and enable the United States to empower our partners…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…This includes programs to train first responders who respond to  opioid overdose calls, provide residential treatment to pregnant and  postpartum women, and support people on long-term recovery.\n\nIf Republicans really support these programs, my colleagues should be  opposing the President's budget, which lays out plans to cut the very  programs Republican…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…really deep  bench. KK Arnold came out and provided lots of energy during the game.\n\nIt was just an amazing team led by an amazing coach, Geno Auriemma.  In 2006, which is a long time ago, he already was named to the Hall of  Fame in Springfield, Massachusetts, which usually is reserved for  coaches after they have retired. However, Geno just kind of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…support the solutions presented by H.R.  4922, including the establishment of a website on District of  Columbia's juvenile crime statistics.\n\nPassage of this bill will go a long way to correcting the broken,  soft-on-crime policies here in Washington, D.C., that coddle criminals  and place at risk the good, honest, and hardworking people who call the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Speaker, H.R. 2916 gives the Saint Regis Mohawk Tribe  clarity on their reservation land and resolves a centuries-old  violation of the Non-Intercourse Act. This settlement is long overdue  and widely agreed upon. It is up to Congress to take the final steps  and authorize the settlement.\n\nMr. Speaker, I urge the passage of this bill, and I yield back…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…technological  upgrades. Annual reports on technological challenges and  solutions ensure Congress remains informed and transparency is  maintained.\n\nThis bill will improve long-term financial management by allowing  user fees to be deposited into interest-bearing trust funds. It also  grants the Secretary authority to permit domestic grain inspection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…going to get  the American Government running again and working for the people, as  they deserve.\n\nI am going to close with this. As Speaker, I have the ability to talk  as long as I want, but I am not going to do that tonight. We are not  going to waste any more time of the people.\n\nI am just going to say this. I think that everybody needs to remember…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…magnitude of the range. In particular, we       have determined that a rule is one of general applicability       even if the rule is limited to a specific geographic area, so       long as the rule does not apply to specific, identified       persons or entities. For example, in B-329065, Nov. 15, 2017,       we concluded that the BLM plans at issue were not…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…American Dream.\n\nFor generations, owning a home has symbolized stability,  independence, and opportunity. It strengthens families, builds  communities, and lays the foundation for long-term financial security.\n\nYet, today, that dream feels out of reach for too many, especially  first-time buyers, young families, and those in rural and working-class  communities.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693119/recognizing-national-homeownership-month"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the tide is now turning and that we have a  new day here in America, but it is important that we pass this  legislation to protect the successes of this administration in the long  term.\n\nMr. Speaker, I urge my colleagues to join me in supporting the  American Entrepreneurs First Act.\n\nMr. WILLIAMS of Texas.  Van Duyne).\n\nMs. VAN DYNE. Mr. Speaker, we…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…away.\n\nIt will take years, if not a decade, for western North Carolina to  fully recover from the damage inflicted by Hurricane Helene. Since that  time, while we have come a long way, western North Carolina is still  reeling from the effects of Hurricane Helene and will continue to feel  the effects of that storm for years to come.\n\nIt is important that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…acknowledges our friends and provides robust  assistance for allies, partners like Israel, Egypt, Jordan, Taiwan, and  the Philippines, to name a few.\n\nMr. Chairman, for too long, we have ignored our hemisphere, our  neighbors in our own region. This bill changes that and provides  special emphasis to key partners in the Western Hemisphere who are  aligned…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…world from  Australia to Africa to Japan and back home through the Panama Canal.\n\nHe was honorably discharged with the rank of Seaman 1st class.\n\nAfter the Navy, Edward built a long and successful career in the  floral industry and was known for his love of fishing, golfing,  hunting, and making breakfast for his grandchildren. He was the proud  father…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…accomplish.\n\nAs I have said before--and I will say it again--I am grateful to  President Trump for his leadership and his efforts to end the conflict  that has lasted far too long--for more than 3 years now. During his  first 100 days, President Trump has done more than President Biden did  in 4 years. He has made clear to the Europeans that they need…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…collaboration among local water providers. His leadership helped bring  about the creation of Central Iowa Water Works, a new regional utility  model built on cooperation and long-term planning.\n\nTed guided the DMWW through both steady progress and unforeseen  challenges, including the COVID-19 pandemic. At a time when basic  services could not be taken…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to recommit for all  five bills.\n\nMr. Speaker, the bills before us today are about one thing: getting  the Federal Government out of the way of the American worker.\n\nFor too long, outdated definitions and woke regulatory overreach have  stifled opportunities and created a paperwork trap for the job creators  on our Main Streets. Today, we take a stand…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…will have to be destroyed.  Every hemp seed in the country will have to be destroyed. This is the  most thoughtless, ignorant proposal to an industry that I have seen in  a long, long time.\n\nThe States have made progress, and more progress is coming. Most  States have age limits.\n\nTo add insult to injury, we are given this legislation in an  appropriations…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…our already creaky electric grid. I know South Dakotans were concerned  about the loss of choice and about being forced into electric vehicles  that aren't suitable for the long distances and bitter cold of life on  the Great Plains. So the elimination of this mandate is welcome news in  South Dakota, as I am sure it is for a lot of Americans around…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}]