[{"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Casten, Tlaib,  and Pettersen, introduced a wave of commonsense bills to promote  safety, soundness, and accountability.\n\nSince then, we have been pushing for action that is long overdue, and  I am glad that Chairman Hill agreed to include several of our post- Silicon Valley Bank bills in the housing package.\n\nWe have other good reforms for community financial…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…neighbors the  reparations that they were promised.\n\nThis Juneteenth, I ask everyone in this Chamber to join me in  honoring our Black neighbors by fighting for what is long overdue:  reparations, Black maternal health equity, investments in HBCUs, and  real protections for voting rights.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…lives and get a benefit, yet billionaires can be  excluded and don't have to pay in the same amount or some totally  circumvent the law altogether and pay nothing?\n\nIt is long overdue, Mr. Speaker, don't you agree, for a vote to take  place. For all the citizens in your district, the more than $300  million that comes in, imagine what that does to the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…memorial in our Nation's Capital honoring John Adams, John  Quincy Adams, both Presidents, and their family, and their leading role  in shaping our country. This recognition is long overdue.\n\nIn closing, I urge my colleagues on both sides of the aisle to  support this act, and I thank you for the time and courtesy.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…is that, in the  Speaker's district in Minnesota, $325 million per month goes to those  Social Security recipients. It hasn't been adjusted in more than 50  years.\n\nIt is long overdue for Congress and for the citizens of this country  to demand of their Congress that they take a vote to let the people  know where they stand. Members should let the people…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Passed in Committee with overwhelming bipartisan support, H.R. 6644  sets the stage for building and preserving more affordable homes in our  neighborhood. It makes many long overdue improvements to housing  programs, expands local development opportunities, and broadens access  to homeownership.\n\nH.R. 6644 also includes a dozen bipartisan provisions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…will be a powerful one. She will be the  218th and final signature on the discharge petition to force the Trump  administration to release the Epstein files, delivering long overdue  justice and accountability for hundreds of victims abused by rich and  powerful men.\n\nShe is a smart, principled fighter through and through.\n\nMr. Speaker, it is my honor…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…We also make sure that there is no longer a waiting  period for disability where we see that so many people have died  waiting to receive their disability payment.\n\nIt is long overdue for the number one antipoverty program for the  elderly  and for children of this country. More disability goes out to veterans  from Social Security than goes out from…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Venezuela into a failed state, one that has caused  terrible suffering and misery for the people who live there. This is  not the question at hand. As I have long said, it is long overdue that  the result of last year's elections be respected in Venezuela.\n\nBut let me be clear on a position I have also held for a long time  regardless of who has been in the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Richard Nixon was President of the United States the  last time Social Security benefits were extended for your constituents  as well as my constituents in Connecticut.\n\nIt is long overdue. We have a COLA that doesn't work. We have people  that continue to work after they receive Social Security that are taxed  on their benefits. We have had teachers and firefighters…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Tribal leadership. This is Congress  fulfilling its promise.\n\nI am proud to champion this bill, and I urge my colleagues to support  its passage. Restoring Allotment 1157 is long overdue, and moving this  legislation forward is a meaningful step toward justice.\n\nI thank my partners in this work for their support, voices, and  stories. They are essential…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the President's own  personal legacy. And we in Congress should finally move this week to  pass the Russian sanctions bill, which I understand has 85 cosponsors.  It is long overdue. Let's do it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the D.C. flag whenever the flags of the  states are displayed. Legislation gave D.C. a coin after D.C. was  omitted from legislation creating coins for the states. It is long  overdue to display the D.C. seal with the seals of the states in the  Main Reading Room.\n\nI urge my colleagues to support this bill.", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…This plan will make it easy for our families to afford the  basics. I hear it from them: Formula, diapers, and childcare are all  out of control. It will provide, again, a long-overdue safety net for  our families.\n\nWe know right now this bill, the End Child Poverty Act, is estimated  to cut child poverty by 50 percent according to the People's Policy…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…enemies like China choose to invest in themselves. I also can't support  a bill that paves the road to VA privatization. Perish that thought.\n\nWhile I have the time, it is long overdue for the Department of  Veterans Affairs to approve the request from northwest Ohio to expedite  the dual affiliation of the University of Toledo Medical Center and the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…of the one big, beautiful bill to deliver on the  mandate the country gave us on November 5, 2024. In total, we saved  American taxpayers more than $295 billion and made long overdue  investments to support the farmers, ranchers, and agricultural  producers of the Big First and all of rural America. I am very proud of  all that we were able to accomplish.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…a lifeline to the agricultural  community by updating reference prices, expanding crop insurance, and  saving millions of family farms from the death tax. The relief was long  overdue. We are grateful, but the work doesn't stop there.\n\nIt is past time for Congress to pass a fiscally conservative 5-year  farm bill, including support for agricultural research…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…injection of transparency, accountability, and  clarity to foreign gift reporting requirements for colleges and  universities. It offers legislative prescriptions that are long  overdue.\n\nUnder current law, section 117 of the Higher Education Act, colleges  and universities must adhere to reporting requirements related to  foreign donations. However, many…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…PERMIT Act introduced by my  good friend and chairman of the Water Resources and Environment  Subcommittee, Congressman  Mike Collins.\n\nThis bold legislation delivers a long-overdue blow to the radical  environmental agenda that has weaponized the Clean Water Act, paving  the way for critical infrastructure projects to move forward and be  free from…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Trump has promised.                Restoring Fairness in Prescription Drug Market\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to speak on the  meaningful and long-overdue step toward restoring fairness and  transparency in our prescription drug market by passing the  Consolidated Appropriations Act of 2026, now signed into law by  President…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I rise today to recognize the 1984  Walla Walla High School girls' basketball team and to celebrate the  long-overdue recognition of their State championship victory.\n\nThe 1979 and 1984 Walla Walla High girls' teams remain the only State  basketball champions in Wa-Hi history. Yet, for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…violent crime before trial, and it  would impose cash bail or bail bonds on anyone charged with a range of  public safety or law-and-order offenses.\n\nThis is a smart and long overdue reform that rectifies the ill- conceived policies currently enacted in the District.\n\nI urge all of my colleagues to support this commonsense public safety  bill, and I…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Amtrak. These facilities are  common on other transportation modes, including airlines. They are  likewise necessary on intercity passenger rails.\n\nThe bipartisan bill is a long, overdue improvement to Amtrak service.\n\nMr. Speaker, I urge support of this legislation, and I reserve the  balance of my time.\n\nMr. EZELL. Mr. Speaker, I have no further speakers.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…times larger since  the end of the Chinese Civil War. The island has crucial insights to  offer an institution that seeks to put its borrowers on stable footing.  It is long overdue for Taiwan to receive the recognition and  representation it rightfully deserves at the IMF.\n\nMr. Speaker, I urge all my colleagues to join me in supporting H.R.\n\nMrs. WAGNER.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Honoring Vietnam Veteran John Gilman\n\nMr. BAUMGARTNER. Mr. Speaker, few moments as a Member of Congress are  more meaningful than helping a hero receive long-overdue recognition.  Recently, my office had the privilege of assisting Vietnam veteran John  Gilman in securing the Silver Star Medal he earned more than 50 years  ago, an honor…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…straightforward. We are here to cut  burdensome red tape and regulatory overreach that leads to higher  energy costs for Americans. Commonsense reforms like these are simple  and long overdue.\n\nWe are also here to move an appropriations package that provides  critical funding and returns us to more responsible spending levels  while delivering for the American…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…protecting investors.\n\nAccording to Joel Trotter, one of the authors of the JOBS Act,  ``Decades of successful experience show that the well-known seasoned  issuer category is long overdue for expansion.''\n\nI couldn't agree more, and this bill does exactly that. It lowers the  size threshold for WKSI qualification while maintaining all the  existing good governance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…significant challenges, including  rising geopolitical tensions, maritime disputes, and growing coercion  from bad actors seeking to undermine a rules-based order.\n\nThis bill is long overdue and sends a strong message that the United  States will stand shoulder to shoulder with our friends, including our  Indo-Pacific partners, from the Philippines to Palau,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the Chinese Communist  Party, must end. I think we can all agree that they have to come to an  end.\n\nThe legislation before us today, the Falun Gong Protection Act, takes  long-overdue action to confront this horror. It directs the U.S.  Government to identify and publicly name individuals and entities  involved in forced organ harvesting in China. It…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…yielding.\n\nMr. Speaker, I have not seen a perfect bill since I have been in  Congress, but this is a pretty good bill. It is an important bill.  Regulating stablecoins is long overdue at the Federal level, but make  no mistake, stablecoins aren't new.\n\nThe New York Department of Financial Services has regulated  stablecoins in the State of New York since…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]