[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…mass layoffs. What they are doing at Social Security--DOGE and the  Trump people--they are afraid to say they want to kill it, so they try  to strangle it--closed offices, longer wait times, phone lines  disrupted, emails disrupted.\n\nMr. Bisignano's nomination is another reminder that Donald Trump's  chaos is made possible thanks to the complicity of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690683/nomination-of-frank-bisignano"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…of the providers caring for them.\n\nTo the point that my colleague from Delaware asked:\n\nSlashing funding would mean fewer healthcare providers,       fewer services, and longer wait times for patients who       already--\n\nWho already--       face significant barriers to care. These cuts will impact the       37 million children on the Medicaid Program,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…vulnerable. From global financial markets to New Hampshire  supermarkets, consumers and businesses aren't sure what to expect.\n\nThey are looking at higher prices, at layoffs, at longer wait times,  and at uncertainty, which many businessowners I have talked to tell me  it is just as bad as higher tariffs because they don't know what to  expect, and they can't…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…to March 28th of 2025 as National Area Health Education Centers  Week, or AHEC week.\n\nSouthern Nevadans are facing a dire shortage of health care  providers, which means longer wait times, fewer choices, and less  access to quality care. To solve this crisis, underserved communities  like ours need to expand the resources we offer so that medical  providers…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689206/recognizing-national-area-health-education-centers-week"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…are  real lives on the line.\n\nOverall, the big, ugly bill will take away healthcare coverage from  16 million people. When people lose coverage, they get sicker, there  are longer wait times, hospital visits rise, and costs skyrocket for  families and the entire system.\n\nHouse Democrats are fighting for a different vision. We are fighting  to make sure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695218/millionaires-tax-breaks-in-big-ugly-bill"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…stay open. It means working  people in Delaware will skip doctors' appointments because they have  lost their insurance, only to end up in the emergency room and facing  longer wait times and crushing medical bills.\n\nRural hospitals are left to absorb the costs while patients are  burdened with life-altering debt, and, yes, it means more preventable…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…from Utah.\n\nAcross the country, and especially in Texas, families are feeling the  strain of a healthcare system that simply does not have enough trained  professionals. Longer wait times, higher costs, and fewer options for  care are symptoms of a workforce that is stretched far beyond its  limits.\n\nOur bill takes a commonsense approach to address…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697515/supporting-healthcare-apprenticeships"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…death.\n\nThat was until 2 months ago.\n\nUnder the banner of government efficiency and the claim to reduce  waste, DOGE has fired three of the five investigators, which means  longer wait times for our first responders who deserve answers as to  how their brothers and sisters died in the line of duty and,  critically, what changes need to be made to prevent…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…get help by the website that frequently crashes and presents  access barriers to the elderly. Nor can they get help in person given  the increased distance to offices and longer wait times due to dramatic  staff cuts and office closures.\n\nAt the time when the greatest number of baby boomers are retiring and  need the most help and when SSA already is…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…for  Disease Control who protected children from lead poisoning and air  pollution, among other services. Staff cuts at the Social Security  Administration have resulted in longer wait times for seniors applying  for benefits.\n\nI have been proud to join legal briefs filed against the  administration, which are resulting in the reinstatement of thousands…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692075/illegal-cutting-of-federal-workforce"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…fired, are being fired.\n\nNot only are we talking about firing 6,000 veterans, but we are also  talking about cutting their services, cutting their medical services,  forcing longer wait times for them because when they call, when they go  to the VA to get help, there will be fewer people there to help them.\n\nI think about the veterans in my district that…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…services.\n\nLet me be clear. The United States Postal Service does not use  taxpayers dollars for operating costs. Reducing post office locations  will lead to slower service, longer wait times, and delays in receiving  packages, medications, and other necessary deliveries.\n\nI urge the Postmaster General to reverse the decision to terminate  the Quartz Hill…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692996/closure-of-quartz-hill-post-office"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…over 5 million people depend on Medicaid.  They are children with disabilities, working moms, and aging parents in  nursing homes. These cuts will lead to fewer doctors, longer wait  times, and hospitals closing. Yes, people will die because they can't  get the care that they need.\n\nMr. Speaker, let me tell you about Stephanie, a mom from Richardson,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…terminations, they  are not just numbers on a spreadsheet; they are real people who execute  a mission serving veterans. And these layoffs--these layoffs are going  to mean longer wait times for appointments, fewer options for mental  health care, fewer options for pain management, more delays in  processing benefits.\n\nIs this really where Elon Musk and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and in  particular Farouk Ophaso and Tyler Coe.\n\nI am opposed to this bill, which will transfer billions of taxpayer  dollars to private hospitals and clinics, leading to longer wait lines,  poorer communication and coordination, a diminished quality of care for  our veterans, and higher costs for taxpayers.\n\nThis is a step toward privatization of the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…afford to come  here and pay for the services. I have highlighted before how Canadians'  cancer patients are coming to America for treatment. Socialized  medicine leads to longer wait times and scarce resources. Let this be  another reminder of socialized medicine's failures.", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698485/healthcare"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I will be brief. It has been a longer wait  than expected, but I am excited that the CLARITY Act has finally made  it to the House floor for debate.\n\nThe CLARITY Act is not just about digital assets like bitcoin.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693780/digital-asset-market-clarity-act-of-2025"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…that they can continue  to prescribe medically necessary treatments to veterans via  telemedicine.\n\nFor veterans in our urban communities, letting this waiver expire  means longer wait times, fewer appointment slots, and even more strain  on an already overburdened VA system.\n\nFor veterans in rural America, the consequences are even more  serious. Many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}]