[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of Greek Orthodox constituents who call  the Massachusetts 7th Congressional District home and the more than 300  million followers worldwide, it is an honor to host the longest serving  Archbishop of Constantinople in the Church's history and a humbling  opportunity to say thank you for his efforts on behalf of the entire  human family. Since being elevated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…honorable discharge,  Paul began a long and respected career at the University of California,  Santa Barbara, where he worked for over four decades, retiring in 1990  as the longest-serving employee in the campus' history.\n\nPaul married Gladys Cota in 1958, becoming a devoted husband and  loving father to Marcia, Ronald, and Paula. Known fondly as ``Uncle…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…intersection of religion and  science. He joins a distinguished group of past recipients, including  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nAs the longest-serving Archbishop of Constantinople in over two  millennia, All-Holiness Ecumenical Patriarch Bartholomew embodies the  values of faith, service, and moral leadership. His life's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…was elected the 270th  Archbishop of Constantinople and Ecumenical Patriarch in October 1991.  Today he leads a community of 300 million Orthodox Christians and is  the longest serving archbishop in the church's 2,000-year history.  Patriarch Bartholomew pursued theological studies in Istanbul, Rome,  Switzerland, Germany, and Greece, earning a doctorate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695550/recognizing-his-all-holiness-bartholomew-archbishop-of-constantinople-and-ecumenical-patriarch"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Once again, I join with Rhode Island's vibrant and important Greek  community to welcome His All-Holiness Ecumenical Patriarch Bartholomew  to our Nation's Capital. As the longest serving Ecumenical Patriarch he  has cemented himself as an influential leader who is highly respected  within Orthodox Christian communities and beyond.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695453/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…include, of  course, Speaker Emerita Nancy Pelosi, Steny Hoyer, the great  Jim  Clyburn, Maxine Waters, Elijah Cummings, and Charlie Rangel.\n\nOur own Marcy Kaptur is the longest serving woman in the history of  the United States House of Representatives. We have all had the  opportunity to serve with legendary Members like John Dingell. As I  said, they…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Speaker, I rise today to warmly  welcome the spiritual head of the Eastern Orthodox Church, His All- Holiness Ecumenical Patriarch Bartholomew, to Washington, D.C.\n\nThe longest-serving Archbishop of Constantinople in the history of  Christianity, the Ecumenical Patriarch will arrive in the United States  this month to receive the distinguished Templeton…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Mr. Speaker, it is my honor to recognize Dorothy Giamboi  on her conclusion of service to the Borough of Metuchen Council. After  fourteen years, Dorothy stands as the longest-serving Council Member in  Metuchen's history. Please join me in celebrating my long-time friend,  Dorothy Giamboi, for her outstanding contributions to the community.\n\nSince…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…trust in John  Bowens and elected him, Sheriff. That trust was repaid every day, for  32 years. He served longer than any sheriff in the county's history and  became the longest-serving African American sheriff elected in the  State of Georgia. But these distinctions tell only part of the story.  What mattered most to those who knew him was not the record…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…the spiritual leader and       Primus inter pares (``Fast among Equals'') of Orthodox       Christianity worldwide--a Church of 30 million individuals--      and is the longest-serving Archbishop of Constantinople;\n\nWhereas, in 1997, His All-Holiness was awarded the       Congressional Gold Medal and declared that pollution,       deforestation, and…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…towering figure  in Ohio's politics and history and a trailblazer for women across Ohio  and our Nation.\n\nBorn and raised in Toledo, Ohio, Marigene broke barriers as the  longest serving woman in the history of the Ohio Legislature. With her  intelligence, fierce conviction, and unmatched oratory--she was a tough  lawyer--she served our community for 24…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Richmond, and Raleigh  before he returned to Philadelphia in 1994. He would go on to serve as  the President and General Manager of WPVI beginning in 2007, making him  the longest-serving General Manager in the station's history.\n\nThroughout the entirety of his tenure, Prazenica played a critical  role in maintaining WPVI's status as the home of the most-watched…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Director of WXXI, who  will retire at the end of March. With over 45 years in journalism, he  is leaving an indelible mark on the industry and our community as one  of the longest-serving news directors in all of New York State.\n\nRandy oversees WXXI's daily news operations across radio and digital  platforms, all while reporting on local issues himself.…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688914/recognizing-randy-gorbmans-retirement"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…that he knows their names, their stories, and their teams.  They know he will make sure they leave with enough food for the week  and maybe a little extra.\n\nFresh is the longest serving employee at the Food Bank of Delaware.  He is a model for compassion, the kind that strengthens communities,  especially when families are stretched thin.\n\nToday and every…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Patriarch, who visits the United  States this week to receive the prestigious Templeton Prize. As the  spiritual leader of 300 million Orthodox Christians worldwide and the  longest-serving Archbishop of Constantinople in the Church's two- thousand-year history, His All-Holiness distinguishes himself as a  global advocate for peace, reconciliation, and religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…serve his community  by joining the Congers Fire Department, eventually serving as their  fire chief, becoming the oldest fire chief in the department's history  and its longest serving member.\n\nAl continued to serve his community by providing leadership at the  county level, helping guide emergency response efforts, mentoring  future firefighters, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…the Orthodox Church  to our Nation's Capital. Ecumenical Patriarch Bartholomew has been on  the forefront of religious freedom for his entire ministry, and now as  the longest serving Archbishop of Constantinople in the two millennia  history of Christianity, he has worked to bring people together for the  purpose of advancing greater cooperation and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695570/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…well-known role was through his service to the  Orange County Farm Bureau. Bobby served in every position within Orange  County Bureau and holds the distinct honor of the longest serving  President. After his service on the Board of Directors, he continued  devoting his time to the Farm Bureau as Executive Director, a position  he held for 38 years.\n\nAside…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "Mr. SCALISE. Mr. Speaker, I rise today to honor and thank one of the  longest-serving members of Team Scalise, a graduate of the University  of Louisiana at Lafayette, and a native of Louisiana's 1st  Congressional District, Mitchell Shea.\n\nMitchell first…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to welcome today's  guest chaplain, my friend, Rabbi Pinchus Ciment.\n\nRabbi Ciment is the director of Chabad Lubavitch of Arkansas in  Little Rock and is currently the longest serving rabbi in our State.\n\nHe was born in Boston, Massachusetts, and moved to Little Rock with  his wife in 1992.\n\nRabbi Ciment has lectured on matters in Judaism at several…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689253/welcoming-guest-chaplain-rabbi-pinchus-ciment"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…secured this  funding and remain committed to strengthening healthcare access and  training across Iowa.\n\nMr. Speaker, I wish a very happy birthday to Ambassador and Iowa's  longest-serving Governor, Governor Terry Branstad. Happy birthday,  Ambassador and Governor Branstad.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696799/recognizing-jones-regional-medical-center-project-funding"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Circuit Judge for 3 years and as a Circuit Judge for 8 years. In 1986,  Judge Knecht was elected to the Illinois Fourth District Appellate  Court. Currently, he is the longest serving judge in Illinois court  history and an accredited leader within the Illinois law community. He  is a member of the Illinois State and McLean County Bar Associations,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…associate  circuit judge and was soon after promoted to circuit judge. In 1986,  Judge Knecht was elected to the Illinois Fourth District Appellate  Court. He is currently the longest serving judge in Illinois court  history and an accredited leader within our Illinois legal community.\n\nOutside of the courtroom, Judge Knecht is heavily involved in  communities…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…liberty, engaging in dialogues with leaders of Judaism,  Christianity, and Islam. Moreover, he leads a congregation of 300  million church members worldwide and is the longest-serving Patriarch  in the two-millennia history of the Church. We are blessed to have him  here in Washington, D.C. this week.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695624/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…environmental protection, have justly placed him at the  forefront of global visionaries as an apostle of love, peace, and  reconciliation.\n\nWe are privileged to host the longest-serving Archbishop of  Constantinople in history here in our Nation's Capital, as he meets  with the President, Secretary of State, and Congress. His visit to the  United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Kevin  Kallinen, who retired on August 13, for his remarkable 45\\1/2\\ years of  service to the Grand Forks Police Department.\n\nSergeant Kallinen holds the record as the longest serving sworn  officer in the department's history, a distinction earned through  dedication, remaining calm under pressure, and an unwavering commitment  to public safety.\n\nHe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695062/congratulating-sergeant-kevin-kallinen"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…liberty, engaging in dialogues with leaders of Judaism,  Christianity, and Islam. Moreover, he leads a congregation of 300  million church members worldwide and is the longest-serving Patriarch  in the two-millennia history of the Church. We are blessed to have him  here in Washington, D.C. this week.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695798/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…the Apostle Andrew. For more than three decades, he has  stood at the forefront of the cause of religious freedom, interfaith  dialogue, and peacebuilding, making him the longest-serving Archbishop  of Constantinople in the history of Christianity.\n\nBorn Demetrios Arhondonis in 1940 on an island in Turkey, His All- Holiness Ecumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, I rise today to recognize James Collins for  his extraordinary twenty-year tenure as President of Loras College. As  the longest-serving president in Loras college's 185-year history,  Collins has left an indelible mark on Iowa's oldest institution of  higher education.\n\nCollins earned his Bachelor of Science…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Primus inter Pares (First among Equals) of more  than 300 million Orthodox Christians worldwide. For decades. he has  been a tireless voice for religious freedom, and as the longest serving  Archbishop of Constantinople in two millennia of Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}]