[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…being able to  because halfway through taking in a deep breath, your chest would  tighten up. You literally choke because of the pollution in the air.  While we have come a long way, for too many Californians today, that is  still a reality. It doesn't have to be that way.\n\nBut that is why, decades ago, Congress recognized both California's  unique air…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…opioid epidemic. Thankfully, there is hope. Overdose deaths dropped by  24 percent from September 2023 to September 2024, and while that's  something to celebrate, we have a long way to go.\n\nThe 33 regional HIDTAs across the country are comprised of federal,  state, and local partners, resulting in robust interagency coordination  to respond to the most…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…fact, he is here talking about not being in support of  big bank mergers because he is trying so hard to get more community  banks. We need more community banks, but he is a long way from getting  what he is talking about.\n\nThe fact is, we really do need them because of the big bank mergers.  One of the things he could do to increase having community banks…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…effort by Trump and his Republican enablers to lay  the groundwork for the rigging of upcoming elections, including the  midterms this November. Now, November might seem like a long way off,  but the midterms have already begun. Primary ballots have been mailed  out in many jurisdictions, and the first round of early voting begins  today in some jurisdictions.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…made some small steps toward providing overdue  compensation to these Americans, the first and the most consistent  victims of our nuclear weapons program, but we still are a long way  from justice.\n\nMr. Speaker, I thank Mr. McGovern for hosting this Special Order hour  tonight and for his years of principled leadership on this issue.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…healthcare system in the United States, timely  and appropriate, especially considering our current state of affairs.\n\nWith this win comes a $100,000 college fund, which will go a long way  to help him attend his dream school, Yale University. Aarit aspires to  become a lawyer and ultimately land an appointment as a Justice of the  Supreme Court of the United…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…first time serving in our United States Senate, and 58  House Members in this Congress, the largest in our history. As we say  in the Baptist church, we have come a mighty long way. From 1971, when  13 Members sat on this House floor, 12 Black men from across this  Nation and one brave, courageous, bad sister, Shirley Chisholm. My,  have we come a long…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687896/black-history-month"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…later this morning. But for now, I simply  want to thank all the survivors and family members who are here today  at the Capitol. Their courage is inspiring. They have come a long way  from across the country, taking red eyes and flying overnight so they  can be here for this important moment. Their decision to be here today,  to push Virginia's Law, will…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…is about  strengthening the support systems around them: the women who care for  them, the employers who depend on them, and the families who love them.  However, we have a long way to go.\n\nDid you know that only 49 percent of men in the U.S. aged 21 and  older had a routine doctor's appointment or cancer screening in the  past year? These are dismal…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…development centers and women's business  centers to provide educational information to small businesses about  career and technical education programs, this bill will go a long way  in meeting the labor needs of small businesses and also giving the  graduates of CTE programs the tools they need to launch and grow their  own successful startups.\n\nMr.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691730/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…advocating for solutions  that are informed by the voices of those who are most affected by  climate disasters.\n\nLos Angeles has made progress in recovery, but we still have a long  way to go. This is why my California Democratic Caucus colleagues and I  are urging the Trump administration to deliver nearly $34 billion in  disaster funding to help Californians…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…schools open, and emergency services running. Secure Rural  Schools was meant to be a bridge and not the final answer for our rural  communities.\n\nMr. Speaker, we still have a long way to go to deliver on the  investments and job opportunities that rural America needs and  deserves. I know it is one of my top priorities in Congress, along with  many of my…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697662/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…flows through  the UAE.\n\nThe United States needs to stand up and say enough is enough.\n\nFor people who say ``Well, what difference does it make? That is  Africa. That is a long way away from the United States. Why does it  matter?'' well, because, sadly, what happens in Africa, what happens in  Sudan doesn't stay in Sudan. If you can't be outraged because…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…that this bill may not capture every need that is  out there--I concede to our ranking member, who I respect greatly, that  we have much work to do. However, this bill goes a long way to fix an  issue that can simply not wait any longer to be addressed. I urge  support for this measure.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698179/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…circumstance  that could justify the use of nuclear weapons to deal with a nonnuclear  threat.\n\nRemoving the specter of the U.S. using nuclear weapons first in a  conflict would go a long way toward slowing down this renewed global  arms race. I am so glad to see my colleagues here share my concerns. I  hope we can make a dent in the common sense here in this Congress.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Corder was killed, we suffered another savage  murder in Milwaukee.\n\nWhen I was a child, Milwaukee was the safest of the 25 biggest cities  in this country. We have gone a long way from that. I hope this House  addresses the root causes of why we have so much more crime in our  major cities than we did 25 years ago.\n\nAlso while I was at home, I ran into…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693490/events-in-milwaukee"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…end bureaucratic  inertia. It also puts in place a system that will deliver capability to  the warfighter at the speed and scale that we need.\n\nFixing acquisitions will go a long way toward ensuring our  warfighters are the most capable fighting force on the planet.\n\nProperly equipping our warfighters is critical, but so is ensuring we  recruit and retain…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…pay calculations that increase costs and burdensome regulations for the  company.\n\nThis guidance is so outdated. It was enacted in 1938, and we all know  things have come a long way since then when families did not use  daycare services for their little ones and elderly parents lived with  their adult children until death.\n\nThe current mandates of the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…away.\n\nIt will take years, if not a decade, for western North Carolina to  fully recover from the damage inflicted by Hurricane Helene. Since that  time, while we have come a long way, western North Carolina is still  reeling from the effects of Hurricane Helene and will continue to feel  the effects of that storm for years to come.\n\nIt is important that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Cheyenne, and Riverton,  serving our Nation. They are doing an outstanding job in their work and  supporting missions in Europe, in Asia, and in the Middle East. They  are a long way from home--eight time zones away from Wyoming--away from  family, away from friends, away for the holidays.\n\nAnd I go every year, wherever I can find Wyoming troops, to thank…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Ways and Means, I know  Representative Grothman to be a tireless advocate for American  taxpayers, as represented by this important piece of legislation that  will go a very long way toward protecting their rights.\n\nThe legislation ensures that rogue IRS employees are not able to  unfairly impose penalties and fines on taxpayers without going through…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…law.\n\nIn California, U.S. Attorney Bill Essayli has found a way to  circumvent effectively the sanctuary State using the powers of Federal  law enforcement, so we have come a long way toward ending the disgrace  of the sanctuary State in California.\n\nWhen it comes to California's failing public schools, which are just  about the worst in the entire country,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…support the solutions presented by H.R.  4922, including the establishment of a website on District of  Columbia's juvenile crime statistics.\n\nPassage of this bill will go a long way to correcting the broken,  soft-on-crime policies here in Washington, D.C., that coddle criminals  and place at risk the good, honest, and hardworking people who call the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…could not get rid of him. I am  incredibly thankful that he stuck it out because this entire body has  benefited from his public service and his expertise.\n\nJack has come a long way from his days as an intern. He went on to  serve as my legislative director in my congressional office. For the  last 6\\1/2\\ years, he has been with me at the T&I Committee,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…visionary, fearless President, Donald J. Trump.\n\nPresident Trump is the creator and the champion of the America First  agenda. We will deliver upon that today. We have come a long way. We  began this process really about 15 months ago. We had a sense, and we  believed that we would have unified government. We would have this  moment where the Republican…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…their Federal highway funds, shall not impose a gas tax  higher than 50 cents on their residents. I think this will give our  drivers, especially those who have to commute a long way to work, who  live in rural areas some much-needed relief and be a much-needed check- and-balance against the politicians in Sacramento who continue to  demand of citizens…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…these  issues poses significant challenges for Mills as it continues to grow,  develop, and attract new residents across Wyoming and beyond.\n\nPassage of this bill will go a long way to correct this oversight,  not only for Mills but for communities nationwide.\n\nThe city of Mills has been a tireless advocate for this legislation,  and I am immensely proud…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693862/establishing-new-zip-codes"}, {"senator": "John Thune", "party": "Republican", "sentence": "…faced for simply trying to do their jobs.\n\nThe President's border czar Tom Homan recently traveled to  Minneapolis at the President's request, and his efforts have gone a  long way to restoring order in that city and ensuring immigration  operations can be carried out safely.\n\nOne thing he is trying to accomplish is increased cooperation between  local…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…President Biden's failed leadership  where 8,000 illegal immigrants were apprehended in one day. It is  amazing. Deploying common sense and actually enforcing the law goes a  long way.\n\nHouse Republicans passed legislation like the Laken Riley Act and the  Violence Against Women by Illegal Aliens Act that protect American  citizens. That is what Americans…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…include the Senate, to do the  best we can on the legislative side in enabling resources to be focused  on research that enables that individual growth to occur.\n\nWe are a long way from getting to the point where we can say we are  done with this. We will never be done with it. There will always be new  advancements in therapy, new advancements in dealing…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}]