[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…go up by more than $1,600 every single  month.\n\nThe Republican plan: talk about it; do nothing. For all of us who  have been here, we have been waiting for the plan for a long time and  have never seen it--have never seen it. It is always just a plan.\n\nRebecca in Seattle will see her premium increase by more than $1,700  a month.\n\nBy the way, that plan…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "Mr. HOYER. Mr. Speaker, I thank my friend for yielding. He and I have  known each other for some 60 years. We have served in this body for a  very long time.\n\nI can remember two events. One was on September 11, 2001, and we  were, as the gentleman observed, attacked by an enemy from without.  That was horrific. America lost thousands…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Speaker, the first thing I will say is we have mentioned  repeatedly ``acquisition reform,'' which is such a huge part of this  bill and such a major undertaking. It took a long time. We held a lot  of meetings with a lot of different defense contractors, think tanks,  and former people at the Pentagon to really get an understanding of  exactly what is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…ashamed to be a part of this Congress, but I will be because  people need to stand up, speak the truth, and stand up for things that  the American people have stood for for a long time like justice, due  process, fairness, caring about the little guy, and caring about giving  people something who have not enough but not something to people who  have too…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694052/this-congress-deserves-an-f"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…national labs to be able to go in there and do what is  called nuclear forensics and find out whether that was a bomb from X,  Y, or Z. That capacity has been under duress for a long time. It seems  like it is every single time the appropriations budgets come up, we end  up having to try to defend that.\n\nThat is something that is completely irrelevant until…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…publicly congratulate him  on the House floor on assuming the chairmanship of the Energy and  Commerce Committee.\n\nWhat I can tell you about Mr. Guthrie, having known him for a long  time, is he has always acted and led with civility, kindness, and  respect, going all the way back to the time in the State Senate in  Kentucky.\n\nI have never served a day of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…congratulations to my dear cousin and  high school classmate, Cora Henderson, and her husband Floyd, on the  occasion of their 65th wedding anniversary. Sixty-five years is a long  time.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698272/expressing-condolences-and-congratulations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in for a long, tedious, and  exhausting night as Donald Trump is set to deliver his fourth State of  the Union.\n\nDonald Trump said yesterday he is going to talk for a very long time  tonight.\n\nGod help us.\n\nI am not sure what he thinks there is to celebrate, because America,  in short, is a mess thanks to him. American Presidents often talk about  how…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…over fifteen years. During his  mayorship, he worked on amazing projects, such as renovating the Harvey  House Museum, establishing a Festival of Trees, and providing the long- time display of the Bugg Lights. His work has not only improved the  city but established a community where people can look forward to  raising their children, supporting their…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I am so happy to be back. This is our  first week back in a long time, and it is great to see all my  colleagues since the House was closed during this entire shutdown.\n\nI was so excited when I started hearing from the President and the  other…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697138/affordability"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…despite threats to them and their family.\n\nThere is courage everywhere we look. We have not yet lost our power.  So many Americans have been sounding the alarm bell for a long time,  and they have been right.\n\nWe have now reached the inflection point.\n\nNow is the time for us to stand firm and for us to stand with them,  and for all of us to stand with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…tax cut for the wealthy.\n\nThe scope of this is just enormous, Senator Booker. So I guess this  is the question I wanted to ask you. You and I have been in government  for a long time. We have served in a variety of different capacities.\n\nI don't think this country is really ready for the scope of the  healthcare cataclysm that could come with a trillion-dollar…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…resilience.\n\nMost importantly and lastly: It would share the economic benefits of  clean energy with host communities.\n\nIt is a good bill. It is one that we worked on for a long time, and  we are going to get as much support as we can.\n\nMr. LEVIN. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, I certainly thank my good friend from Ohio,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…showing  the American people how horrible this administration is treating  average families--working families--in so many ways, and I know he  intends to hold the floor for a long time to make sure that that is the  case in letting America know how bad this is.\n\nNow, our healthcare is the main focus right now, and it is amazing, I  would say to my colleague:…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…taxes; they  included literacy tests; they included civics exams--rigged so that  only White Americans could pass. But we remedied that situation. We  took it on. It took a long time, unfortunately.\n\nIn the 1960s, Members of this Chamber and Members of the Chamber down  the hall said we are ready to end that discrimination that we knew all  along was…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have to be destroyed.  Every hemp seed in the country will have to be destroyed. This is the  most thoughtless, ignorant proposal to an industry that I have seen in  a long, long time.\n\nThe States have made progress, and more progress is coming. Most  States have age limits.\n\nTo add insult to injury, we are given this legislation in an  appropriations…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…perimeter.\n\nFor his valor, Clyde was awarded numerous honors. The one he was the  most proud of was the Combat Infantryman Badge. That was a few years  into a young man's life, a long time ago, like so many of the boys who  were asked to and did the impossible: storming the beaches of Normandy,  liberating concentration camps, and island-hopping across the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Speaker, I rise today in strong support of the passage of the  GENIUS Act, and I thank Chairman Hill for his extraordinary leadership,  not just in this Congress, but for a long time advocating for this  moment. He deserves a tremendous amount of credit for persevering and  working and marshaling bipartisan, bicameral support. I thank him for  his tremendous…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…and all Federal law enforcement need this bill to pass.\n\nMr. Speaker, I am one of those who represent a lot of Federal  employees, and they have been without a check for a long time. This is  very simple. It is very simple. It is way past time to open the  government up. There are going to be a lot of excuses about could have,  should have, would have,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…racial division in this country, and they promote weird, woke  values that most Americans find disgusting.\n\nMr. Speaker, this is something that we have talked about for a long  time, and finally, we have a President who is serious about rooting out  waste, fraud, and abuse from the Federal Government. This is the  perfect place to start.\n\nLet's pass…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692310/ending-taxpayer-funded-propaganda"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…has struggled with it over the years. I am very proud that the  ranking member and the chairman worked together to bring a bill to the  floor. That has not happened in a long, long time. Usually, it just  sort of gets muddled in. It says a great deal about their  professionalism and their cooperation.\n\nIf you listened to the debate, you would think we…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…work with  us, I can get every dollar of that by just modernization of delivery of  services.\n\nRemember, at one time, I worked on my State's Medicaid budgets. It  has been a long time. I actually chaired for a little while my State's  health committee, so I have some experience on Arizona, which has a  very unique Medicaid system. We buy basically managed…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the modification.\n\nMr. SULLIVAN. Mr. President, I want to let people know back home that  means that that bill, the ARTIST bill that we have been trying to get  moved for a long time, just passed the U.S. Senate. So I want to thank  my colleague from California, my friend from California who has worked  with me, by the way, on one of the other bills that…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…side of every transaction.\n\nIn fact, the former director of the Commodity Futures Trading  Commission, Giancarlo, talked about digital dollars. He has gone around  for a long time talking about it and touts the features. They call it  programmable money.\n\nIf you wanted to put stimulus into the economy like we were doing  during COVID, you could put…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…course, is  not a new one, but it has been getting increasingly worse, particularly  during the last 4 years of the Biden administration. The truth is, it  has taken us a long time to get to $37 trillion in debt, but it has now  reached the point of unsustainability. We are spending more money on  interest on the national debt than we are on defense…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…of the data.\n\nWhy would the Democrats take a big stand? This is the former chairman  of Homeland Security and current ranking member, who has been on the  committee for a long time. This is a rare appearance on the House floor  to push back against about this.\n\nAmericans should think about this. Democrats are pushing back on this  because they don't…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…out this:  When Members look at the 22 million Americans who will be most directly  impacted, a lot of these folks are people who Republicans have been  fighting for, for a long time. For example, independent contractors,  freelancers, gig workers, and Uber drivers. They have been under attack  from the likes of Gavin Newsom and the corrupt political…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Florida. Mr. Speaker, I thank the gentlewoman for  yielding time.\n\nMr. Speaker, we are on the brink of a historic moment. This is a day  I have worked toward for a long time. Throughout my time here, I have  fought for legislative reforms that will restore a Member-driven  process. This is the most Member-driven, principled process in Congress  in my time…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699307/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…afraid to cheat or steal our technology if it  is possible.\n\nOn the other side of the coin, U.S. investments from the United  States are flowing into China and have for a long time. A 2021 estimate  was that the market value of U.S. investments in China was valued at  more than $1 trillion.\n\nNow, the reason why that is important is that China has used…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}]