[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "The Natural Resources Committee is entrusted with working on behalf  of Indian Country. While we don't always agree on everything, we have a  long history of bipartisan work and a shared commitment to advancing  legislation that benefits Tribal communities. H.R. 504 is one clear  example of this. It addresses longstanding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…prohibits nor penalizes the modification of       these devices for such purposes, effectively deregulating       fIrearm access even for prohibited individuals.\n\nGiven the long history of modifying weapons to make them       even more dangerous, it is not hard to imagine scenarios       where unscrupulous gun industry actors would seize on this       dangerous…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…medical care. We are dehumanized. Like in the case of Adriana  Smith, our bodies and our dignity are desecrated in death.\n\nThis is cruelty. It is the latest episode in a long history of the  experimentation and exploitation of Black bodies. I grieve for  Adriana's family, for the torture they are experiencing layered with  the daily uncertainty that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…science though. It is about saving  lives and finding new treatments and therapies and cures that give hope  to help patients fighting for their lives.\n\nCancer research has a long history of bipartisan support here in  Congress. But some of my colleagues across the aisle seem to need a  reminder and a wake-up call because under President Trump, we have seen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…officials.\n\nWhy in the world was Donald Trump rolling back critical national  security safeguards in order to hand over sophisticated U.S. technology  to a country with a long history of helping China acquire sensitive  chips that it needs for its military? Why in the world was Donald Trump  trying to ship off our state-of-the-art chips to the UAE--and…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…us anything, it is that wars are easy to start,  but they are incredibly difficult to end. The choice you make on this  vote will carry a long, a very long, a very long part in this history.\n\nMr. Speaker, I will end with this. Let me just tell you, the cameras  of history are rolling. What will be the downstream effects of  destabilizing the country,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Chief of Police Joe Harvey,  as they strive to maintain a culture of positive public engagement,  equity, and compassion for all. Founded in 1874, the department has a  long history of dedicated officers working to build public trust  through accountability and equitable policing.\n\nNational Police Week offers an opportunity to honor law enforcement…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692010/recognizing-the-golden-police-department"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Asian community.\n\nAs a Member of Congress who is part of both the Black and Asian  community and the Civil Rights Task Force chair of CAPAC, I want to  acknowledge the long history of solidarity between our two communities.  For example, American abolitionist Frederick Douglass spoke out against  the Chinese Exclusion Act of 1869 in his Our Composite…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687997/black-history-month-and-the-alliance-between-the-black-and-asian-community"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…military as well as to our individual rights and  liberties is what prompted me to introduce the Insurrection Act of  2024.\n\nWe all know that the Insurrection Act has a long history. It was  written over 200 years ago, in the aftermath of the Whiskey Rebellion  and the Battle of Wabash--in those instances, probably not at the tip  of the tongue of most…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump wants from judges: complete obeisance of  whatever he wants, regardless of the rule of law, regardless of  precedent, regardless of the Constitution.\n\nMr. Bove has a long history of defending Donald Trump when he was his  personal attorney. He defended the President when the President was  accused of inciting the January 6 insurrection, mishandling…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…hometown, in Ohio's 13th Congressional District.\n\nFor many years, the city of Akron, which I proudly represent, has  been nicknamed the Rubber Capital of the World due to its long history  of rubber and tire manufacturing. This industry has provided decades  of local jobs, economic development, and financial stability to  countless families in Akron and the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…and suppressed  civil rights, became the party that pushed through the 1964 Civil  Rights Act and the 1965 Voting Rights Act. And it is the Democratic  Party, despite its long history of suppressing civil rights, that  became the welcoming party for newly-enfranchised minority voters.\n\nAnother interesting flip, in my mind, is on international trade. When…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…us from the American story.\n\nWhat is this all in service of? It is promoting some singular  narrative to undermine the recognition of this Nation's true history  and its long history of struggles that have shaped it, from overcoming  the loss of land, the killing and displacement of indigenous people,  slavery, Jim Crow, internment, and the continued…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…universities was forced to move  out of the country because President Orban attacked it so ceaselessly  for fomenting protests against his government.\n\nUniversities, over the long history of democracy, have been the place  where protests--especially youth protests--begin. They are a thorn in  the side of leadership. The famous Tiananmen Square protests in…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…nothing to ensure that others could live free of abuse,  injustice, and discrimination. Her undeniable impact will continue to  grace Kansas City with inspiration.\n\nAlice's long history of advocacy began when as a high school student,  she became involved with Guadalupe Center as a volunteer in the 1950s.  As she saw the many families in predominately Hispanic…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…throughout the past 150 years. The hard  work and spirit shown by generations of village residents have made  Tontogany an outstanding example of American ingenuity.\n\nTontogany's long history dates back to the first settlers to settle  in the area, Samuel and Eliza Hamilton. The village's name comes from  the Ottawa Native American Chief Tondoganie. When it was…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…certain lands as Visual       Resource Management (VRM) Class II and redesignate them as       VRM Class III or IV.\n\nThe 2024 Central Yukon RMP improperly ignores the long       history of BLM's calling for the lifting of the ANCSA       17(d)(1) withdrawals and fails to provide a rational       explanation for retaining those withdrawals other than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Bay, has seen its  population grow for sustained periods alongside responsible development  on the North Slope.\n\nThe prospect of oil and gas development within ANWR has a long  history that dates back to before Alaska joined the Union as a State in  1959. In 1943, the Federal Government withdrew all the lands on the  North Slope by Public Land Order,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…oldest national women's patriotic organization and the auxiliary to the  Grand Army of the Republic, which was our first VSO in the United  States.\n\nThis organization has a long history of service and patriotism, with  strong ties to Illinois and to my hometown, Murphysboro, not  Murfreesboro. That is in Tennessee. I am speaking of Murphysboro, M-u- r-p-h-y-s-b-o-r-o.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Nashville's Harpeth Hall School, and she was an  outstanding athlete and an outstanding student at the Harpeth Hall  School, which, as an educational institution, has a really long history  of producing and graduating remarkable women. And Ms. Hermandorfer is  one of those.\n\nShe graduated magna cum laude from Princeton, and she was first in  her law school…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693465/nomination-of-whitney-d-hermandorfer"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…can be spotted outside the entrance of  the Old Supreme Court Chamber.\n\nFrom poltergeists to apparitions of Abraham Lincoln and other dead  Presidents, Washington has a long history of ghost stories.\n\nThe city itself was transformed into a ghost town when government  workers disappeared from their desks as a result of President Biden's  lax telework…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of Pennsylvania. Mr. Speaker, I rise today to celebrate  two families that were awarded Century Farm status at the Pennsylvania  Farm Show last week.\n\nAgriculture has a long history in the Commonwealth and has been one  of the State's first industries. For the prosperity of the State, it is  important to preserve these farms and pass them to the next…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699335/farm-show-centennial-award"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania.\n\nElliot was first elected township supervisor in 1980, after service  on both the Patton Township Sign and Review Board and the Planning  Commission. Elliot has a long history of service to Patton Township and  to the entire Centre region\n\nFor more than 50 years, Elliot delivered the weather report as chief  forecaster and senior vice president…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697750/recognizing-elliot-abrams"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…alongside many other North Slope Tribes  and entities like the Native Village of Kaktovik, Voice of the Arctic  Inupiat, Arctic Slope Regional Corporation, and more, have a long  history of supporting responsible resource development projects in  ANWR. The Voice of the Arctic Inupiat, of which ICAS is a member, has a  standing resolution supporting the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…It is simply how the legislative process operates when the House has  its full agenda.\n\nWe need only look at the Committee's operations under Democratic  control to see a long history of meetings in the dark of night. Under  Democratic control of the Rules Committee, we have seen things like  House Resolution 587, which the report was filed at 3:46 a.m.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…representing the  North Slope, an Inupiat himself, urging BLM to maximize the area  available for oil and gas leasing and development in the NPR-A and to  take into account the long history of safe and responsible oil and gas  development on the North Slope. All these Alaskan voices were ignored.\n\nImportantly, my joint resolution is supported by the North Slope…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…the difficult decision to revamp and relocate its campus  to a shared space with the State University of New York at Plattsburgh,  a university with whom the College has a long history of partnership,  to maintain their effort to provide the best outcome for their  students.\n\nWith the College primed to begin this new chapter in its life with  the start…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…international relations in a  different, more grassroots, and hands-on way.\n\nAs the co-chair of the bipartisan German-American Caucus and  representing Pennsylvania, a State with a long history of German  heritage, I am proud to support this program.\n\nI thank David for his work and time in my office, and I wish him the  best in his future endeavors.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688275/recognizing-41st-anniversary-of-cbyx-exchange-program"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…school  were drafted in the first round. I am always proud to calI myself an  alumnus of Corona High School, but I am especially proud this week.\n\nCorona High School has a long history of excellence on the baseball  diamond. Seth, Billy, Brady, and Ethin are the latest in a long line of  Corona High School players who have made their way to Major League…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693755/recognizing-seth-hernandez-billy-carlson-brady-ebel-and-ethin-bingaman"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, I would like to see if my friend from Louisiana  can stick around a little bit longer.\n\nMr. ROY. Mr. Speaker, I appreciate my friend from Louisiana because  of his long history of distinguished service, and he knows what he is  talking about.\n\nI know that the gentleman from Louisiana came to my home State of  Texas when the people that I represent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}]