[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…In fact, they are just asking for a fair shot  in this economy.\n\nThe SBA's 504 loan program is designed to provide that fair shot  through basic good policy and affordable, long-term financing. The  financing helps small businesses buy buildings, buy property, expand  operations, and employ Main Street neighbors throughout our community.\n\nUnder the current…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…people  with disabilities. They conduct research into fall prevention, chronic  disease management, and Alzheimer's disease. They safeguard vulnerable  adults through the Long-Term Care Ombudsman Program, and they address  elder justice issues like abuse, neglect, and exploitation. They  provide legal assistance for disabled people and more.\n\nThese…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…cases,  this damage has led to the extirpation of species from specific areas  and the introduction of invasive species, which further disrupts the  ecological balance. The long-term consequences of these practices are  the loss of biodiversity and the degradation of habitats that are vital  to the health of our oceans.\n\nMany of these harmful collection…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the only authority to declare war. This President, like  many others of both parties, has ignored that requirement and, I think,  at his own peril. They are engaging us in a long-term conflict which  could cost us dearly, and they are not engaging the American people in  the discussion and rationale of our ultimate goals in the region.\n\nThis briefing this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…affected, and I followed up after that to talk to  our local officials, our local volunteers, our local regional planning  commissions: What worked and what didn't in the long-term response?\n\nAnd what I heard from officials--regardless of what their political  orientation was but local officials who had a real sense of urgency  about getting the community…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Administrator for Global       Health, USAID            the PRC is stepping up where the U.S. is stepping back\n\n``That support has been withdrawn and the sustainability       and the long-term system of strengthening . . . is       questionable for the future. The People's Republic of China       is filling that gap. The people in the communities that we…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…management  structure.\n\nWeighing ESG factors when making investment decisions is not only  more socially responsible, it is also more fiscally responsible for the  type of long-term investments managed by retirement plan fiduciaries.  Factors like sea level rise due to climate change, child labor  violations, or track records for mistreating workers…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…support of H.R. 6504, a 3-year extension of the  Haiti HOPE/HELP trade preference program, one of the most important  tools for promoting economic stability, job creation, and long-term  development in Haiti.\n\nThe Haitian people have faced enormous hardships in recent years,  after suffering successive political and environmental tragedies. Now  is the time…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…the INNOVATE Act as currently proposed by the Chairs of the House and  Senate Small Business Committees. Even DOD itself has flagged  significant concerns. I do support a long-term comprehensive  reauthorization of the program, and I am committed to taking a serious  look at where the program has challenges and needs good governance  updates. I am also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…top, but the way we  are going to do it is we are going to cut people's healthcare benefits  who are on Medicaid. By the way, Medicaid is also the program that  helps provide long-term care for a lot of middle-income families in  this country.\n\nMr. Speaker, the notion that we can make all these cuts and don't  worry, be happy, come on. Come on. People can…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…to  my family. I won't be able to keep my daughter healthy or get her the  medications she needs.\n\nThey are real people like Veronica, whose grandmother's last few days  in long-term care were only possible because of Medicaid.\n\nTaking healthcare and food away from people isn't bringing down  prices for families. It is telling people that your health…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691411/gop-tax-scam-hurts-women-and-families"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the State can demonstrate that no action  would be the reasonable course.\n\nSouth Dakota took no action in its latest regional haze plan to  address haze pollution over the long term. It made no updates to  significantly out-of-date controls at its three major emitters--a coal  plant, a cement plant, and a lime plant--and it failed to demonstrate  that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…your aging parents to care for them when your local nursing  homes close? Are you ready to move your dining room table out and bring  in a hospital bed because there is not a long-term care facility to  take care of them?\n\nWe have already lost 27 rural hospitals in Texas because of a lack of  adequate Medicaid funding. It takes some people in our State…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…critical items  on the table.\n\nLet me be unequivocal on one other issue. No budget proposal that  permits additional rescissions is worthy of any serious consideration.  Any long-term budget should be shielded against further rescissions  because we have already seen this administration's willingness to  rescind funds approved in a bipartisan fashion by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…other environmental, social, and       governance factors when they select retirement investments.       The bill would constrain plan fiduciaries' ability to account       long-term financial risks in their investment decisions,       which would undermine workers' retirement security.      H.R 2270, Empowering Employer Child and Elder Care Solutions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…innovation, strengthen  university-industry partnerships, and train the next generation of  scientists and engineers right here at home--investments that are  essential to our long-term economic growth, to our national  competitiveness, and to our national security.\n\nAt NOAA, this legislation bolsters critical weather monitoring  services, increases resources…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…enter into a       memorandum of understanding to explore and address the impact       that the record of decision entitled the ``Supplement to the       2016 Glen Canyon Dam Long-Term Experimental and Management       Plan Record of Decision'' and dated July 2024 (referred to in       this section as the ``record of decision'') has on the Upper       Colorado…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…got a lot of work to do in that area, and we  stand ready to work in good faith to come up with a workable bipartisan  solution that will lower the cost of healthcare in the long term, if  our Democratic colleagues are willing.\n\nSuffice it to say, we have our work cut out for us, though, in the  Senate. While this year has barely started, President Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…least 60 percent support in this body. The result of that  process is a product that has been stress-tested by Members on both  sides and one that works out better in the long-term for the American  people.\n\nBut with the COVID-era enhanced ObamaCare credits set to expire  according to a timetable set by Democrats since no Republican voted for  it in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…preseparation counseling under section 1142 of title 10,       United States Code, and veterans in the supply chain       workforce;\n\n(3) recommend specific short- and long-term actions the       Department of Transportation, the Department of Defense, the       Department of Veterans Affairs, or the Department of Labor       can take to help members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Japanese yields on the long end of the curve? When you see the  long end of the curve going up and up, that lets you know the entire  world is getting really nervous about long-term debt.\n\nRay Dalio, the billionaire, has been giving speeches around the  country. He even wrote a book saying you have a math problem. The  entire industrialized world basically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Biden Department of Energy implemented a  policy that threatens small businesses, harms consumers, and drives up  costs, even as many Americans continue to struggle under the long-term  effects of the Biden administration's inflationary economic policies.\n\nThat ends now. I am proud to join my House Republican colleagues in  standing up for America's consumers…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…that the LPTA criteria are not always  appropriate for agencies seeking complex or technically innovative  services.\n\nFor instance, this can result in agencies sacrificing long-term value  for short-term savings. We also do not want the LPTA to be used in a  manner that jeopardizes national security.\n\nThis bill requires the Director of the Office of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…resiliency of manufacturing capacity and supply chains for       critical industries (including critical industries for       emerging technologies) by--\n\n(I) developing long-term strategies;\n\n(II) increasing visibility into the networks and       capabilities of domestic manufacturers and suppliers of       domestic manufacturers;\n\n(III) identifying…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…just want to extend the  TCJA's provisions. We want to give small businesses certainty by making  these pro-growth tax policies permanent because permanence will  encourage long-term investment, it will encourage growth, and it will  maximize our economy's potential.\n\nAccording to one estimate, making the 199A deduction permanent would  lead to 1.2 million…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…constituents and  their wallets.\n\nThis commonsense bill would require State public utility commissions  like the Colorado PUC to consider implementing policy that focuses on  long-term energy reliability which, of course, helps affordability.\n\nMy constituents are facing an energy crisis in no small part due to  the skyrocketing costs of utilities in Colorado,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…will now have to work in order to continue  receiving their fully subsidized healthcare. The vast majority of  Americans agree that Medicaid should be a safety net, not a long-term  entitlement for those who are able to work but choose not to.\n\nThe One Big Beautiful Bill Act strengthens and secures Medicaid for  expectant mothers, children, low-income…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…accounts allow for Americans to save and spend their own money  on the care that they actually choose, the insurance premiums that they  want to pay, the direct primary care, long-term care, and wellness  expenses like healthy food and fitness. Imagine encouraging Americans  to take their pretax dollars and go buy the healthy food that will  sustain their…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…flood insurance affordable again. I will keep working to  do that. I am pleased that the Flood Insurance Program will survive the  weekend, but we need to make it survive long term.                                  ______\n\nBy Mr. PADILLA (for himself and Mr. Merkley):\n\nS. 1042. A bill to require the Agricultural Research Service to  conduct research…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688826/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Road, effectively preventing Alaskans from  developing their own resources.\n\nPassing this CRA is the first step in allowing Alaska to acquire  these lands outright, creating long-term certainty for this project.\n\nConstructing this road and allowing access to the Ambler Mining  District is expected to create thousands of new jobs and produce $1.1  billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]