[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…the silence feels strong.      Because goodness was never      the absence of pain;      it was God stepping into it,      bearing the weight, wearing the stain.      Good looked like a manger,      not a throne dressed in gold.      Good looked like mercy      when the world had grown cold.      Good had dirt on His hands,      tears in His eyes,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…own  borders. When I landed in Kuwait during the Iraq War that came two  decades later, I entered the headquarters complex of the U.S. military  command. It was huge. It looked like a massive Mission Control for a  U.S. space launch. Video screens, hundreds of employees, and a full  color, smiling portrait of former President and oil man George Bush…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…and he  was handcuffed.\n\nAnd what was the explanation that was given?\n\nIt was an explanation that any reasonable person can look and know  will be a full-on lie: that he looked like an attacker.\n\nWell, if this doesn't cause every person under the sound of my voice  to shudder today, I don't know what to say about it, because today it  is Senator Padilla,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692441/alex-padilla"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…with  nothing, literally as second- and third- and fourth-class citizens and  noncitizens initially; when it is understood that when this building  was built, people who looked like me could only be here for three  reasons: To either build it, clean it, or serve food; when it is  understood that when this country was formalized in a Constitution  people…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…United States of America.'' What  they were doing with this was making a lunch for the children in the  village. I don't think your kids or mine would have touched it. It  looked like some odd rice crispy ball that was held together with  water. They sat with little tin plates with this rice crispy ball on it  from the USAID package to eat their lunch.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688339/usaid"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…in  downtown Los Angeles, in my congressional district, not targeting the  ``criminal'' immigrants that he promised he would go after, but  targeting anybody that looked like me, looked like my colleagues,  looked like my family members, looked like the people who live in Los  Angeles.\n\nI don't know any MS-13 members, gang members, who work at a car…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the Seventh Circuit,  putting Illinois--and Chicago has been really affected by this. The  Seventh Circuit made a decision in support of the district court there,  but that looked like it was going to the Supreme Court. And they may do  a shadow docket decision very soon, at any moment, which could also  affect what happens. So my guess is soon.\n\nIf none…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…friend,  her friend. Her propaganda campaign to recruit ICE agents cost  taxpayers $200 million.\n\nShe made a video that turned the South Shore raid into something that  looked more like a movie trailer. Make no mistake, this is not a movie.  This is real life, and real people are being hurt and killed.\n\nI really have to wonder who the people are behind…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that, here in the Senate, we would not be able to get the  majority vote we needed to pass this bill into law. But we did. To all  those detractors and Debbie Downers, it looked like this pessimism was  completely unwarranted.\n\nNow that the Republicans have proven their critics wrong by  accomplishing what they insisted had to be done in order to avoid…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…in Bind Lach serving as border patrol between Germany  and Czechoslovakia. He and his company referred to themselves as The  Speed Bump because ``that's what it would have looked like if the  WARSAW Pact had decided to come across.'' This was his favorite  assignment.\n\nHe was then assigned to Fort Carson, Colorado, with the 10th Cavalry  (part of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Senator Cynthia Lummis:\n\n``Senator Cynthia Lummis, one of Powell's more strident       critics usually, on Monday said the Justice Department's use       of a criminal statute looked like a ``heavy lift'' and that       she did not see any criminal intent.''\n\n--Reuters article, 1/12/26\n\nSenator Kevin Cramer:\n\n``I do not believe however, he is a criminal.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…in the house, from crying  tears to frustration at the individual who delivered the worst news in  their lifetime. They never forget that police officer, what he or she  looked like, the demeanor he or she had, what they smelled like, what  time of day it was, how hard the knock was, how many times you rang the  doorbell.\n\nMr. Speaker, it is tough.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691938/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…emissions budget.\n\nThe Trump administration's EPA finalized this interim rule that this  CRA would repeal to adjust Indiana's emissions budget to reflect what  it would have looked like in 2021 had those plants not announced  retirement.\n\nI will say that every single day, every one of our offices is deluged  with people coming in, saying: We need more power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…have heard for 18 months that the intifada should be globalized.  We have heard ``resistance by any means necessary.'' On Sunday, and  again 2 weeks ago, we saw what that looked like.\n\nIn this country, we have a hard decision to make. We have to make a  decision about whether we are going to continue to be afraid or whether  we are going to call evil…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}]