[{"senator": "Al Green", "party": "Democrat", "sentence": "…are now at a point in this country, to tie this together, where  there are people who are suspects because of the way they look, just as  I was a suspect because of the way I looked. If you are Latino in the  United States of America, given the behavior of the king's men--that  would be President Trump--you are a suspect. You are a suspect, and the  king's…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, 80 years ago, over 120,000 Japanese  individuals were stripped of their rights and forced into barbed-wire  camps because of the way they looked and the language they spoke.\n\nMy great-grandfather, my GG, was one of them. He was taken from his  home on Maui and imprisoned not for anything that he had done but for  who…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697462/fighting-dhs-immigration-raids"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…contrary to claims  that were made earlier today, I did not circulate any petitions that I  was accused of circulating. I only circulated when I filed on the first  day.\n\nAs I looked ahead, I had to be honest about what the next term would  demand and what my family needed. I saw the big picture: supporting my  wife as we manage her illness, taking better…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Senate floor that  Ronald Reagan must be spinning in his grave. It is certainly true of  our treatment of Ukraine and our giving in to the Kremlin. But that  President, who was looked to as a portrait of the American conservative  movement, watching as the party of Lincoln and Teddy Roosevelt and  Reagan completes its transformation into the party of Donald…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…administration has chosen them--the  billionaires, the elite, the people who think children are theirs to  exploit--over us, the American people.\n\nTime and time again, they have looked into the cameras and promised  the American people: We will release the Epstein files.\n\nWe heard it over and over again: We will tell you the truth.\n\nWhen the moment of truth…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693547/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…my colleague from the Commerce  Committee might realize, that some of our colleagues wanted to be able  to sue the Federal Government because the Department of Justice had  looked at their phone records. Have we struck that provision?\n\nI am pretty sure these families who have lost loved ones would like  to be able to sue the Federal Government, the DOD…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…That 12-percent estimated income reduction was a midpoint  in an estimated range between 2-percent income reduction and 22-percent  income reduction.\n\nThat study, by the way, looked at general temperature effects, not at  the costs of specific extreme weather effects like hurricanes, sea  level rise, or wildfires. So the actual number is obviously worse.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…would sell massive amounts of firearms, is  actually going to help gun manufacturers make mountain loads of money  by putting more guns into circulation.\n\nIt is interesting. I looked it up. On a list of the 22 major sponsors  of the CMP, 6 are gun manufacturers. They are companies like Colt,  Glock, and Springfield. Mr. Chair, seven make gun accessories,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…seen. Usually in those jails,  it is one of those units for 2 to 4 people, not three for 32 people.\n\nI have to tell you, one of the most emotional parts for me was when  we looked at the cages from afar. We weren't let in the tent but stood  at the doorway, hearing those chants: ``Freedom, freedom''; ``libertad,  libertad.'' People were yelling.\n\nThis…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…weren't.\n\nThere was a move to expel George Santos. He was a Republican Member  of the House from New York. It was the same kind of rush to judgment,  absolute political frenzy. I looked at it for about 60 seconds.\n\nI was a professor of constitutional law, so call me a legal nerd, but  I said, wait. This guy has not been convicted of anything. Well, he is…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have to have what is called carbon pricing, a fee, a  penalty, whatever you call it, for pollution.\n\nThis is part of a review from work that the Potsdam Institute did.  They looked at 1,200 climate scenarios that over the years have been  presented to the IPCC, 1,200. Of those 1,200, there are 11 left--11 out  of 1,200--11 left that put us on a pathway…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…choir together. Jose shared  about Alex that, ``even as a fellow student, I saw him as a role  model.''\n\nJD, who also knew Alex in high school, wrote to me:\n\nEveryone I knew looked up to him as a role model--      effortlessly cool and unfailingly kind. Everything I know       about his life since those days and even his final act aligns       completely…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of the child tax credit, an idea that has proven  successful--all that was sacrificed to give billionaires tax cuts  instead.\n\nIn the end, three sensible Senate Republicans looked at this ugly  betrayal of a bill and agreed they couldn't be part of the process. I  commend them. But, sadly, three votes on the other side of the aisle  wasn't enough. We…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…And we breathe,      In the echo of that song                              by addison norris       In the beginning,      God created the heavens and the earth.      He looked upon His work and said,      It is good.      But is it really good      when we're facing wars,      when families are waiting      for unopened doors?      Is it really good…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have to have good nutrition for our kids, and the Senator  from Kansas has outlined why milk is so good.\n\nOf course, I remember growing up and going to grammar school, and I  looked forward to milk. We had milk breaks, and it made a difference to  pay attention in those afternoon classes and to be active in your  sports activities right after that.\n\nThe…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…Most  importantly, they assured us that our child was okay and would be just  fine.\n\nWhen we went to leave, I had just one question for them: How much do  we owe you? They looked at us and they said: Guys, the services that we  provide here are free. You can go on your way. They assured us that our  baby was healthy, and they gave us such peace of mind.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…he calling all of these  victims unreliable?\n\nThey have testified to the FBI. The FBI has these names in their  possession.\n\nI asked the FBI Director in a hearing: Have you looked at the  documents?\n\nNo. He trusts everybody who has been there for decades.\n\nThat is wrong. Do not let the Senate muck this bill up. If Senators  are a party to that in the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the year before? That is a  great time to do it with America. Where are we?\n\nIt reminds me, Mr. Speaker, at the Constitutional Convention in 1787,  Benjamin Franklin famously looked at the chair behind the presiding  officer that was carved with a Sun and he asked a question that still  echoes throughout history: Was the Sun rising or was the Sun setting?…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…have serious concerns that if this rule goes into effect that it  can potentially bring about a criminal charge and even perhaps criminal  punishment. I don't think the CFPB looked at all the criminal laws of  the States, but having practiced for many years in the criminal courts  of the Commonwealth of Virginia and having discussed it with the  patrons…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and it goes to their energy  regulation that their State and local governments have done to  themselves.\n\nMr. Speaker, I was in California putting gas in a rental car, and I  looked over to the guy next to me and said: Do you have any idea how  much people pay for gas in the rest of the country?\n\nI paid $2.80 in Kentucky and paid over $4 in California.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…savings are  cruel. They literally said this will destroy America as we know it. No  one outside of the beltway will take them seriously.\n\nHave my Democratic colleagues even looked at what is in this bill  before attacking? Is it cruel to suggest that American taxpayers  shouldn't have to pay $60,000 to celebrate DEI in the Netherlands or  $30,000 to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692542/rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is being discussed is that the United States has a handful  of huge databases. The problem is, they don't talk to each other.\n\nYou saw the story last week of, hey, we just looked at some of the  Social Security death files. The oldest person in America is, what, 114  years old? We took people over 114 years old and then wondered how they  were getting…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…he did 11 months and at the easiest time that could  be done. He walked every day during the day on the work-release  program.\n\nThat sweetheart deal, let me say, should be looked at. Now, to my  horror, who has come to light that should be looked at, what was their  involvement? Was there some involvement then? She is a good lady from  the Virgin Islands.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Monahan.\n\nAnother man who did a lot of work in this area was George Gilder who  wrote a couple of books, ``Men in Marriage,'' ``Visible Man,'' ``Wealth  in Poverty.'' He first looked into this problem, as some people do, in  a ghetto in Albany, New York. He could remember the time right before  that when it was a considered real crisis if a woman got pregnant…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…great career in front of him.\n\nBut the second thing you notice about these debates is how kind  Charlie was. He never raised his voice. He never said anything hateful.  If you looked up the words ``positive attitude'' in the dictionary,  Charlie Kirk's name would come up.\n\nI don't know if I could stay as calm as he did while he was talking  with some of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…with  them, because it is not money we have in the bank. It is all borrowed  money, Mr. Speaker.\n\nWhere did we start? The White House laid out a number of things, but  they looked at that USAID program. They didn't gut the whole thing, but  they said there are a number of things that are being done that just  don't represent the values of the United…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…to address. That is the issue we want to address. We  do want prices to go down. We don't want it to be $5 a gallon.\n\nI was putting gas in a rental car in California, and I looked over at  the guy next to me. I paid probably $2.60 a gallon in Kentucky, and I  think it was $4.80 there. I said: Do you guys have any idea what the  rest of America is paying…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…of the global space race.\n\nCommercial space is the free market revolution. If you haven't  already done so, read the recent book by Isaacson about Elon Musk. He  basically looked at NASA, saw some of the challenges they faced after  the Apollo program, the cancellation of our shuttle program, and even  the challenges we face in the ARIES program, which…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Yi, on this theft  of intellectual property that China does. He pressed her hard.  ``Madam Wu Yi, you have to stop stealing our IPR.'' That senior Chinese  official, 2003, looked at the President of the United States and  solemnly and sincerely said: Mr. President, we will stop this. You have  my word.\n\nWell, we all know what happened. For decades,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…teaching math appropriately, getting back to basics, utilizing  education technology in the right way, without having students be  exposed to excessive screen time. We have looked at school choice  programs, including, most importantly, expanding charter schools. We  have looked at the foundational importance of parental rights.\n\nIn California, unfortunately,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]