[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…collaborate with Federal medical researchers, Ph.D.  students, other families affected, drug and device reviewers and  advocates.\n\nMany of these rare disease patients were looking forward to attending  the rare disease event that was supposed to be today. And this year it  was going to be a collaboration between NIH and the FDA because of all  that integral…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…world.\n\nNevada's Third District is honored to have such an accomplished  athlete with a passion for outdoor recreation and making the world a  better place. We are all looking forward to seeing what Alex will  accomplish next.\n\nI congratulate Alex.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699610/recognizing-alex-honnold"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to educate the next  generation on Tamil history.\n\nI congratulate the Valluvan Tamil Academy, and I thank them for all  that they do for our community in Virginia. I am looking forward to  working together for many years to come.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692089/recognizing-valluvan-tamil-academys-15th-annual-day-celebration"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…neighbors.''\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to celebrate Evergreen, Colorado, on its 150-year- history and join the town in looking forward to the future.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…of becoming a music producer  one day, and that love of music led Evyatar to the Negev Desert for the  Nova Music Festival on October 7, 2023. For months, he had been looking  forward to a weekend of music and friends. But instead, Evyatar, is  now, as I speak these words on the Senate floor, living his 591st day  of captivity in a Hamas dungeon under…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691457/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…accepted  and obtained the rank of Lieutenant Colonel.\n\nWhen taking over the position of Chief Deputy of Operations, Shabazz  was confident in his skills in operations and was looking forward to  being responsible for both the ADC and all of their support services.  Sheriff Kincaid described him as being ``the gold standard of  leadership in [the] agency,''…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…So thank you so much, Senator Alsobrooks, for that.\n\nAnd then, secondly, the lactose intolerance point the Senator makes  is valid, and that is why I am enthusiastically looking forward to  working with her, so we make certain there is no stigma associated with  a person who is lactose intolerant.\n\nSo thank you so much for your cooperation on this, Senator,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Virginians. We see that 46 percent of the children  in America receive their healthcare through Medicaid. When we look at  Medicare, it is beyond belief what that would do.\n\nI am looking forward to somehow seeing how you achieve the massive  budget cuts that are in this resolution without touching those. That is  why you have heard so much concern today about…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…services,  they were temporary, I have the consolation to believe that, while  choice and prudence invite me to quit the political scene, patriotism  does not forbid it.\n\nIn looking forward to the moment which is intended to terminate the  career of my public life, my feelings do not permit me to suspend the  deep acknowledgment of that debt of gratitude…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…ways for a young person to prepare for a life of service  and leadership in their community. Las Vegas is proud to have raised  these boys into young leaders, and we are looking forward to seeing  what all eleven of them become in the years ahead.\n\nI commend the hard work, dedication, and achievement of Jacob  Bennett, Cannon Castor, Ethan Dastrup, Christian…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…League Swim and Dive State championships.\n\nThe students performed in musicals and theater productions, including  Disney's ``The Little Mermaid.'' My family is already looking forward  to seeing the next show.\n\nThey certainly have left their mark on the John Champe community.  Whether it is college, the military, the workforce, or the trades, I  look…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…you--for being here. Your presence is the reminder America  needs of the real-life harm that Trump's agenda has done to our  country.\n\nFinally, there is one more thing I am looking forward to tonight-- listening to my good friend Senator Padilla, who will offer Democrats a  Spanish language response. His story of what he went through in the  past year, after…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…including decades of  progress for diversifying the STEM workforce.\n\nThis week, we should be celebrating the advancements NSF has  contributed to over the past 75 years and looking forward to a bright  and innovative 75 more years. Instead, we are fighting to save it from  the chaotic, reckless, and destructive actions of this administration.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…that our city grows stronger when we invest in our young  people.\n\nI congratulate the players, coaching staff, and entire community. I  will admit, a lot of us are already looking forward to the three-peat  next year.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698090/recognizing-washington-university-womens-soccer-team"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…and  protect the healthcare of the American people. We are going to protect  the Medicaid of the American people against this assault on vulnerable  communities.\n\nI am looking forward to all 13 of these Republicans joining us to  protect the healthcare of the American people whom they represent. That  is the promise, Mr. Speaker, that your Republican…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…want to demean the  concept of a strong family, but it is one of the core aspects of having  a strong economy.\n\nThere is a lot going on now and in the coming months. I am looking  forward to seeing the Senate come together and getting us the  parameters that they would like to see with respect to this tax  package. We are working very close in hand with…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…you a sense of what a rogue agency the Coastal Commission  has become and the barriers that we will face to rebuilding Los Angeles  if this is allowed to continue.\n\nI am looking forward to advancing the Coastal Commission  Accountability Act through the House and getting it signed by the  President, who I know agrees with me on this issue. I am hopeful…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "French Hill", "party": "Republican", "sentence": "…prevailing faction, more able or more fortunate than his competitors,  turns this disposition to the purposes of his own elevation on the  ruins of public liberty.\n\n``Without looking forward to an extremity of this kind (which  nevertheless ought not to be entirely out of sight) the common and  continual mischiefs of the spirit of party are sufficient to make…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Democrats, in their own  version of reconciliation, have enhanced that, as well.\n\nI lead the Family First Act, which is another enhancement of the  child tax credit, and I am looking forward to, hopefully, getting that  passed through. That is another key win.\n\nThere are numerous business provisions that help. Real wage growth,  economic activity, and strong…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…schools.\n\nI just can't say enough about how proud I am of my parents, Albert  and Sarah. I just want to wish them a happy anniversary this weekend.\n\nI love you, and I am looking forward to years ahead together.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700043/happy-50th-anniversary-albert-and-sarah-stutzman"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Good for Alaska  Native Vietnam vets. We get a call an hour ago saying: Nope, the Dems  are going to move the goalpost, and they are going to object.\n\nWhy? I am really looking forward to hearing from my good friend from  New Mexico on why they are going to object, but I am pretty sure I know  why. He is going to tell me: Hey, we want to move more bills.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…American Dream, a future of America  first. That is what I am focused on doing, along with President Trump,  and that is what the one big, beautiful bill is all about.\n\nI am looking forward to supporting our bill when it comes to the  floor for a full vote and delivering on the mandate the country gave us  on November 5, 2024. We can't afford to miss out…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…use the trackers contrary to  Linkedin's explicit guidance? I am asking how this sort of violation  can be prevented in the future. This is truly unacceptable, and I am  looking forward to getting some answers from this investigation.                     Congratulating Mark and Marcus Haney\n\nMr. KILEY of California. Mr. Speaker, I wanted to take a moment…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…negotiations team, the  scholarship committee, and the house committee.\n\nOfficer Mazurkiewicz devoted 29 years to serving and protecting the  Rochester community and was looking forward to a well-earned retirement  to spend fishing, traveling, relaxing, and spending a lot of time with  his wife, Lynn, and their family.\n\nOn July 21, 2022, Officer Mazurkiewicz…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…others  before himself. He will undoubtedly continue to embrace the spirit of a  dedicated first responder and an engaged member of our Fort Worth  community. I know he is looking forward to well-earned time with his  family and first grandchild.\n\nOn behalf of the 12th Congressional District of Texas, it is an honor  to recognize Mr. Jeffrey L. DeWitt's…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…people hardest hit over the last 4 years, and we bring the American  Dream back to America by investing in people instead of investing in  more and more government.\n\nI am looking forward to working with the President and, more  importantly, to signing this bill later this year so that we can see  these programs in action, move this country forward, and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…at State actions that are  contributing to our decline in refining capacity.\n\nCalifornia, I am sure, will be the State where the most such actions  are identified. I am looking forward to the results of this and then  being able to act to use whatever leverage we have here at the Federal  level to try to spare Californians from the continually rising…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. ``In looking forward to the moment which is  intended to terminate the career of my public life, my feelings do not  permit me to suspend the deep acknowledgment of that debt of gratitude…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…legislation would eliminate income taxes for many of  our Nation's retirees, leaving them with more money in their paychecks.\n\nAs we work on these tax provisions and more, I am looking forward to  working with President Trump to deliver relief for hard-working  Tennesseans and, indeed, all Americans.\n\nWe are the greatest Nation on Earth, and with strong leadership…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Mr. Speaker, 2025 was a big year for my team and for House  Republicans. We passed landmark legislation, and people are going to  see the difference because of it.\n\nI am looking forward to 2026 and continuing to work hard for Utah's  First District.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}]