[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…in the Rules Committee when I testified. I actually have  two grandsons who are adopted. I have one from Guatemala. Yes, he is  brown-skinned, but he is a citizen. He lives in Los Angeles. I find  myself telling him, ``Make sure you carry your passport,'' because it  scares me that, because of his brown skin, he can be pulled aside,  detained, and deported.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…from  the 1930s and 1940s.\n\nDHS is now building databases of Americans, detaining and even  disappearing people off of corners in Minneapolis, Chicago, Portland,  Nashville, Los Angeles, and far too many communities across the Nation.\n\nThe Trump administration demanded that Republicans deliver a $170  billion taxpayer-funded slush fund for these misbegotten…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…it means more kids are  going to suffer from asthma. It means grandma and grandpa dying  earlier. It means more death and destruction from extreme weather  events, such as the Los Angeles wildfires and Hurricanes Helene and  Milton. By the way, those three events caused $500 billion worth of  damage--those three events, all related to climate change,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…fronteras, compartiendo la vibrante  cultura puertorriquena con millones de personas en todo el mundo, a la  vez que despierta un profundo sentimiento de orgullo y conexion entre  los latinos de todo el mundo. El sabe que la musica y la cultura  tambien transciende en el corazon.\n\nSu album de 2022, Un Verano Sin Ti, hizo historia como el primer  disco en…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692866/recognizing-bad-bunny"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…benefits and opportunities for DACA recipients, but now they  are threatening to arrest DACA participants as well. That is exactly  what has been happening in my hometown of Los Angeles when, last month,  masked immigration officials--unidentified and masked immigration  officials--carrying weapons, raided a carwash in Temple City. It was  there that…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Ms. BARRAGAN. Madam Speaker, I rise today to dissent.\n\nThis week, six members of the U.S. Supreme Court decided to allow ICE  raids in Los Angeles that are rooted in racial profiling. This is a  direct assault on our Constitution and on the very idea of equal  justice under law.\n\nJustice Sonia Sotomayor said it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695282/scotus-immigration-raids-action"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…of California's  five Nobel laureates for their achievements.\n\nFrederick J. Ramsdell, an alumnus of the University of California,  San Diego, and the University of California, Los Angeles, was one of  three scientists awarded the Nobel Prize in Physiology or Medicine for  their research to better understand and protect the human immune  system. Dr. Ramsdell's…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…gentleman from Montana (Mr. Downing).\n\nI will point out that I am uniquely unqualified to address this bill  since my entire district is in an urban area, that of the great city of  Los Angeles. Yet, even I recognize the importance of getting capital to  our small businesses in rural areas.\n\nI strongly support this legislation, which would require the SEC's…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…who told me that they are not able to train because all of  that money is going to have our National Guard's members stay in hotel  rooms all around Washington, D.C.; Memphis; Los Angeles; and New  Orleans. That is something that shouldn't be happening. We should have  greater accountability.\n\nI am also concerned about this whole issue of merit. We have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…problems. These aren't just numbers. They are our children, our  parents, and our neighbors. Please allow California to enforce stronger  clean air protections.''\n\nTia Triplett from Los Angeles wrote to EPA that heavy truck pollution  threatens the health of her community, and she urges stronger  protections.\n\nHouse Republicans want to silence these voices.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690469/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…abusing our  military, trying to blur the lines between our servicemembers and law  enforcement. We saw it when he sent the National Guard to intimidate  peaceful protesters in Los Angeles or when he similarly threatened  Chicago and Portland before he was stopped by the courts. We have even  seen it in this Capital City, where I am speaking today, when…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…CALIFORNIA\n\nSan Diego Police Department\n\nAnother article on procurement\n\nSanta Clara Sheriff's Office: A pilot program in county       jails\n\nLos Angeles Sheriff's Office: --``a CEW deployment is an       intermediate use of force tool''\n\nLos Angeles County Sheriff's Department Official Temple       Station\n\nMurrieta…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…home, one of my taxpaying constituents, Narciso  Barranco, was picked up by who I believe were ICE agents--they were  masked--and is now sitting in an ICE holding facility in Los Angeles.  Videos show him being punched by masked Federal agents, unprovoked.\n\nNarciso Barranco has lived in my district for 25 years or more and  doesn't have a traffic ticket…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693093/wake-up-call-for-immigration-reform"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…looking for a second-rate director.\n\nH. Res. 516 is not about public safety. It is about fear,  scapegoating immigrants, and gaslighting the American people into  believing that Los Angeles is some so-called hellscape. If it is such a  hellscape, I want to know why Republican Members of Congress have been  flying into Los Angeles over the past few weeks…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693147/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…Americans' rights to free speech, not to intimidate Americans from  exercising that right. Our troops are willing to die to defend this  country, not to defend one man's ego.\n\nLos Angeles did not ask for this; Washington, DC, did not ask for  this; Portland did not ask for this; Chicago did not ask for this; our  servicemembers did not ask for this.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…in the House of Representatives called the PATH Caucus. It was formed  about 3 years ago.\n\nI happen to be the Republican lead and my dear friend and colleague  Lou Correa from Los Angeles is the Democrat lead. We call it the Noah's  Ark Caucus, where one Democrat and one Republican come together and  join it, but the whole goal as the PATH Caucus--the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…and vandalized and  looted local shops.\n\nThe Democratic vice mayor of Cudahy has called on criminal street  gangs to attack Federal law enforcement.\n\nThe Democratic mayor of Los Angeles said that for the riots to stop,  the Federal Government had to stop enforcing Federal immigration law.  You just heard the same sentiment expressed on this floor a…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Young Kim", "party": "Republican", "sentence": "Mrs. KIM. Mr. Speaker, I thank Representative Kiley for yielding.\n\nMr. Speaker, I rise in strong support of H. Res. 516 to condemn the  violent riots in Los Angeles this month, and I thank our brave law  enforcement officers for keeping us safe.\n\nI appreciate the heated debate and the conversation. I thank my  colleague (Mr. Kiley)…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…they cannot seek their own  waiver.\n\nCongress provided California this special ability because of its need  to address unique locally high levels of pollution--like smog--in Los  Angeles and in the San Joaquin Valley. But over the past two decades,  California has used its waiver authority to push its extreme climate  policies on the rest of the country,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…worthy of continued funding.\n\nSan Francisco nonprofit workers have been charged with       theft of public funds intended for homeless seniors, and real       estate executives in Los Angeles have been charged with       stealing $50 million from a variety of homeless programs.       Theft of public money is not just confined to nonprofits in       California.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…KILEY of California. Mr. Speaker, I have asked Attorney General  Pam Bondi to open an investigation into the  FireAid concert that took place in the aftermath of the devastating Los  Angeles fires.\n\nWhat we have learned has happened is absolutely beyond belief. In the  aftermath of these fires, which destroyed 18,000 homes and tragically  killed 30 people,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…national defense, while  needlessly undercutting innovation and economic progress.\n\nThe need to rein the commission in has now become urgent as we face  the challenge of rebuilding Los Angeles following the fires, and that  will not be possible if the commission is allowed to continue operating  as it has been.\n\nJust to give you a couple of examples of some…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…organized the hearing. The high- speed rail authority can't manage to complete anything on time, even  its own reports to the legislature, let alone a high-speed train from  Los Angeles to San Francisco or even that very first segment from  Bakersfield to Merced, which is now projected to miss the 2033  deadline.\n\nListen to the bipartisan pushback that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…rate for those who  apply to be TFA teachers is as low as 11 percent. That is as selective  as many of the most elite colleges in the country.\n\nI was a teacher through TFA in Los Angeles. I taught 10th grade  English. I had students who were, on average, at a fourth or fifth  grade reading level when they came to my classroom, but I had a  tremendous…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. The scenes we are seeing in Los Angeles  right now are absolutely horrifying, and California's radical political  leadership has done everything possible to usher in this chaos.\n\nFirst of all, they aided and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692164/protests-in-los-angeles-california"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…district attorney, would have dealt very seriously  with the person who bit off the finger of an ICE agent.\n\nIn fact, Minneapolis--which is kind of like, I guess, New York West  or Los Angeles East, they did not see anything worth prosecuting when  you bite off the finger of an ICE agent.\n\nThen we went to the Federal law enforcement, and they convened a  grand…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the lives  we lost by doing everything possible to prevent and mitigate future  attacks. With major events on the horizon, including America250, the  FIFA World Cup, and the Los Angeles Olympics, we must ensure every  necessary security measure is in place to protect the millions of  visitors and attendees these events will bring.\n\nMadam Speaker, I…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…citizens. Once  again, the President did not ask approval from Congress. Reagan acted  swiftly, lawfully, and decisively.\n\nToday, the actions taken against the cartel of the los Soles, headed  by Maduro, fall squarely into this same category--operations against  nonstate actors and criminal organizations, not a war against a  sovereign nation or a legitimate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…his associates, along with  offering a $15 million reward for his capture.\n\nThe 2020 indictment described how Maduro and his top lieutenants  served as leaders of the Cartel de los Soles for over two decades and  partnered with known designated foreign terrorist organizations to  move, at the time, over 250 tons of cocaine through Venezuela--cocaine  that…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…thought, and what the people who  lived in Montana and Alaska thought.\n\nAll they cared about was what their NGO and environmentalist friends  in Washington, D.C., New York, and Los Angeles thought about lands in  faraway rural places and how they wanted to impose their will on what  happens in these rural areas where our resources abound.\n\nIsn't it ironic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]