[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "Even the Trump administration's own experts at CMS, the  Centers for Medicaid and Medicare Services, say that implementation of  this rule could lead up to 1.8 million people to lose health insurance  just this year, 2026.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Speaker, it is with great honor that I rise today  for the third week in a row to anchor the Congressional Black Caucus'  Special Order hour to tell stories of people who stand to lose their  health insurance if Congress does not act in 22 days.", "title": "Restoring Enhanced Premium Tax Credits", "date": "2025-12-09"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "In Vermont, 27,000 people  who rely on the tax credits will lose their health insurance.", "title": "Cloture Motion", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Every  millionaire will get an $80 million tax credit, and the 25 million  people in this country who are relying on enhanced tax credits so they  won't lose their health insurance, they are basically saying to them:  To hell with you.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "When people lose health insurance, the consequences  are real, and they are devastating.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "They had said it was 13.5 million, but now, because of the  changes before the bill went from the Energy and Commerce Committee to  the floor, it is now 16 million people who will lose their health  insurance, primarily because of all this red tape.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "Speaker, if we don't extend the tax credits for the  Affordable Care Act, costs for healthcare will go up for 20 million  people and millions more will lose their health insurance.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "As a result, people are going to lose their health insurance.", "title": "One Big, Ugly Bill", "date": "2025-06-03"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Expiration of the tax credits will  result in health premiums increasing by an average of 114 percent for  individuals who rely on the marketplace, forcing 4.2 million people to  lose their health insurance.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Millions will lose their health insurance and  will be hungrier and sicker.", "title": "Republican Budget Will Make Us Sicker", "date": "2025-06-03"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "I reject this bill that bill rips health care from 17 million  Americans, with over 535,840 Illinoisans expected to lose their health  insurance, including 102,174 children and 27,000 seniors in my District  alone.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "We have told stories of people worried about how they are going to  pay that unexpected bill if they get sick or injured or if they lose  their health insurance.", "title": "Healthcare Affordability Crisis", "date": "2025-12-15"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Seventeen million Americans will lose their health insurance.", "title": "One Big Beautiful Bill Act", "date": "2025-07-08"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Madam Speaker, at a time when our colleagues are perfectly content to  see millions of Americans lose their health insurance, when they do  nothing to extend the Affordable Care Act tax credits that millions of  Americans are depending on, at a time when they are happy to throw  millions of people off of Medicaid coverage, they decide to change the  subject in order to vilify and demonize a small minority.", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Representative Judy Chu had an amendment striking cuts to the  Affordable Care Act, cuts that are in this one big, ugly bill that will  cause millions of everyday Americans to lose their health insurance or  experience having their costs go up.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}]