[{"senator": "Andy Kim", "party": "Democrat", "sentence": "…bills when it  comes to  healthcare. We see that tens of billions of them will have to pay  more--possibly double--what they are already paying. Over 4.5 million  Americans will lose their care, including many in New Jersey. That is a  catastrophe that we see coming. We knew it was coming, and we tried to  take action to be able to address that. What happened?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…that will meet the needs of all  of our communities.\n\nBut Donald Trump wants to throw these bills out the window so he can  pick which communities win and which communities lose when it comes to  Federal resources.\n\nFunding laws are still laws, and Congress passed these laws with  bipartisan support to direct resources to these programs. No President…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…with special needs. I'm also a nurse in primary  care settings. My story is from the front lines. . . . If you cut  Medicaid, Americans will die. People will get sick. They'll lose jobs.  Some won't survive. It's not an exaggeration. It's reality.\n\n``This bill doesn't cut waste. It cuts the heart out of programs that  help Americans meet their basic needs:…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Speaker, 4.7 million Floridians, one in five who live in the Sunshine  State, depend on the ACA. It is estimated that without the tax credits,  over 1.4 million Floridians will lose their health insurance entirely.\n\nThey are entrepreneurs. They are caregivers. They are cancer  patients. They are part-time workers. They are small-business workers  who have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698595/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that have represented Democrats or brought cases against  him--and he is telling them that if they don't fall in line and stop  doing work to oppose him, their clients will lose access to Federal  work.\n\nThat is extortion. This body, Republicans and Democrats, should stand  up against it. But it is working. Several law firms have signed deals  with…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…were ignored.\n\nOver the holidays, the Department informed us that the cuts were  final and will begin immediately.\n\nOver the next 3 years alone, schools in our district will lose  millions of dollars promised and planned for. The program has already  shown positive educational outcomes, and the negative consequences for  our kids will be felt for years…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Baltimore County and expansions  that have happened across this country will likely vanish overnight.\n\nIn fact, the Urban Institute says that as many as 18.3 million  children will lose access to free school meals under these cuts.\n\nFood banks will be overwhelmed. Children will go hungry, and it will  have a domino effect: a domino effect on their education,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…reckless  Republican budget. I voted ``no'' because it cuts hundreds of billions  of dollars in funding for SNAP and Medicaid, which means children will  go hungry, seniors will lose care, and people with disabilities will be  left behind, period.\n\nYou don't have to take my word for it. The Congressional Budget  Office issued a letter on March 5 where they…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689057/voters-sent-us-to-congress-to-lower-costs"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…Medicaid  for basic services like birth control and cancer screenings. In fact,  the Congressional Budget Office warns that this bill would cause at  least 13.7 million people to lose coverage.\n\nMr. Speaker, 42 percent of my constituents depend on Medicaid, and 60  percent of children in the district depend on Medicaid. Republicans are  choosing to strip…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691437/trumps-one-big-ugly-bill"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today, I rise on behalf of the 800,000  children who will lose access to early childhood care, healthcare, and  education because of the Trump administration's budget.\n\nTheir budget proposes to eliminate Head Start, the nationwide program…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…in our  country and the world, as well as to corporations--many of them,  multinational corporations.\n\nWe are in crisis--our Nation is in crisis--as more and more Americans  lose trust and lose faith in our country, in our democracy, in the  people who serve--the 535 Members: the 100 Members of the Senate and  the 435 Members of the House of Representatives.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…4 in 1965 to 24--a total of 150.\n\nMr. Speaker, I submit that a good many of these 150 are currently at  risk. If things continue as they are in Texas, then we are likely to  lose a third or more of these 150 Members of Congress.\n\nLet's talk about Texas for just a moment. In Texas, we have evidence  and, Mr. Speaker, I include in the Record this letter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…about a shutdown,  but what we haven't been having is a negotiation about how to protect  families from a rate shot that they can't afford that means they are  really going to lose healthcare.\n\nI do urge us and I urge the President to act aggressively to resolve  this. It will help folks. Whether they are in a red State or a blue  State, whether they identify…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…However, Republicans aren't worried about that. They don't worry  about bounced checks because Republicans live in a different world, a  world where banks win and families lose.\n\nI urge my colleagues to vote ``no.'' Vote for people, not for banks.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689850/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…for those affected by natural disasters,  the deadline for the lookback period is not extended. This leads  taxpayers, as you can imagine, Mr. Speaker, in disaster areas to lose  out on money that they are owed because their lookback period is  shorter than expected.\n\nThis bill would fix that, by aligning the lookback period with the  postponed tax…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…families across rural Arkansas for many  years, as I said, managing their finances, they are pretty smart about  how to do that, Mr. Speaker.\n\nThe truth is if the consumers lose access to overdraft protection,  they will be forced to turn to alternative sources of credit that may  be more expensive and riskier, have less consumer protection and  documentation,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Rocket  Lab, Boeing, L3Harris, and so many others, along with Northrop Grumman,  to make sure that we are dominant in space so that we do not take  second place in space and lose that technological dominance, which is  so necessary to win this latest cold war.\n\nJust a few years ago, we were playing catch-up. As I mentioned  before, we were literally…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…Have you seen an electric tractor, baler, or plow? I haven't because  they  don't work on farms or in the real world. In fact, the heavy-duty  trucks in cold weather States lose 20 percent of their battery  capacity.\n\nWhen compared to cities, rural areas have extremely low EV rates,  with the vast majority of rural areas having EV registration rates…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…and other national parks. They do it every year.\n\nUnder a Schumer shutdown, those plans will be forced to be canceled.\n\nLocal businesses like hotels, restaurants, they will lose revenue.  Park staff are reduced to skeleton crews. Trash piles up. That is not  stewardship. That is neglect.\n\nThat is what the Democrats are risking. It is what Democrats…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…workplace.\n\nIn summary, this legislation is necessary to support the recruitment  and retention of the Metropolitan Police Department.\n\nWashington, D.C., cannot afford to continue to lose police officers  during the ongoing crime crisis in the Nation's Capital city.\n\nMy colleagues recognize the importance of supporting the law  enforcement officers who risk their…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…reauthorization will assist countless Wyoming  communities that are uniquely and disproportionately impacted by  bureaucratic decisionmaking beyond their control.\n\nLastly, we must not lose sight of the underlying problem and continue  to prioritize policies that restore timber production and the original  intent of our Federal land management agencies: supporting…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…narcoterrorist. He was in league with the very drug traffickers who are  in the business of killing our kids for profit. He didn't just tolerate  drug traffickers in Venezuela or lose control of his territory and  allow them to run wild; he was a drug trafficker.\n\nI didn't conclude that alone. That was not President Trump's sole  decision or even President…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…long as I serve here in the  people's House. It is important to me, to my community, and, most  importantly, to the rule of law. If we don't respect the rule of law,  we will lose everything in the United States of America.\n\nWe have to have a system that our Founders established that allows us  to know that we will be treated fairly. We pass the laws,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…do it. We know what happens if you overregulate and  don't produce the energy. That is a good example right there from  Europe.\n\nWe know we need the power or we are going to lose the great battle of  our time of who is going to control AI and supercomputing, eventually  quantum computing.\n\nThe very first thing we can do to really bridge that power gap…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…another day a qualified professional can't serve. It is  another day the system fails those who have served and protected us  all. It is another day the swamp wins and our heroes lose.\n\nWe ask our veterans to wait for many things. Quality healthcare  shouldn't be one of them, not in President Trump's America and not on  our watch.\n\nMr. Speaker, I urge all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…this year on the Big Beautiful Bill in July to destroy  healthcare for millions of Americans.\n\nWe need to find a path forward toward ensuring that millions of  Americans do not lose insurance through the Affordable Care Act and  Medicaid, something that will raise insurance costs for everyone and  that will increase ER wait times in my State and in every…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…we use the  program for healthcare and poor people to try to penalize those foolish  people who get married first.\n\nIt is easy. It varies from couple to couple how much they lose if  they get married. I think it is safe to say it is very easy to come up  with hypotheticals of $25,000 or more--a $25,000 penalty in this  country from getting married and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…agricultural and small business  families to keep more of their hard-earned dollars. Farm families were  relieved that they no longer have to fear being forced to sell land  when they lose a loved one. By expanding the death tax exemption, we  brought the tax code in line with today's farm economy and allowed more  farm families to keep their operations in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…providing the service, many banks  and credit unions will be forced to reduce or eliminate overdraft  programs altogether.\n\nBecause of the CFPB's rule on overdrafts, consumers will lose  options. The resolution will repeal the CFPB's rule and protect  consumers.\n\nMr. FITZGERALD. Mr. Speaker, many people will face declined payments,  higher minimum balance requirements…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…During the Vietnam War, 8.7 million Americans served in our Nation's  Armed Forces, with over 2.7 million being deployed to Vietnam.  Tragically, 58,281 servicemembers would lose their lives in the  conflict, and many more were wounded in action. Moreover, there are  nearly 1,600 Americans who are still classified as missing in action or  having died…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}]