[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…and give a speech congratulating them from here on  the House floor if they won the series. I would have, but I won't. Why  won't I? Because the truth is that Minnesota didn't lose game five.\n\nI was there in New York. The Liberty didn't win. The WNBA gave it to  them.\n\nLet's stop pretending that what happened in game five of the WNBA  finals was just a…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the most  effective job-creating tools we ever had.\n\nThousands of workers, many in rural and coastal counties in my home  State of Oregon, but also across the country, will lose the jobs they  just started. Jobs in solar, wind, battery storage, clean  manufacturing, those are jobs with good wages and benefits that are  supporting their families.\n\nRipping…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…with special needs. I'm also a nurse in primary  care settings. My story is from the front lines. . . . If you cut  Medicaid, Americans will die. People will get sick. They'll lose jobs.  Some won't survive. It's not an exaggeration. It's reality.\n\n``This bill doesn't cut waste. It cuts the heart out of programs that  help Americans meet their basic needs:…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…to be  fun; it is going to be a nightmare for our farmers. And many of the  farmers in my State worry that they will be able to farm at all.\n\nIt is not like they are going to lose farmland. There are rich  people, billionaires, software executives who will buy farmland. We are  going to lose farmers. I know this because we have already been through  this…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that have represented Democrats or brought cases against  him--and he is telling them that if they don't fall in line and stop  doing work to oppose him, their clients will lose access to Federal  work.\n\nThat is extortion. This body, Republicans and Democrats, should stand  up against it. But it is working. Several law firms have signed deals  with…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans  have scheduled a Rules Committee meeting on their one big, beautiful  bill at 1 o'clock in the morning.\n\nThis is the bill that will cause millions of Americans to lose their  healthcare and nutrition assistance in order the pay for tax breaks for  billionaires. Who does that?\n\nWhy are they meeting at 1 o'clock in the morning? It turns out…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691511/one-big-beautiful-bill"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…what are they cutting? They are cutting $750 billion in Medicaid  benefits. That is just a fact. Go Google it. You will see the cuts.  They claim that people aren't going to lose their healthcare, but the  independent CBO says that up to 14 million Americans may lose their  healthcare. Up to a million of American children, kids born in the  United States,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…it will fail--20 million  Americans will see their premiums surge on January 1. Many will not  even be able to afford hundreds or even thousands more each month, they  will lose their healthcare coverage completely.\n\nThis is a partisan exercise that does nothing to address the crisis  before us. That is why, moments ago, four Republicans signed onto…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698398/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…about a shutdown,  but what we haven't been having is a negotiation about how to protect  families from a rate shot that they can't afford that means they are  really going to lose healthcare.\n\nI do urge us and I urge the President to act aggressively to resolve  this. It will help folks. Whether they are in a red State or a blue  State, whether they identify…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today, I rise on behalf of the 800,000  children who will lose access to early childhood care, healthcare, and  education because of the Trump administration's budget.\n\nTheir budget proposes to eliminate Head Start, the nationwide program…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…depend on Medicaid for their basic healthcare.\n\nIn Illinois, 772,233 adults are enrolled in the ACA Medicaid  Expansion. If Republicans cut Medicaid, these constituents would lose  their healthcare. We have the obligation to remain defiant in our  position that everyone independent of citizenship status, ZIP Code, or  age has a right to a dignified, healthy…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Medicare, and the Affordable Care Act. These deep cuts will allow the  richest Americans to receive, on average, an additional $30,000  annually, while the poorest Americans will lose approximately $700  annually.\n\nThis legislation is a complete betrayal of the American people,  extending additional tax breaks to the wealthiest individuals in this  country…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…his attacks on the bipartisan appropriations process? And when  he does that and the majority--the Republicans in Congress--allow this  to happen, how do the American people lose?\n\nMs. BALDWIN. Thank you.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Expiration of the tax credits will  result in health premiums increasing by an average of 114 percent for  individuals who rely on the marketplace, forcing 4.2 million people to  lose their health insurance.\n\nI hear the fear in the voices of my constituents, Republicans and  Democrats, and Americans across the country who talk about healthcare  and the looming…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and  have it be affordable.\n\nPremiums are going to increase, on average, about 75 percent as the  Senator said. One in four people who have a chronic condition are going  to lose out on coverage; 3.3 million small businessowners will see  their premiums increase.\n\nI just want to stop on that point for a moment because the Senator,  my colleague here,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…providing the service, many banks  and credit unions will be forced to reduce or eliminate overdraft  programs altogether.\n\nBecause of the CFPB's rule on overdrafts, consumers will lose  options. The resolution will repeal the CFPB's rule and protect  consumers.\n\nMr. FITZGERALD. Mr. Speaker, many people will face declined payments,  higher minimum balance requirements…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this round of what will apparently be a new  precedent of ongoing, rolling redistricting, you are going to see  millions of Americans across all of these States, Mr. Speaker, lose the  right to vote for their current Representative.\n\nMy own district, for example, under a newly proposed map, would be  cut into six different pieces. Hence, at least five-sixths…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…understands  Medicaid, that we are not cutting one single person out of that program  who truly qualifies for that program.\n\nThe only people who will be out of that program or ``lose  healthcare'' are people who lied on their applications and are no  longer eligible.\n\nSecond, if a person is an illegal alien, they will not get Medicaid.  People will say that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Rocket  Lab, Boeing, L3Harris, and so many others, along with Northrop Grumman,  to make sure that we are dominant in space so that we do not take  second place in space and lose that technological dominance, which is  so necessary to win this latest cold war.\n\nJust a few years ago, we were playing catch-up. As I mentioned  before, we were literally…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the Tax Cuts and  Jobs Act, an average American will have a tax hike of 22 percent,  $1,700 would be the extra expense for families of four, 26 million  small businesses would lose their comparable tax break through the 20  percent 199A deduction, child tax credit would be cut in half for 40  million families, the standard deduction for 91 percent of all…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…reauthorization will assist countless Wyoming  communities that are uniquely and disproportionately impacted by  bureaucratic decisionmaking beyond their control.\n\nLastly, we must not lose sight of the underlying problem and continue  to prioritize policies that restore timber production and the original  intent of our Federal land management agencies: supporting…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reductions and  modernization over 10 years. $86 trillion is the baseline spending. We  are talking about trying to trim $2 trillion out of the $86 trillion.  This causes people to lose their minds.\n\nHave we lost our sanity in this country? We can't find--that is  what--2.3 percent? Forgive my math. I am trying to do it quickly. That  is Armageddon? Does that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…long as I serve here in the  people's House. It is important to me, to my community, and, most  importantly, to the rule of law. If we don't respect the rule of law,  we will lose everything in the United States of America.\n\nWe have to have a system that our Founders established that allows us  to know that we will be treated fairly. We pass the laws,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…this is still the case in States like California,  where a hostile regulatory environment has forced refineries to reduce  operations. In fact, the Golden State is expected to lose 17 percent of  its capacity in the next year. This has led to an average gasoline  price of nearly $5 per gallon, an increased fuel dependence on Asian  producers, and jeopardizing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…another day a qualified professional can't serve. It is  another day the system fails those who have served and protected us  all. It is another day the swamp wins and our heroes lose.\n\nWe ask our veterans to wait for many things. Quality healthcare  shouldn't be one of them, not in President Trump's America and not on  our watch.\n\nMr. Speaker, I urge all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…from someone who was never or is no longer  eligible to receive it.\n\nAccording to the nonpartisan Congressional Budget Office, of the 7.8  million people Democrats say would lose coverage, 4.8 million are able- bodied adults with no kids who could work, but don't. Another 1.4  million are in the country illegally and 2.2 million simply don't  qualify…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692933/medicaid-should-serve-the-truly-needy"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Robert Rector, who  works for the Heritage Foundation, found approximately 90 programs in  which eligibility depended upon having a small income.\n\nIn other words, you would lose eligibility for these programs if you  either worked and, depending on the program, made more than $12,000,  made more than $25,000, made more than $50,000, or had somebody…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…on when our constituents flip the  switch.\n\nPJM, the largest grid operator in the Nation and sole grid operator  for my home State of Ohio, has announced that they expect to lose about  40 gigawatts of generation by 2030. That is 21 percent of PJM's total  capacity, and new power generation is not coming online quickly enough  to offset the risk posed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…miraculously, they don't care.\n\nWhen it comes to the attacks on the Jews in Israel put out there by  the Palestinians, they will purport to care about the Palestinians who  lose their life when the Israeli Army inevitably had to go back into  Gaza, but they don't care about Muslims who are dying in other wars.  They don't care that many, many Muslims…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…winning contracts year after  year.\n\nIf small businesses can't break into Federal contracting, innovation  is stifled, costs for taxpayers increase, and American entrepreneurs  lose out on opportunities to grow.\n\nMy bill, the SPUR Act, addresses this issue by requiring the SBA to  track and report the number of new small business participants into the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}]