[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…by Republicans in this Congress and in this White House. This is a  lethal risk to take on to pay the tax breaks for billionaires.\n\nIf this bill passes and even one patient loses their insurance  because of burdensome paperwork in a single hospital or nursing home,  the responsibility will fall on anyone who voted yes on this bill.\n\nAnd our State and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…life may  not happen again because we went through that process.\n\nThe question is whether there is going to be another Alex Pretti  sometime soon, where another U.S. citizen loses their life because of  this overreach of power, because we are not investigating, we are not  protecting these civil liberties, and we are not understanding that we  have an…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Congressman Luis  Gutierrez.\n\nAn immigrant from Mexico and the son of a bracero, Chuy Garcia has  spent 45 years as an organizer, public servant, and a coalition builder  who never loses sight of the people he serves. He has been a steadfast  champion for dignity, equity, and justice across Chicago.\n\nHe stepped out of this race for one reason and one reason…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…will lose $24.8 billion. Louisiana, the  Speaker's home State, will lose $20 billion. South Carolina will lose  $20 billion. States with small budgets would get hammered.\n\nIowa loses $4.1 billion. What did Senator Ernst from Iowa have to say  about it? She is not concerned. She says: ``Well, we all are going to  die.''\n\nKentucky loses about $12 billion.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…your car before you can drive again. They say that it  is painful to have to do that every morning and going back from work.  That doesn't compare to the pain of someone who loses a mother, a  father, a son, a daughter, a cousin, an uncle, an aunt, or what have  you.\n\nIf we want to deal with drunk driving, let's seriously deal with  drunk driving. This…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…How can we be sure that the funding laws we  pass will help all of our communities succeed if our Republican  colleagues will simply let President Trump pick who wins and who loses  when it comes to Federal support?\n\nPresident Trump's Budget Director Russ Vought has already made it  clear that he won't stop with this rescission effort. He just opened…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and billions of  dollars in new costs are going to be thrust upon States. States are  going to have to decide whether to cut other programs in order to make  sure that no one loses their nutrition benefits, or they are going to  have to cut people off their nutrition benefits.\n\nThe SNAP benefit, on average, is about $2 per person per meal. That  is it.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…side in Congress, five more  seats to hold on to power, five more seats to continue to be the  reckless, ruthless, lawless President that he is, five more seats.  Because if he loses the House, he loses his ability to do many of the  things that the House can constrain him and prevent him from doing,  because the House controls the purse strings.\n\nHe said:…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…getting sick. Her daughter relies on Medicaid to pay  for the formula that keeps her alive.\n\nWithout it, she won't just struggle. As her mother wrote plainly to  me: ``If she loses Medicaid, she will die.''\n\nMr. Speaker, we must not gut Medicaid to give tax breaks to  billionaires while moms are begging for their children to survive. This  mom's story…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691433/gop-tax-scam-hurts-women-and-families"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…earned a BA--``yet he earned a BA on the autism spectrum and lives  `independently' but with our support and works a part-time job.'' She  put ``independently'' in quotes.\n\nIf he loses his medical coverage, he would not be able to       afford to live where he lives and, most importantly, will not       be able to afford his meds. He has medications that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…The President is harmful to the processes that we have enjoyed in  this country. He is unfit to be President. He is also unfit because he  disrespects the judiciary. When he loses a case, it is always the  judge's fault.\n\nWhat is amazing to me is that I have colleagues who are buying into  that, that it is the judge's fault. Let's impeach the judge because…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and his wife and his daughter rely on the Affordable Care Act.  They pay right now about $700 a month. He looked at his bill and his  bill would go up more than $1,400 if he loses the tax credit.\n\nHe has about 40 employees and they will see their premiums spike, as  well. It is a lot of money for people, Lester said, and not knowing  what the price is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…as he is unable to due to his ability to communicate by mouth  or by ASL. Michael has relied on Medicaid for hearing aids, surgeries,  dental work, housing, and more. If he loses his coverage, she believes  Michael will become frustrated and either go to jail, self-harm, or  die.\n\nMichael's mother passed away when he was 19. With no other family to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691458/medicaid-and-snap"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…happens is that those structures of accountability are either  so degraded or so completely co-opted by the regime that the truth is  just buried, and the political opposition loses the basic tools that it  needs to win.\n\nIn every democracy that stops being a democracy, then, there is a  familiar story. There are four institutions that the regime attacks…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…this  folly.\n\nRepublicans call their bill a tax break, but, in reality, it is a tax  hike and a job killer, except for China, where it is a job creator.  China wins; America loses.\n\nIn the coming days, Americans will take a look at the Republicans'  Big Beautiful Bill and discover it gets uglier and uglier the closer  they look.\n\nThe bill, hopefully,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…for rural communities.\n\nThis measure is of particular importance for my home state of Idaho,  as 62 percent of our land is owned by the federal government.\n\nEvery year, Idaho loses revenue in timber sales due to wildfires  fueled by federal land mismanagement. In fact, in 2024 alone, a  staggering one million acres of the Gem State went up in flames.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697656/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…them, not only can't afford  an EV, these vehicles are not compatible with our daily lives.\n\nHow are you supposed to drive an electric vehicle when it is 20 below  zero, and it loses 60 percent of its battery life in a short period of  time?\n\nWe cannot forget that the critical minerals that are used to make  these EVs are sourced from Chinese Communist…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…Act is about more than technology. It is about  public trust. When a local government falls victim to ransomware and  emergency services are delayed, when a school district loses student  records, or when basic services are interrupted, citizens lose  confidence in those institutions.\n\nThis bill helps prevent those outcomes by equipping State and local…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…discovered, and she was sentenced and  ordered to repay $25,000 in restitution. This case is not isolated. The  Government Accountability Office estimates that the Federal Government  loses up to $521 billion to fraud every single year.\n\nThe American people expect honesty, fiscal discipline, and respect  for their sacrifice. I am proud of the Republican Conference…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…bring these therapies from the lab into real world  care settings. Again, we can't wait 5 or 10 years while veterans  continue to suffer.\n\nEvery day we delay is a day someone loses hope or their life.\n\nIf there is a treatment that works, we have a responsibility to be  ready to deliver it. This isn't about politics. It is about promises  kept. We owe…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…out the form.\n\nWhy does this scare the hell out of the IRS? It is because the IRS is  the second most unionized bureaucracy in the Federal Government. It  turns out the union loses its mind when we start talking about  technology to take care of the American people. Wouldn't we like to  pick up the phone and call, whether it be the Social Security  Administration…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…ready to have the revolution of how we  spend money. That is because adopting the very technologies, the cures,  the things we can do, this army of lobbyists outside this door loses  their blanking minds because we are requiring them to either change  their business models or make the bureaucracy do it differently or  maybe come up with the conclusion…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, in every election, somebody wins and  somebody loses. Democracy depends on the losing side trusting that the  election was a fair and accurate reflection of the will of the  majority, and the winning side depends on the same…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…enforce its laws, or to confront its enemies-- even when those enemies are beating police officers and firebombing  Federal buildings right before our eyes.\n\nWhen a government loses the ability or the will to defend its own  cities, its own institutions, its own people, then it ceases to be a  government worthy of its name.\n\nThe path back to justice is…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Colorado, who are overcharged for insurance because their ZIP Code  inaccurately places them in a higher risk area.\n\nThink of the local government already stretched thin that loses  millions of dollars in vital sales tax revenue because transactions are  mistakenly attributed to neighboring jurisdictions.\n\nThese challenges are not unique to Colorado.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…us from using technology  because--I actually can't give you an honest answer. We know that, for  years, I have been trying to fix technology at the IRS, and the IRS  union loses its mind thinking: You are trying to get rid of us.\n\nWhen we have been doing the audit at the Pentagon, the unionized  auditors come and want to have meetings with me. They…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…resisting, or impeding Federal officers,  or of organizing, promoting, encouraging, participating in, or carrying  on a riot under sections 111 or 2101 of title 18 of the U.S. Code loses  their nonprofit status and is ineligible for Federal funding going  forward.\n\nThis is a commonsense step that will prevent the sort of lawlessness  that we saw in Los Angeles…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693063/no-tax-dollars-for-riots-act"}]