[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…smallmouth bass, northern pike, whitetail deer, grouse, black       bear, and one of the largest selfsustaining populations of       native lake trout in America. The potential loss of these       unique recreational opportunities is a stark reminder of the       stakes involved in protecting this irreplaceable natural       resource.\n\nH.J. Res. 140 would…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…species from specific areas  and the introduction of invasive species, which further disrupts the  ecological balance. The long-term consequences of these practices are  the loss of biodiversity and the degradation of habitats that are vital  to the health of our oceans.\n\nMany of these harmful collection practices occur in international  waters, particularly…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Nation witnessed the killing  of a fellow American in broad daylight, in Minneapolis, Minnesota. Her  name was Renee Nicole Good. She was a concerned citizen and a mother.  The loss of her life was entirely preventable.\n\nThis tragic loss of life comes the same week that we remember what  occurred here 5 years ago on January 6. On that day, violent  insurrectionists…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698775/holding-ice-accountable"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tragic plane crash that occurred on a winter's night in Western  New York. They have worked so hard, and they are so proud of their  accomplishments. In the face of unspeakable loss, they worked  relentlessly to change America's aviation laws to prevent a tragedy  like that that happened to their families.\n\nToday, the 1,500-hour rule is the gold standard…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693275/nomination-of-bryan-bedford"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…no  cure. However, there is hope, thanks to Medicaid research advancements  and investments.\n\nRachel recently reached out to me and shared her brave story as she  grieves the loss of her father, whom she tragically lost to  Huntington's. She has made it her life's mission to advocate for proper  care of those affected and to eventually find a cure.\n\nIn…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691303/recognizing-huntingtons-disease-awareness-month"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…not accomplish cutting the funding.\n\nI would point out again, Madam Chair, when I talked about  international war crimes and when the previous speaker was talking  about the loss of life in Ukraine, there are 20,000 Ukrainian children  who have been kidnapped by Russia. They were ripped from their homes  and the arms of their mothers and fathers. That…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…flights from Albuquerque to CHCO, including several life-      saving surgeries.\n\nLosing funding for Medicaid directly translates to       unnecessary suffering and even loss of life for Joaquin and       countless children like him. Please do not allow that to       happen.\n\nMr. President, I can't tell you the number of parents I have met who  have…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…preference, Haitian exporters will face sudden and steep  tariff increases. For many factories, these added costs are  unsustainable. This result would be devastating: widespread job loss,  factory closings, and further destabilization of a country already in  crisis.\n\nWe should be clear about what is at stake. Allowing Haiti HOPE/HELP  to lapse would not only…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…real question is, do you believe in these civil liberties of  Americans or not? And when police or power by the Federal Government is  used in an excessive way and it means the loss of life, do you believe  in having an authority that investigates that and is transparent with  the American people and holds that system accountable?\n\nI know this: The Seattle…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…significant progress in the Homeland Security bill, and we were on  track to do that.\n\nHowever, then we watched unfold an unspeakable tragedy in Minnesota:  the unspeakable loss of a young woman who was killed.\n\nWe have heard from my colleagues from Minnesota not just about the  killing of Renee Nicole Good, but of the other unspeakable  transgressions…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…regulated because it is perfect.\n\nWhy do we need to regulate here? First, to prevent excessive fees;  second, to prevent deception; but, third--and this is obvious--to  prevent the loss of consumer money.\n\nVenmo is holding $7 billion of consumers' money. If you have a tiny  bank that is one-tenth or one-hundredth the size of Venmo, you have to  make sure that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Postal Service would mean higher costs, slower service,  and the elimination of rural delivery because corporations won't serve  what isn't profitable. It will also mean the loss of strong, middle- class jobs for over 640,000 postal workers across the country,  including nearly 74,000 U.S. veterans. In Delaware alone, nearly 1,000  of my neighbors would…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…that has been eliminated, gamblers now  will be required to pay taxes on money they haven't earned.\n\nMy FAIR BET Act would undo the Senate mistake by keeping the 100  percent loss policy in place. This will ensure that gamblers don't have  to pay taxes on phantom income and are not lured to offshore and  unregulated markets.\n\nMy legislation has bipartisan…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693484/bringing-fairness-back-to-gaming-taxation"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…President signed an executive order mandating the  elimination of diversity, equity, and inclusion offices across the  Federal Government, leading to the illegal firing and loss of  leadership across Federal and military service.\n\nIn March, he signed another executive order called the ``Restoring  Truth and Sanity to American History'' order, directing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…creating a severe gap in the economy. Haitian TPS holders       comprise a large portion of essential work in healthcare,       education, and other critical sectors. The loss of their       labor would harm not only individual families, but also       employers, local economies, and public services that rely on       their contributions.\n\nIn light…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…course of  history--the Reagan revolution and the Cold War in particular--might  indeed have been very different.\n\nI, therefore, join Norman's family not only in mourning the loss of  this great man but also in celebrating the highly consequential life of  a true American patriot.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…foot off the gas. People die. Families are destroyed, and communities  suffer.\n\nThis resolution does nothing to promote peace. It invites danger,  continued chaos, and the loss of more American lives--more American  lives.\n\nIt tells terrorists and cartels that the United States Congress is  willing to tie the hands of our Commander in Chief while they…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…astronomical prices at the gas station, but it is  going to increase the cost of goods and services throughout the  economy.\n\nThat is not to mention that it is going to lead to the loss of  hundreds of jobs for the folks who were working at these refineries.  The gas that we are now going to have to import from other States or  other countries is not only going…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…power of song.\n\nChris' journey to the golden ticket was not an easy one. He spoke of  his family's battles with illness, his mother's diagnosis of multiple  sclerosis, and the loss of his father, whom Chris called his Superman.\n\nWhen Chris stood before the judges and performed his original song,  ``Lonely Road,'' he was not just singing for a TV show.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700169/congratulating-chris-tungseth"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Cozean is part of the fabric of Farmington. He leaves a  legacy of caring that's exemplified by the many lives he touched. I  join with the Farmington community in mourning his loss but celebrating  his life of service today before the United States House of  Representatives.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to mourn the loss of  Richard ``Dick'' Wallace.\n\nDick was a man who led a captivating life growing up in Alexandria,  Virginia. From a young age, he exhibited an exceptional musical talent,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…the  Federal Government's most essential functions. But far too often, these  programs fall short of their well-intended purpose.\n\nBureaucratic overreach has resulted in the loss of trust from many  Americans. Waste, fraud, and abuse have contributed to excessive  spending without meaningful improvements in outcomes, and that is  driving our national…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…they want to see taxpayers  subsidize illegal aliens' healthcare.\n\nIn addition to the categories I just mentioned, the Congressional  Budget Office estimates that the remaining loss of coverage will be the  result of reducing waste, fraud, and abuse within these programs-- again, something that is not particularly controversial, and I can't  think of a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…a problem. If you are taking a  medication or even if you have a particular doctor you like, having  your plan change without your knowledge or consent could result in the  loss of coverage altogether or force you to change doctors  unnecessarily.\n\nBut this underscores one of the most significant problems that my  Republican colleagues and I have raised…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…and love, and the highlight of  her life was her husband, Jason, and her family. These descriptions are  all fitting for a woman whose name said it all.\n\nWhile we grieve her loss, we also celebrate a life well lived, a  mission well served, and a friend deeply missed. Our Utah communities  mourn for the Love family. We pray that they find peace in the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689230/moment-of-silence-in-remembrance-of-the-honorable-mia-love"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…individuals, 17 of whom were  in Laurel County. Had it not been for the rapid response and  coordination between police, fire, medical professionals, and good  Samaritans, the loss of life would undoubtedly be higher. Within 24  hours, every life had been accounted for, despite the mass destruction.  Heroic stories of rescues and make-shift tourniquets…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…foundation's station, and their ongoing support of the Nevada  County Fairgrounds.\n\nAfter nearly 60 years of marriage, Nancy passed in 2020, which was,  of course, such a great loss for Eddie. However, he stayed busy in the  last several years supporting political campaigns, keeping an eye on  local politics, and working to improve his adopted country.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…loopholes; it requires universities to fully disclose the source,  purpose, and terms of all foreign gifts; and it imposes real  consequences for noncompliance, including fines and loss of Federal  funding. It also ensures transparency in private university endowments,  preventing foreign adversaries from quietly shaping campuses' culture  and academic research…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…As they often do, these officers choose  to prioritize the safety of others above themselves, even in a life- threatening situation.\n\nWhile our community grieves this tragic loss, I am reminded of John  15:13, ``Greater love has no one than this, that someone lay down his  life for his friends.''\n\nMr. Speaker, please join me in praying for Deputy Sikes'…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690553/mourning-the-loss-of-deputy-brandon-sikes-and-praying-for-swift-recovery-for-deputy-gavin-white"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…is  constitutional, these troops were in and out of Venezuela in a couple  of hours.\n\nOnly the United States could execute such a dangerous and difficult  mission without the loss of a single American life. But instead of  celebrating Maduro's ouster and America's success, our Democratic  colleagues are determined to condemn the operation, all because…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}]