[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…food, veterans  who might have PTSD and need help, senior citizens who rely on SNAP to  help feed themselves, and so many others--people who are out of work  because they lost their jobs through no fault of their own--need SNAP.\n\nWhy are we not doing it? Not because the money is gone; it is there.  Not because it is not permitted; it is legal. But because…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…from hundreds of my constituents, former USAID public  servants, who dedicated their lives to making the world a better place.  Their overwhelming regret is not that they lost their jobs but that the  critical work they did to help the poor, the sick, and the starving has  stopped.\n\nI am sickened by what this administration has done to USAID and to  the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…He calls Ohio his  home, though he does not come from the Great Lakes region of Ohio.\n\nMr. Chair, if you look around our country, for many, many years my  part of America lost jobs and economic growth to California and the  West because of the Bureau of Reclamation. It is important to  understand what the Bureau of Reclamation does and the fact that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…assistance it's likely that I would not be a Member  of Congress today.\n\nThis Big, Bad Bill reverses the progress we've made addressing  climate change, resulting in thousands of lost jobs in renewable  energy, dirtier air and water, more extreme heat events, and poorer  health outcomes. At a time when energy demand is surging and clean  technologies are finally…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…deep in that part of the financial system that it cascaded out  across the entire economy, and everybody got hurt. Car dealers,  Realtors, small businesses, people who lost their jobs got hurt in 2008  because it was systemic.\n\nNow you have got the CEO of one of America's biggest insurance  entities warning us about this systemic risk.\n\nHere is an even…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…reputation around the world, and to the checks and  balances that are the foundation of our democracy.\n\nVermonters are outraged by what is happening. Dozens have already  lost their jobs. They want the United States to be a leader for good in  the world. They care about the image of the United States as the  world's oldest democracy. They are smart enough…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…in revoked funds. Whether that  happens or not, I can tell you, without a doubt, that the harm done  from the first round will be irreparable.\n\nThe cancellations will mean lost jobs for Americans, lost educational  opportunities for students. It will mean higher energy bills for  households and businesses across this country.\n\nIt will make it even harder…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…with teachers worried about students who don't have the  resources to weather the hardships so casually inflicted by this White  House.\n\nI heard from Federal employees who lost their jobs but were more  concerned about the veterans and seniors and kids with disabilities  they could no  longer serve. I met with medical researchers whose work fighting cancer…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689829/standing-up-for-americans"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…district. For 50  years, NIOSH has been helping workers all over the country, making sure  that workers are safe and healthy.\n\nDuring all the DOGE cuts, 1,500 NIOSH workers lost their jobs. We got  to work. We worked with labor and others, and 100 Members of Congress,  and we started getting those jobs reinstated.\n\nWe asked Secretary Kennedy to work with…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699625/niosh-workers-got-their-jobs-back"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…communities across my State.\n\nIn my district alone, the damaging effects of the administration's  cuts to USAID are already being felt. Thousands of talented  professionals have lost their jobs, and vital partnerships with our  local universities have been terminated.\n\nThese devastating cuts are not only costing people their livelihoods  here at home but are…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692405/trump-rescissions-request-and-usaid-cuts"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…by while we throw out all the  hard-fought gains we have made in American manufacturing since the  1980s; and, boy, believe me, they have been hard fought. Our region  lost so many jobs abroad to NAFTA and CAFTA and China PNTR. We fought  against those. We knew they wouldn't work, and they didn't. Now, we  have had about 10 years where we tried to rebuild…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and that the next quarter will be  worse. This is real money.\n\nIn an industry that America has been striving to bring back to full  production in this country, we have lost so many jobs abroad to cheap  labor and places that have no labor rights. This is what happens with  tariffs when we lead with flashy headlines instead of well-thought-out  trade…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…that we hold our elected officials to  account.\n\nAll across my district, there is not a single family who has not been  touched over the last 100 days: People who have lost their jobs,  teachers and firefighters, people who work for the VA and the Forest  Service, who work for our national security programs, scientists and  engineers, people who just…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…well-being of  the people in this country.\n\nBy the way, this has a real economic impact; and it is the economic  impact, first and foremost, among those individuals who lost their  jobs. But it is a real economic impact because we are eroding the  infrastructure of science, of inquiry, and of investigation for better  health cures. You don't destroy that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…supply chains. Tariffs create uncertainty in the  job market, leaving hardworking families worse off.\n\nWhen manufacturing jobs disappear as costs rise, Ohio families feel  it. Lost jobs and rising costs are not an abstract economic theory for  us. They are a harsh reality. Thousands of families I represent have  been touched. Another company just closed…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699062/manufacturing-jobs-lost-due-to-trump-tariffs"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…hadn't done it right. The rule was improper  and it was invalidated by the Supreme Court, but they are not going to  come back in and reopen the plant.\n\nThose jobs are lost. The jobs of the people who worked there, who  then ate lunch at the local lunch facilities, or who might have bought  a car, or might have bought something else there in the very…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…families and strengthen our economy, but  under this rule, companies will be forced to take on massive new costs,  costs that will either be passed on to consumers or result in lost jobs  and closed facilities. We cannot afford to let Washington bureaucrats  dictate policies that weaken American industries and send our  opportunities overseas.\n\nI urge my…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688532/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…year or so we have  seen a reckoning begin in higher education in this country, and we are  starting to see very positive changes. A number of university  presidents have lost their jobs, and universities are increasingly  committing themselves anew to protecting civil rights and promoting  academic freedom.\n\nThe DETERRENT Act will be an important part…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the southern tier.\n\nHowever, instead of moving forward, that project was tied up with  endless red tape and obstructed by regulators. Western New York and the  southern tier lost jobs and investment in energy security that would  have come from it. A project that should have supported a large  construction workforce and strengthened our region was derailed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]