[{"senator": "Al Green", "party": "Democrat", "sentence": "…We must all learn to live together as brothers and sisters, or we  will perish together as fools.\n\nI did not know Mr. Kirk. I don't believe I have ever met him. I meet  a lot of people, so I may have, but I don't believe that I have.\n\nHere is what I know about him: He was a human being. He was a child  of the same creator who created me. He had every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…entrusted by the American people to make will have  ramifications for millions of our fellow Americans and indeed for our  country for decades to come.\n\nThere may not be a lot of people able to watch at 4:05 in the  morning, but in just a few short hours, some of them on Medicaid will  be waking up and turning on the news to find out if what we did here…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Carolina.\n\nNow, this picture here is a picture that tells you a little bit about  education and DEI. As you can tell, this picture is about the  Revolutionary War. Now, a lot of people talk about Massachusetts and  Virginia and what they did for the Revolutionary War.\n\nLet me tell you something, if you were really educated properly, you  would know that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…this  Special Hour on such an important topic.\n\nMr. Speaker, I have seen the movie ``A House of Dynamite'' as well as  ``Oppenheimer'' the previous year, which introduced a lot of people in  the moviegoing world to the development of our first atomic bomb at the  Manhattan Project.\n\nIt is very important that we go from popular culture to real history  and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…colleagues on the other side of the aisle for the courage they  demonstrated when they decided to get rid of ``Sesame Street.''\n\nI don't know how many people know this, but a lot of people think  that ``Sesame Street'' is about the education of children, especially  in rural areas, and teaching the basics, like reading, writing, and  arithmetic. However,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…days--whatever it is--that  a deal is a deal; that we not write it, agree to it, celebrate  reopening the government, and then have President Trump on day two  start to fire a whole lot of people or claw back more money from the  Virginia Department of Health or cancel more economic development  projects in Virginia. Let's just say a deal is a deal. Congress will…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…his bill and his  bill would go up more than $1,400 if he loses the tax credit.\n\nHe has about 40 employees and they will see their premiums spike, as  well. It is a lot of money for people, Lester said, and not knowing  what the price is going to be because of a stalemate in Congress adds  uncertainty. I think everybody is feeling the anxiety.\n\nWho else…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…drink fine wine at Mar-a-Lago while  regular people suffer.\n\nMaybe they don't understand how much $1,000 a month is to the people  I represent. Guess what. It is a lot. For most hardworking people, this  is a catastrophic amount of money that suddenly needs to be added to a  monthly budget. It is more than what a lot of people earn during a week  of work.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Epstein files.\n\nNow, this weekend, Donald Trump said: ``Let's . . . not waste time  and energy on Jeffrey Epstein, somebody that nobody cares about.''\n\nWell, Mr. President, a lot of people actually care. We know that MAGA  was all in on Jeffrey Epstein. My Republican colleagues have sent  letters, they have posted, and they have demanded disclosure. Donald…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…fondly remembered in history as a result of it.\n\nMadam President, I am going to close by saying that this is an issue  that is near and dear to my heart, and I think a lot of other people  too. They have gone through experiences much like my own. I know they  realize that we have few moments of opportunity of service in the  Senate to really make a difference…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…not get better. It  is our responsibility now to make it better so that we can turn this  around and make this agency work.\n\nI am not for abolishing ICE. There will be a lot of people who are  going to be unhappy with my saying that, but so be it. We need to  reform it. We need to turn it around. We need to make it work on behalf  of the American people,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…to do. No, no, this is our Chamber.  We are not going to let any TV cameras in.\n\nWe let those TV cameras in. Well, now we are at a different stage in  our history, and a lot of people are seeing their news this way. So we  need to expand it and make sure we are on all of those platforms, as  well as the ones we already are on.\n\nThank you again to Senator…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…increase.\n\nThere are no increases to helping the poor or helping the hungry,  many of whom are in both Republican and Democratic districts.\n\nAgain, many of my colleagues have a lot more people on Medicaid than  my district does. Yet, here we are gaslighting and misleading the  public and saying: We are not cutting it. We are not doing this or  that.\n\nHow is…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…home 6  weeks later, but that entire 6 weeks I didn't have to worry about how I  was going to pay that bill. All I had to worry about was her and my  recovery. There are a lot of people that aren't that lucky.\n\nThere are a lot of people trying to decide right now whether to start  a family. There are people right now who are in the process of starting…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the people that are here-- from the pages I get to know in every class, to the folks that work the  door, the clerks, the Parliamentarians. It is a special place, and a  lot of people who are known here are not the ones that really keep this  place functioning.\n\nI come in here days and I have good moods or bad moods but always  find myself lifted when…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Mr. LANKFORD. Mr. President, this year, 2026, is the 50th anniversary  of the Hyde amendment. Now, that may not mean a lot to a lot of people,  but 50 years ago, the U.S. Senate and the U.S. House and the President  of the United States came to a compromise agreement over the issue of  abortion. It was a long,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…power of the Appropriations Committee. So do I. The fact is, we know  that to get our job done, at the end of the day, it is going to have to  be bipartisan and bicameral. A lot of people are going to have to move  or give up some things that they feel very strongly about for the  greater good of making sure that the Government of the United States is  appropriately…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…deserved. Few among us have  lived the American Dream like he has, and what a difference he has  made.\n\nMr. Speaker, I say to Doug and Shelley: Well done. I know I speak for  a lot of people. I thank him for his example of selfless service and  his commitment to helping his fellow man. Godspeed and may he enjoy a  well-earned retirement.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the low-income  housing are encouraged to build very modern, very upscale apartments  that maybe some of the average people cannot afford. As a matter of  fact, a lot of the average people may still be living with their  parents for a while even after they get married.\n\nWe have our Medicaid program, which is a fine program, providing  healthcare for…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…will say one last thing. Energy  independence and critical mineral dominance is a Trump administration  agenda. That is the America First agenda that is going to employ a lot  of people.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…through some spending  constraint. That is the only time in modern history when we have done  it.\n\nHere is the problem. This chart shows you what we are dealing with. A  whole lot of people are saying: Well, Chip, you and all of these fiscal  hawks, these fiscal conservatives, you guys want to do all of these  massive cuts, and we can't do it. It is crazy…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…few days  about the horrible assassination of Charlie Kirk.\n\nI was able to attend two ceremonies over the weekend in which people  gathered to memorialize him.\n\nI hear a lot of people talking about Charlie Kirk exercising his  right to political free speech, and we have to respect people's ability  to engage in political speech.\n\nI think if you look…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695392/charlie-kirks-religious-message"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…difference in  reducing the risk of infections and falls.\n\nI am thrilled to say that my bill extends the successful hospital at  home program for an additional 5 years. I know a lot of people being in  Florida where their parents will talk about the importance of if they  could stay at home, and I know this is critical.\n\nAn extension of this program would ensure…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697172/hospital-inpatient-services-modernization-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that Islam promotes violence.\n\nParallel legal systems are not keys to a thriving society. There must  be one rule of law for all the people.\n\nAll the way back in 1991--a lot of people won't know this--the Muslim  Brotherhood issued a memorandum about North America, detailing a plan  for the ``enablement of Islam in North America,'' establishing an  effective…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…expire. In  reality, it is only the Biden COVID credit bonus that will expire.\n\nWhat happened during COVID for the ObamaCare subsidies--they took off  the income caps, and a lot of people had zero-dollar premiums. If you  were making over half a million dollars a year, you, too, could get a  Biden COVID credit bonus and subsidy from the ObamaCare exchange…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…somebody who hypothetically should have been happy, right? According to  her father, Greta Thunberg was unhappy, despite all her material  wealth. I think that is true of a lot of people, sadly. They are  spoiled people with time on their hands in the West.\n\nShe became happy by spending all her time pushing this global warming  stuff. Do you know why it…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…China\n\nMr. President, I wanted to come to the floor to discuss a recent op- ed in the New York Times just a few days ago. It kind of made a stir. A  lot of people thought it was a really good op-ed. I didn't.\n\nI wanted to come to the floor and talk about this op-ed because it is  making the rounds. It is by the columnist Thomas Freidman,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…devil hates holy water.\n\nNow, President Trump early in his second term--I have given several  speeches about this--agreed to it. And I said at the time it was a  mistake. A lot of people said it was a mistake.\n\nHe got some bad advice, and I know who gave him that advice. And they  are no longer there. But be that as it may, I called the President and  talked…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the whistleblower disclosures of violating grand  jury secrecy rules when I obtained 197 of Jack Smith's subpoenas--wide- ranging subpoenas--that violated the privacy of a lot of people,  including a lot of Members of the Senate and Congress.\n\nSenator Johnson and I then made these subpoenas public--almost 2,000  pages of information. That information exposed…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…and working swiftly and in a smart way to deport those folks  who broke the law, not just coming to this country but once here in  this country.\n\nFor a change, I think a lot of people are finally saying that the  government is working for them instead of against them. Let's send a  clear message that law and order mean something, the Constitution means…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}]