[{"senator": "Al Green", "party": "Democrat", "sentence": "…explain to the President--I never called him a  name. I merely said to him: ``You do not have a mandate, you do not  have a mandate'' to cut Medicaid. My colleagues were shouting loudly to  prevent my voice from being heard, at least that is the way I received  it. So I repeated what I said. Their voices grew louder. I repeated it  again, and I was removed.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…centers, which also are  incorporated in the Medicaid funding that my colleagues, the  Republicans, want to slash. I will start by saying to you  unapologetically and very loudly that I believe to my core that  healthcare is a human right.\n\nNo one should have to choose between getting the care they need,  accessing their medication, or paying their…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Agency pushed out after analysts produced a straightforward, evidence- based assessment showing that Iran's nuclear program had not been  obliterated, as President Trump so loudly claimed. Rather than face  those facts, the administration decided to punish the messenger, and he  was let go from DIA.\n\nWe have seen, more recently, analysts, literally with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…no mandate to cut Medicaid.\n\nMy colleagues across the aisle became very rambunctious and decided  that what I was saying did not merit being heard, so they performed  very loudly. I am not angry with them. They performed loudly. I wanted  to make sure that the President heard my statement, and I repeated  myself and added Medicare and Social Security.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…conventional wisdom about big, high-paying university  programs. They just keep getting it done.\n\nCoach Hurley, who coaches the men's team, was rooting on Geno and the  women as loudly as anyone. It is a great university sports program that  brings everybody together. We are so proud of them, particularly in the  Second Congressional District. I have the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…colleagues are even considering a  plan that is so backward and so cruel for hard-working Wisconsinites  and seniors. This is wrong, and we must continue to fight back and say  loudly and clearly: Hands off Medicaid.\n\nMs. BALDWIN. Mr. President, I rise today for the third time this  evening  on behalf of Wisconsinites in rural communities whose access to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…with the people and  security of Taiwan. When asked if the U.S. will maintain its decades- old commitment to Taiwan, Trump has repeatedly avoided the easy answer,  declaring loudly that he won't provide a direct response.\n\nWe should pass this bill, but we should also urge our President to  not undermine Taiwan and not undermine the world economy by talking…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…beholden to Russia  and China would do.\n\nMr. Speaker, I urge my Republican colleagues to speak out against the  President's suggestion that we retreat from the world stage and loudly  oppose any outcome of this review that will harm America's economic  leadership across the globe.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Representative McClellan  and Representative Carter for inviting me to speak tonight.\n\nMr. Speaker, I rise today because there is a gun violence epidemic in  America.\n\nI have spoken loudly and clearly on gun safety again and again and  again, shooting after shooting. Moments of silence have never been  enough.  Thoughts and prayers have never been enough.\n\nAmericans…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Republican colleagues are refusing to act to stop healthcare premiums  from doubling for over 20 million Americans.\n\nI just can't stand by without a fight. Americans have said loudly and  clearly that they are in a healthcare crisis. That is not up for a  negotiation. But it didn't have to be this way. We are at this moment  because Donald Trump and congressional…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…they were under the Biden administration. They were  particularly high in the partial Trump administration before COVID. It  wasn't a COVID thing. Trump's policy is to yell loudly and accomplish  nothing when it comes to dealing with our trade deficits with China.\n\nTrump talks about other countries eating our lunch. Under his first  administration, China…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…International Brotherhood of Electrical Workers Local 8, a teacher in  the trades, a voice for women, and a standard-bearer for excellence.  She worked hard, spoke honestly, laughed loudly, and made room for  others to grow. She was, as all those who loved her say, pint-sized and  full of spice, unforgettable in every way.\n\nAbove all, Sydney loved fiercely: her…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…But we know that that was a lie because,  recently, at rallies he has been acknowledging that he used that  phrase, and he still uses that phrase. Just a few months ago, he loudly  and proudly repeated the same line. He said:\n\nRemember I said that to the senators that came in, the       Democrats. They wanted to be bipartisan. So they came in . .…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the memories of all those killed and injured this weekend be a  blessing.\n\nI have warned repeatedly that anti-Semitism is a scourge around the  world that must be condemned loudly and fought vigorously at every  turn. The Jewish people have been collectively demonized, increasingly  so in the last few years. This tragedy in Sydney shows the danger--the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Month after month, the Chinese Communist Party and Government further  press at the edges of Taiwan's security and America's support for  Taiwan.\n\nThis Congress must speak loudly about our concern about such  international actions by the Chinese Government, actions that could  intentionally or unintentionally lead to an escalation of China's  conflict…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…and manufacturers in the world.\n\nThis legislation is a win-win for school-age children and dairy  farmers across this country. I am proud that we now, once again, can  say loudly: ``Milk: It does a body good.''\n\nMr. Speaker, I encourage my colleagues to support this important  legislation.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698181/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our committee, as well as the Committee on Foreign Affairs, in  crafting economic deterrence to bad actors--certainly, the military  junta in Myanmar is a bad actor--calling loudly for a strong bipartisan  vote in this House on the BRAVE Burma Act, which I hope then will be  promptly considered by the Senate.\n\nThis is when the legislative branch and the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…raise these points because a Member of this House  recently made some truly vile and despicable remarks about Charlie Kirk  after his brutal assassination. Her words should be loudly and  universally condemned.\n\nLast night, on the House floor, a resolution of censure was brought  against her in the name of Charlie Kirk to formally punish her for her  hateful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Congressional Record in  September, triggered the CRA window that allows Congress to act today.\n\nCongress must act because Alaskans have spoken clearly, and they have  spoken loudly.\n\nThe North Slope Inupiat leadership, including the Arctic Slope  Regional Corporation, the North Slope Borough, and the Inupiat  Community of the Arctic Slope, have consistently…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…They took this process, flipped it on its  face, and they disregarded the voices of Montana.\n\nWell, I can tell you here this afternoon, the voices of Montana are  speaking loudly with the united Montana delegation both here in  Washington as well as Montanans back home in the State, and we are  going to right that wrong today. We are going to give Montana…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696070/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…clamor for war,  the regional situation remains precarious, and American servicemembers  remain in danger. Many advocates for war, giving voice to their real  feelings, have loudly opposed the current cease-fire. Those arguing  against a cease-fire give a callous testimony, insensitive to the  cruelties of war.\n\nSome 40,000 U.S. troops are scattered throughout…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}]