[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…inclusion policies are not about mandates and  quotas. On the contrary. DEI is about eliminating bias, opening doors,  and giving everyone, no matter what they look like or who they love a  fair opportunity for employment, promotion, and access to capital. DEI  is about understanding and knowing what these differences are and doing  everything that can be done,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…constitutional responsibility to do so.                           Slavery Remembrance Day\n\nMr. Speaker, and still I rise; proud to be an American with great  respect for the country I love, and I ought to be proud of it, proud to  be associated with it. I am proud because my ancestors were sacrificed  for more than 240 years  to lay the foundation for the greatness…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…years of this challenge, Leslie ran more than 1,300  miles during these marathons alone, but thousands more to train for  this incredible accomplishment.\n\nLeslie balanced her love of running with her already busy life as an  occupational therapist, wife, and mother of two. I am truly amazed by  Leslie's dedication, stamina, and drive.\n\nMadam Speaker,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694050/congratulating-leslie-rook"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…this just flat-out enrichment? They didn't lose. They are winning  as other people suffer. So is this really a bailout or just a flat-out  ``Hey, fellas. Here is $40 billion. I love you, Donald Trump''?\n\nMr. WELCH. Well, I appreciate that.\n\nI yield to the Senator.", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Inauguration, Matt was always willing  to seize the opportunity.\n\nA proud University Albany alum and Long Islander, Matt brought the  New York spirit to our office. Given his love for New York, Matt was  always happy to help at events in the district, and I have particularly  found memories of marching with him in the New York Pride.\n\nLike many of my…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…El Salvador and imprisoned in the  notorious CECOT facility.\n\nWhat is the evidence against him? A couple of crown tattoos above the  names ``Mom'' and ``Dad,'' symbols of his love for his hometown's Three  Kings Day celebrations.\n\nAndry's case exemplifies the dangers of unchecked executive power and  what happens when the rule of law is pushed aside.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have some confidence and security that we have the best  minds addressing health issues and focusing on cures to diseases that  all of us can be subject to or the people we love, that they will be  doing that job.\n\nBut these people are now just fired. They are gone. That means--just  think about it. An NIH scientist, that is somebody who probably has…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Glabb could see that all that these kids needed was a  break and somebody who cared for them.\n\nI thank Scott for the positive role model that he has presented to  our kids. We love him and wish him success in his retirement.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691910/recognizing-scott-glabb"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Scout troop. For God's sake, they are part of our communities, and  they are young adults who have now grown up to be lawyers, to be  doctors, to be teachers, and who have more love for everything that  this country stands for than anyone threatening them in Trump's  Department of Homeland Security. But this week the Trump administration  is now telling…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Mr. Speaker, here we are again--Yogi Berra once said that it is deja  vu all over again--debating this bill in the middle of the night. This  crowd must love prime time in Guam.\n\nThis has been the worst process of the worst bill I have ever seen  during my decade in Congress.\n\nThis is not what our Founders intended--far from it.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…elderly in home- and community-based  services that help protect these Americans who need our help. They live  with disabilities in their own communities and get the support, love,  and affection of those communities and their families.\n\nIn California alone, almost 15 million Californians are on Medicaid.  1,906,300 Californians on Medicaid have a disability.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…birth in  Reynolds, Georgia to the union of Thomas Carson and Mildred Dent Carson  Perry. She was primarily raised by her grandmother, Mrs. Leather Dent  who instilled in her a love of serving others and an unwavering faith  in our Lord and Savior, Jesus Christ.\n\nInstilled with a love of learning, Mrs. Booker graduated from Albany  State College with a…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I love America, and I  will do anything to protect our Constitution and our democratic values.\n\nDonald J. Trump has been committing crimes since day one: bribery,  corruption, taking…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691026/protecting-our-constitution"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…forever grateful for the timbre of his character and  the fidelity of his friendship.\n\n``CP'' accomplished much in life but none of it would have been  possible without the love and support of his beloved wife of nearly 74  years, Annie Ruth Redding; his children, Vickie Turner (David Gatch) of  Prattville, Alabama, Curtis Parham ``Bubba'' Redding (Dawn)…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…chips.\n\nMr. Speaker, this is corruption, plain and simple.\n\nIt is the prioritization of personal profit over the national  security interests of our country, the country we all love so dearly.\n\nIt is wrong. It is immoral, and my colleagues on the other side of  the aisle say nothing. Worse, some of them defend this conduct,  notwithstanding that they know…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Free societies do not fear free speech, even when that speech is  hateful or malignant or stupid. Free societies recognize that the only  way to separate fact from fiction, love from hate, truth from lies,  wisdom from folly, or good from evil is to put them side by side and to  trust the people to know the difference.\n\nNo central authority must ever…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…at several schools and across all grade levels, Nancy  touched the lives of countless elementary students and gave them the  skills and encouragement needed to pursue their love of music. Beyond  the classroom, Nancy is an amazing musician herself, serving as the  pianist for her church and previously performing at county festivals.  In retirement,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…President; Krista Vannoy, Immediate Past President; Frank Giannini,  Treasurer; Jim Dubinsky, Secretary; Isabel Ditzel; and Eric Monday.\n\nThis anniversary season opened with ``Love and Sacrifice: A tribute  to the Heart of Opera Roanoke,'' which also marked the retirement of  Maestro Steven White, whose more than 20 years of service have  profoundly shaped…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Unfortunately, Charlie was taken from us in a disgusting act of  political violence on September 10, 2025, but his legacy lives on.  Charlie will long be remembered for his love of God, his family and  this great Nation and the impact he had on each and every one of us.\n\nWe have the opportunity to carry on his memory by believing in the  power of ideas,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695709/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…members of Tren de Aragua, the  gang notoriously known around the country, have been charged in her  killing.\n\nNaming the refuge after Jocelyn is a very fitting way to honor her  love for animals and to preserve her spirit within the very landscape  that she called home.\n\nI thank Chairman Westerman and Senator Cornyn for their leadership  and support on these…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Carolina with strength and skill.\n\nI congratulate Coach Schnall and all of the players on a season to  remember. Their run inspired fans across the Nation and reminded us why  we love this game. We look forward to their continued success in the  years to come. Chants Up.                     Honoring Robert Franklin Childs III\n\nMr. FRY. Mr. Speaker, I rise…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692819/recognizing-coastal-carolina-university-baseball-team"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…productive  farmland in the country, some of the most unique trees in the world,  wonderful weather, good fishing. Everything nice, it seems like  California has it.\n\nI think we all love California, but we all realize somehow it is kind  of a different universe than the rest of the country that we live in.  Maybe they embrace that and like that, the good people…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Mr. MARSHALL.  I think those are great goals. And having  children and grandchildren that love the great outdoors, I want to  leave this world better than I found it.\n\nBut I guess where we disagree is, How are we going to get there? As a  family, we have done projects…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…to pay  their own rent and put food on their own table, much less providing  themselves with music, plant, and pet therapy.\n\nI know many taxpaying American families who would love to be able to  provide their children with one-on-one academic tutoring but simply  cannot afford it.\n\nThis all begs the question: Why are we investing in illegal families…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…As it is, under Governor Newsom, California has the  highest unemployment rate in the country. A recent jobs report showed  literally zero job growth in California. I would love to create more  jobs.\n\nWe could create jobs by hiring people to dig a hole and hire more  people to come and fill the dirt back in, which isn't that far from  what is actually…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…brought my district into Stanislaus County, I  was fortunate to bring him into my congressional office where he served  ably as my district representative.\n\nHis work ethic, his love for people, his sunny disposition, and his  simple decency made him an exemplary figure in our community.\n\nHe was always the picture of fitness and health until he was  diagnosed…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…legacy will live on in the work he did  and the countless lives he touched. Walt's commitment to serving his  fellow Veterans, his courage in the face of adversity, and his deep  love for his community will continue to inspire us all. His memory will  forever remind us of the importance of honoring those who serve and  making a lasting difference in the lives…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…our way of life.\n\nIn moments like these, we must all come together to reaffirm our  commitment to protecting the peace and civility that define the America  that I know and love.\n\nMr. COMER. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. COMER. Mr. Speaker, I join my House colleagues in offering my  deepest condolences…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "Mr. RYAN. Mr. Speaker, I thank my colleague, Mr. Deluzio, for his  leadership on this and for bringing this group together to remind us  that as Americans who love this country, we need that strong, muscular  economic patriotism to serve my constituents in my district, which is  the Hudson Valley of New York State, and across this country.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…district and ask them what they  could do with $16,000, the answers would be endless. Some may say that  they would purchase a car for their family or teenage child.\n\nMany would love to see that money stored away in an emergency fund or  a retirement fund. If their family has a loved one who is aging or  facing health challenges, that money could be used…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}]