[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…measures pass, then more pollution will fill our air, more  kids will miss school because they are sick, more seniors will land in  the hospital, more families will lose loved ones far too soon to  preventable deaths, and billions of dollars will be spent on health  expenses that could be avoided.\n\nCommunities like the ones I represent, low-income neighborhoods…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690469/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…wondering how she will afford her baby's asthma inhaler if premiums go  up; families like Deborah's in Boston, staring down premiums that will  double while they care for loved ones, serve their community, and do  everything right.\n\nThese are not abstract numbers. These are real people with real lives  and real fears about whether they will be able to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…at this  critical time.\n\nEarlier this year--I hope you have seen the news reports--all across  the country, there were stories of families waking up to learn that  their loved ones had disappeared--a husband with no criminal record  detained after a routine immigration appointment, complying with the  conditions of his status at the moment; another…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…programs that our  communities desperately need.\n\nWe have seen our government manufacture consent for the invasion of  Iraq that killed and displaced millions of people, our loved ones, and  created total devastation and instability in the region.\n\nWe have seen our government lie about weapons of mass destruction  before. We are not going to fall for it…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692911/no-more-wars"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…ICE  accountable for the nightmare they are forcing families like Benjamin's  to live through. Many immigrant families in my district do not know the  whereabouts of their loved ones after they are detained  by ICE. My bill respects the dignity of immigrant families and promotes  government transparency.\n\nWith my Hispanic Caucus and Progressive Caucus…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697460/fighting-dhs-immigration-raids"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…following: Plant a  tree. Visit a local park and make use of their amenities, especially a  bike trail. Pet a dog. A golden retriever is ideal, but any will do.  Tell your loved ones a cheesy dad joke and laugh about it. Bake  something--bread for Mark or a cake for Melissa--and share it with  someone,'' like your local firefighters. ``Try a new hobby…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692983/lowering-the-temperature"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…that the Big Beautiful Bill was cutting someone else's  healthcare, that cost--which is so personal to so many people because  it is whether we can provide health to our loved ones--is now going to  go up. So every single American is either at risk of losing their  health insurance or having the price of their health insurance go up.\n\nOther Michiganders…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Pike, like Hanna  Harris 30 years ago and hundreds and hundreds of native women and  girls, should be alive today.\n\nIt is far too common that their cases go cold and that loved ones are  left without answers and without justice.\n\nTo this day, the MMIP crisis remains the most underreported, under- discussed, and under-resourced tragedy in America, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…allies. They pose no threat to the  United States. After thousands of brave American soldiers fought in  Iraq and Afghanistan, many losing their lives, their limbs, and their  loved ones, the last thing the American people want is to send our  troops to any new wars, especially against countries that pose no  threat to our own.\n\nNow President Trump will not…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…chance to show their work permits and a 67- year-old man who had disappeared for 3 days without access to his  medication.\n\nFamilies waited in anguish to hear from their loved ones, many of  whom reported not having enough to eat and being unable to shower-- cruel, callous, inhumane, and unlawful.\n\nIn these trying times, I am not defeated. I am fortified…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…communities to support organizations that provide resources and  assistance to the Gold Shield families.\n\nGold Shield families suffer tremendous, heartbreaking loss when their  loved ones--police officers, firefighters, emergency medical  technicians, and corrections officers--are killed while serving their  communities.\n\nMr. Speaker, I support H. Res. 364…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691024/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…family, and words cannot  fully celebrate the work Aleksandra put in to bring her husband home. I  look forward to George's swift return to normalcy and autonomy with his  loved ones, back in Atlanta where he belongs.", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691683/welcoming-george-glezmann-home-to-georgias-5th-congressional-district"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…for this nuclear option with more of their  paychecks on hospital bills. They will pay for it with fewer jobs, less  success in their communities, fewer years with their loved ones, more  cancers, less time to enjoy the quality of life, and less quality of  life.\n\nThat is not a future I want to see. I want to see a future  envisioned, I think, as we…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Think about that. We don't have their names.  That information should be released immediately--today--because there  are families who still have no confirmation where their loved ones are.  And the only list we have right now was not even released by the  administration. It was reported by the press. Some families only  learned their son was gone, their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…to moms and dads,  brothers and sisters who had been killed in episodes of gun violence.  That was really important to hundreds of families out there who knew  that their loved ones' names were part of that wall. Now the wall comes  down. For what? Just to send another signal that the administration  doesn't care about attacking gun violence.\n\nBut I…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…remains in critical, yet  stable condition.\n\nWe all in the Senate and across America continue to pray for these  guardsmen, for Andrew's recovery, and for their families and loved  ones.\n\nAfter the suspect started firing--and many missed the news on this--a  National Guard major who was just doing his rounds was nearby, checking  on other troops. He started…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…in North Carolina and among law enforcement agencies, it  is not good.\n\nTo the families of the fallen: Your loss is shared by a grateful  nation. We will never forget your loved ones' service, nor their  sacrifice. God bless them. God bless law enforcement. And may God bless  the United States of America.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that everything around you, love, joy, peace,  sadness, is all just a construct of neurons firing in your brain. We,  as Christians, have hope that we are going to see our loved ones again  and that we will be in Heaven and that we will be in perfect peace and  that this is not it. In fact, there is something even better awaiting  us.''\n\nAlso earlier…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…April 21, 2025, at the Northeast  Florida Fairgrounds in Nassau County, Florida. This will be a unique  and moving opportunity for individuals to come see the names of their  loved ones and patriots who otherwise may not be able to make it to  Washington, D.C.\n\nMr. Speaker, we remember the 150,000 who were wounded in battle and  bear the visible scars of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…This is not partisan. This is  not political. This is necessity.\n\nOur servicemembers must have the resources they need to carry out  their missions and return home to their loved ones. This bill  strengthens our military, and it sends a very clear message: America is  prepared to meet the moment.\n\nI urge my colleagues on both sides of the aisle to support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…and the death of over 100 million  people worldwide.\n\nMy own family lived those horrors. My mother-in-law risked her life  crossing the DMZ lines multiple times to rescue loved ones from the  North Korean regime. To this day, tens of thousands of Korean families  remain separated by a system that tears apart communities and crushes  basic human dignity.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…cause.\n\nMr. Speaker, I rise today in solemn remembrance of the lives lost in  the tragic crashes of American Eagle Flight 5342 and PAT 25.\n\nTo the families, friends, and loved ones of the 67 victims, we offer  our very deepest condolences. No words can ever ease the pain of such a  devastating loss, but we stand with them. We stand with every one of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…sacred compact  with the men and women who serve, and we will never stop searching for  the ones who remain missing and unaccounted for until they are returned  to their loved ones.\n\nThat is why today I reintroduced a resolution that urges our trading  partners to aid in the search and recovery efforts of our Nation's  missing servicemembers.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695819/national-powmia-recognition-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…cheerleader  everyone would be lucky to have.\n\nChris, a talented storyteller and comedian, made connections wherever  he went, creating valuable memories for his friends and loved ones.\n\nMr. Speaker, please join me in prayers for his family and all  privileged enough to know him and to love him.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691812/mourning-the-loss-of-chris-lane-gay"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…of silence.\n\nWhen I was a law enforcement officer, we, too, faced a culture of  silence. During a shift, we would see the worst of humanity, and then  we went home to our loved ones and pretended everything was okay. That  is because if you didn't, Mr. Speaker, you thought you would come off  as weak or unable to handle the job.\n\nAs a former police officer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…grounded him and his beliefs, making him  an even better advocate for the abundant agricultural producers of  California's First District.\n\nAudrey and I are praying for Doug's loved ones as they grieve through  this tragedy.\n\nPsalm 34:18 says: ``The Lord is close to the brokenhearted; he  rescues those whose spirits are crushed.'' It is our prayer that Doug's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698727/9999"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…its wake, and they are not alone.\n\nFor every Laken Riley, there are thousands of Americans whose names  have never been spoken, whose stories have never been told, whose loved  ones have suffered in silence.\n\nThere was the 14-year-old girl in Louisiana who was brutally raped at  knifepoint by an illegal alien from Honduras and the man he stabbed in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…bolster prevention initiatives, and fight the fentanyl crisis.\n\nThis bill is about offering hope to those in despair, those battling  substance use disorder, their families and loved ones, healthcare  heroes, and first responders who need continued support to help save  lives.\n\nI thank Congresswoman Pettersen and all the Members who have  supported this important…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…discuss this very topic to find ways to better this situation. I am  always looking to ensure that Department of Veterans Affairs leaders  hear the concerns of veterans' loved ones.\n\nFrom its creation, the Office of Survivors Assistance, OSA, was meant  to serve as the principal adviser to the VA Secretary on all survivors'  benefits and services, as…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…On his 109th birthday, it was marked by a joyful celebration of  family, friends, and community members gathering in great numbers.  Surrounded by his two daughters and loved ones, the occasion was  fittingly warm and celebratory--centered, as it should be, on a man  whose life had meant so much to so many.\n\nFlorida is the proud home to more than 1.4…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}]