[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…or raising prices for those who don't qualify for  Medicaid. Others simply will not survive.\n\nI know how worrisome it is to watch aging parents need to leave the  home they loved. I know how critical it is to find them the best  possible care. I saw it with my own in-laws, Joan and Bill Cunnane.\n\nAfter all, through Medicaid, think about it, Mr. Speaker:…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694077/nursing-homes"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Bartlett turned his degree into a career as a Treasury  agent and as an auditor for the IRS.\n\nMayo Peter Bartlett was an outstanding basketball player who played  in Europe and loved coaching young people in basketball. He was a jazz  enthusiast with an extensive collection of LPs. He has been a good  friend to many. For over 50 years, he and his wife,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Louise Trotter Wagstaff, was born in  Harlem, New York. She was one of those people.\n\nLynne attended St. Catherine of Siena and graduated from St. Pascal  Baylon High School. She loved to dance and attended Johnson Dance  Studio during her youth. Her summers were enriched, and she formed  lifelong bonds at Camp Minisink, a camp for African-American youth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…intellect, he  accomplished all of that.\n\nThose who were close to Eric speak of his thoughtfulness, curiosity,  and noteworthy commitment to learning about his government. He loved  archery, fishing, and the great outdoors, but surely it will be his  character that is remembered most.\n\nTo his parents, Tamara and Robert; his siblings, Angela and Jeremy;…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693539/moment-of-silence-in-memory-of-eric-tarpinian-jachym"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…the question was asked: Will you stand up for Americans and  prevent them from being deported? Raise your hand. Only Democrats  raised their hand.\n\nI also have to ask when our loved ones and when our friends and  family members go overseas and they get snatched, are Republicans going  to pick up the phone and ask to have their constituents brought back?…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…York, the Mohawk Valley, just west down  the Erie Canal from my good friend, Representative Tonko, who  represents the capital region.\n\nThis is a place where I have lived and loved my entire life. These  are communities that know firsthand what happens when Washington breaks  its promises and when jobs and investments disappear.\n\nWe remember back home…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…slaughtered  more than 1,200 Israelis and abducted dozens more.\n\nSo today we remember, as we must, all who lost their lives, and we  remember the families who have lost their loved ones. And our hearts go  out to them, as they did in those days immediately following that  horror.\n\nWe cannot forget the 48 hostages still enduring unimaginable  suffering…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…simple pleasures of life. She was an avid cook,  enjoyed shopping, and brought warmth and laughter to family gatherings,  particularly during friendly card games that brought her loved ones  together.\n\nHer life was characterized by her deep care for others, and she will  be deeply missed by all who had the privilege of knowing her. I would  also like to extend…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…support her.\n\nFrom the days at the NICU until now, one thing has become       obvious: the last question on anybody's mind when they are       trying to keep their child or loved one from dying should be,       How can we afford these things?\n\nI do not speak only for Leda. The bill before Congress       would strike thousands of Washingtonians from…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…colleague described him as the most intelligent, frustrating,  hardest working, disorganized, nicest person they ever had the pleasure  and honor to work with.\n\nSteve Fought truly loved his country and the democratic process. He  was always both an ardent participant and learned scholar of democracy.  He floated in books. Steve was a lifelong student, earning…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…October 2025, more than 170 U.S.  citizens were detained by immigration agents. That is what we know of.  Two dozen were held for more than a day without being able to call  their loved ones or a lawyer. Nearly 20 of those U.S. citizens detained  were children, and 2 of them had cancer. More than 50 American citizens  were detained by ICE on suspicion of being…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…in leadership will hurt the military  families and, particularly, their access to healthcare.\n\nTRICARE provides for the well-being of our servicemembers, their  families, and loved ones.\n\nMr. Bass has a long service record, but this administration is  undercutting his potential work, and we deserve to debate it on the  floor of the Senate without unanimous…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fabric of  our mobile networks. With these advancements, mobile consumers now have  even greater connectivity and the comfort of knowing they can reach  first responders and loved ones in a time of need, no matter where they  may be.\n\nThe satellite evolution is also touching American farms by  facilitating advancements in precision agriculture. H.R.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…mothers, sons, teachers, taxi drivers, people whose stories echo  our own because they are us. No matter where someone is born or what  language they speak, our grief over losing a loved one is the same.\n\nWe are bound together by that shared humanity, so we must be  relentless in our commitment to peace: peace rooted in diplomacy, peace  that is sustained with…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…rely on Medicaid in Illinois' 17th District  for their nursing home coverage.\n\nWhile you may see this as a numbers game in a budget, I see families.  I see neighbors. I see loved ones.\n\nLet me let you in on a secret because there aren't any Republicans in  this room. There are more Republican constituents of mine that are  calling my office saying:…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688092/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…times to come out of the  shutdown. My Democrat friends have voted 14 times to stay shut down. I  think it is going to be like that for a while.\n\nI used to have a beagle. I loved him to death. His name was Roger. He  was a rascal. Roger would run off. He was a rabbit dog that we picked  up as a stray. Roger would run off for 3 days and scare me to death.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…in its wake, and they are not alone.\n\nFor every Laken Riley, there are thousands of Americans whose names  have never been spoken, whose stories have never been told, whose loved  ones have suffered in silence.\n\nThere was the 14-year-old girl in Louisiana who was brutally raped at  knifepoint by an illegal alien from Honduras and the man he stabbed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…that was there was the attorney general from  Louisiana talking about the number of women who have experienced  coercive abortions, where a parent or a boyfriend or some other loved  one compelled them to be able to take these chemical abortion drugs  against their will--compelled them to do that--or slipped it into their  food or into a drink to be able…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Mr. President, across America, 1.3 million people live  in nursing homes. Many of us have parents, grandparents, or other loved  ones who rely on these homes for care and community in their golden  years. We understand just how vital nursing homes are--whether it is in  urban, suburban, or rural areas--to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…small business  families to keep more of their hard-earned dollars. Farm families were  relieved that they no longer have to fear being forced to sell land  when they lose a loved one. By expanding the death tax exemption, we  brought the tax code in line with today's farm economy and allowed more  farm families to keep their operations in the family.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694904/no-place-like-home"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…photos of the high school  football games to teaching at Mineral Area College to serving as Mr.  Country Days in 2018. Jon was best known for his passion for local  history. He loved to share details about the Farmington community with  audiences who came to appreciate their heritage more because of the way  Jon brought their hometown story to life.\n\nDr.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697134/recognizing-dr-jon-cozean"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…know that we strengthened the nursing homes that came to  us because they were threatened by some of the Biden rules that we shut  down, and people need access when they have loved ones who are in need.\n\nThese tax cuts aren't talk. These efforts aren't talk. They will grow  our economy. Our legislation provides much-needed tax cuts for working  families,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Meet-Up, which  brings caregivers together, meeting virtually or in person to share  experiences. It also created the After the Storm Group, which is for  those who have lost a loved one; the C3 program--Connect, Create,  Collaborate which includes art, music, and yoga workshops, allowing  people to collaborate with others going through similar situations;…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…brave men.\n\nWhile none of these men were native to Georgia, they are forever part  of our States' and our Nation's story, thanks to their selfless and  courageous service. Their loved ones, the Fort Stewart community, and  all those impacted by this tragic loss of life have been in our  prayers, and we humbly request that they be in yours, as well.\n\nMr.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689658/moment-of-silence-in-remembrance-of-staff-sergeants-jose-duenez-jr-edvin-f-franco-troy-s-knutson-collins-and-private-first-class-dante-d-taitano"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…over $2  billion in new funding for the Defense Health Program, strengthening  medical readiness for our servicemembers and ensuring our  servicemembers and their families and loved ones can get the care they  deserve.\n\nI also visited the Curtiss-Wright service center in Chesapeake, where  skilled workers support our Navy's nuclear fleet. Their work is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…District, representing the  largest number of veterans in any district in New York State. That is  why I am proud to take action to make sure no family mourning the loss  of a loved one who is a veteran has to deal with VA red tape and these  bureaucratic mistakes.\n\nThis commonsense, bipartisan legislation honors the legacy of World  War II Veteran Ernest…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…have a sacred compact  with the men and women who serve, and we will never stop searching for  the ones who remain missing and unaccounted for until they are returned  to their loved ones.\n\nThat is why today I reintroduced a resolution that urges our trading  partners to aid in the search and recovery efforts of our Nation's  missing servicemembers.\n\nMr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695819/national-powmia-recognition-day"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…things with peace  through strength.\n\nI will miss Diana, and she will be remembered for her fierce  patriotism and her strong convictions. She was feisty. She was  committed. She loved her country. I thank her for her steadfast  commitment to the conservative movement, to the United States, to  defending our country, and in service of the Lord almighty.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…improving lives through education. I am honored to  recognize her for her extraordinary service and congratulate her on her  well-earned retirement. I wish Dr. Quirk-Bailey and her loved ones the  very best in the years ahead.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…lives in service to others.\n\nThis is a time of remembrance, reflection, and gratitude--a moment to  recognize not only those fallen heroes, but also the families, friends,  and loved ones who share in their sacrifice and carry the weight of  their loss.\n\nIn my home State of Mississippi and across the country, law  enforcement officers serve on the frontlines…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}]