[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "At the same time Americans are calling for their leaders to do the  things that are necessary to lower everyday costs so that they can  better their conditions and plan effectively.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "They  hit lower income people the most.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "It is time we work together to cancel the cuts, lower the costs, and  protect healthcare for all Americans.", "title": "Stories From Home: the Human Cost of Expiring Healthcare Tax Credits", "date": "2025-11-17"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "You can say, okay, well, that might have been okay because previous  Democrat and Republican Presidents worked to lower tariffs and to open  up markets.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-04"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "The American people have made clear that they want their elected  leaders to be focused on improving the economy and lowering costs.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "House Democrats came to Congress ready to work with our Republican  colleagues to lower the cost of eggs, take on price gouging, expand the  child tax credit, build more housing, and put the pocketbooks of  working families first.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "Every independent analysis says this will not lower the budget  deficit but will increase it.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The United States has enormous untapped geothermal potential, enough  to power millions of homes while slashing greenhouse gas emissions and  lowering energy bills.", "title": "Trump's Reckless Tariff Policies", "date": "2025-07-23"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "As millions of Americans face losing their health insurance,  Republicans are not working to protect coverage or lower costs.", "title": "Protect Children's Innocence Act", "date": "2025-12-17"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "I have scoured our voting record, trying in vain to find one vote,  just one, that would lower costs for American families.", "title": "Bring Meaningful Relief for Constituents", "date": "2025-07-22"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Additionally, I have submitted three additional amendments to create  jobs, lower costs, and protect our national  security in American innovation and manufacturing.", "title": "Providing for Consideration of H.R. Promoting Efficient Review for Modern Infrastructure Today Act; Providing for Consideration of H.R. Increasing Investor Opportunities Act; Providing for Consideration of H.R. Electric Supply Chain Act; Providing for Consideration of H.R. State Planning for Reliability and Affordability Act; Providing for Consideration of H.R. Improving Interagency Coordination for Pipeline Reviews Act; Providing for Consideration of S. Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery; and for Other Purposes", "date": "2025-12-10"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, that is designed to lower the high cost of  living in the United States of America, a promise that Republicans  repeatedly made last year to the American people and now have  repeatedly broken.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "While we stand here debating three bills to micromanage the affairs  of the District of Columbia, which has its own Mayor and city council,  who are perfectly capable of representing their constituents,  Republicans are moving forward with more tax breaks for billionaires  and corporations while lower  income Americans are made worse off through their largest cuts to  healthcare and food assistance in our Nation's history.", "title": "Providing for Consideration of H.R. Prohibiting Voting By Noncitizens in District of Columbia Elections; Providing for Consideration of H.R. District of Columbia Federal Immigration Compliance Act of Providing for Consideration of H.R. Protecting Our Nation's Capital Emergency Act; and Providing for Consideration of S. Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-10"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "The American people elected us to solve problems on their behalf and  to address the issues that matter, like the high cost of living, to  lower housing costs, to lower grocery costs, to lower childcare costs,  to lower insurance costs, and lower utility costs.", "title": "Solving Problems for the American People", "date": "2025-02-26"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "``It's starting to look critically       and strategically at ``How do I retool these programs to       accomplish the same thing but at a lower cost?' ''\n\nBarwis said he's established partnerships with larger       hospital systems, like UConn Health and Hartford HealthCare,       and expects to do more of these in the future.", "title": "Congress' Long To-Do List", "date": null}, {"senator": "Blake Moore", "party": "Republican", "sentence": "I get that this seems  like a good thing to always have lower taxes, but it is going to create  a whole bunch of debt, right?", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "But if it lowers your flood insurance  premiums, it can be a worthwhile investment.", "title": "Risk Rating", "date": "2025-05-22"}, {"senator": "John Joyce", "party": "Republican", "sentence": "It is time that my colleagues and I codify President Trump's  deregulation agenda so that our energy producers can unleash domestic  production, lower costs for all American consumers, and further support  our allies abroad on our pathway to energy dominance.", "title": "Unleashing American Energy", "date": "2025-07-21"}, {"senator": "French Hill", "party": "Republican", "sentence": "This work tonight represents over a decade of effort on a bipartisan  basis, both sides of the aisle, to advance economic growth for our  citizens, and for our businesses by advancing their ability--at a lower  cost, in a more effective way--of raising money from working out of  their garage and crowdsourcing their idea to bring their idea to life,  through angel investing all the way through to lowering the cost to be  a public company.", "title": "Increasing Investor Opportunities Act", "date": "2025-12-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "We start seeing Greece and other countries having substantially lower  interest rates than us.", "title": "Truth Telling with Math and Facts", "date": "2025-05-20"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I believe that does create more revenue the  Treasury can bring in with lower rates on a bigger pie.", "title": "Tax Cuts and Spending", "date": "2025-06-27"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "The result is simple: fewer delays, lower costs, and more  homes built for working families across the country.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "In  turn, we want to do everything we can to lower costs for American  households while providing necessary energy.", "title": "Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act", "date": null}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Instead of simply enabling the current fraud, waste, and abuse  exposed in the unaffordable care act subsidy scheme that Democrats are  addicted to, we are offering transformative policies that will root out  hidden costs, attack inflationary programs, and increase competition  throughout the entire healthcare insurance marketplace, lowering  premiums for all Americans.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "Speaker, I rise today to honor the life and  service of Jim VanWert, a dedicated member of the Lower Macungie Fire  Department, who recently passed away after 45 years of service to our  community.", "title": "Recognizing Joshua Hobson", "date": "2026-02-10"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "They were lower rates, but the top portion of  income earners actually were paying a higher percentage of Federal  income tax.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "This increase in red tape will do nothing to lower  appliance prices, and it will do nothing to lengthen product lifetimes  or to bring real energy savings to the American homeowner.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Unlike other launch sites in the lower 48, Alaska's spaceport  benefits from minimal air traffic congestion and robust launch windows,  enabling greater efficiency and mission success.", "title": "Space Dominance", "date": "2025-02-24"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "We would like to make them lower, but  we surely don't want them to go up as the other side of the aisle wants  to do.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "If you are the insurer, you make a profit because you lower  utilization because you had your enrollees, your patients, your  members, get healthier.", "title": "Math is Such An Anathema", "date": "2026-02-11"}]