[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that? Donald Trump is like the Grinch--just  with a lot more bronzer.\n\nNow, today, Senate Democrats will hold a special caucus lunch to roll  out a new initiative to lower costs for the American people and show  precisely how Donald Trump and Republicans have made life far more  expensive for Americans.\n\nThis morning, a report came out that Americans will…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…part of the story  when it comes to lowering the cost of living. In the coming weeks and  months, Democrats will lay out cleanly and comprehensively how we can  lower costs for the American people on a number of different topics-- from health to housing, to groceries, to childcare, to energy costs,  and beyond.\n\nIn the coming weeks, for example, I will…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…make life more affordable. We are here to  improve people's lives, and that responsibility should guide everything  we do.\n\nI will continue to fight every day to lower costs and keep the  American Dream alive and within reach.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699583/stop-the-republican-affordability-crisis"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…American people.\n\nSo we have the ideas. If the President wants to work with us or  anyone else on the other side wants to work with us, then we are ready  to do that to lower costs for the American people.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697138/affordability"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…the AC on during dangerous heat waves, but  the Trump administration and Republicans in Congress are doing  everything they can to stop clean energy that will help lower costs for  the American taxpayer.\n\nThey are rolling back programs that help build low-cost power. They  are making it harder to build new wind, solar, and transmission  projects. Projects…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…time to come together in a bipartisan way and listen to the American  people. Let's extend the Affordable Care Act tax credits, reverse the  Medicaid cuts, and lower costs for the American people.\n\nMr. Speaker, stop wasting time with ballrooms and bailouts, and  instead deliver for the American people.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…putting good jobs at risk, all while the world continues to move  around us. Congress has constitutional authority over tariffs. We must  use it here and now. Let's lower costs for American families, protect  jobs in San Antonio and across America, and end this reckless trade  war.\n\nMr. Speaker, I urge my colleagues to support this resolution.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…California requirements.\n\nTo my friends on the other side of the aisle, the global industry and  the market have left them behind. House Republicans have no agenda to  lower the costs for the American people. They are attacking California  by putting on this political Kabuki show for political benefit.\n\nLet's talk about California. Despite our many faults, my…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…they are facing higher prices is because of  his policies.\n\nWhile Republicans ignore higher costs at their own peril, Democrats  are still going to keep fighting to lower costs for the American  people. We know that there is an opportunity that is going to come  before the Senate in just a few days to do something about the high  cost of health insurance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Congress and, sadly, I return with the same message. I  wish it weren't so.\n\nI have scoured our voting record, trying in vain to find one vote,  just one, that would lower costs for American families. The closest I  found was a bill that would improve price transparency for concert  tickets, but nothing to actually address price gouging.\n\nWhen it comes…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694035/bring-meaningful-relief-for-constituents"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…healthcare should be  standing up for their constituents rather than falling in line behind  President Trump.\n\nI am going to keep fighting for affordable healthcare and lower  costs. The American people deserve better.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696726/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, I rise today to urge my colleagues to vote  no on S.J. Res. 13. President Trump promised that he would lower costs  for American families on day one. He promised to cap interest rates on  credit cards at 10 percent, and so what is it that the Senate is  prioritizing today? Making it easier…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…will  eliminate because this one big, ugly bill puts a target on the backs of  the clean energy economy, on clean energy jobs, which result in cheaper  energy and lower costs for the American people.\n\nWe were told by President Donald Trump when he was on the campaign  trail, costs would go down on day one. He was going to focus, we were  told, on lowering…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…from 65,000 children in my district. It is not pro-life to take away  food from hungry children.\n\nWe were promised that president Musk and the MAGA majority would  lower costs for the American people from day one. This does none of  that. Instead, they are trying to take away healthcare and food from  our kids.\n\nI urge everyone to vote ``no'' on this resolution…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…actions, blocking funding already approved by Congress, firing career  public servants, and hollowing out entire agencies.\n\nLet's be honest. These are not going to lower the costs for American  families. It is not going to reduce the deficit, but it will make the  world more dangerous.\n\nIt will make Americans less safe and less prosperous.\n\nMr. Speaker,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…colleagues to join me in supporting H.R.  4626, the Home Appliance Protection and Affordability Act to protect  consumer choice, to modernize EPCA authorities, and to lower costs for  American families.\n\nMr. GUTHRIE. Mr. Speaker, I have no further speakers. I reserve the  balance of my time.\n\nMr. Speaker, we are working on affordability. This whole bill…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700166/dont-mess-with-my-home-appliances-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…U.S. has become a world leader in  reducing carbon emissions.\n\nIn partnership with President Trump, House Republicans are  reinstating common sense in Washington. To lower costs for American  families, we must unleash our energy capabilities and utilize the  reliable natural gas right under our feet, not impose these outlandish  taxes on domestic producers.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688181/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…affordability challenges in housing,  Mr. Speaker, is because we have an inventory shortage. Republicans are  offering solutions to provide more housing stock to lower the costs for  the American people and deliver on that American Dream of  homeownership.\n\nThis bill cuts through the regulatory choke hold that Washington has  imposed on housing. It streamlines…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…challenge and power the future, we need pipelines. This legislation  streamlines regulatory oversight, establishes clear timelines for  environmental reviews, and helps lower costs for American families by  unleashing our full energy potential.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…regulation on manufacturers.\n\nFortunately, H.J. Res. 42 will roll back this red tape and enable  Congress and the Trump administration to safeguard consumer choice and  lower costs for American households.\n\nI thank the gentleman from the Ninth District of Georgia (Mr. Clyde),  my good friend, for leading this legislation. I urge all of my  colleagues to join…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688548/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…throughout the U.S.\n\nIt is time that my colleagues and I codify President Trump's  deregulation agenda so that our energy producers can unleash domestic  production, lower costs for all American consumers, and further support  our allies abroad on our pathway to energy dominance.               Honoring Our Brave Border Patrol and ICE Agents\n\nMr. JOYCE of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…responsibly in a way that directly benefits  Americans.\n\nThese bills lower the cost of living and boost the economy. They  support domestic energy production, resulting in lower costs for  American families and businesses, and invest in water infrastructure to  address drought and protect supplies for communities across this  country.\n\nThese appropriations bills…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…cosponsor this bill, H.R. 1047, because policies like  this ensure a supply of reliable, affordable electricity generation. In  turn, we want to do everything we can to lower costs for American  households while providing necessary energy.\n\nWe have challenges now. The demand is going to increase precipitously  in the years to come. How do we make sure we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}]