[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…anywhere else that are undertaken just to enrich corporations and the  most wealthy amongst us and cronies of the President's, and to do  nothing in the process to lower the cost of living, to help families  afford housing or healthcare, or to secure a future for our children.\n\nMs. HOULAHAN. Mr. Speaker, I am struck by the fact that we are at a  place…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699370/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, now, on cost of living, if Donald Trump  refuses to focus on the one thing Americans want most, which is to  lower the cost of living, Democrats are happy to do it for them. As we  begin 2026, Democrats enter the new year on our front foot. The cost of  living will remain the No. 1 focus for this…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Mr. Speaker, candidate Trump and President-elect Trump  consistently and repeatedly promised the American people that when he  was elected, on day one that he would lower the cost of living for  Americans. He very effectively campaigned on that issue, and I think  that that was a major driving force in terms of why he prevailed on  November 5. In fact,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…triggers $500 billion in Medicare cuts. It increases the  budget deficit by $3.3 trillion.\n\nPresident Trump and House Republicans have abandoned their promise to  lower the cost of living. They are making it worse.\n\nI would say to my Republican colleagues: Have the moral courage to  oppose this bill. The consequences of this vote will come due. They…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693171/one-big-beautiful-bill-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…better of  this Congress.\n\nI hope that we can send a message on this bill and the next one that  we are not going to put up with it anymore. We want real solutions to  lower the cost of living.                    Announcement By the Speaker Pro Tempore", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…We must pass full-year spending bills that  ensure that lawmakers, not President Trump and Russ Vought, decide how  taxpayer dollars get spent.\n\nDemocrats want to lower the cost of living for all Americans and  deliver critical services and investments to the working class, the  middle class, and the vulnerable. That victory can be achieved through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…repeal these standards on  coolers and freezers. They are, in essence, walking out on the cost  savings at a time our neighbors really expect us to work together to  lower the cost of living.\n\nThere is a larger issue here, and it is the fact that Republicans are  ignoring the affordability squeeze. When Democrats were in charge, we  did everything we could…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…D.C., to tackle  the cost of living. During this Republican-led Congress, there has not  been one bill brought to the floor of the House--and here we are in  May--to lower the cost of living for families along the Gulf Coast and  all across America.\n\nIn fact, what the Republicans have been focusing on is a massive tax  giveaway to billionaires like Elon…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the American people and making things affordable  for them.\n\nToday's vote is simple. It is very simple. Will my colleagues on the  other side of the aisle vote to lower the cost of living for American  families, or will they keep prices high out of loyalty to Donald J.  Trump?\n\nThat is what this vote is. That is why we pressed for this vote  today.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Florida. Mr. Speaker, I thank the ranking member for  yielding the time.\n\nMr. Speaker, I rise in opposition to H.R. 3617. I wish we were here  discussing how we could lower the cost of living. I wish in the Energy  and Commerce Committee, where we are controlling the time, we could  discuss a bill that will lower electricity prices for our neighbors  back…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…89.\n\nMr. Speaker, I wish I was here to speak about different policies,  policies that the American people actually want to see to help them pay  their bills and to lower the cost of living that is choking millions of  American families.\n\nInstead, in this administration's first 100 days, I have seen this  Republican majority capitulate to the largest…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…we reverse all that.\n\nThe first step is these ACA tax credits because it is going to help  working families. The party in the majority now said they were going to  lower the cost of living, but they failed. Now we are going to step up.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698802/breaking-the-gridlock-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to be paying about $939 more annually than you were 5  years ago.\n\nMadam Speaker, folks back home are really wondering: Can Congress get  its act together to help lower the cost of living and work on  solutions? I hate to report that, no, Republicans in Congress and the  Trump administration have shown no interest in doing that or in  tackling lower…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…from New  Jersey for yielding the time.\n\nI rise in opposition to H.R. 4593 with a great concern that House  Republicans simply do not care to work on any solutions to lower the  cost of living for our hardworking neighbors back home.\n\nIn 2025, House Republicans failed to bring one bill to the floor to  lower the cost of living or to tackle the high rate…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698568/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…is amazing that this is the priority of the GOP at a time when  people are really being squeezed back home. Republicans have not  brought one bill to the floor to lower the cost of living and tackle  the everyday challenges of our neighbors back home. Instead, they are  consumed by this tax giveaway for billionaires.\n\nThis is the priority, to gut the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…and the priorities of this Congress, avoiding another shutdown and  spending taxpayer dollars responsibly in a way that directly benefits  Americans.\n\nThese bills lower the cost of living and boost the economy. They  support domestic energy production, resulting in lower costs for  American families and businesses, and invest in water infrastructure…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Committee led  by Chairman Cole, for their leadership on these critical pieces of  legislation being considered. I urge Congress to pass these commonsense  bills to lower the cost of living not only for Buckeye families but for  families across America.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…LEGER FERNANDEZ.\n\nMr. Speaker, I will point out that Americans know that Trump has been  horrible on the handling of their economy because he has done nothing  to lower the cost of living. In fact, everything he has done is the  opposite.\n\nHis tariffs have increased prices. Their failure to address the  healthcare crisis and extend tax credits for health…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]