[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that is what they are  claiming publicly.\n\nLet me remind my colleagues: Republicans are giving more tax breaks  for billionaires, wealthy heirs, and corporations, while lower income  Americans are made worse off through the largest cuts to healthcare and  food assistance in our Nation's history. This is the biggest cut to our  nutrition programs in…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…federal workers that oversee Head Start,  President Trump reportedly plans to eliminate Head Start in his FY26  Budget. Head Start reduces educational disparities so that lower-income  children enter school ready to learn. Gutting it directly harms over 1  million parents who rely on Head Start to work, over 800,000 children,  and tens of thousands of…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…economies on our  planet would enjoy an increase of 60 percent in GDP by 2050--those  societies, 60 percent richer by 2050--from getting climate right. And  they suggest that lower-income countries would enjoy an increase of 124  percent in GDP--more than doubling their wealth--from getting climate  right. So this is a two-sided equation: Continue to fail…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…nothing but a new sales tax.\n\nAnd the analysis, as this chart shows, of who the tariffs raise taxes  on, like every other form of sales tax, tariffs are regressive. They  hit lower income people the most. The average tax change as a share of  income if the Trump tariffs are implemented, it is essentially on the  poorest 20 percent of the American population,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…such as housing and employment on a case by case       basis. In contrast, H.R. 5214 would implement a cash bail       system that would financially ruin many of D.C.'s lower       income families, force many parents, disproportionately women       and Black women, out of the workforce, and expose children to       the well-documented harms of parental…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…the bill that would extend the ACA's premium tax credits for 3 years.  This extension will cut premium spikes by 80 percent, on average. It  will wipe out increases for lower income families. It will save over 5  million Americans from losing their insurance.\n\nThis is the solution. We have it in our hands.\n\nWhile this is a straightforward fix for the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…will put an undue financial strain on individuals and families  across Connecticut but, most important, on people who can least afford  a higher tax--our middle-income and lower income members of the  workforce, working people in Connecticut who have to buy stuff  depending on their paychecks--for groceries, for gasoline. A tax on  those products will…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a fact. The math is undefeated here.\n\nI am sorry that my friends don't want to appear like Republicans are  insensitive to the plight of those who are struggling in the lower  income brackets and who need Medicaid and for whom it is a lifeline. It  is just the truth. There is no way. Again, do the arithmetic. Do the  math. There is no way to get those…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…constituents who have been tricked, scammed, and defrauded out of  their hard-earned money on these payment apps. Consumer use of payment  apps is only increasing, with lower income households experiencing a  disproportionate share of complaints.\n\nBetween 2018 and 2021, fraud-related complaints involving Venmo, Cash  App, and other payment apps surged…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…city council,  who are perfectly capable of representing their constituents,  Republicans are moving forward with more tax breaks for billionaires  and corporations while lower  income Americans are made worse off through their largest cuts to  healthcare and food assistance in our Nation's history.\n\nWe live in the richest country in the history of the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Republicans produced their bill, their budget reconciliation bill,  which extends those tax cuts, despite the fact that it worsens our  budget deficit and leaves middle-class and lower income Americans in  the dust.\n\nThis chart was done by the Peterson Institute for International  Economics, a nonpartisan think tank, which shows again where the  benefit of that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…are complaining that Republicans are going to let this expire,  that was their timeline. This zero-dollar issue and then not capping  it, so it is only targeted towards lower-income individuals, had to go  away. Even in compromise and bipartisan approaches to deal with this  expiration, those aspects had to go away. Those are things that were on  the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…simplifying the tax code. Everybody talks  about it, and we have done it. Since 2017, we decided to double the  standard deduction.\n\nThat immediately targets middle- and lower-income Americans who  choose not to itemize. Itemizing is still an option you can do, Mr.  Speaker, if you have multiple different types of elements that you can  deduct from your…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…course. Of  course. Most people don't realize the Social Security formula actually  is progressive. If you are a high-income earner, you get less  of your money. If you are lower income earner, your FICA tax, you  actually get more, but in the mean, you get about a $72,000 spiff for  that couple. It is a crap rate of return.\n\nHowever society, the Democrats,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…is maintained, homebuilders have every incentive to meet the  housing needs at every income level. The profit margin might be bigger  at the top, but the sheer numbers of lower income families compensate  with volume, assuring ample affordable housing for all income levels.\n\nGovernment sets basic safety standards but otherwise leaves consumers  alone…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "John Thune", "party": "Republican", "sentence": "…is that somehow this is  going to--we want to be for the little guy, for the guy who is trying  to make it out there, the person who is really struggling to get by,  the lower income category. But what this does is this forces hard- working taxpayers--people out there trying to get by--to subsidize the  insurance costs of affluent, wealthy people. Why?…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…called the ObamaCare exchanges.\n\nSo when we talk about the ObamaCare subsidies, that is what we are  talking about. It is about 24 million people, and it was meant for  lower income people.\n\nUp until 2019, it was all for low-income people. Then, in 2019,  without any Republican votes, President Biden said: Look, we are in a  pandemic. We are going to…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Plan Act of 2021 made temporary changes to       premium tax credits by expanding eligibility to higher-income       individuals and increasing premium tax credits for lower-      income individuals for tax years 2021 and 2022. For example,       the law increased the premium tax credit amounts for eligible       individuals and families, resulting in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Plan Act of 2021 made temporary changes to       premium tax credits by expanding eligibility to higher-income       individuals and increasing premium tax credits for lower-      income individuals for tax years 2021 and 2022. For example,       the law increased the premium tax credit amounts for eligible       individuals and families, resulting in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…that year, you are  automatically given a dollar figure that you can deduct from your  taxable income.\n\nIn 2017, that number was doubled. We said to middle-income filers,  lower-income filers that we want to give you a significant deduction  and we are going to double that standard deduction. It hasn't been done  for a while. We need to increase this to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Res. 18, a Congressional Review Act resolution, would overturn a  midnight rule issued by the Consumer Financial Protection Bureau, CFPB,  that undercuts the ability of lower-income Americans to access  liquidity.\n\nTo put it very simply, this CFPB's rule hurts the very consumers that  it purports to protect.\n\nOne of the likely outcomes of this rule…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…progrowth elements: no tax on tips or overtime, an increased child tax  credit, tax relief for seniors, an increased standard deduction  targeted entirely at the middle- and lower-income Americans, investment  in rural America. These are just a few of the reasons Americans will  see significant increases in their upcoming tax returns.\n\nMr. Speaker, that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…income taxes and for local property taxes, so  they can spend more money.\n\nWe have to realize that if the SALT Caucus succeeds, there will be  less money available here to lower the income tax on manufacturing, as  President Trump tries to bring back American manufacturing jobs from  China, Korea, and Mexico.\n\nWe will not have the money available to do eventually…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…look at means-tested Federal programs. So what  does it mean to have a means test?\n\nWell, it depends on your income. Wealthy people don't qualify. People  of modest and lower income brackets can qualify for these means-tested  programs. But they need to have work requirements for able-bodied  adults because there are a lot of able-bodied adults that…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Tennessee, the bill we passed here in the House would put an  average of $11,700 more in the pockets of a family of four every year.  Under this bill, everyday Americans will see lower income tax rates, a  larger standard deduction, and an expanded child tax credit. That means  more take-home pay, more money for groceries, gas, and healthcare.  Filing will be…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…broad support for almost all of it.\n\nThe Republicans in 2017 doubled the standard deduction. Who does the  standard deduction support, and who does it help? It helps lower- and  middle-income Americans, plain and simple. It increased the number of  people who took the standard deduction and gave them the best tax  benefit. It is the wealthy folks who itemize,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}]