[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to stop  it from happening. It has been many years since George W. Bush was  President, but we estimate that we have saved 25 million lives with  this PEPFAR Program. I am a loyal Democrat and proud of it but was  happy to vote with the Republicans and George W. Bush on that program.  That program was going to be eliminated by this bill that was  considered.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…harmful bill that would only serve to weaken America and  give the Trump administration yet another weapon to attack the American  institutions that they deem are insufficiently loyal to President  Trump.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…we can access all of the talent  in this country. Saying that we are going to get rid of all of that in  favor of merit that just happens to focus on people who are blindly  loyal to Pete Hegseth and President Trump, that is not merit.\n\nI should clarify, I am not opposed to DEI programs. I am opposed to  bad DEI programs--we ought to excise those--but…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…President Trump told her that he wants her to ``put herself out of a  job'' by eliminating this Department. Since President Trump only  nominates people who are 100 percent loyal to him, we can expect Linda  McMahon will comply with putting herself out of a job, which leads us  to wonder why we are even giving her this job in the first place.\n\nA nominee…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…picking winners and losers by firing nonpartisan experts in  programs that he doesn't like, and he is replacing them with people  whose only qualifications are that they are loyal to the President--the  only qualification he cares about.\n\nAnd in a classic authoritarian playbook, he is covering all this up  by removing independent watchdogs that conduct…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…in the Record the names and  accomplishments of Filipino Americans, again from my Hawaii:\n\nDomingo Los Banos was Hawaii's first Filipino American       school principal and a loyal veteran of the 1st Filipino       Infantry Regiment that fought in the Philippines during World       War II.\n\nCarolina Dizon Wong broke a glass ceiling when she obtained…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…who would dare speak up. When dissent is silenced,  they can turn our government and weaponize it into an institution that  serves only Donald Trump and enriches those who are loyal to him.\n\nIn a system where the rule of law is replaced with raw power and  governed by grievance, greed, cruelty, and impunity, nobody is safe.\n\nThis is not just a story of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…in a violent way.  I just mean that, at some point on the infinite continuum that we call  time, you are going to have to account for those times.\n\nThe question won't be: How loyal were you to the President? It will  be whether you stood on principle when you had an opportunity to deal  with the great issues of your time related to this country. There…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Republicans would defund the  watchdog that is tasked with precisely that role.\n\nThe only plausible explanation is that the majority, and the  administration to which it is blindly loyal, is upset that GAO has  repeatedly found that the White House is stealing funds away from  taxpayers.\n\nThis conference takes place as our entire legislative branch of  government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…gives Congress the constitutional authority to  declare war, is a violation of Article II Powers of the President.\n\nThat tells you all you need to know.   Mike Johnson is more loyal to  the President than he is to the separation of powers. He is more loyal  to the administration's authoritarian agenda than he is to the  Constitution. He is certainly more…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have the ability to stand in the well of the House of  Representatives and say it. I am saying it. Yes, he is a beneficial  bigot.\n\nThen those who benefit from his bigotry are loyal to him. These are  people who would never allow a person to do such a thing if he hadn't  done favors for them. They would speak out and speak up against his  bigotry. They…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…are distinguished in their careers, have outstanding experience,  great credentials, but he is trying to force them out so he can replace  them with people who are politically loyal to him.\n\nI just want to chat a little bit about the firing of these people  because I know a lot of folks across the country are not in love with  government workers. They…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…majority did, my colleagues on the other side of the  aisle would uplift successful programs and agencies like SBA or SAMHSA,  not gut them.\n\nUnless you are a mega-donor or a loyal MAGA mouthpiece, you do not  matter to this Republican majority. What is happening here isn't just  irresponsible. Mr. Speaker, it is immoral, and it is a damned disgrace.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…but it didn't matter.\n\nWhy didn't it matter? It didn't matter because it wasn't about the  evidence. It was actually a test.\n\nIt was a test to signal your willingness to be loyal. If you promise  to spread our lies, you can be on the team. It was a qualification for  being able to work on that team. Slowly, like the rot in the foundation  of an old…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…of those convicted of assaulting  our government, including police officers, on January 6. They went  after the FBI and tried to fire anybody who was seen as insufficiently  loyal to Donald Trump at the FBI. They did the same thing at the  Department of Justice. They looked to illegally usurp our Article I  powers by firing thousands of government employees,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…pay tribute to my staff director, Mark  Roman, who is leaving Federal service at the end of this week.\n\nFor more than one decade, Mark has been one of the most capable and  loyal public servants I have ever worked alongside. My team is stronger  today because of his judgment and the example his work ethic sets for  the rest of my team. He has not only…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the young people who work every day to build a stronger, more service- minded America.\n\nLet's help ensure that the next generation lives up to the Scout law:  trustworthy, loyal, helpful, friendly, courteous, kind, obedient,  cheerful, thrifty, brave, clean, and reverent.\n\nAlso today, on a personal note, I welcome Josh and Finn Kirby to  Washington,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…announce a resolution  commending and congratulating the Florida Panthers on winning the 2025  Stanley Cup Final.\n\nLast month, our State--the great State of Florida--along with loyal  fans nationwide, came together to cheer on the Florida Panthers as they  fought hard to secure a victory and bring home the cup to Florida.\n\nAnd they cemented their place…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694088/commending-and-congratulating-the-florida-panthers-on-winning-the-2025-stanley-cup-final"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Some--perhaps many--wanted desperately to  stay. These people were their neighbors, their friends, their family.\n\nBut over the past three decades, we punished the companies that were  loyal to America while rewarding the ones that weren't. The businesses  that were eager to offshore got big bonuses at the American workers'  expense. The businesses that wanted…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…brought joy to many with his  favorite songs.\n\nIn later years, Bob found peace on a small farm in Medina, raising  rescued horses and a spirited donkey, always accompanied by his loyal  German shepherd. His favorite horse, Duke, reflected Bob's own gentle  strength.\n\nToday, we celebrate a life of service, music, and quiet devotion, a  life that touched all…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…woman can make a meal out of typical pantry items that  tastes gourmet. In addition to weekdays, you can count on Mary to be at  the facility almost every Sunday, along with a loyal team of other  volunteers, ensuring those that are unhoused or unable to afford much  food receive a wonderful, hot meal. In addition to those who enjoy the  sit-down meals…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691234/recognizing-mary-adams-adamczewski"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…service, have benefited the U.S. House of Representatives, its Members,  staff, and the American public.\n\nWe recognize and honor the individuals named below for 25 years of  loyal service to the House. Collectively, the employees listed below  represent 675 years of service and include their names in the Record:\n\nOffice of the Clerk: Carla Benson, Ora…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteers at the clinic two to three times a  week for eight months out of the year. Tom always goes above and  beyond, always putting the patients' well-being first. Tom is also a  loyal supporter of Metropolitan Ministries in Holiday, where he donates  food and other needed supplies to their program. Pasco County is a  better place because of dedicated, caring…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692163/recognizing-tom-prior"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…last week in Sioux City, IA. The Dordt Defenders  defended their title and are back-to-back champions.\n\nSports brings communities together from one generation to the next.  As loyal UNI Panther fans and proud boosters for Dike-New Hartford  athletics, Barbara and I would say that sports are like glue that  sticks, a refreshing antidote in these polarizing…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…joy. She lit up every room with her beaming  smile--full of laughter, endless warmth, and a sharp wit that could  disarm you in an instant. She was unbelievably funny, fiercely loyal,  and wise beyond her years. Molly had a rare gift: She made everyone  feel special because she genuinely believed everyone was special. She  treated people with compassion…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…at JAHVH SCI, ensuring that veterans and  their families received nourishment, fellowship, and support.\n\nBeyond her service, Mary Ann was a loving mother and grandmother, a  loyal friend, and a fierce advocate for those in need. Her legacy is  one of compassion, leadership, and unwavering commitment. Through her  tireless work, countless veterans and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…13th Congressional District will be felt for  years to come. On behalf of myself, my staff, and the constituents I  proudly serve, I want to thank Bryan Brody for his years of loyal  service, his commitment to excellence, and his patriotic spirit. I wish  him the very best as he continues to work diligently for the American  people.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…faith leaders from across our Nation with  revoking their tax-exempt status?\n\nI was in Europe with a bipartisan delegation from this body just 2  weeks ago visiting our trusted, loyal NATO ally Denmark, as they were  alarmed about the rising tide of threats from our President to extract  the territory of Greenland from their nation.\n\nThis coming weekend…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…constituents, calling with concern and alarm about how much prices have  not gone down but have gone up, I recommend you think about one  country, one of our most trusted and loyal allies--some of the nicest  people on the planet. Who doesn't like Canadians?\n\nCanadians have served alongside us in virtually every war we have  ever fought. They are a NATO…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…willing to grant us.\n\nUnless and until the President can demonstrate otherwise, then the  proposition at hand today is very straightforward: incinerating the  hard-won trust of loyal allies in exchange for no meaningful change in  U.S. access to the Arctic.\n\nThat is the definition of ``allies''--plural--because this is about  more than Greenland. It is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]