[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…after 31 years of faithful service to our  Nation, culminating in his service as lieutenant colonel, the highest  rank in the Sheriff's Office, immediately below Sheriff.\n\nLt. Col. Shabazz has always been a competitive and driven person, as  was apparent in his days as a college basketball player. He attended  Virginia State University on a four-year…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Congressional Veteran Commendation. His life and  career are a testament to his exceptional character and unwavering  commitment to service.\n\nOn active duty from 1973 to 1997, Lt. Col. Smith served in various  locations around the globe, including Quantico, London, Brussels, Hong  Kong, Australia, and Turkey. In 1990, Lt, Col. Smith was deployed to  Kuwait…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689308/saluting-the-service-of-lieutenant-colonel-spencer-hutson-smith"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Mitchell Bombers with the U.S. Army Air Corps during World War II.  His servant's life reflects the hard work and dedication that  exemplifies the best of our Nation's values.\n\nLt. Col. Wagamon entered active duty in Philadelphia, Pennsylvania in  September of 1944 at twenty years of age and served an important role  during period of World War II, flying…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, I am proud to honor Lt. Col. Jeff  Davison, U.S. Air Force, Retired, with a Congressional Veteran  Commendation. Over his two-decade long career in the Air Force, he  embodied the courage, honor and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the outstanding  contributions that Kathy Logue has made through her volunteerism at Bay  Area Legal Services. After serving in the U.S. Army, Lt. Col. Kathy  Logue began her career as an elementary school teacher in Chicago. A  lifelong learner, she pursued her legal education at Chicago-Kent  College of Law, part of the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Commendation in recognition of his  outstanding service to both his country and his community.\n\nAfter receiving his Bachelor of Science in Education from Texas A&M  University, Lt. Col. Matthews served with distinction in the United  States Army for over 24 years. His military career included service in  over 30 countries, and a particularly harrowing tour…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}]