[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…When I think about this day, as many of us will be traveling all over  the country--in fact, I am going to be in the hometown of  Representative Kennedy to celebrate Martin Luther King Jr. Day I think  on the 18 of this month--I am thinking tonight about King's letter from  the Birmingham City Jail, which many of us remember was written in  response…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…rights activist, ordained minister, and leader in the  community. Through his active involvement with the civil rights  movement, he became friends and marched with Dr. Martin Luther King,  Jr., on more than one occasion.\n\nReverend Middlebrook secured the appearance of Dr. King for multiple  strikes and also participated in multiple sit-ins in Atlanta while…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697618/reverend-harold-middlebrook-post-office-building"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…cooks, and [the] other [of the] nonviolent       immigrants they are targeting.\n\nYou see, Alex Padilla knows something about this country, which is  that we are all, as Martin Luther King so eloquently wrote in those  letters from the Birmingham Jail, when he was jailed for his nonviolent  civil disobedience--what Alex Padilla knows is what King said so…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…utilizing good judgment.\n\nOurs is a great country, and among the things that make us great is  our system of healthcare.\n\nSpeaking at a 1966 healthcare conference, Martin Luther King, Jr.,  observed: ``Of all forms of inequality, injustice in health is the most  shocking and inhumane.'' Many of these inequalities are, in part,  attributable to the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise.\n\nMr. Speaker, I am proud to rise today on this, the birth date of Dr.  Martin Luther King, a man so great in the eyes of this country that we  honor his birthday as a holiday, but it is more than a holiday. It is  an opportunity for us to do some introspection,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…fight for  our future.\n\nI begin with a story because Black History Month is often thought of  as a time to recognize those historical figures that we all know: the  Martin Luther Kings of the world, the John Lewises of the world, Rosa  Parks, and others. Black History Month is about more than just those  who are known. It is about a lot of those who…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…turn their backs on  the work, the advocacy, and the sacrifice of women like Susan B.  Anthony who worked so zealously for the right of women to vote, and men  like Martin Luther King, Jr., and thousands of Americans who dedicated  themselves to opening the voting booths to all Americans.\n\nIndeed, the Trump administration and congressional Republicans…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…stories of women of color whose lives are unsettled  when a spouse becomes incarcerated.\n\nAva DuVernay's 2014 film Selma followed the civil rights march  shepherded by Dr. Martin Luther King, Jr. that resulted in the  enactment of the Voting Rights Act. When developing this film, DuVernay  drew from her father's direct recollection of witnessing this historic…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696266/recognizing-ms-ava-duvernay-art-as-a-catalyst-for-change"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Native Hawaiian, Pacific Islanders,  and Black Americans has worked hand-in-hand for generations to advance  racial equality. That coalition was on full display during Martin  Luther King, Jr.'s historic march from Selma to Montgomery in 1965 when  he wore a lei gifted to him by Reverend Abraham Akaka of Hawaii.\n\nIt existed even on the battlefield. Senator…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688016/aanhpi-history-and-black-history-bonded-together"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…security, and everyone else.       I think it's very apropos on the wake of the many faith       events that we have been at celebrating the life and legacy       of Dr. Martin Luther King Jr., to invoke one of my favorite       adages, which is, when you pray--and we have been doing a lot       of that, and I certainly do that as a woman of faith myself--…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the march--students,  advocates, members of my staff, community leaders such as Tim Garvin of  the United Way of Central Massachusetts, Sean Barry, Shannon from the  Martin Luther King Center in Springfield, and so many, many more--are  incredible. We had double the number of marchers this year compared to  last.\n\nAlong the way, the marchers stopped…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Reconciliation,'' where white and  Black people across the South rode buses together to challenge  segregation laws, a precursor to the Freedom Rides.\n\nRustin was an advisor in Martin Luther King, Jr.'s inner circle as  King advocated pacifism and nonviolence for achieving equal treatment  for African Americans. Rustin applied his brilliant strategic mind to  execute…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…trouble-- '' good trouble, good trouble--``necessary trouble.''\n\nStanding on the shoulders of giants, John Lewis would often talk to  us about his admiration for Dr. Martin Luther King, Jr. Dr. King would  refer to John Lewis as the boy from Troy.\n\nNow, what is interesting to me, that civil rights movement--we can  learn a lot from it--started December…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…healthcare  for millions of Americans, rolling back support for new mothers,  slashing innovative cancer treatments--this doesn't help families.\n\nI love what Dr. King said. Martin Luther King famously stated:\n\nOf all the forms of inequality, injustice in health is the       most shocking and inhumane.\n\nOf all the forms of inequality, injustice in health is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…family in Schererville to commemorate this significant milestone.\n\nEdith Brown was born on February 13, 1917, in Muskogee, Oklahoma. She  was one of four children born to Luther Albert Brown and Dora Rozolia  Draper Brown. Her family went on to live in Kansas City, Kansas, and  after her parents passed Edith moved to the south side of Chicago,  Illinois,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Harold Middlebrook.\n\nReverend Middlebrook played a crucial role in the civil rights  movement during the sanitation workers strike in Memphis and later  founded the Dr. Martin Luther King, Jr. Commemorative Commission in  Knoxville.\n\nReverend Middlebrook was president of the Bolivar Human Development  Corporation, an adviser to the Hardeman County Bi-Racial…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697619/reverend-harold-middlebrook-post-office-building"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of the NAACP, Ms. Pryor also was a strong  proponent of voting rights. She was also among the activists who were  instrumental in the renaming of West Broad Street to Martin Luther  King, Jr. Boulevard.\n\nMs. Pryor served on the Board of Directors of the Ralph Mark Gilbert  Civil Rights Museum and was the former grand marshal for the annual  Martin Luther…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…where sanitation workers protested unsafe  working conditions and low wages. He was at the Lorraine Motel when Dr.  King was assassinated.\n\nIn 1986, he founded the Dr. Martin Luther King, Jr. Commemoration  Commission in Knoxville. I will say, for the record, every time they do  the parade, it is the coldest day of the year, just for the record.\n\nHe was…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…enforcement of fair housing laws and  the physical reclamation of community landmarks. He was instrumental in  their naming of the Malcolm X Park and supporting the Martin Luther  King, Jr., Memorial.\n\nHis continued civic work through service on the Papio-Missouri River  Natural Resources District Board, and as a founding member of 100 Black  Men of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…from our own civil rights  movement, a time when America confronted its deepest flaws, yet emerged  stronger, more just, and more faithful to its founding ideals.\n\nDr. Martin Luther King, Jr., once said: ``The arc of the moral  universe is long, but it bends toward justice.''\n\nThat arc bends when brave people stand up. It bends when people  refuse to be…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…importantly the knowledge of Jesus' love for him.\n\nAfter graduating from Windom High School, Jim attended St.       Olaf College and graduated with honors. He went on to Luther       Seminary and received his M.Div. Jim always credited his       older brother `Big John' for encouraging him to attend       seminary. Although this was not Jim's original…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]