[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…goods to Canada than we do--in Minnesota--to our second, third,  and fourth largest markets combined. In 2024, Minnesota's goods trade  with Canada, including ag products, machinery, and medical devices,  amounted to roughly $22 billion--$22 billion. That is more than a  quarter of all the goods that we export, a major hit for our State.\n\nI chair the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…from around the world will have  the ability to collaborate in New York in R&D for new chips. It means  startups and other innovators will have access to the most advanced  machinery to experiment and discover new innovations in semiconducting.  It will even mean more good paying jobs--J-O-B-S--at Albany NanoTech  and the local economy.\n\nWe all worried…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693456/national-semiconductor-technology-center"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…forgotten American is cutting  healthcare for the disabled, for children, and for seniors.\n\nThis is an administration that rules not with hope but with fear, and  it is using the machinery of government not to serve the people but to  punish the President's perceived enemies, including those who brought  January 6 rioters to justice. I will take just a moment…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…including the 504/CDC program. The 504/CDC program supports small  businesses in accessing capital for the development of major fixed  assets like land, buildings, equipment, and machinery. As part of the  program, loans are guaranteed for so-called special use properties like  amusement parks, car washes, bowling alleys, and gas stations.\n\nWhen the special…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699165/main-street-parity-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…she works well into the evening. She deserves support,  not demonization.\n\nLet's fix this. Let's get our letter carriers the resources they  need. Let's get our sorters the machinery they need. Let's ensure  Americans don't pay late fees if their mail is delayed. Let's get this  done.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688285/protecting-postal-workers"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…people at Canadian-owned  businesses. Slap-shot tariff policy and volatile trade policy have put  those jobs at risk.\n\nOur manufacturers who rely on metals, equipment, and machinery are  watching the costs rise. Just yesterday, in a hearing in the  Agriculture Committee that I serve on, farmers were talking about their  increased costs. Those increased…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of our States.\n\nI was here, a month ago today, sharing stories from businessowners in  New Hampshire who weren't sure how they were going to keep operating if  specialized machinery that they can only get from Canada suddenly costs  25 percent more. Since that time, I have heard from even more people in  New Hampshire, more small businesses.\n\nLast week,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…NBC and other       networks by threatening to ``challenge their license.''\n\nThere was one area in which the Trump administration went       beyond threats to try to use the machinery of government to       punish critics. During his first week in office, President       Trump signed an executive order authorizing federal agencies       to withhold funding…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…they don't  surrender power, they expand it.\n\nLike the military-industrial complex, they find new enemies and new  missions, new excuses to keep the money flowing and the machinery of  fear alive.\n\nThat is why we will not look away. This is bigger than one community  and bigger than one city. It is about the kind of country we are  becoming.\n\nChicago…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…are hurting our farmers. Just think about this.  Fertilizers--those costs are up 16 percent and in some cases, 39  percent. The effective rate on tractors and other farming machinery is  16 percent and 13 percent, respectively.\n\nWe have also had, as a result of the tariffs that are seen by our  trading partner in Canada that was the participant in the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…resources from their most       efficient use, while making it more difficult and expensive       for U.S. businesses to access inputs and capital goods, like       steel and machinery for manufacturers and fertilizer and       agricultural equipment for farmers.\n\nAdditionally, by increasing production costs for       domestically made products and reducing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…scientists unlock climate secrets.\n\nThis legislation would let tech moguls bulldoze right through these  waters with industrial-scale operations--massive drill rigs, heavy  machinery, and construction fleets--all without the environmental  review that everyone else would have to undergo.\n\nThe sponsors insist that these undersea cables are just little…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…any major city in the country.\n\nOur economy is deeply tied to North American supply chains. Thousands  of San Antonians work in aerospace, automotive manufacturing, energy,  machinery, semiconductors, and medical devices, exactly the high-paying  industries we want to be growing here in the United States.\n\nThese companies chose San Antonio because we are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…across the globe. E.J. Basler Co. has  achieved lasting success by staying true to its original values while  evolving with current times.\n\nE.J. Basler Co. offers precision machinery services that leverage  different techniques, cutting-edge technology, and expertise to create  the most cost-effective solutions for customers. They manufacture from  iconel,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692550/recognizing-ej-basler-co"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…similar  pattern occurs with China, where Illinois sends substantial volumes of  agricultural products and electronics. Mexico is another major trading  partner in auto parts, machinery, and food products. Disrupting the  supply chains through tariffs or threats to pull out of trade deals  like the USMCA could destabilize job-creating industries within…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…the highest  honors given to a Coast Guard boat operator. His leadership, skill, and  commitment to mission excellence represent the very best in service.\n\nAlongside him, Machinery Technician First Class James Lang has earned  the Fireman First Class Paul Clark Outstanding Engineer Award, a  national recognition of his outstanding technical expertise…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690914/recognizing-bm1-bradley-walker-and-mk1-james-lang"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Northeast Technical Services; Grand Itasca       Clinic and Hospital; Lakehead Constructors; Ely Public School       District--Anne Oelke; Fight for Mining Minnesota; Road       Machinery & Supplies Co.; Feeley Township, Itasca County,       MN--Deb Langanki; Lake Country Power; Encampment Minerals,       Inc.\n\nGiant; B.R. Clark Consulting LLC; RMS Tritec;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…duplicates in bronze of       the gold medals struck under section 3, at a price sufficient       to cover the costs thereof, including labor, materials, dies,       use of machinery, and overhead expenses.       SEC. 5. STATUS OF MEDALS.\n\n(a) National Medals.--Medals struck under this Act are       national medals for purposes of chapter 51 of title…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…duplicates in bronze of       the gold medals struck under section 3, at a price sufficient       to cover the costs thereof, including labor, materials, dies,       use of machinery, and overhead expenses.            SEC. 5. STATUS OF MEDALS.\n\n(a) National Medals.--The medals struck under this Act are       national medals for purposes of chapter 51…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…difference for our economy. It is helping businesses build  things, building them right here at home in America.\n\nIt allows for full expensing for factory improvements, new machinery,  and farm equipment. We are seeing that in farms and ranches across  Wyoming.\n\nI heard it at the Farm Bureau. I heard it from our stock growers. It  is encouraging businesses…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…manufacturing,       agriculture, or services, mining has a much lower labor       multiplier. Modern operations are highly mechanized, relying       more on advanced technology and machinery than on large       workforces. The jobs that are created are typically       specialized--geologists, engineers, and metallurgists--      limiting wider employment opportunities.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…SBA's 504 loan program is an important tool that helps small  businesses obtain affordable financing for the acquisition of fixed  assets, such as land, buildings, and heavy machinery.\n\nTo obtain a 504 loan, a small business owner must contribute 10  percent of the total project cost as a form of downpayment. However, if  a small business is seeking financing…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…flexibility for family farms to reinvest in equipment,  inputs, and labor. It renews 100 percent expensing for capital  purchases so producers can write off the cost of new machinery,  infrastructure improvements, or production facilities right away.\n\nThe bill also delivers on President Trump's promise to secure the  border and enhance national security.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…is an incredibly important tool that helps small  businesses obtain long-term, fixed-rate financing like the acquisition  of fixed assets such as land, buildings, and heavy machinery.\n\nIn fiscal year 2025, the program supported $7.8 billion in loans to  small businesses nationwide. Specifically, H.R. 5788 would require the  SBA to provide Congress with…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…with that, but then they change the name, and it is the same  thing under a different name.\n\nIt is not just the chips themselves that we have to keep a tight grip  on but the machinery we use to make them. Many of the intermediary  parts, such as lithography machines, are produced by our allies, like  the Dutch ASML, which makes the leading-edge, advanced,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of hemp farmers. And it couldn't come at a  worse time for America farmers. Times are tough for our farmers.  Farmers' costs have increased as the price of fertilizer and machinery  have jumped, while prices for their crops, like soybean, corn, and  wheat, have declined.\n\nFor many farmers, hemp has proved to be a lifeline, a new cash crop.  Farmers…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}]