[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Madam President, finally, I want to say a little bit  about last week.", "title": "Stablecoins", "date": "2025-05-12"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Madam Chair, I want to follow along on the path that  our ranking member has laid out, but before I go there, I do thank my  Republican colleagues, particularly Chairman Rogers, for his efforts in  committee to put together a decent bill, which I did vote for.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Madam Speaker, I was necessarily absent and missed one  vote on the House Floor during the 5 p.m.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act", "date": "2025-05-20"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "Madam President, Evyatar David has always loved music,  singing, and playing instruments with his brother Ilay and his sister  Yaela at Shabbat dinners.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-20"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Madam Speaker, Chaco Canyon is sacred ground.", "title": "Chaco Canyon is Not for Sale", "date": "2025-11-20"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Madam Speaker, I thank Ranking Member Pallone  for yielding the time.", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Madam Speaker, on that I demand the yeas and nays.", "title": "Save Sba From Sanctuary Cities Act of 2025", "date": "2025-06-05"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Madam President, the issue of quality, affordable health  insurance is personal to me.", "title": "Department of Defense", "date": "2025-12-08"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Madam Speaker, I yield back the balance of my time.", "title": "Veterans Readiness and Employment Improvement Act of 2025", "date": "2026-02-02"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Madam Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.", "title": "The Truth Still Matters", "date": "2025-05-13"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Madam Speaker, I rise today in opposition to this rule  which allows for consideration of the Republicans' extreme budget that  slashes funding for vital programs like Medicaid, SNAP, and Federal  housing assistance to bankroll $4.5 trillion in tax breaks for  billionaires and big corporations.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''; and Providing for Consideration of H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-02-25"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Madam Speaker, as the holidays roll around, I want to say  this to folks across the St.", "title": "Recognizing Annie Malone and Foster and Adoptive Care Coalition in St. Louis", "date": "2025-12-17"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Madam Speaker, Republicans rammed through Trumps' big  budget betrayal with the largest cut to healthcare in American history.", "title": "Budget Betrayal", "date": "2025-07-22"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "Madam Speaker, let me just thank the  gentlewoman from the Virgin Islands for yielding.", "title": "Haiti Economic Lift Program Extension Act", "date": "2026-01-12"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Madam Chair, the National Defense Authorization Act often  includes provisions that have nothing to do with our national defense,  and that is not a bad thing.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Madam Speaker, I move to suspend the rules and pass the  bill (H.R.", "title": "Delivering Digitally to Our Veterans Act of 2025", "date": null}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Madam Speaker, pursuant to House Resolution 951,  I call up the bill (H.R.", "title": "Reliable Power Act", "date": "2025-12-17"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Madam Speaker, I thank Chairman Bost for yielding me  the time.", "title": "Ernest Peltz Accrued Veterans Benefits Act", "date": "2026-02-02"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Madam Chair, I rise in opposition to the amendment.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Madam Speaker, I rise in support of my bill, H.R.", "title": "Protecting Our Nation's Capital Emergency Act", "date": "2025-06-10"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Madam Speaker, I rise in support of H.R.", "title": "Haiti Economic Lift Program Extension Act", "date": "2026-01-12"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "Madam President, I come to the floor today to add my  voice to the many who are commending President Trump as he works toward  peace in Ukraine.", "title": "Ukraine", "date": "2025-04-28"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Madam Speaker, I was delayed on the way to the floor  and missed the vote.", "title": "Main Street Parity Act", "date": "2026-01-20"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Madam Speaker, I thank the lead of this bill, the  gentleman from California (Mr.", "title": "504 Program Risk Oversight Act", "date": "2026-01-20"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Madam Speaker, I will one more time point out what  should be the most important issue facing this body in 2026.", "title": "Republicans Have Delivered in 2025", "date": "2025-12-17"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Madam Speaker, I move to suspend the rules and  pass the bill (H.R.", "title": "Ending Improper Payments to Deceased People Act", "date": "2026-01-12"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Madam President, every year, Sunshine Week is held  around March 16, the birthday of James Madison, who not only is a  former President, but the acclaimed ``Father of the Constitution.''\n\nOn its 20th anniversary, Sunshine Week continues to be a crucial  reminder of the need for transparency and open government.", "title": "Sunshine Week", "date": "2025-03-12"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Madam Speaker, I move to suspend the rules and pass the  bill (H.R.", "title": "Economic Espionage Prevention Act", "date": "2025-05-05"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Madam Speaker, I move to suspend the rules and pass the  bill (H.R.", "title": "Ernest Peltz Accrued Veterans Benefits Act", "date": "2026-02-02"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Madam Speaker, we had an interesting 2 weeks out of  this building, and sadly my home State of Wisconsin made the news  again, in an effort to remove not just any person here illegally but  somebody who had broken the law, an abuser, somebody who under normal  circumstances would not be viewed favorably.", "title": "Wisconsin in the News", "date": "2025-04-28"}]