[{"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…medicine with ideology. No parent  should have to fear prosecution for trying to get their child the care  they need, and that is exactly what this measure would do.\n\nMadam Speaker, I urge a strong ``no'' vote.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698351/protect-childrens-innocence-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…it possible for these brave Jewish servicemembers'  descendants to know that their loved one's military service, life, and  religious heritage are properly honored.\n\nMadam Speaker, I urge my colleagues to support passage of H.R. 2701  so we can properly honor our fallen Jewish-American servicemembers.\n\nMr. TAKANO. Madam Speaker, I urge my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…convey my gratitude to Chairman Williams; his staff  director, Lauren Holmes; and all the floor staff for seeing this bill  through today. It is greatly appreciated.\n\nMadam Speaker, I urge Members to support this bill, and I reserve the  balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I commend Ms. Scholten and Mr. Downing  for their dedication to…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…change, and explore the stars.  What message are we sending them right now?\n\nWe should be investing in their future, not pulling the rug out from  underneath them.\n\nMadam Speaker, I urge my colleagues to reject these cuts, reject this  anti-science, anti-veteran agenda. Let us fight for the truth for our  researchers, for our vets, and for the country…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…taxpayers  hundreds of millions or billions of dollars in holding people in our  prisons for offenses that currently they are being held for 6 months or  for up to 2 years.\n\nMadam Speaker, I urge my colleagues to vote ``no'' on the gentleman's  legislation.\n\nMadam Speaker, I yield back the balance of my time.\n\nMr. RASKIN. Madam Speaker, on that I demand the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the only manufacturers that oppose them are the foreign  manufacturers and industry CEOs who make more money when water heaters  are less efficient and use more gas.\n\nMadam Speaker, I urge my colleagues to reject this resolution and  live up to the promise of lowering costs for the American people by  lowering their energy bills.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688290/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…bipartisan collaboration in crafting this bill. I am  proud to have worked with my colleagues on this important legislation,  and I look forward to seeing it pass into law.\n\nMadam Speaker, I urge my colleagues to vote ``yes,'' and I reserve  the balance of my time.\n\nMr. CARBAJAL. Madam Speaker, I yield 5 minutes to the gentleman from  Washington (Mr. Larsen).…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…improve the microloan program was not  enacted into law. I am glad to be working across the aisle again to  make sure territories receive full access to SBA services.\n\nMadam Speaker, I urge Members to support this important bill, and I  reserve the balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I urge my colleagues to support this  legislation, and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699175/northern-mariana-islands-small-business-access-act"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…Accountability Office has explicitly said that Congress  cannot use this process to overturn California's waivers with the EPA,  and we should not pretend otherwise.\n\nMadam Speaker, I urge my colleagues to reject this effort. Let's  stand up for clean air, State rights, and for the health of the  American people.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690436/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…height of the Cold  War. I hope that, in recognizing this victory, their legacy will  continue to inspire us and to unify a country that faces significant  divisions.\n\nMadam Speaker, I urge my colleagues to support this bill, and I yield  back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…crisis. Every time Americans open their power  bill or see their lights flicker, Republicans are responsible. I think  the American people will hold them accountable.\n\nMadam Speaker, I urge my colleagues to vote ``no'' on this bill, and  I yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, I rise in opposition to the amendment.\n\nMr. PALLONE.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…know  she is already at work on additional solutions for the program, such as  measures to maintain and support the staff at VA tasked with carrying  out the program.\n\nMadam Speaker, I urge my colleagues in the House and Senate as well  to support this bill.\n\nMadam Speaker, I yield 3 minutes to the gentlewoman from Oregon (Ms.  Dexter), who is the author…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…diesel will cost Americans over $90 billion in  health damages. Republicans are fighting for resolutions that are  hurting people's health and putting lives at risk.\n\nMadam Speaker, I urge my colleagues to oppose this resolution, and I  yield back the balance of my time.\n\nMr. PALLONE. Madam Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…can win.\n\nThat is not how democracy works. You don't get to silence millions of  Americans just because they might not like your policies. You represent  them, too.\n\nMadam Speaker, I urge my colleagues to reject this dangerous  legislation and protect the rights of every eligible voter in the  country because our democracy is strongest when every voice…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…reliable and cheap sources of  energy, which also happen to be the cleanest. It limits choice and will  slow energy innovation, keeping prices higher than they need to be.\n\nMadam Speaker, I urge my colleagues to reject this bill and work  together on real solutions that lower energy bills for the American  people.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697888/state-planning-for-reliability-and-affordability-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…such       Congress shall determine how the contents within should be       preserved or used.\n\nMrs. BICE. Madam Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, today I urge my colleagues to support S. 3705, the  Semiquincentennial Congressional Time Capsule Act. This is the Senate  companion to H.R. 6243, introduced by my colleagues,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…legislation with me. The AI-WISE Act will ensure small  businesses have the information that they need to most effectively  utilize AI to bolster their entrepreneurship.\n\nMadam Speaker, I urge my colleagues to vote in support of this  legislation.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…confidence in those institutions.\n\nThis bill helps prevent those outcomes by equipping State and local  leaders with the resources and tools they need to prepare.\n\nMadam Speaker, I urge my colleagues to support H.R. 5078 and to stand  with the State, local, Tribal, and territorial partners who are on the  front lines of our cyber defense every day.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…and the Los Angeles Olympics, we must ensure every  necessary security measure is in place to protect the millions of  visitors and attendees these events will bring.\n\nMadam Speaker, I urge my colleagues to support H.R. 1608.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…program will help spur  entrepreneurship, strengthen local economies, and ensure that small  businesses in all States and territories have a fair opportunity to  grow.\n\nMadam Speaker, I urge my colleagues to support H.R. 3496, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Madam Speaker, I yield such time as she may  consume to the gentlewoman…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699176/northern-mariana-islands-small-business-access-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…America's natural  beauty.\n\nI commend Representative McClintock for his leadership on this bill  and his continued work to expand outdoor access for the American  people.\n\nMadam Speaker, I urge my colleagues to support this commonsense, pro- recreation, pro-first-responder legislation. Let's honor those who  serve by giving them the opportunity to enjoy the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…decide, and that is important.\n\nIf we are going to make sure we become energy independent in this  country, we have to start thinking about those things. It is important.\n\nMadam Speaker, I urge the passage of H.J. Res. 20, and I yield back  the balance of my time.\n\nMr. LATTA. Madam Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…stand with  the men and women who keep America running. We stand with Americans for  common sense. I couldn't be  more proud to be here with my colleague for this bill.\n\nMadam Speaker, I urge my colleagues to support this resolution. In  the words of the truckers: Let's slam the brakes on this nonsense and  put America back in the driver's seat.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veterans, ensuring the VA is working for our  veterans.\n\nMadam Speaker, I also give special thanks to The American Legion, the  PVA, and the VFW for their support.\n\nMadam Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Madam Speaker, I yield such time as he may consume to the  gentleman from Michigan (Mr. Barrett), who is the sponsor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…billion industry. By enhancing our  promotion of music-related tourism, we can stimulate local economies,  create jobs, and showcase America's rich cultural heritage.\n\nMadam Speaker, I urge my colleagues to join me in voting in favor of  H.R.\n\nMr. BILIRAKIS. Mr. Speaker, let me tell you, the speaker on the floor  of the House of Representatives in the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…AGOA's renewal without interruption is       essential to signal the strength and continuity of the U.S.-      Africa economic relationship.\n\nMr. SMITH of Missouri. Madam Speaker, I urge my colleagues to vote  ``yes,'' and I yield back the balance of my time.\n\nMr. SMITH of Missouri. Madam Speaker, on that I demand the yeas and  nays.\n\nThe yeas and nays…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…State Planning for Reliability and Affordability Act prioritizes  the resources we need most. It will encourage States to take more  responsibility over their systems.\n\nMadam Speaker, I urge my colleagues to support the legislation, and I  reserve the balance of my time.\n\nMr. GUTHRIE. Madam Speaker, I yield 3 minutes to the gentleman from  Ohio (Mr. Latta),…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…like the One Big Beautiful Bill  Act or today's ZIP Code update, it is my mission to be a voice that  responds to the needs of my constituents.\n\nI stand here today, Madam Speaker, to urge support for this package  to ensure that communities across this country can have the clarity  that they absolutely deserve.\n\nMr. COMER. Madam Speaker, I yield 3 minutes…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…forward. It  would close that loophole that allows illegal aliens to get off lightly  when committing fatal acts, such as vehicular manslaughter under the  influence.\n\nMadam Speaker, I urge my colleagues to vote in support of this  legislation to help bring back common sense to our immigration and  legal systems after these 4 years of pure chaos.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…government regulations. We cannot allow Gavin Newsom and  California Democrats to decide what vehicles my constituents in central  Pennsylvania are allowed to purchase.\n\nMadam Speaker, I urge my colleagues in both the House and the Senate  to pass this legislation so that President Trump can end this mandate  and save our American auto industry.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}]