[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the Address, which was written by the archetypal  son of our Commonwealth, with the assistance of close confidants  Alexander Hamilton and another Virginia native son James Madison. Those  Virginians who read the Farewell Address on the Senate floor are: John  Daniel, Claude Swanson, Carter Glass, John Warner--twice--Paul Trible,  Chuck Robb, and George…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia.\n\nMs. NORTON. While Congress has authority to legislate on local D.C.  matters, it does not have a duty to do so. It is a choice.\n\nIn Federalist 43, James Madison said of D.C. residents: `` . . . as a  municipal legislature for local purposes, derived from their own  suffrages, will, of course, be allowed them.''\n\nSince 1802, Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to honor Mayor Tyrone Echols  of Venice, Illinois, and to congratulate him on his retirement after  more than 40 years in office.\n\nAs a graduate of Madison High School and Southern Illinois  University, Mayor Echols is a true son of downstate Illinois. He has  dedicated his career to serving our community.\n\nBefore he was elected…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691471/retirement-of-mayor-tyrone-echols"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Wisconsin who relies on the enhanced premium tax credits on the  Affordable Care Act. Amanda, who has lupus, needs weekly shots to  manage the autoimmune disease.\n\nOr take Madison chef and restaurant owner Evan Dannells who has about  a dozen employees who all get their care from the Affordable Care Act.\n\nHe said that if that weren't an affordable option,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the  United States is the Constitution.\n\nNo king, no monarch, separate and coequal branches of government.  This is the Article I branch of government.\n\nMr. Speaker, James Madison once made the observation in his view in  one of the Federalist Papers that at its best, Congress should function  as a rival to the executive branch. That was James Madison.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…ability to advance lifesaving medical  research in the first month of the Trump administration.\n\nAs many of you know, I am a proud graduate of the University of  Wisconsin-Madison Law School. In many ways, I grew up at the  university, where both of my grandparents, who raised me, worked. My  grandmother ran the costume lab at the theater department,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…happiness. Thomas Jefferson didn't mean all men. He didn't include the  men, women, and children that he owned, including his children and the  mother of those children.\n\nWhen James Madison, the architect of the Constitution wrote the  Virginia Plan that led to the Constitution in the beginning, ``We the  people . . . in order to form a more perfect Union'' and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…for voting Members of the House and Senate.\n\nWhile Congress has the authority to legislate on local D.C. matters,  it is not required to do so. In Federalist No. 43, James Madison said  of D.C. residents: ``A municipal legislature for local purposes,  derived from their own suffrages, will of course be allowed them.''\n\nIn 1953, the Supreme Court held…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Madison Sours  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nMadison has overcome many challenges along her journey to success,  demonstrating perseverance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691986/recognizing-madison-sours"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Commander in Chief, but article II is not a blank check. The Framers of  our Constitution deliberately separated the powers of war and peace  between the branches.\n\nJames Madison warned:\n\nThe executive is the branch most prone to war; therefore       the Constitution has, with studied care, vested that power in       the legislature.\n\nThe War Powers…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "Mr. MURPHY. Mr. President, in a 1793 letter to William Cabell, James  Madison said this:\n\nIn no part of the constitution is more wisdom to be found       than in the clause which confides the question of war or       peace to the legislature, and not…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…States.\n\nThe Constitution includes a Bill of Rights, and one of the most  important pieces of the Bill of Rights is the First Amendment. It was  drafted by Virginian James Madison, and it talks about the fact that  there can't be laws or legal restrictions against the right of the  people to peacefully assemble and petition government for redress of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…power to start another war in the hands of any single person.\n\nThe Framers put their thinking on parchment, and in a letter to  Thomas Jefferson, in the summer of 1789, James Madison reflected on how  they had approached this question of war power, which was the subject  of much debate in Philadelphia at the Constitutional Convention. He  said:\n\nWe have…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…States of America,  because there are some people who have read the Federalist Papers. I  have read them. I have read the words of Hamilton, the words of Jay,  the words of Madison. I have read them.\n\nThey now have come to these lofty conclusions about what impeachment  is. I am going to tell you the truth of what it is, and I defy any one  of these…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…K-12 funding and allow the Department  of Education to continue their work. Our students deserve better than  this waste and red tape.                       Congratulating Madison Whitbeck\n\nMr. SUBRAMANYAM. Mr. Speaker, congratulations to former Ms. Loudoun  County, now Ms. Virginia, Madison Whitbeck.\n\nMadison is a proud graduate of Riverside High School…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Constitutional Convention  originally considered giving Congress the exclusive power to make war.  Elbridge Gerry successfully replaced ``make war'' with ``declare war.''\n\nMadison explained this distinction as ``leaving to the executive the  power to repel sudden attacks.'' That distinction has been widened over  the centuries, and perhaps it is time…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…toward it. They fight crime, protect the innocent, and  too often, make the ultimate sacrifice.\n\nDuring my time in Congress, Mississippi has lost too many heroes: In  June 2023, Madison Police Officer Randy Tyler was shot and killed while  responding to a hostage situation. In January 2024, George County  Sheriff's Deputy Jeremy Malone was shot and killed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…fully whether or not to grant this power to the  President. To a man, from Jefferson to Hamilton, the spectrum of our  Founding Fathers, they all agreed with the words that Madison wrote  that the executive is the branch most prone to war, and, therefore, the  Constitution, with studied care, vested that power--vested the power to  declare war in the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Crowley,       Michael: New York Times; Cueto, Isabella: STAT; Cunningham,       Paige: Washington Post; Curi Saavedra, Maria: Axios; Curran,       Enda: Bloomberg News; Czopek, Madison: PolitiFact da Costa,       Pedro: Market News International; Daly, Matthew: Associated       Press; Daneman, Matthew: Communications Daily; Daniels,       Omari: Washington…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Madam President, every year, Sunshine Week is held  around March 16, the birthday of James Madison, who not only is a  former President, but the acclaimed ``Father of the Constitution.''\n\nOn its 20th anniversary, Sunshine Week continues to be a crucial  reminder of the…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…C-SPAN's cameras rolling here in Congress keeps lawmakers  accountable to our constituents by providing a valuable conduit for  civic engagement and civic education.\n\nAs James Madison wrote in 1822, after he had been President 10 years  before--no, I better say 6 years before--some 35 years after he helped  write the Constitution, he had this to say:\n\nA…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…School State Championship.\n\nFollowing an impressive regular season and dominant performance in  the playoffs, the West De Pere Phantoms traveled to Camp Randall  Stadium in Madison to compete in the 2025 WIAA Division 2 State  Football Championship.\n\nIn a hard-fought matchup, the West De Pere team won its third State  title in program history. The Phantoms'…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Easton, Massachusetts);\n\n(F) Mike Eruzione (Winthrop, Massachusetts);\n\n(G) John Harrington (Virginia, Minnesota);\n\n(H) Steve Janaszak (Saint Paul, Minnesota);\n\n(I) Mark Johnson (Madison, Wisconsin);\n\n(J) Rob McClanahan (Saint Paul, Minnesota);\n\n(K) Ken Morrow (Flint, Michigan);\n\n(L) Jack O'Callahan (Charlestown, Massachusetts);\n\n(M) Mark Pavelich (Eveleth,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…University.\n\nFunding in this package will also provide residents and businesses in  Brown County with long, and greatly needed, sewer services and support  for  the city of Madison's stormwater mitigation project to reduce flooding  and improve water quality.\n\nThese investments will support critical infrastructure and local  priorities that communities…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…agriculture  but also taking initiative to serve their neighbors, strengthen their  school, and build a brighter future.\n\nLed by adviser Lynne Phillips and officers Harlie Brooks, Madison  Ballard, Bella Kaplan, Allie Englert, Camberlee Lockhart, Cadence  Flint, Alexis Clark, Silas Dutton, and Lex Flores, alongside all other  members, planned and carried out…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Maryland, I think, wisely noted--our  civil liberties, and the extent to which we are made aware of what  actions we take might be criminalized.\n\nMr. Speaker, I note as James Madison said in Federalist No. 62 on the  fundamental principles of representative government and the importance  of accessible and understandable laws: ``It will be of little avail…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…NEWS; Alva, Mitchell: ABC NEWS; Alvarez,       Maximillian: THE REAL NEWS NETWORK; Alvarez, Priscilla: CNN;       Alvarez Gruber, Benjamin: DEUTSCHE WELLE TV; Alworth,       Madison: FOX BUSINESS NETWORK; Al-Yasiri, Ridha: AP-      BROADCAST; Amash, Justin: NBC NEWS; Amor, Miguel: FOX NEWS;       Ampah, Ekow: NBC NEWS; Anderson, Charles: WETA; Anderson,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…a question we have had to fight for, we have had to struggle  for, and that is right before us today.\n\nIt goes back to the Framers in our founding. Federalist 51 is where  Madison wrote:\n\nIf men were angels, no government would be necessary.\n\nAnd so they came up with a structure, the separation of powers.\n\nOur Constitution has often been remarked upon…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…person working for me once found out.\n\nShe got married, and she and her new husband were looking for a new  apartment. They found what they felt were the nicest apartments in  Madison, Wisconsin, were the low-income apartments. Not only do you get  a free apartment, but it is superior to the apartments that other  people are paying for.\n\nWith regard to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise to recognize Madison Wasmer.\n\nMadison is a junior at Jackson High School and has recently earned  the Eagle Scout Award, becoming the first female in Jackson County to  earn this distinction.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}]