[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…beginning a blockade of a country with  which we are not at war and with which the American people do not want  us to go to war--not over regime change, as despicable as the Maduro  regime is. The American people do not want to go to war over regime  change, which is apparently the real objective here.\n\nWe should pass a War Powers Resolution to make clear…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…behind Maduro's  second in command, who is, as we speak, ramping up the repression of  political speech and political activities in Venezuela. All the bad  actors in the Maduro regime, with the exception of Maduro and his wife,  are still there, running a kleptocracy, stealing from the Venezuelan  people, shipping drugs out of the country, while continuing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…rejected and  their leadership positions removed simply because the truth didn't fit  a politically convenient story.\n\nAnd again, to be clear, there is no question that Maduro's regime in  Venezuela and the TDA are ruthless actors who pose real threats, but  punishing officials--punishing intelligence officials in particular-- for telling the truth only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…consider launching a major military operation against  another country, and that authority--the Constitution is clear--must  come from Congress.\n\nNobody here denies the Maduro regime is horrific and undemocratic,  and we also agree drug traffickers and organized criminals who poison  Americans ought to be tracked down and dismantled. That was why, when…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President's own words, this campaign is simply about  seizing Venezuela's oil and profiting from it.\n\nThe people of Venezuela have suffered extraordinary hardship under  the Maduro regime. They have voted in multiple elections for new  leadership and have been denied their choice through fraud and  repression. After everything they have endured, the people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and the exodus of literally millions of  Venezuelans, some to the United States.\n\nLast July, Venezuela held another Presidential election, during which  the regime, the Maduro regime, arbitrarily blocked opposition  candidates from the ballot and tried to undermine the preelectoral  process. Nonetheless, more than 10 million Venezuelans showed up to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Thune", "party": "Republican", "sentence": "…administration, Democrats were calling  for the ouster of Maduro and for U.S. assistance in Venezuela and were  criticizing the President for not going far enough in opposing the  Maduro regime. President Biden raised the reward for information  leading to the arrest or conviction of Maduro to $25 million. But then  President Trump directs an isolated Special…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…resolution would prohibit the use of United States Armed Forces  off the coast of Venezuela without regard for the real and growing  threats posed by the foreign terrorist Maduro regime.\n\nLet's be clear-eyed about the danger that we face. The Maduro regime  is a designated foreign terrorist organization, a narcoterrorist state  that collaborates with other…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…Democrat-led legislation is cited in a  House resolution--H. Res. 987--we have introduced today.\n\nExamples include H.R. 328, a Democratic-sponsored bill that  excoriates the Maduro regime which ``has refused to respect the  overwhelming choice of  the people of Venezuela and subsequently arrested and abused thousands  of innocent citizens of Venezuela, including…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Trump ordered it.\n\nConsider that, in 2020, Senator Schumer criticized President Trump  for bragging ``about his Venezuela policy'' but failing to bring ``an  end to the Maduro regime.'' It sounds like a call for regime change to  me, just like Joe Biden's decision to increase the bounty on Maduro's  head seems like a call for Maduro to be apprehended…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…message: Narcoterrorist dictators are not immune  from consequences, and the United States will not stand by while our  citizens continue to be poisoned and murdered by the Maduro regime.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "French Hill", "party": "Republican", "sentence": "…trade.\n\nIn 2019, the United States no longer recognized Maduro as Venezuela's  legitimate president. As a result, the United States officially cut  diplomatic ties with the Maduro regime.\n\nIn 2020, the Department of Justice charged Maduro with  narcoterrorism, and the United States offered a $15 million reward for  his capture.\n\nIn 2024, in my view, Mr.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…imposed at the point of a foreign  bad act. The United States maintains the most formidable military in  human history. Of course, we have the capability of overthrowing the  Maduro regime, just like we had the power to overthrow Saddam Hussein  and Muammar Qadhafi.\n\nBut what comes next? Is anyone thinking about the potential blowback  that such a campaign…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…who will be on this  floor in a few minutes, came to this very floor in 2020 and complained  about President Trump, saying President Trump ``hasn't brought an end  to the Maduro regime.''\n\nSenator Chris Van Hollen from the Foreign Relations Committee, a  Democrat from Maryland, told MSNBC just last year--he said:\n\n[T]he United States needs to work with…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…United States is a member, it says that  the countries of the Western Hemisphere may take military action  against a threat that endangers the peace of the Americas.\n\nThe Maduro regime has destroyed the peace of the whole Western  Hemisphere. If not, ask anyone who lives in my district, the city of  Miami.\n\nNow let's go back to American history, which…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Senator said--and this was on February  5, 2020:\n\nAnd the President brags about his Venezuela policy. Give us       a break. He hasn't brought an end to the Maduro regime. The       Maduro regime is more powerful today and more entrenched       today than it was when the President began.\n\nWell, the President changed that. He removed Maduro. Do you know…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…organizations.\n\nJust yesterday, at a Europe Subcommittee hearing, I made the point  that China and Russia are engaged in hybrid war against the United  States today.\n\nNot only has Maduro's regime purchased Iranian-armed drones, but they  have also allowed Iran to establish production facilities for its  military drones within their borders.\n\nTerrorist organizations…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]