[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Correa  for yielding.\n\nMr. Speaker, I rise today in support of my bill, the Securing the  Cities Improvement Act, a critical piece of legislation designed to  help us build and maintain our Nation's security capabilities.\n\nSpecifically, this bill provides participating cities with more  reliable guidance and support from the Department of Homeland  Security's…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that mention candidates are not subject to FEC reporting       regardless of proximity to Election Day.\n\nNevertheless, some major online platforms voluntarily       maintain databases of political ad sales. These datasets       indicate that about 320 groups that do not disclose their       donors collectively spent more than $281 million on online…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Because of this, we rely on the       Marketplace for affordable health coverage. Even with a       budget focused solely on basic necessities, we are still       struggling to maintain affordable healthcare. The current       federal tax credits are what make it possible for us to have       even the most basic health insurance, and additional credits…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698417/healthcare-is-real"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…cover nearly a  quarter-million low-income Georgians who can prove they are working,  studying or volunteering. Only about 6,500 of them, however have been  able to gain and maintain coverage.\n\nIn Georgia's Second Congressional District, which I represent, some  of the poorest counties have fewer than 10 enrollees despite having  high percentages of uninsured…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…current pre-trial system is a calibrated approach to public       safety that appropriately weighs public safety risks while       also considering the need of individuals to maintain critical       supports such as housing and employment on a case by case       basis. In contrast, H.R. 5214 would implement a cash bail       system that would financially…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Now, H.R. 881 contains a waiver provision that allows the Secretary  of Homeland Security to permit Department funding to go to U.S.  institutions of higher education that maintain a relationship with  programs and entities in China if the relationship is either in the  national security interests of the United States or has no bearing on  the national…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…earliest days of policing rural roads to the current use of  cutting-edge technology, the agency has continually evolved to meet the  challenges of each era while striving to maintain the trust and respect  of the public it serves.\n\nEven their uniforms made an impression--most notably in 1986, when  their distinctive attire earned national recognition and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…important it is to keep our ties in this  region strong.\n\nThe Taiwan Security Cooperation Initiative is not just another line  item. It is a vital provision that enables Taiwan to maintain its self- defense capabilities and sends a clear message to both Taipei and  Beijing that the United States is serious about deterrence. It keeps us  out of that war that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…people  forgetting the struggle, people forgetting what we overcame, people  forgetting what we could not have and why we fight so hard for what we  do have and to be able to maintain it in the future.\n\nI don't forget. I won't forget. I cannot forget because every day I  walk in here is a reminder of what was sacrificed for me. Every day  that I have the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Marketplace for my health coverage, the       only way I could secure a policy that didn't deny me for my       age, that capped my out-of-pocket costs, and that allowed me       to maintain my own health. Now, with funding cuts and       legislative actions targeting the core of the ACA, that       coverage is dissolving. The fear is a cold, suffocating…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…administration, there  were 107,000 encounters at the southern border, but in August of 2025,  there were only 9,000. The border is much more secure. I support that.  We must maintain it, and we will.\n\nSo is the deportation policy now about deporting criminals--something  we support? There is evidence, and the evidence of what the policy is  about comes…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to share the story of a Federal  worker, an FAA scientist, who DOGE and the administration fired. This  person's job was to create and maintain flight maps that air traffic  controllers and pilots could use to navigate airspace. Without these  maps, ``pilots would quite literally be flying blind.''\n\nYet the Trump…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688198/fired-by-president-trump"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…destabilizing show of  force. I heard these concerns reinforced recently during a  congressional visit to the Pacific countries.\n\nUnder such tense circumstances, we must work to maintain peace and  stability in the Taiwan Strait by bolstering deterrence and redoubling  our commitment to the U.S. One China policy.\n\nWhile providing Taiwan with the weapons to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690684/taiwan-assurance-implementation-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…that fat-free and low-fat milk are  the healthiest options for children.\n\nThe DGAs must follow the Dietary Guidelines Advisory Committee's  evidence-based recommendations to maintain current limits on saturated  fat, sugars, and sodium. Simply put, nutrition standards must be guided  by scientists, not politicians and industry lobbyists. If there is a…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…funded by taxpayer dollars but by our utility bills.\n\nBonneville system operators keep the lights on. They match supply to  demand, whether in a heat wave or a cold snap. They maintain the  majority of our transmission lines so when we have a wind storm like  our recent ones, their linemen go out and fix those lines in the worst  weather. These specialized…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688300/senseless-bonneville-power-administration-workforce-cuts"}, {"senator": "James Risch", "party": "Republican", "sentence": "…cost is       $510 million.\n\nThe United States is committed to the security of Israel,       and it is vital to U.S. national interests to assist Israel       to develop and maintain a strong and ready self-defense       capability. This proposed sale is consistent with those       objectives.\n\nThe proposed sale will enhance Israel's capability to meet…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…defense program funding by $912  million. This includes $25.4 billion for the National Nuclear Security  Administration, an increase of $1.3 billion. These funds ensure we can  maintain today's nuclear stockpile, prepare for future needs, and  modernize aging infrastructure that underpins our nuclear deterrent.\n\nOur bill also delivers a nearly 10 percent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…his country, and asking our fellow  man, Mr. Speaker, to hear this message: enforce existing laws,  prosecute violent criminals, incarcerate those who are convicted, and  maintain that incarceration until they are reformed or their sentence  is complete.\n\nWe say this not just for ourselves, but for the murdered, for the  lost, for the forgotten, for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…freedom in Hong Kong and the People's Republic of China--and one  that reminds us that the work of liberty, the work of freedom, the  sacrifice and the struggle required to maintain it are not cheap.\n\nOur Nation was built on a yearning for the kind of freedom from  government repression and overreach that Jimmy Lai stood up against.  And our democracy…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…authorized to accept       funds from a Federal or non-Federal entity, including through       a grant or funding agreement, to study, design, construct,       operate, or maintain wastewater treatment works, water       conservation projects, or flood control works, and related       structures, consistent with the functions of the Commission.\n\n(b)…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692167/international-boundary-and-water-commission-authority"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…that is more than 100 years old and plays a vital role in preserving  safety, quality, and a standard of excellence for the American grain  industry.\n\nIf we want America to maintain its status as the safest, most  abundant grain supply in the world, reauthorization of this act before  several of its key provisions expire at the end of September is  absolutely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that China has never seen a piece of  intellectual property that they aren't willing to steal, so by hook or  crook, they are going to try to outcompete us, and we need to maintain  our diligence and be vigilant when it comes to this threat.\n\nChina is aggressively investing resources towards winning this race  for artificial intelligence, and we cannot…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the gates to the national parks remained fully  accessible.\n\nToday, opponents of President Trump's war on government waste have  revived the Washington Monument strategy to maintain a bloated Federal  workforce that is crushing American taxpayers. Every dollar of  discretionary spending, which fully or partially funds every department  within the Federal…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Federal Acquisition Regulation.\n\n(3) Operational independence.--Over the course of a       comprehensive assessment, contractors hired pursuant to       paragraph (1) shall maintain operational independence from       the integration, management, and operations of the software       inventory and software entitlements of the agency.\n\n(c) Submission.--On…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…When volunteers are united in an important mission, it naturally  fosters camaraderie which is great for anyone who works or volunteers  at the Center. All of these women maintain a loving demeanor and greet  each client with a warm smile and conversation (and sometimes a hug).  The Center's clients feel welcomed and cared for because of the lived…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…discussed here is whether you allow those very tax  benefits for small businesses, for individuals, to expire. We don't get  a huge economic pop from continuing them. You maintain consumption. We  know if you don't do them, that loss of consumption in those  populations actually really hurts us economically.\n\nI am going to reserve in a moment, and then,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…It preserves the tipped wage and protections in the  Fair Labor Standards Act. It provides clarity and simplicity in  categorizing workers as tipped employees. It seeks to maintain a  consistent regulatory environment.\n\nTo put it simply, my legislation will protect the hard-earned  paychecks of tipped employees across the country and right at home in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…committee shall be published unless the chairman, with       the concurrence of the ranking member, determines otherwise.\n\nThe committee, through the chief clerk, shall also maintain       at least one copy of all materials provided to the committee       by the Executive Branch; such copy shall remain in the       custody of the committee and be subject…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…rescinded pursuant to a court order, not later than       the date on which the order is entered, the agency shall, at       the location described in section 4(a)--\n\n(1) maintain the rescinded guidance document; and\n\n(2) indicate--\n\n(A) that the guidance document is rescinded;\n\n(B) if the guidance document was rescinded pursuant to a       court order,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…fuels, have made the grid operators'  jobs nearly impossible.\n\nWe know that baseload and dispatchable power resources provide the  essential reliability services necessary to maintain the stability of  the electric system at an affordable price. This legislation provides a  pathway for grid operators to bring these resources online quickly if  there is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}]