[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…experiences to transition to major airport facilities.\n\nManassas Tower has historically prevailed against difficult  circumstances. It has faced critical infrastructure issues yet  maintained its role as a leader in air traffic control. As they prepare  for commercial flights in 2026, they will continue to be a role model  for perseverance and leading with purpose.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697601/recognizing-manassas-regional-airports-air-traffic-control"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…in America will be served by this institution so  that they can pay the lowest tax amounts possible. The corporations in  this country must have their record-low tax rates maintained.\n\nThe problem is this comes with a cost, and that cost will be paid, as  the Republicans have laid it out for us to see, by the Medicaid program  and by the addition of trillions…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are talking about the people who make sure that veterans  have transportation to those appointments, who assist with benefits  claims, who ensure that the VA hospitals are maintained and that they  are safe, who clean operating rooms and sterilize instruments in  between procedures. It may not be the surgeon who is fired, but the  surgeon who is walking…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…and economic space and build resilience in Taiwan against PRC gray zone  tactics.\n\nSince 1979, in order to build a bilateral relationship with China,  our government has maintained internal executive department guidelines  to limit official interactions with Taiwan consistent with our One  China policy. This bill simply directs the executive to report…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690684/taiwan-assurance-implementation-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…years, those immortal words have lived at the heart of  our Republic. Representative democracy is not just something that  appears, it doesn't happen by accident, and it isn't maintained by  sheer inertia. We have to fight each and every day to maintain it.\n\nI am the child of refugees. My parents came to this country from  Communist Vietnam in search of the…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689123/a-republic-if-we-can-keep-it"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…younger than 18 years of age.\n\n(2) Documents to establish income.--To establish the       alien's income, the alien shall provide--\n\n(A) employment records that have been maintained by the       Social Security Administration, the Internal Revenue Service,       or any other Federal, State, or local government agency;\n\n(B) bank records; or\n\n(C) at least…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…excellence, nuclear safety,  emergency preparedness, and professional standards, exemplifying the  spirit of public service and technical leadership. Additionally,  Waterford 3 has maintained a strong and ongoing partnership with the  St. Charles Parish community, providing local jobs, supporting  charitable organizations, investing in STEM education, and preparing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…improvements for  firefighters and improving working conditions. In another sweeping  effort to cut costs, DOGE eliminated the entire office. Now, this  cancer registry is no longer maintained or updated.\n\nWhen the President talks about DOGE and government efficiency, I am  thinking about the firefighters whose lives he is putting in harm's  way. We owe it to firefighters…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…choose that path, to experience the American Dream.\n\nMr. Speaker, as I perhaps approach the end of this particular  journey, let me just reiterate that as House Democrats, we maintained  from the very beginning of this Congress, we acknowledged the election  of President Donald Trump, offered to work with our colleagues on the  other side of the aisle whenever…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…variety of outdoor  spaces, the parks attract thousands of visitors every year.\n\nOver their 80 years of service, the Carmichael Recreation and Park  District has successfully maintained its parks and facilities through  many challenges. They continue to provide exceptional recreation  experiences and will continue to do so for many years to come.\n\nI ask…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…done well. In certain select cases, like the       Japanese semiconductors, we've taken steps to stop unfair       practices against American products, but we've still       maintained our basic, long-term commitment to free trade and       economic growth.\n\nSo, with my meeting with Prime Minister Nakasone and the       Venice economic summit coming up,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…improve the lives of  Cubans on the island, these same people are silent. I find that  shameful.\n\nIn the past, whether our policy was more relaxed or tightened, our  government maintained consultations with Cuban officials to manage  migration, but the Trump administration has closed even that door,  turning off a basic level of dialogue.\n\nNone of this makes…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…vicious policies and more, they found a  way forward.\n\nThere is a disproportionate number of Native Americans and Alaska  Natives that rely on these programs, people who have maintained  extraordinary dignity despite promises made and promises broken.\n\nSo many people are talking about that idea of a sacred trust; that  the richest Nation in the world, to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Margaret Lucinda Sidney,  his aunt Sylvia Sidney, and his cousin Arthur Dennis Sidney, both of  whom now reside in Washington, D.C. Corey was proud of his close-knit  family and maintained affectionate relationships across the country.\n\nThough he might have claimed to be shy, Corey was truly a social  butterfly, effortlessly making friends wherever he went,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…kept alive the memories and stories of the years  past that represent the foundation of the village of Port Chester  today.\n\nLed by president Jordan Allen, the society has maintained the  historic Bush-Lyon Homestead and has been able to follow through with a  host of different items for this building that was built in 1760,  involving the community and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…development and environmental  stewardship actually go hand in hand. We have invested billions in  clean and emissions-controlled technology. We have reclaimed our lands  and maintained some of the strongest air quality records in the Nation.\n\nWe can grow the economy, power the country, and steward the  environment all at once. That is the American Way,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…unable to tax large portions of land in  their jurisdiction.\n\nWith this funding reauthorization, rural communities across Idaho  will be able to keep classrooms open, roads maintained, and emergency  services operating. However, a long-term solution is necessary, and I  will continue to advocate for one in Congress that ensures Idahoans  dictate Idaho…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697656/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…an Army veteran  herself. She said: Surviving spouses and families who cared for  children, moved many times during a military career, compromised their  own careers, and maintained their homelife while the servicemember was  deployed have earned and deserve attention when the spouse has passed.  Placing the OSA directly under the Secretary will help…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…confident foreign  policy of defending American interests and free peoples against the  menace of Soviet Russia and anti-American insurgencies around the  world.\n\nNorman maintained a friendly dialogue with Reagan over the years and  received a richly deserved Presidential Medal of Freedom from President  George W. Bush.\n\nNorman turned over the reins…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…(A)(iii), the term `eligible Roth IRA' means a Roth IRA       which--\n\n``(i) is the only Roth IRA (other than a Roth IRA       established under section 401(a)(31)(B)(i)) maintained for       the benefit of the individual during the taxable year of the       taxpayer in which the distribution or payment described in       subparagraph (A)(iii) is made,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…preventing catastrophic war.\n\nWell, what did the American people say? How did they feel about that?\n\nIn 1989, with the Soviets on the ropes, 75 percent said that NATO  ought to be maintained beyond victory--maintained beyond victory.  Thirty years later, in 2019, an even greater majority gave the very  same response, even before Putin's escalation in Ukraine.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…not only revolutionizes the way we do  business but preserves critical financial institutions, and they need  this opportunity.\n\nFor more than 150 years, our country has maintained both State- chartered and national banks. There are about 5,000 banks; 4,000 of  them are chartered at the State level and only 1,000 at the Federal  level. This system has…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…loss or theft of such social       security card, the Commissioner shall issue a new social       security account number to such child and make note in the       records maintained with respect to such child of the       pertinent information received by the Commissioner regarding       the loss or theft of the social security card.''.\n\n(b) Effective…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…country listed in Country Group D:5       under Supplement No. 1 to part 740 of title 15, Code of       Federal Regulations; and\n\n``(ii) is included on--\n\n``(I) the list maintained and set forth in Supplement No. 4       to part 744 of the Export Administration Regulations; or\n\n``(II) the list maintained and set forth in Supplement No.       7 to part…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…moved over  close to 3,000 counties to the right. That is 89 percent of the  counties in the United States. Senate Republicans won a 53-seat  majority, and House Republicans maintained the majority as well.\n\nAmericans gave us a mandate to secure the border, to rebuild the  economy, to unleash American energy, and to restore America's strength.\n\nHere we…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Invitational.\n\nRussell delivered a pivotal chip-in eagle on the par 5 hole during  his final round at Bay Hill, taking lead over his playing partner,  Collin Morikawa. Ultimately, he maintained his score of 11 under par to  win by one stroke.\n\nRussell was finally back in the winner's circle for the first time in  over 850 days, having been one of the most consistent…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689684/congratulating-russell-henley"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and infrastructure. Highlights of her service include  transforming greater expertise into local water authority and making  improvements at Five Ponds Golf Course. Judy maintained the standard of  being thoughtful and resident-focused in her approach to governance.  Ms. Hoover has been especially proud of the work of Library Director  Peter Lehu, whom…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…right-of-way associated with the covered       land in section 2 to a width of less than 50 feet on each       side of the center of the main track or tracks established       and maintained by the Southern Pacific Transportation Company       on the date of the enactment of this Act; or\n\n(2) validate or confirm any right or title to, or interest       in the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Academy within which 1 or more Coast Guard       Academy cadets reside overnight;\n\n(2) test each such mechanism not less than once every 6       months for proper function and maintained in proper working       order; and\n\n(3) use a system that electronically records the date,       time, and identity of each individual who accesses a cadet       room using…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…administrative databases of the       Department of Veterans Affairs, the Department of Defense,       and the individual Services, respectively;\n\n(B) the national death index maintained by the National       Center for Health Statistics of the Centers for Disease       Control and Prevention; and\n\n(C) the study conducted under section 750 of the William…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}]