[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…colleagues--to join me,  not just in defending California's rights to protect the health of our  residents, not just in combatting the existential threat of climate  change, but in maintaining order in this Chamber.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…board.\n\nLike other bills that Democrats and Republicans have come to  bipartisan agreement on, this bill balances the concern of those trying  to raise capital while also maintaining disclosures and financial  transparency that benefit and protect investors and thereby protect our  capital markets, which so many speakers have pointed out are the envy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Small manufacturers account for more than 98 percent of U.S.  manufacturing firms and employ 4.8 million Americans. They play a  critical role in regional economies and in maintaining supply chain  resilience.\n\nThere is no doubt that reshoring manufacturing is a top priority. We  all lived through the pandemic and saw the downsides of streamlined  just-in-time…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…safety and management, including       training on the prevention, recognition, and academic       consequences of concussions and response to concussions; and\n\n(ii) using, maintaining, and disseminating to students and       parents--\n\n(I) release forms and other appropriate forms for reporting       and record keeping;\n\n(II) treatment plans; and\n\n(III)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…that a significant share of cancer cases may be preventable  through practical, evidence-based measures. Simple but important  actions, such as staying physically active, maintaining a healthy diet,  protecting our skin from excessive sun exposure, and keeping up with  recommended screenings, can make a real difference in reducing risk.\n\nAt the same…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…energy future.\n\nI congratulate Entergy's Waterford 3 Steam Electric Station, its  leadership, and employees, on their anniversary. I extend my best  wishes to Entergy for maintaining its commitment to powering Louisiana  and for being a strong community partner throughout the state.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…month, President Trump nominated three federal judicial       nominees who were selected from the Commission's candidate       pool--a process that demonstrates the value of maintaining       local input. DC residents also voted to elect an Attorney       General who represents the public interest. Changes to these       charter agencies would significantly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…need  to be taken carefully, the review required by this bill is a smart step  in the right direction which I support.\n\nThis legislation provides a useful directive while maintaining  congressional prerogatives and oversight over armed sales. I hope that  all of my colleagues will join me and support this bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694810/made-in-america-defense-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…have  resources as well. Cuba and Mexico. Is this the world that will work  for us or the world that we want where rather than acting as a  defender--actually the leader--in maintaining long-established  principles of national sovereignty, we threaten and invade countries to  seize their natural resources? That is the way it was before 1945:  ``Might makes…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…fentanyl- related substances were originally scheduled by the DEA, in 2018,  Congress has never allowed this authority to expire. So, by passing  this bill, we are merely maintaining the status quo. We must also  address how this poison gets into the hands of the most vulnerable: our  children. Too often, fentanyl is peddled in the open on some of the…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…reported  harassment, threats, and abuse locally.\n\nElection officials with institutional knowledge of how local systems  run and who are imperative to registering voters and maintaining voter  processes are leaving their roles at an alarming rate. The turnover was  especially pronounced in large jurisdictions where the Trump campaign  focused its misinformation…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…over the last few years to ensure the success of this legislation.\n\nMr. Speaker, this bipartisan effort is an important step in  solidifying our partnership with CERN and maintaining our Nation's role  as a leader in scientific research.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694825/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…back and forth between our two  nations. The fact that  he will continue to play a policy role will be important for both of  our nations and for all of us who care about maintaining democratic  values. I know that his passion for public service, his commitment to  internationalism, and his insightful analysis are ending here after his  time in Washington.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…well-positioned to respond. H.R. 5214       would also bring increased costs to DC taxpayers.       Incarcerating someone at the DC jail can cost $241 a day; the       price of maintaining the current jail population of 1,977       costs DC residents approximately $476,457 every day and over       $173 million every year. Introducing cash bail and expanding…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…beginning in 2007, making him  the longest-serving General Manager in the station's history.\n\nThroughout the entirety of his tenure, Prazenica played a critical  role in maintaining WPVI's status as the home of the most-watched local  news broadcast in Philadelphia, Action News, a title which the station  and program have held for nearly 50 years. In…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698974/recognizing-bernie-prazenicas-retirement-as-president-and-general-manager-of-wpvi-tv"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…from May 18-24, 2025, and  to offer a special greeting to the City of Oxford Public Works  Department.\n\nOur public works professionals dedicate their time and talent to  maintaining the infrastructure and facilities essential to public  health and our quality of life. In Oxford, that work is carried out  under the capable leadership of Rusty Gann who…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691680/recognizing-the-national-public-works-week-may-and-the-city-of-oxfords-public-works-department"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…sophisticated criminal networks with vast  resources extend their reach into America due to the open-border  policies that the left seems so committed to.\n\nIt is only through maintaining the policies of this President and  strengthening deterrence that we can ensure that illegal immigrant  criminals do not continue to flood this country.\n\nWe must send a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…H.R. 3381, the  Encouraging Public Offerings Act.\n\nThis legislation builds on the success of the JOBS Act by making it  easier for companies of all sizes to go public while maintaining the  transparency and investor protections our markets depend on.\n\nH.R. 3381 allows any company, not just emerging growth companies, to  test the waters by gauging investor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…this Act, the Commandant shall       conduct a pilot program to determine the extent to which the       Coast Guard Great Lakes icebreaking cutter fleet is capable       of maintaining tier one and tier two waterways open 95       percent of the time during an ice season.\n\n``(B) Report.--Not later than 180 days after the end of       each of the 5 ice…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…never gave up.\n\nBrycen found his competitive spirit on the track. Representing Mt.  Spokane, he has won multiple State titles and competed on the national  stage, all while maintaining a 4.0 GPA.\n\nBrycen Phillips is a total stud, and the entire Congress and the  entire Republic deserve to hear his story, and they now have.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…said, no, we are not going to allow that. What  was the reason they cited? It had nothing to do with preserving the  coast, which is their mission. It had nothing to do with maintaining  the beauty of the California coast, one of the most beautiful places in  the world, which is their mission.\n\nNo. The commissioners explicitly said during their meeting…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…companion bill with HR 2189 (Fitzgerald/      Correa) and ensures a consistent and harmonious federal       approach to the Department of Treasury & the DOJ updating and       maintaining clear compliance guidance for less-than-lethal       projectile devices.\n\nThe legislation corrects a key issue for federal law       enforcement. Unlike the U.S. armed forces,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…modernize its armed forces and to maintain a       credible defensive capability. The proposed sale will help       improve the security of the recipient and assist in       maintaining political stability, military balance, and       economic progress in the region.\n\nThe proposed sale will improve the recipient's capability       to meet current and future…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696897/arms-sales-notification"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…support jobs  and local growth in our districts.\n\nThe Labor-Health and Human Services bill on the floor today balances  the need for responsible fiscal stewardship while maintaining key  investments in biomedical research, schools, and public health.\n\nThanks to the negotiations on a bicameral, bipartisan level, funding  decisions have moved through…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…collaboration  between borough council, local businesses, residents, and public safety  officials. His leadership reflected a practical, community-first  approach, focused on maintaining New Hope's unique identity while  addressing the everyday needs of its residents and visitors alike.\n\nUnder his leadership, New Hope continued to strengthen its position…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…from May 18-24, 2025, and  to offer a special greeting to the City of Anniston Public Works  Department.\n\nOur public works professionals dedicate their time and talent to  maintaining the infrastructure and facilities essential to public  health and our quality of life. In Anniston, that work is carried out  under the capable leadership of David Arnett…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691676/recognizing-the-national-public-works-week-may-2025-and-the-city-of-annistons-public-works-department"}, {"senator": "James Risch", "party": "Republican", "sentence": "…significantly to ensuring peace and economic       stability in the Western Pacific. It is vital to the U.S.       national interest to assist our ally in developing and       maintaining a strong and ready self-defense capability.\n\nThe proposed sale will improve Australia's capability to       meet current and future threats by ensuring Australia has…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Representatives,      Washington, DC.\n\nDear Representative Bean: On behalf of Florida's       environment and regulated communities, I would like to voice       my support for the Maintaining Cooperative Permitting Act of       2025 (H.R. 2030/S. 1014).\n\nThe Act is necessary to set right last year's ruling from a       federal district court in Washington, D.C.,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the rhetoric of Obama-era  officials' who viewed their remit as managing America's decline amid a  transition to a multipolar world.\n\nIf the NDS ignores the importance of maintaining American primacy,  fails to account for the global nature of competition with China, or  discounts the value of supporting and integrating allies and partners,  it would…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…sets him apart. Over the course of his nearly four decades  of service, the House saw a lot of change. Noah's ability to constantly  adapt and consistently excel--all while maintaining his sense of  humor--is a bold testament to his dedication to the House of  Representatives and the people it serves. I wish Noah the best for his  well-earned retirement.…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}]