[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, Americans are watching members of the  military patrolling the streets of major cities in the United States of  America. I never thought I would utter those words anywhere, let alone  on the floor of the U.S. Senate--members of the military in our  neighborhoods,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…said, overall, in Connecticut, we had 167 homicides in 2023.  In 2024, we had 63. It is wild.\n\nThis happened in Baltimore, and this happened in Chicago. In most of  the major cities in this country and in rural areas as well, we saw  this dramatic, dramatic decline. So it is just something to celebrate  because it is not easy to get that kind of consensus.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…businesses.\n\nSupporting small businesses should not be a partisan issue. We in the  Committee on Small Business have heard in our hearings that targeting  SBA resources in major cities will be critically detrimental.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to the committee.\n\nIf the House rules permitted,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692102/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…a moment of truth and an hour of  decision.\n\nI believe we have to do this. I believe we have to do it because if  we are going to wait until there are tanks rolling into major cities,  at the capitals of cities, it will be too late.\n\nIf we are going to wait until you read and hear about it in some  major newspaper that the President has metamorphosed…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…this urgent reform and increased congressional oversight.\n\nEarlier this week, the President suggested that he would invoke the  Insurrection Act to deploy more guardsmen in major cities if the courts  or Governors delayed deployment. So I stand here with my colleagues  from Oregon, Illinois, and California, whose constituents are living  through this threat.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…irrelevant since there is no  justification for Congress to legislate on local D.C. matters, but I  will briefly discuss it.\n\nConsistent with Federal law, the position of the Major Cities Chiefs  Association and D.C.'s values, D.C. limits cooperation with Federal  immigration agencies. D.C. concluded that cooperating with Federal  immigration agencies would…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…stimulate that. Yet,  this bill could not be further from that goal.\n\nIf this bill is passed, SBA offices will be relocated as political  payback, away from public access in major cities. In fact, that is the  point: to reduce programs that help small businesses gain access to  capital, professional services, and predictable tariff policies.\n\nThat is why…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…governments could plan  long-term budgets with certainty.\n\nIt ensures that children growing up in frontier communities receive  the same shot at a quality education as anyone in major cities in my  district, like Albuquerque or Las Cruces. It ensures that when there  was a medical emergency in the middle of the night, emergency medical  services had the roads…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…attacks on his opponents. He       called the media the ``enemy of the American people,''       questioned judges' legitimacy, and threatened to cut federal       funding to major cities. Predictably, these attacks triggered       dismay, shock, and anger across the political spectrum.       Journalists found themselves at the front lines, exposing--…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…real safety improvements felt by families here in the District  of Columbia.\n\nWhile Democrats scramble to defend their failed policies and liberal  experiments in America's major cities, and they downplay the true cost  in lives that come from policies that have long been supported in these  cities, Republicans are restoring accountability, enforcing the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…enforcement.\n\nThese bills are widely supported by law enforcement groups. The  Association of State Criminal Investigative Agencies, Federal Law  Enforcement Officers Association, Major Cities Chiefs Association,  Major County Sheriffs of America, National Association of Police  Organizations, National Narcotics Officers' Associations' Coalition,  and Sergeants…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…reach a breaking point, and this could result  in the closing of our airspace or portions of it.\n\nThe consequences of the shutdown on our aviation system aren't  isolated to major cities and large airports as the viability of the Air  Service Program is also now put at risk. This program incentivizes  airlines to provide commercial flights to rural communities…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696174/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…oppression, and the deterioration of freedom.\n\nDespite this record, we are seeing a troubling rise in socialist  rhetoric here at home, especially among younger Americans and in major  cities like New York City where these ideas are becoming increasingly  mainstream. At the same time, support for the free-market principles  that built our Nation has declined.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Ranking Member Thompson, Resident Commissioner  Hernandez, and former Congressman and Chairman Mark Green for  cosponsoring this bill. I also extend my gratitude to the Major Cities  Chiefs Association and the International Association of Fire Chiefs for  endorsing the bill.\n\nMr. Speaker, I strongly encourage my colleagues to support H.R. 4058,  and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…keeping the peace.\n\nWith President Trump's support, law enforcement nationwide is making  America safer. This year, violent crime is down 12 percent and murders  across our major cities are down 20 percent. Record amounts of  dangerous drugs like fentanyl, meth, cocaine, and heroin have been  seized and, thankfully, are off our streets due to the hard work…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…enforcement organizations,  the Association of State Criminal Investigative Agencies, Federal Law  Enforcement Officers Association, the National Fraternal Order of  Police, Major Cities Chiefs Association, the Major County Sheriffs of  America, the National Association of Police Organizations, the National  Narcotics Officers' Associations' Coalition, the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…safest of the 25 biggest cities  in this country. We have gone a long way from that. I hope this House  addresses the root causes of why we have so much more crime in our  major cities than we did 25 years ago.\n\nAlso while I was at home, I ran into somebody who is in a low-income  housing unit that receives the low-income housing tax credits. This  person…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693490/events-in-milwaukee"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…in the United States.\n\nThis legislation is supported by the Association of State Criminal  Investigative Agencies, the Federal Law Enforcement Officers  Association, the Major Cities Chiefs Association, the Major County  Sheriffs of America, the National Association of Police Organizations,  the National Narcotics Officers' Associations' Coalition, the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…now, just a few days ago, while saying that  there is no problem with crime in California, the Governor has  announced that crime suppression teams will be sent into our major  cities. Which is it?\n\nMr. Speaker, the Governor has also claimed that there has been a  modest reduction in crime across California this year. To the extent  that that is true,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]