[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "attorneys, who lead and have led the cases on fraud, the  important cases to go after the stealing of taxpayer money, and brought  80-some cases already and won major convictions in court, those  prosecutors who are so well-respected in our State were asked to  investigate Renee Good's wife after she was gunned down.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Earlier this week, the President suggested that he would invoke the  Insurrection Act to deploy more guardsmen in major cities if the courts  or Governors delayed deployment.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Senators Bennet and Hickenlooper  helped secure $500 million through the Infrastructure Investment and  Jobs Act for this project that was a major step toward completion.", "title": "Finish the Arkansas Valley Conduit Act--Veto Message From the President of the United States", "date": "2026-01-08"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Speaker, on May 22, House Republicans passed  their budget bill, which would make major cuts to the Pell Grant  program in order to finance tax breaks for the ultra-wealthy.", "title": "Cuts to Pell Grants", "date": "2025-06-26"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "residents, the  majority of whom are Black and Brown, are capable and worthy of  governing themselves.", "title": "District of Columbia Policing Protection Act", "date": null}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "618 is an extremely simple fix to a complex problem that plagues  Apex and causes major slowdowns at the Southern Nevada Bureau of Land  Management and stifles economic growth in the county.", "title": "Apex Area Technical Corrections Act", "date": "2025-05-13"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "But in an  environment like that, where the executive branch refuses its  constitutional duty to faithfully execute the laws, it doesn't make any  sense for us to continue negotiations on a major bipartisan bill.", "title": "Permitting Reform", "date": "2026-01-07"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "The majority knows full well that more  than 70 percent of this cut will be felt by the local radio and  television stations in their own communities and across the country.", "title": "Providing for Consideration of H.R. Rescissions Act of 2025", "date": "2025-06-11"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "It is new  technology that can be used for data storage and helping AI to analyze  major issues.", "title": "Consumer Safety Technology Act", "date": "2025-07-14"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "The Congressional Budget  Office issued a letter on March 5 where they reinforced that the math  is conclusive: Major cuts are the only way to meet the requirements of  the Republican House budget resolution.", "title": "Voters Sent Us to Congress to Lower Costs", "date": "2025-03-25"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Part of that work is oversight, but it is ridiculous and infuriating  to me that my Republican colleagues, who continue to obstruct oversight  every chance that the majority can, don't seem to agree.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "The burning of the HMS Gaspee on June 10, 1772, was the       first major armed act of rebellion by the American colonists,       Rhode Island historians and officials maintain.", "title": "253rd Anniversary of the ``gaspee'' Raid", "date": "2025-06-02"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "America spends more per  patient than any other major country for the worst outcomes.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Already--let me just emphasize, already--healthcare debt is the major  cause of bankruptcy in this country.", "title": "Healthcare", "date": "2025-10-28"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "She was  an African-American artist who is now recognized as a major American  painter of the 20th century.", "title": "Women's History Month", "date": "2025-03-31"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "This legislation is supported by the Association of State Criminal  Investigative Agencies, the Federal Law Enforcement Officers  Association, the Major Cities Chiefs Association, the Major County  Sheriffs of America, the National Association of Police Organizations,  the National Narcotics Officers' Associations' Coalition, the National  Sheriffs' Association, and the Sergeants Benevolent Association NYPD.", "title": "Leosa Reform Act", "date": "2025-05-14"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "She has championed beach renourishment, expanded recreational  opportunities, and helped build major infrastructure, all while keeping  North Myrtle Beach on budget with some of the lowest taxes and crime  rates in South Carolina.", "title": "Recognizing Mayor Marilyn Hatley", "date": "2025-07-22"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Normally, it would be this weekend at some major city in Iowa.", "title": "Veterans Day", "date": "2025-11-06"}, {"senator": "John Rose", "party": "Republican", "sentence": "This bill will ensure issuers  back stablecoins with high-quality liquid assets, a major win for the  American consumer.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}, {"senator": "James Risch", "party": "Republican", "sentence": "(ii) Total Estimated Value:\n\nMajor Defense Equipment* $0.", "title": "Arms Sales Notification", "date": "2025-07-23"}, {"senator": "James Risch", "party": "Republican", "sentence": "Major Defense Equipment (MDE) constituted $689       million of this total.", "title": "Arms Sales Notification", "date": "2025-06-10"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Reconciliation isn't enough  to support these major efforts, and neither is a perpetual freeze at  the Biden fiscal year 2024 level.", "title": "-9999", "date": "2025-10-03"}, {"senator": "James Risch", "party": "Republican", "sentence": "(ii) Total Estimated Value:\n\nMajor Defense Equipment * $605 million.", "title": "Arms Sales Notification", "date": null}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "After the suspect started firing--and many missed the news on this--a  National Guard major who was just doing his rounds was nearby, checking  on other troops.", "title": "Halo Act", "date": "2025-12-04"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Lion Caucus is made up of a diverse group of undergraduate and  graduate students from any background or major.", "title": "Welcoming Penn State Lion Caucus to Capitol Hill", "date": "2025-12-03"}, {"senator": "James Risch", "party": "Republican", "sentence": "Major Defense Equipment (MDE) constituted $21.8 million of       this total.", "title": "Arms Sales Notification", "date": "2025-07-17"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "From taking incredible videos and photos and designing eye-catching  graphics to teaching other Hill staffers how they can best produce  great content for Members of Congress, Michael's inspiring creativity  and work ethic have been a major contribution not only to my team but  to the entire Republican Conference as a whole.", "title": "Good-Bye Michael Comer", "date": "2025-06-04"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "With major events on the horizon, including America250, the  FIFA World Cup, and the Los Angeles Olympics, we must ensure every  necessary security measure is in place to protect the millions of  visitors and attendees these events will bring.", "title": "Department of Homeland Security Vehicular Terrorism Prevention and Mitigation Act of 2025", "date": "2025-11-17"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "There are 500 Chinese Communist Party-affiliated Chinese nationals--I  say ``affiliated'' because they are required when coming over to work  in a new production center in my district that will be opened up very  soon by a major corporation.", "title": "Transparency in Reporting of Adversarial Contributions to Education Act", "date": "2025-12-03"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "But what they want to do is what has been done in the past, is you  cuddle together a whole bunch of bills--sometimes a dozen or more,  maybe dozens of them--and then time the introduction of that package to  a moment just before a major holiday or long-scheduled recess, they  bring them forward, and they say: Take them or leave them.", "title": "Providing Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-05-22"}]