[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…premiums are  higher; the credits lower. They have got to fill in the gap in between.  And are they going to be able to afford insurance? Are they going to be  able to make that decision by January 1? They are stressed about this.\n\nI had small businesses in yesterday, representatives from Oregon, and  the vision there is ``Main Street is in Pain Street''…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…and your fellow  citizens, the folks who made the decision to step forward and serve our  country--whether we, as elected representatives, have the  responsibility to make the decision whether they have to go into harm's  way--you have inspired us every day.\n\nIf you are ordered to go, you go; you report for duty. The Commander  in Chief makes the decision.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…having  just endured a war and having paid the toll that war always takes,  wanted to ensure that our newly independent Nation would see the  representatives of the people make the decision of whether and when to  put American lives on the line.\n\nIn 1798, James Madison wrote to Thomas Jefferson about the danger of  leaving that power in the hands of an executive.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…follow, as the night the day, Thou canst not then be  false to any man.''\n\nIn that vein, Mr. Speaker, I have decided not to seek another term in  the people's House. I make this decision with sadness, for I love this  House, an institution the Framers designed to reflect the will of the  American people and to serve as the guardian of their liberty and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…objection. He did so out of a  desire to punish the State that he believes didn't support him  politically.\n\nIn my opinion, this is the last reason any President should make a  decision about anything. An election is one thing, but once we hold  office, we have a responsibility to represent every American,  regardless of their political party, regardless…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…this legislation is based on national security. We  are saying if this is information that the author thinks is not  sensitive, let the Secretary of Homeland Security make that decision to  present it. This legislation isn't necessary. You don't want to mandate  it. You want to let the anti-terrorist experts make that decision.\n\nMr. Speaker, I will make…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…way, as President Trump said, that he  would rain hellfire on them and have us in a war?\n\nThe point here of the Kaine resolution is that if this country is  going to make that decision, it must be Congress that authorizes that  decision. It must be Congress that has the debate about what are the  national security concerns, what are the costs, and what…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…what is happening  in my country as our President would embrace this ethnic cleansing.\n\nThis is the hour of decision. This is the time for every person of  good will to make a decision. I stand for peace in Palestine and the  two-state solution.\n\nThere are those who say that there is no plan for the interregnum,  what we call the day after. Mr. Netanyahu…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…is saying: I  can put groups on a list--and we understand it is many groups and their  affiliates--and not tell Congress and not tell the American public, and  I get to make the decision about whether the Nation goes to war.\n\nThat is not what our Constitution says.\n\nMy colleague Senator Schiff is talking about the Constitution, so I  won't belabor it.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fact that President Trump and the Republicans are only just  allowing a vote on continuing these critical tax credits just 2 weeks  before all these families have to make their decision--it is only 2  weeks to go, and then they have to send the check in to get the  coverage for January 1. So the Republicans have waited until 2 weeks  left to go.\n\nIn…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Constitution, or do you stand with the  Constitution? Do you stand with the Constitution of the United States  of America?\n\nThis is where we Members of Congress now have to make a decision. Are  we going to stand with the reckless, ruthless, lawless President, or  are we going to stand with the Constitution of the United States of  America?\n\nI am proud to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Things got worse for Timothy. In order to get him the Medicaid  coverage he needed, Timothy's parents were forced to legally disown  him. Can you imagine being forced to make that decision in your own  family? Unfortunately, for Timothy, even that was not enough.\n\nAt 12 years old, Timothy completed suicide.\n\nTimothy's memory will never leave me. His spirit…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…again. So it creates an  enormous amount of frustration.\n\nWe have a situation with the town of Stannard where the town clerk-- this is the town of 300--the town had to make a decision about repaving  a road. It is a gravel surface. In order to get repaved more than a  year after the road had been repaired, with the town borrowing money it  really couldn't…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…conversation with my staff and asked them to tell me why I  should and should not come over. We had that conversation, and I made  the decision myself. My staff did not make the decision, but I welcomed  their input. I came here to behave, as I did, and engage in peaceful,  silent protest--peaceful, silent protest.\n\nHowever, my colleagues caused it to…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…identify in their  country who would meet their airplane.\n\nWith all of the trafficking that has been going on, it was a  ridiculous idea to take children and ask them to make that decision and  to give them a financial reward if they went along.\n\nWas the Senator aware of that?\n\nMr. DURBIN. That was the detail.\n\nI am going to yield the floor and thank the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…than I do.\n\nMr. SMITH of Nebraska. Mr. Speaker, if this resolution is instead  driven by a newfound tariff skepticism, I urge them to allow the  Supreme Court to first make its decision.\n\nTo overlook the very basis of the emergency in the hope of removing  tariffs for which the President has other authorities to pursue only  increases uncertainty in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Frankly, all we are asking for is a decision one way or another, Mr.  Speaker, yes or no, green light, red light. Don't just sit there in  purgatory forever and not make a doggone decision. That is the problem  we are trying to fix.\n\nWith respect to the gentlewoman's concern about closed branches, we  are concerned about the lack of branches. We are…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…friends who are over in the Senate, and they were  just desperate to avoid doing what was difficult, so they threw it in  our lap.\n\nMr. Speaker, we as House Members get to make a decision: Are we going  to do what is right and moral and what actually sets up the future for  economic growth?\n\nVery last point. Almost 2 months ago, the Congressional Budget…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…the President to be able to move quickly and  declare a national monument in an area with antiquities, or an area of  scientific interest, to hold it until Congress could make a decision.\n\nSince 1976, when the Federal Land Policy and Management Act, FLPMA,  passed, it has been the policy of the Federal Government that we don't  dispose of land anymore,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…extend this out. We are going to give companies and families some  consistency. All we have to do is juxtapose those two bills--the TCJA  and the American Rescue Plan--and make the decision based on that. That  is as simple as it needs to be.\n\nThe gentleman from Texas (Mr. Arrington) likes to say a lot of  things. He talks a lot. He is very verbose. When…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…someone is a real doctor. I don't understand how  someone is not a real doctor when they show a patient an ultrasound.  Giving them all of the information and letting a woman make a decision  is somehow not celebrated here.\n\nIf we were really for life, wouldn't we be excited that a woman  looked at that ultrasound and said: You know what? I have decided I…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699216/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…heard ``resistance by any means necessary.'' On Sunday, and  again 2 weeks ago, we saw what that looked like.\n\nIn this country, we have a hard decision to make. We have to make a  decision about whether we are going to continue to be afraid or whether  we are going to call evil by its name.\n\nI have news for you, Mr. Speaker. When someone chants ``Free  Palestine,''…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…different sports,  which will ensure that non-revenue-producing sports are still  supported. I personally hope this will include swimming, but the  universities get to make that decision.\n\nThis bill would also protect athletes from unscrupulous agents. As I  said before, the SCORE Act affirms the right of student athletes to  make money by endorsing products…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…courts. District courts  are scattered all over the country, and those individual, small  district courts that are scattered all around the country--those  individual courts make a decision on the person that is in front of  them.\n\nNow, again, this is fairly simple civics. When you have a Federal  case in front of you, you go to the district court, and you…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…me. Some people say: Well, why do you use the  feminine when you speak about this? Because women make 85 percent of  the decisions in healthcare, and we can trust her to make a decision  which is good for her family's health and which is good for her purse,  which is good for her pocketbook.\n\nLet's have faith in her to make the wise decision for her family…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…U.S. sovereign debt issued will be  to cover interest and Medicare.\n\nIn 7\\1/2\\, let's call it 8 years, the Social Security trust fund is  empty. That first year we have to make a decision, are we going to let  the poverty of seniors double when they get a 21 percent cut in their  checks? Or how much are we going to raise taxes?\n\nAre we actually going to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…decided it was just easier to do it here versus answer the  callous questions out in the hallway--is because in the moment where he  and I had a disagreement, I had to make a decision about how I could be  most helpful to him.\n\nIf I ran for reelection, I would necessarily always have to think  about what boundaries I should have in expressing my concern,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…entire Nation.\n\nThat is why this Congress is paying attention to its own  responsibilities and not listening to the bureaucrats and other  unelected officials. We must make a decision and vote to pass H.J. Res.  87.\n\nIt is important to the Nation as a whole to protect our trucking  industry and to protect jobs across this great land.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690474/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…be in session and keep working until we solve the problem.\n\nPut the pressure on us. Rather than cutting off the paycheck of  somebody who has no ability to be able to make the decision to solve  this, why don't you put the pressure on us, where it should be, to be  able to stay here until it is resolved?\n\nNow, I want to see my family like everybody…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…has made it illegal  for police to pursue a vehicle.\n\nThat is what we are correcting here. We are restoring the discretion  of the professional law enforcement officer to make a decision in a  fraction of a second or two based upon his policies and training and  the totality of circumstances of whether or not he needs to pursue that  vehicle.\n\nThis is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}]