[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…automobiles head-on, to take drastic  generational action to clean up our air.\n\nBut the steps that my colleagues in the Republican Party are taking  tonight aren't going to make America healthy again. They are going to  make America hazy again. If we go down this road, the future is clear  even if our skies won't be.\n\nAmericans will pay for this nuclear option…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…to finding cures for disease, the mission  of these Agencies and their workers is critical to our well-being. Yet  Secretary Kennedy doesn't care. He has pledged to make America healthy  again, but in reality, he has fired safety inspectors, eliminated food  safety labels and labs, and revealed plans to take the Federal  Government out of the role of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…access to treatment, and promoting  recovery.\n\nIt will be combined with other agencies that the Trump administration  doesn't care about under the banner of a larger make America healthy  again office. Now, these critical programs to treat mental health and  substance abuse will be deprioritized or eliminated in favor of  Secretary RFK, Jr.'s, pet projects,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the Office of  Management and Budget asked for funding in the continuing resolution at  the Senate's level of $8.2 billion. Yesterday, the administration  released its Make America Healthy Again report. The report commended  the WIC program for its science-based approach to evaluating the health  and the diet of participants and working to improve them.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Mr. Speaker, I will take a moment today to share a  story of why we are fighting and who we are fighting for.\n\nEvery day this administration claims they are trying to make America  healthy again, and yet everything they are doing seems to indicate that  they are trying to make us sicker again. They have fired 10,000 HHS  health professionals. On this…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690049/who-we-are-fighting-for"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…premiums skyrocket.\n\nThat is nearly double the number of people who canceled coverage last  year. It is a huge increase that will drive up costs for everyone and  make America less healthy. I am sure that my colleagues are seeing  their constituents make similar choices.\n\nLet me end with this. We have the power right now to give peace of  mind to working…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…because the Trump  administration's Environmental Protection Agency is quietly denying us  protection from forever chemicals.\n\nWhile Secretary Kennedy claims he will make America healthy again,  the EPA announced it would overturn historical reporting requirements  on toxic substances known as PFAS. Exposure to small amounts has been  linked to cancer,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697919/making-americans-less-healthy"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, President Trump has developed a new MAHA  strategy. Instead of Make America Healthy Again, his new strategy is  ``Make America Hungry Agenda.'' He is weaponizing food against  America's most vulnerable families. In my State of Oregon, that means  cutting…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…billion from critical healthcare programs  like Medicaid, Medicare, and the Children's Health Insurance Program?\n\nYou can't have it both ways. Donald Trump promised to make America  healthy again, but gutting healthcare for millions of Americans-- gutting healthcare for millions of Americans--rolling back healthcare  for millions of Americans, rolling…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…unacceptable. We cannot build a healthy world if we  leave entire communities behind. I hope Secretary Robert F. Kennedy,  Jr., is listening. Healthcare is real.\n\nLet's make America healthy again by keeping programs like Medicaid.  Let's make America healthy again by making sure that children are  eating nutritious meals. Let's make America healthy again…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Trump administration even acknowledges this. Secretary Kennedy  has spent his career railing against the coal energy and its pollution.\n\nThe Trump administration's ``Make America Healthy Again'' report  celebrates the progress we have made in reducing toxic air pollution,  progress we made in part by regulating coal mines.\n\nHowever, now President Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695768/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…resolution puts  the profits of billionaire corporate polluters over the health and  welfare of the American people, and it makes a mockery of Republican  promises to make America healthy again.\n\nI really believe, Madam Speaker, that this resolution is a  distraction. I listened to the President's speech last night, and it is  clear to me that neither…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…DOGE--not through Congress, through DOGE--are cutting the very  workforce that we need to help identify the risk factors unique to men  and the ways to prevent it.\n\nWe can't make America healthy again if we are ripping health  insurance away from 16 million people and undermining and then gutting  our public health workforce.\n\nThese are just a couple of the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…and threatened  the safety and dignity of immigrant and LGBTQ communities.\n\nThese bills are far from perfect, but they send a strong message to  this administration: Make America Healthy Again cannot coexist with  attempts to cut public health programs, and Congress will continue to  assert our power of the purse and impose necessary checks on the  administration.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…low-weight  birth.\n\nPollution has impacts, and we are just beginning to learn about the  impacts of PFAS in our water.\n\nThe Trump administration said that they want to make America healthy  again, a wonderful goal and a good idea, but this bill does exactly the  opposite. Please, let's kill the bill and kill the amendment. It is  dangerous to us all.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698038/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…much better, more affordable solutions than the current  disaster that we are facing with ObamaCare.\n\nThat is why I am promoting a new framework that is called MAHA, Make  America Healthy Again, a patient-centered alternative that restores  choice, transparency, and affordability without expanding government  control or forcing anyone to give up their…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…center. This is a huge win for the American families and the farmers  who grow the best medicine in the world.\n\nLook, eating real food delivers real results. Let's make America  healthy again.\n\nI have to do just one more thing. Even ice cream is healthy when  eaten in small amounts. I want to add my favorite sweet out here and  say it is OK to have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…bringing this forward. This is common sense.  President Trump tried to do this in his first term. I am very grateful  that they are trying to do this again. We want to make America healthy  again. That starts with being able to give patients the tools that they  need to be healthy. I urge support for H.R. 919 to my colleagues.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688476/chronic-disease-flexible-coverage-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…have brought transparency and common sense back to our  institutions, dismantling DEI mandates, and restoring fairness, merit,  and basic common sense. We have begun to make America healthy again by  examining finally what is in our food supply, empowering patients,  expanding health savings accounts, and improving access and  accountability across our…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…consideration.\n\nThe Labor-HHS bill before us demonstrates the will of the American  people who want new priorities and accountability in government,  including priorities to Make America Healthy Again and Make America  Skilled Again.\n\nInvestments in this bill are directed to where they matter most: into  lifesaving biomedical research and resilient medical supply…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}]