[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…My amendment would ensure Americans could still register to vote and  prove their citizenship online or by mail. This is a simple,  commonsense amendment, and it would make certain that we can care for  the people who can't get out of their homes and that this Congress is  not depriving any eligible citizens of their right to vote.\n\nRepublicans have…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690011/safeguard-american-voter-eligibility-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…that is the underrepresentation  of women, especially women of color, in faculty positions. This was  peer-reviewed, data-driven, mission-critical science, and we need to  make certain that we continue to build upon that.\n\nCutting this program sends a clear message to a generation of  researchers: You don't belong.\n\nIt doesn't stop there. Another canceled…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…those hard-  working folks there. And I know how highly important it is to the  Presiding Officer about healthcare access. So let's act as a body.  Let's do it together and make certain that folks do have healthcare,  just don't have the anxiety and uncertainty and the bills that are just  going to cripple them. I want to thank the Senator from Illinois.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…nobody in this  U.S. Senate who wants a nuclear Iran. Russia doesn't want a nuclear  Iran. China doesn't want a nuclear Iran. Our Presidents--bipartisan-- have worked hard to make certain that Iran didn't have it.\n\nThe Obama agreement was working. After President Trump was not  President Trump, he challenged the agreement. When he got elected, he  tore it…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…This is the peacekeeping  force that was in the 20-point Presidential plan. If we are going to be  successful, we have to redouble our efforts to stand that force up and  make certain that all the signatories to that peace plan do their part  to make certain that can happen.\n\nPresident Trump's leadership to help achieve a cease-fire--that  leadership…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…I will yield to her for that  purpose.\n\nMr. WELCH. Mr. President, I want to thank Senator Alsobrooks, as  usual she is right, and there are two points. One is we want to make  certain that the parents have the ability, on behalf of their children,  to choose an alternative that is best for their kids. So this is not  about forcing people to drink milk…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…denied access to  healthcare because they are poor kids, that they are not denied access  to nursing home care because they have run out of their lifesavings.\n\nWe want to make certain that the healthcare needs of our children and  our seniors, disabled children, disabled adults--we want to make sure  those healthcare needs are met. We have to do that.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…minute. The time needed to detect a missile would go from 1 minute  to 2 minutes because of that interference.\n\nNow, we stand here, closest to the shore. We absolutely should make  certain that these windmills are not going to affect our safety  standing right here in the Capitol.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…reintroduced the bipartisan Kids Online Safety Act, or KOSA, as we know  it. This is crucial legislation. This is the legislation that will hold  Big Tech accountable and make certain that parents and kids have the  tools, the safeguards, and the transparency they need for young people  to be protected in the virtual space.\n\nAmong its provisions, the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…about  2 weeks--to review the findings and recommendations. We need to  determine what, if any, congressional action is necessary to implement  these recommendations and make certain the FAA and Army are making the  recommended changes, provide funding for further modernization of our  aviation system, advance new technologies at the FAA, and train and…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and  pass the bill (H.R. 3357) to amend the Securities Exchange Act of 1934  to require issuers with a multi-class stock structure to make certain  disclosures in any proxy or consent solicitation material, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Branch, and our MILCON-VA--have already passed off the floor, and they  did so with wide bipartisan votes. This is something that, yes,  indeed--yes, indeed--we need to make certain that we continue to push  these bills. Now, by passing these approps bills, we are ensuring that  we get onto the budget the American people voted for.\n\nWell, this is not…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. President, I have introduced legislation, as is  introduced on an annual basis. We have done so again this year to make  certain that the rate of disability compensation and other financial  benefits from the Department of Veterans Affairs for veterans and  military survivors keeps pace with the…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696621/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 131) to make certain modifications to the repayment for the  Arkansas Valley Conduit in the State of Colorado, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the reason why: We have a New York  Times Ipsos poll that tells the story on this. Seventy-nine percent of  the American people, including 67 percent of Democrats, want to make  certain that female sports are for girls and women. Those numbers--67  percent of Democrats, 79 percent of all Americans--say they are with  us.\n\nThey want to protect women and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…dwindling in number. My  father dedicated 2 years of his life to the liberation of Italy,  repairing rifles and other small arms weapons under the regular threat  of attack to make certain U.S. forces were equipped to win.\n\nI am joined in this resolution by my colleague from Florida Senator  Rick Scott, whose father also served in this campaign, in recognizing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694990/measure-read-the-first-time-s-res-377"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…moment since then.\n\nI appreciate the leadership of my two colleagues on the full  committee, as well as Senator Duckworth, my colleague on the  Subcommittee on Aviation, to make certain that we take all the steps  necessary and to make certain for the families who remind us today, and  almost every day since January 29, about the importance of making the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3579) to amend title 38, United States Code, to make certain  improvements to the Veterans Readiness and Employment program of  Department of Veterans Affairs, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695445/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Tennessee Bureau of Investigation, the U.S. Marshals Service. They are  all going to be there to support the Memphis Police Department.\n\nThis is going to be important to do to make certain that this  crackdown on crime--making Memphis safe--is going to continue.\n\nNow, the National Guard is a part of this, as I said, and these  National Guards men and women…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 3123) to amend title 38, United States Code, to make certain  improvements to laws relating to the payment of certain benefits  administered by the Secretary of Veterans Affairs that are affected by  death, and for other purposes,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…inappropriately appointed as  special counsel. We never took a vote. He didn't have a statute that  allowed him to be the special counsel. But he goes to great lengths to  make certain that we could never find out about this deep invasion of  our privacy and the violation of our constitutional rights. So he went  to an Obama appointee, Judge James Boasberg,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…indication that this  was not the direction to go in.\n\nSince that time, I have visited with other central banks around the  world, in Europe and other places, that make me even more certain that  we should rely on private-sector innovation that, in turn, can create  the tokenized money, which we have talked about all morning, but  doesn't do it in a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}]