[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…things he does--is rescind the policy  that extended the enrollment period.\n\nIn addition to this, Republicans in Congress want to take away the  tax credits that make healthcare more affordable for so many people.  Millions of working-class Americans rely on Affordable Care Act tax  credits to access affordable, quality healthcare and coverage.\n\nI could…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Chair, I thought Republicans' plans were to make  Americans' lives better. I thought we were supposed to lower the cost  of goods. I thought we were supposed to make healthcare more affordable  for Americans.\n\nWell, let me tell you this: When you strip healthcare away from  290,000 New Mexicans, many of which are in my district, including  132,000 children…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…are following up with this proposal that the  Congressional Budget Office says will take healthcare away from an  additional 100,000 Americans a year.\n\nWe need to make healthcare more affordable for all Americans. Despite  spending 18\\1/2\\ percent of our GDP in the United States on healthcare,  we have the worst outcomes: the highest mortality rate, life…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698403/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…will be saving  hundreds of dollars a month because Democrats rolled up our sleeves to  deliver price cuts on prescription drugs.\n\nWhat has President Trump done to make healthcare more affordable?  Nothing. Instead, he decided to slash Medicaid by $1 trillion with the  passage of the so-called big beautiful budget bill.\n\nBecause of this law, many hospitals…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…families afford healthcare.\n\nI will vote ``no'' on this rule and the underlying bill to protect my  over 31,000 constituents who rely on these ACA tax credits to make  their healthcare affordable. I encourage my colleagues to do the same.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698314/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Oregonians and Americans deserve better.\n\nMy colleagues should listen to their constituents, vote ``no,'' and  come back to the table and join us in the work to make healthcare  affordable and accessible to all.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696695/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Trump and congressional Republicans had no problem giving their  billionaire friends tax breaks in their big, ugly bill, but they refuse  to extend tax credits that make healthcare more affordable for millions  of middle-class families.\n\nThis is an outrage. We can't allow this to happen. Democrats believe  we must address this healthcare crisis before millions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…to run.\n\nIt is simple: We all do better when we all do better. We are all  healthier when we are all healthier. Let's extend the ACA premium tax  credits. Let's make healthcare more affordable and accessible.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…even let us vote on an  amendment to do that.\n\nI invite my colleagues to listen to their constituents, vote no, come  back to the table, and join us in the work to make healthcare  affordable and accessible for all.\n\nMr. MOORE of North Carolina. Mr. Speaker, as we take up the Senate- passed bill to reopen the government, I want to clarify that we should…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…and give us time to negotiate on healthcare costs, without leaving 22  million Americans in the lurch.\n\nIs this everything I think we should do? No. We should make  healthcare more affordable for everyone forever. But I am willing to  compromise to avoid catastrophe for families I work for.\n\nI am demanding that we take this vote so that we can actually…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, there is no more important bill than Leader  Jeffries' bill to make healthcare more affordable for more than 20  million Americans whose monthly health premiums have skyrocketed  because of Republican inaction and indifference.\n\nWhen I was home during the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…ahead,  provide a better life for their family, join the workforce, and, in so  doing, make our economy stronger.\n\nThere is, of course, much more work to do to make healthcare more  affordable for all of our people. But Medicaid saves lives. Over the  course of the program's history, Medicaid has allowed hundreds of  millions of Americans who otherwise…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…the  success of the Affordable Care Act. One of those wins has been giving  families a tax break when they buy their insurance through the  marketplace to help make their healthcare more affordable.\n\nFor small businesses, like our restaurants, manufacturers, and  childcare providers, the small group health insurance market isn't just  a huge administrative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…about, but millions of Americans are  seeing their healthcare costs skyrocket because the President and  Republicans refuse to extend critical tax credits that make healthcare  more affordable for millions of Americans.\n\nMillions more are paying thousands of dollars more a year for  everyday goods because of the President's tariffs. These tariffs are…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…essential to every  American.\n\nIt was the Democrats that forced this do-nothing Congress to actually  act. Neither Speaker Johnson nor President Trump wanted to make  healthcare more affordable, so we took it upon ourselves to pass a 3- year extension of these vital tax credits, 3 years that match with the  remaining 3 years of this Presidency.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698663/protecting-healthcare-for-millions-of-americans"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…and everyone in the Gallery--let's steward that  money correctly. I urge my colleagues to reject this resolution and  continue with bipartisan, important work to make healthcare more  affordable.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…created  this system. It is a system that Americans simply cannot afford.\n\nThe Lower Health Care Premiums for All Americans Act would address  these issues that will make healthcare affordable again by creating  more options and more choices for American patients.\n\nWith this new legislation, House Republicans will lower costs for all  Americans, preventing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…American people want something to pass. Let's work to find  something that can pass. Let's give power to the patient, not profit to  the insurance company. Let's make healthcare affordable again.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…care of preexisting conditions. I wasn't  here then. It is something that Republicans should have fixed. They  should have fixed that. Other than that, it did not make healthcare  affordable.\n\nIn fact, the biggest complaint that my colleagues have had throughout  the course of the last few weeks about the enhanced premium tax credits  was due to a temporary…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…which have been an       inducement for fraud.\n\nRepublicans would be wise to remind voters that Democrats       sold ObamaCare on false pretenses--e.g., it would make       healthcare ``affordable.'' Extending the subsidies would       perpetuate that fraud.\n\nThat is the end of my reading of the Wall Street Journal of Monday of  this week.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Act--better known as ObamaCare--was as dubiously named  as the Inflation Reduction Act, which did not reduce inflation, just  like the Affordable Care Act did not make healthcare affordable.\n\nWhen ObamaCare was crafted, debated, and passed, Democrats refused to  work with Republicans to make it a bipartisan law.\n\nSo this failed experiment in ObamaCare…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…for the love of God and  country, please, it is intellectually dishonest to tell the American  people that this COVID-era, fraud-ridden program is somehow going to  make healthcare affordable any more than the underlying bill itself,  ObamaCare, which everyone knows hasn't.\n\nI said it the last time, I will say it again: Ronald Reagan was spot  on. Government…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…ACA exchange claims came from taxpayer dollars.\n\nTo quote an article from The Wall Street Journal, Democrats sold  ObamaCare on the false pretenses that it would make healthcare  affordable. Let me say that again: false pretenses. Extending the  subsidies would perpetuate that fraud.\n\nWe passed a bill before Christmas that would reduce costs by 11…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}]