[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…speech last night, but they are  out of touch. Everything is not all well.\n\nThe affordability crisis is not solved, and now Republicans bring a  bill to the floor that makes it harder and makes everything more  expensive for people back home.\n\nMr. Speaker, 54 States and territories are already getting these  rebate initiatives out, getting the money…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…alone.\n\nRepublicans are now pushing a funding bill that would abandon even  more veterans like Mr. Park. It shifts critical care from the VA to  private corporations and makes it harder for women and immigrant  veterans to get the services they need\n\nThis bill isn't efficiency. It is cruelty. I will not stand by while  Republicans turn our veterans into…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…includes the DISCLOSE Act, which I have cosponsored--Senator  Whitehouse's bill--in every Congress since 2012, to end secret money in  our politics. The DISCLOSE Act also makes it harder for billionaires  and others to hide their contributions by ending the use of transfers  between organizations in order to cloak the identity of donors. It  requires organizations…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…the SAVE Act is intended to prevent undocumented  immigrants from voting, but it is already illegal for them to vote, and  it is extremely rare.\n\nIn reality, the SAVE Act makes it harder for Americans, especially  women and people of color, to participate in our elections. We have  seen these tactics before, creating barriers to the ballot box to  suppress…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690014/safeguard-american-voter-eligibility-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…of those employees had  received layoff notices.\n\nMr. Speaker, firing Federal employees in this moment does not  decrease the need or importance of the agency; it just makes it harder  for entrepreneurs, for restaurateurs, for childcare operators, and  others to keep their employees paid, to keep their doors open, and to  keep our downtowns thriving.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…health insurance.\n\nLosing this system would negatively impact our business. It       would mean facing impossible choices between our health and       our livelihood. It makes it harder to run a stable business,       stay productive, and provide for our families.\n\nWe are counting on you to protect the health insurance       exchange and the tax credits…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…House Republicans are advancing a bill that would disenfranchise  millions of women and other Americans through a federal takeover of  state election administration that makes it harder to vote. Sixty-nine  million American women--one out of four Americans would face an  additional burden to register to vote simply because they changed their  last name…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, the SAVE America Act makes it  harder for Americans to vote. As a member of the Subcommittee on  Elections, my responsibility is to protect access at the ballot box,  not to restrict it.\n\nThat is why I offered…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699934/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of FEMA's  predisaster mitigation grants because the administration canceled the  program.\n\nCutting emergency preparedness funding doesn't prevent disasters. It  just makes them harder to handle. Once again, it is Americans who will  pay the price.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693988/fema-cuts-and-hurricane-season"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…weren't satisfied with simply making 4 million kids go  hungry. They decided they needed to move up the timeline. Cuts to SNAP  will take effect as soon as next year. That makes it even harder for  food pantries to adapt--more chaos, more hunger, and more closures  among our food pantries and kitchens that serve the hungry.\n\nWidespread hunger is now on the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…wasn't the only Republican who  didn't read the bill before voting to pass it. Another one of our  conservative colleagues from Nebraska admitted he did not know the bill  makes it harder for the courts to hold the Trump administration  officials in contempt for defying a court order. Get this: He claims he  would have voted against the bill had he known…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…nationwide. That is about 0.0001 percent of  all votes cast.\n\nIf there ever was one, this is a solution in search of a problem, and  the only solution doesn't even work. It only makes it harder for law- abiding Americans to register to vote or patriotic Americans to  register to vote.\n\nPerhaps it would be better if this bill were modeled after the system  that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…of uncertainty. They  rachet rates up to avoid a pitfall of some kind of downward decline  that chaos often brings. It becomes more expensive for people to  borrow. It makes it harder to own a home. It makes it harder to build  more homes. It raises car payments and credit card payments. It raises  the price of almost anything.\n\nSo if Donald Trump is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…must pay.\n\nThis interest has real costs. It slows economic growth. It depresses  the standard of living. It leads to higher inflation and higher  interest rates. It makes it even harder for families already faced with  high prices and borrowing costs to make ends meet.\n\nWasteful, woke, and weaponized policies, my friend from Texas said.  That is a very…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and optimism that define the  American spirit. They turn ideas into opportunities and dreams into  progress.\n\nYet too many inventors face an uneven playing field that makes it  harder to protect their work. The ``Balancing Incentives Act'' ensures  that inventors have a fair chance to defend their creations.\n\nBy doing so, we reaffirm that innovation…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696400/reintroduction-of-the-balancing-incentives-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…every time they fly a mission. However, there is not enough  medical research available for VA to simply presume that their cancers  are related to those exposures. That makes it much harder for them to  access their earned VA benefits. Each one of those veterans has to  prove to the VA that chemicals and toxins caused their cancer.\n\nMany have had to fight…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…costs, and real results.\n\nRight now, families across America are still recovering from Biden- era inflation, sky-high interest rates, and a Washington regulatory  state that makes it harder and more expensive to build a home.\n\nThe radical left's answer is always more government, more mandates,  more red tape. Well, that is how we got into this mess. Republicans…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}]