[{"senator": "Laura Friedman", "party": "Democrat", "sentence": "…the very engine of our  advancement in the world, the thing that makes us the number one Nation  on Earth? Why would we want to cut the funding off for that? It doesn't  make any sense.\n\nPeople who are undergoing programs right now that have seen some  funding coming back can't even reach the NIH, who administers these  grants, because of a gag order…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…imaginary stop work order that drops. But in an  environment like that, where the executive branch refuses its  constitutional duty to faithfully execute the laws, it doesn't make any  sense for us to continue negotiations on a major bipartisan bill.\n\nI want to say, in particular, that Chair Capito has been helpful,  thoughtful, a good partner. All the Environment…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…funding opportunities  directly from the Department of Justice and over $1 billion in gun  violence prevention funding for schools from the Department of  Education. Make it make sense.\n\nNow, organizations like Youth Alive in Oakland, California, will not  have the funding that they need that is so critical in this moment to  do the work of violence…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692122/supporting-gun-violence-prevention-programs"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…valuable skills and experience to be  hired as contractors, even if they don't have college degrees. It gets  rid of minimum education and experience requirements that don't make  sense in some of these Federal contracting solicitations.\n\nThat is not to say a college education isn't valuable; but, too  often, Federal agencies put unnecessary degree requirements…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700120/skills-based-federal-contracting-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…project over a decade  in the making that had received all of its final permits from multiple  Federal agencies and was expected to power over 700,000 homes.\n\nThis just doesn't make sense to bring a package of bills and say: Oh,  we are really concerned. They are not concerned. Rates are going up.  They are canceling projects. They are throwing wrenches into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…regulatory  bills that will not help small businesses one iota, while allowing the  authorization for critical, vital counseling and training programs to  lapse. It doesn't make sense. Small businesses deserve better than  slogans over substance.\n\nMr. Speaker, I urge my colleagues to oppose this bill, and I yield  back the balance of my time.\n\nMs. VELAZQUEZ.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…question? They have  already opened up the Coastal Plain, so why do this?\n\nWe should vote ``no,'' not to score a political point, but because  this proposal simply doesn't make sense and won't work.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…methamphetamine and 42 pounds of cocaine  from two commercial trucks seeking entry into Canada at the Coutts port  of entry. Seizures like this are not uncommon. Wouldn't it make more  sense if we agreed to work together with our Canadian allies instead of  putting a tariff on them?\n\nThe second fact that bears mentioning is that the vast majority of  the fentanyl…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…The legislation is based on the flawed premise that if you  provide workers with certain opportunities or benefits, employers must  be able to pay them less. That doesn't make sense.\n\nWe should not let employers get away with failing to pay workers for  their time while claiming that it is in the workers' best interests.  These workers, if they are working…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…better, not worse.\n\nI invite all of my colleagues to join us. Join us to fight for people  and to work for people. Let's get back to the real work in these  Chambers. Let's make it make sense why we are here working on behalf of  our constituents who have elected us. Let's get back to the people's  business.\n\nKamlager-Dove).\n\nMrs. McIVER. Mr. Speaker, I am…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…installations meet their targets.\n\nMr. Chairman, I urge opposition to this harmful amendment, and I  reserve the balance of my time.\n\nMr. BEYER. Mr. Chairman, that would make sense as to why there is a  preference. They could do it differently if they are near saltwater  versus being in, say, Dayton, Ohio.\n\nMr. Chair, I yield the balance of my time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…alienate our best  customer. I'm a former social studies teacher. I know that tariffs can  be a useful tool. But these tariffs on Canada are unprompted,  unnecessary, and make no sense at all.\n\nAs a Minnesotan, the only thing I want to fight with Canadians about  is who has the better hockey team and who can catch the most fish in  the others' waters.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…process from bringing their new babies to the United States.\n\nThe administration has claimed this is about vetting immigrants to  protect public safety. But tell me: Does it make sense to deny entry  for a baby for vetting reasons?\n\nWhat the President has done to bring down the hammer on those who are  legally immigrating from what he calls ``s-hole countries''--remember…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…negotiate later on this  when you won't negotiate now on this? Now when you need our votes, you  won't negotiate on something. You say you will negotiate later. Why  does that make any sense? Why is that even remotely credible?\n\nThe harm starts now; the negotiations should start now. Frankly, what  Democrats are asking for is something you ought to be doing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…against financing drilling in the Arctic Refuge. The banks, insurers,  too, followed suit, which is why the second justification that they are  using to do this just doesn't make sense--that producing oil in the  refuge will make gas cheaper for everyday Americans.\n\nYou can see from the map that this is not remotely true. If  construction and drilling costs…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…wouldn't give me 3 hours or 4 hours to do it, so you are stuck  with me for a half an hour.\n\nThen, earlier today, CBO actually did their update. Okay. Let's see  if I can make this make sense.\n\nWhen I come behind these microphones, I am trying to explain sort of  a unified theory that, so often, the political class behind these  microphones say: We can do…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…was about $28  trillion. Let's do a math experiment. Baseline borrowing for the next  10 years is $22 trillion. If we were to do the tax extensions--and this  is going to make sense. When we hear people running around here saying  let's just use current policy, let's just pretend our spending stays  the same, our tax policy all stays the same, and we…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…bright, and it shines  bright on my old Kentucky home. There are areas for that. There are  areas where solar makes sense, where wind makes sense, and where fossil  fuels make sense.\n\nWhen he says best of the above, he doesn't mean we don't do all of  it. We do what fits in the right place at the cheapest price for our  citizens. When you talk about…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…permanent. Now, they are demanding Republicans do what they  could not do and clean up their mess, which was an add-on to the so- called Affordable Care Act.\n\nI can't make that make sense, and, Mr. Speaker, I bet you can't  either.\n\nWhat are they asking for now? You guessed it: another temporary  extension that fails to address the underlying causes of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…sustainable way to achieve the President's goal of securing the Arctic.\n\nThe not smart, unachievable way is whoever told the President that  this was a viable path. It doesn't make sense.\n\nI will give you another example. Over the weekend, the President--the  question yesterday had to do with Chair Powell. I made the statement  that I felt like now that the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…looking  for.\n\nNow, there may be some new forms of partnership. I am talking about  dialogue and trade relationships, but there may be other forms of  partnerships that might make sense in 2026. There has been some  suggestion of a joint Compact of Free Association that accounts for  both Greenland and Denmark's interests. That is one proposal, and I  think…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…a voice for her constituents. She talked about the county  governments there that didn't have a voice when this rule was made.  This is hurting their economy. It doesn't make sense, and it is kind of  a bad example of having that distant landlord with an alternative  agenda that lives many miles away managing the land where you live. I  thank her for…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…opportunity, that one day, the devastating diagnosis that she received  would someday be curable for other kids.\n\nSome things that come across your desk in Congress just make sense,  and this is one of them. This bill has 33 cosponsors in the Senate, and  they are bipartisan, from liberal Democrats to conservative  Republicans.\n\nWe worked hard to get…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Federal  Government as required by Federal law. So you want to obey the law in  Connecticut? Stop being a sanctuary State.\n\nYou want to fix immigration? Have policies that make sense.\n\nYou all act like, for 4 years, Biden wasn't President. Every  Democratic Senator aided and abetted the Biden administration with a  massive invasion of this country. You…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can be creative,  and if we can take on the entrenched incumbency of the bureaucracy and  business models.\n\nLet's actually do a couple of things here and see if I can make this  make sense. Let's march along--this is sort of important--and see if I  can make this make sense.\n\nThis is last year. The red is spending. The blue is tax receipts.  That gap…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…way--everybody on the  Armed Services Committee thought he did a great job. He is going to get  a really big vote here. So why are we delaying it? I don't know. It  doesn't make any sense to me.\n\nThe President deserves his senior military adviser. That is what the  Chairman of the Joint Chiefs is--his senior military adviser. The  President needs to feel…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this year.\n\nThis doesn't have the tax reform, many of those things built into  that base. How do I help folks understand? Here is where we are already  at, and this will make sense in a little while.\n\nFor every dollar we take in in tax receipts, we spend $1.39. We spend  $1.39 for every dollar we take in tax receipts. If you saw that  previous chart,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to help our  voters. Our constituents call us and say: Is this true? You can't find  the story. You ask them if they can send it to you. You think, well,  that doesn't make any sense. It is someone who hit a computer button.\n\nWhat also happens when we actually see stories like: OMB says Trump's  economic agenda will cut the deficit in half. I am trying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…more difficult and left them with less money for other necessities.\n\nMany pundits say the 2024 election hinged on promises to reduce  inflation and lower taxes. Does it make any sense to impose a tax on  imports that will make all Americans worse off? Shouldn't we learn from  our success?\n\nWe should ask ourselves a fundamental question: Is trade good?…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economy working, a tax code that actually gets investment  in the next generation. But are we going to adopt policies?\n\nAll right. Let me go jump on a landmine.\n\nDoes it make sense to have a government that goes out and owns 10  percent of Intel? So your government is the largest shareholder of  Intel.\n\nOkay. I love Intel. But I can actually show you…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]