[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…built on the  success of the Affordable Care Act. One of those wins has been giving  families a tax break when they buy their insurance through the  marketplace to help make their healthcare more affordable.\n\nFor small businesses, like our restaurants, manufacturers, and  childcare providers, the small group health insurance market isn't just  a huge administrative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…and she  works part time. Because of the ACA, they can have reliable healthcare  that covers her husband's preexisting conditions. Angel is dreading the  update that will make healthcare more costly. They will have to make it  work, but it will come at an extreme hardship. Angel and her husband  are two of the over 31,000 people in my district who will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…including $20 million in American  Rescue Plan funds, the new Nylon Capital Center will expand access to  education and workforce training with a new DelTech facility. It will  make healthcare more accessible with a new TidalHealth medical site.  Small businesses will have new space to grow, and a coworking center,  the Mill, will foster entrepreneurship. Critically,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…and stay ahead,  provide a better life for their family, join the workforce, and, in so  doing, make our economy stronger.\n\nThere is, of course, much more work to do to make healthcare more  affordable for all of our people. But Medicaid saves lives. Over the  course of the program's history, Medicaid has allowed hundreds of  millions of Americans who…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, 3 years ago this week, the Supreme Court  stripped from millions of women the right to make their own healthcare  decisions. Since overturning Roe v. Wade, women across this country  have struggled, suffered, and even died. Doctors are forced to hesitate  even in emergencies,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692893/third-anniversary-of-dobbs-decision"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…reason for this. They cannot avail themselves of  the services in these buildings that they live in the shadows of  because of the socioeconomic conditions.\n\nWe have got to make healthcare more accessible and more affordable  for all of our citizens. We have a great system. There are people I  have traveled with on codels who refuse to go to a doctor or…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Republicans are following up with this proposal that the  Congressional Budget Office says will take healthcare away from an  additional 100,000 Americans a year.\n\nWe need to make healthcare more affordable for all Americans. Despite  spending 18\\1/2\\ percent of our GDP in the United States on healthcare,  we have the worst outcomes: the highest mortality…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698403/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…issue simply  because you are a man. It affects you and your family as much as it  does women.\n\nThe decision in Dobbs stripped millions of women of the freedom to  make their own healthcare decisions. The idea that Dobbs would simply  return the issue of reproductive rights to the State was always  disingenuous. States across the country have created…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…and remind you, Mr. Speaker, and all those who are  listening, it was the Democrats with our American Rescue Plan who  expanded the promise of the Affordable Care Act to make healthcare more  affordable. I could take you back to 1965, Mr. Speaker, when then, too,  we were dealing with healthcare, and it was the government body that  came up with Medicaid…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…this  literally makes healthcare coverage worse for every single person  living in rural America. I have spent the majority of my career in  public service, working to make healthcare better, both more accessible  and more affordable. This proposed budget does the opposite.\n\nMy amendment to the proposed budget would prevent consideration of  any legislation…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688099/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, there is no more important bill than Leader  Jeffries' bill to make healthcare more affordable for more than 20  million Americans whose monthly health premiums have skyrocketed  because of Republican inaction and indifference.\n\nWhen I was home during…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…families  deal with the affordability crisis. There are bills that have been  introduced that stop price gouging at the grocery store, make housing  more affordable, and make healthcare accessible for all, but  Republicans have yet to take up any of these proposals.\n\nWe are in midst of an affordability crisis, and Republicans are  refusing to work with…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…insurance.\n\nTrump and congressional Republicans had no problem giving their  billionaire friends tax breaks in their big, ugly bill, but they refuse  to extend tax credits that make healthcare more affordable for millions  of middle-class families.\n\nThis is an outrage. We can't allow this to happen. Democrats believe  we must address this healthcare crisis before…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…crisis pregnancy centers. They don't serve  patients. They serve the anti-abortion agenda.\n\nLet me be clear: Every person has the right and deserves the dignity  to make their own healthcare decisions, free from intimidation,  deception, and coercion. At a time when our country has a shameful  maternal and infant mortality crisis and is facing a worsening…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…for 4 years, and he has been around for 10 years now. Yet,  he has no responsibility for anything. It is always somebody else's  fault. Donald Trump never had a plan to make healthcare more affordable  or accessible. He didn't care about any of that stuff.\n\nI just want to point out, for the record, because I think it is  important, that one-half of adults…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…selling ACA exchange claims came from taxpayer dollars.\n\nTo quote an article from The Wall Street Journal, Democrats sold  ObamaCare on the false pretenses that it would make healthcare  affordable. Let me say that again: false pretenses. Extending the  subsidies would perpetuate that fraud.\n\nWe passed a bill before Christmas that would reduce costs by…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…quo. As a  physician, I can tell you that putting a bandaid over a broken bone  doesn't work. And the Republicans are absolutely interested in finding  a solution that can make healthcare and health insurance more  affordable beginning on January 1, 2026, but going on beyond that.\n\nSo what can we do for January 1, 2026? This is where I think we are  headed:…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Care Act--better known as ObamaCare--was as dubiously named  as the Inflation Reduction Act, which did not reduce inflation, just  like the Affordable Care Act did not make healthcare affordable.\n\nWhen ObamaCare was crafted, debated, and passed, Democrats refused to  work with Republicans to make it a bipartisan law.\n\nSo this failed experiment in ObamaCare…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…know they are not. The system was built for this kind of fraud. They  represent the broader failure that is ObamaCare.\n\nWe must take action to fix this broken system and make healthcare  actually affordable, not the Ponzi scheme that it currently is.\n\nThe Lower Health Care Premiums for All Americans Act is a great first  step toward this mission, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…all the disinformation  he wants. The Rural Health Transformation Program is in effect, and  every State in the Union is benefiting. Republicans will continue to  work to make healthcare more comfortable and accessible for American  families.\n\nI want to thank Dr. Oz and his team at the Centers for Medicare and  Medicaid Services for their tireless work…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…watching and everyone in the Gallery--let's steward that  money correctly. I urge my colleagues to reject this resolution and  continue with bipartisan, important work to make healthcare more  affordable.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…take care of preexisting conditions. I wasn't  here then. It is something that Republicans should have fixed. They  should have fixed that. Other than that, it did not make healthcare  affordable.\n\nIn fact, the biggest complaint that my colleagues have had throughout  the course of the last few weeks about the enhanced premium tax credits  was due to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…But for the love of God and  country, please, it is intellectually dishonest to tell the American  people that this COVID-era, fraud-ridden program is somehow going to  make healthcare affordable any more than the underlying bill itself,  ObamaCare, which everyone knows hasn't.\n\nI said it the last time, I will say it again: Ronald Reagan was spot  on.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…subsidies, which have been an       inducement for fraud.\n\nRepublicans would be wise to remind voters that Democrats       sold ObamaCare on false pretenses--e.g., it would make       healthcare ``affordable.'' Extending the subsidies would       perpetuate that fraud.\n\nThat is the end of my reading of the Wall Street Journal of Monday of  this week.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Democrats created  this system. It is a system that Americans simply cannot afford.\n\nThe Lower Health Care Premiums for All Americans Act would address  these issues that will make healthcare affordable again by creating  more options and more choices for American patients.\n\nWith this new legislation, House Republicans will lower costs for all  Americans, preventing…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}]