[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…bipartisan American leaders made possible to prevent another  world war.\n\nImperialism, starting wars around the world wherever Trump's latest  whim takes him, will not Make America Great Again. It will make us much  less safe.\n\nTo found this country, Americans got rid of one despotic king. We  don't need another one. Instead, we must demand an accountable…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699361/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…reckless tariffs.\n\nFirst, we must ask why the Trump administration is stopping the  investment of billions upon billions of dollars in projects that were  awarded to make America great again. The answer is the Trump trade war.  Well, but then on top of that, this tariff regime is raising prices on  everything for American households. The American people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…doesn't matter. It just fails to recognize that it is not the 19th  century anymore. It is a globally connected world that impacts us.\n\nThe last argument I would make, Make America Great Again: We are  supposed to be the most compassionate nation. As we run around the  world telling everybody how great we are, how much we are better than  everybody…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Ohio who rely on IDEA programs  to get the education they need and deserve.\n\nI have one question today: How exactly does gutting special education  programs and staffing make America great? It doesn't. We should be  strengthening IDEA, not weakening it. We should be protecting civil  rights, not gutting them. We should be recommitting our promise to  every…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…administration's officials.\n\nMinnesota was once known as a place of refuge. It has now been turned  into a war zone by a Federal Government that has lost sight of the  values that make America great.\n\nEverything we love--our communities, our rights, our Constitution,  and our humanity--is on the line right now. We have to fight like our  future depends on it because…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…innovation.\n\nWe should be doubling down on education and innovation. We should be  building labs and funding scholarships, not building walls.\n\nHere is the truth: You don't make America great again by making  Americans dumber. You don't build up the economy by draining it of  talent and opportunity. This is not just about spreadsheets and budget  lines. It…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…improperly. These people are here in this country making  America a better country by their very presence in the country. Not  everybody is going to invent something to make America great. Work hard  and treat people right, you could be a good citizen and make America  great. You don't have to do the things that are going to be written  across the pages…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…drawn its current maps in conformance with traditional, non-      racial redistricting criteria to ensure Texas continues to       adopt policies that will truly Make America Great Again. As       permitted by federal law, the congressional maps in 2021 were       drawn on a partisan basis. See Rucho v. Common Cause, 588       U.S. 684 (2019).…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…advocate, and I know that our  country does better when we treat people with humanity, break down  barriers, and open doors of opportunity. This bill does nothing to Make  America Great Again; it's one of the most dangerous, mean, and  regressive bills I've ever seen, and I urge my colleagues to stand up  for their constituents and reject this horrible…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…his MAGA  cronies are the ones who are playing the game.\n\nWe cannot allow that to stand. Trump is actually going full MAGA out  here with this, and his purpose is to Make America Great Again again.  He wants to turn the country back to a time when the only people who  had the right to vote were the White male property owners.\n\nIn line with that, he…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…into account, once again, the maxim of equal  protection under the law. We want to make sure that America stays  strong and America gets better.\n\nI tell those that say ``Make America Great Again,'' I tell them that  this is the greatest America has ever been. This body now has more  female Senators, has more people of ethnicities, more diversity, and I…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…that--facing fierce global competition--I underline that--is  an insult.\n\nThis includes hundreds of hardworking constituents even across  northwest Ohio. If the goal is to Make America Great Again, then the  U.S. Department of Energy just failed royally. Each of these U.S.  manufacturing companies has developed plans to modernize operations and  to position…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Nation.\n\nThe Wall Street Journal documents that, over the last year,  manufacturing  unemployment has risen in our country by 68,000 more unemployed  workers. You can't Make America Great Again unless you restore American  manufacturing on our home soil.\n\nThe Trump administration's reckless tariffs and disastrous trade wars  are straining the pocketbooks…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of faith, my God tells me to welcome the stranger. Do not  be indifferent to the suffering of your neighbors. Immigrants make our  country a better place. Immigrants make America great, and our  immigrant brothers and sisters deserve to call this country home.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…living wage, affordable food and healthcare,  and have a shot at a better future. That is what I am fighting for.  That is what we are fighting for. That is how I want to make America  great. That is the Democratic vision for what this country could be.\n\nFrom a moral perspective and from a set of values, we believe it is  immoral to have a system that gives…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…here and tell you this makes me sad.\n\nWe are going to make this city safe. We are going to show the world  that we are not a nation in decline. We are going to not only Make  America Great Again, but we are going to make the United States Capital  great again.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…However, as we now pass the 100 days since President Trump has taken  office, it is time for us to do our jobs and codify these executive  actions that he has taken to make America great again. If Republicans  are serious about backing the President's agenda, let's do something  about it, dadgummit.\n\nThat means making sweeping reforms that may actually…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…truth. They want to weaponize a  serious matter into a distraction all in an attempt to take down  President Trump and to hurt his administration and what he is doing to  Make America Great Again.\n\nThe actions taken by Delegate Plaskett reflect poorly on the House,  and this body needs to hold her accountable.\n\nMr. Speaker, I urge all of my colleagues to…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Mr. Chair, the things that make America great are  the things that America makes.\n\nHow do we do that?\n\nWe have an electric grid, Mr. Chair, and that electric grid is under  real pressure. Demand is climbing fast…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…work, and when Washington works, we all  thrive.\n\nI applaud our President for keeping his campaign promises, pushing  forward this agenda of peace and prosperity to make not only America  great again but make the world a much safer place.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…public on this problem, and that is the breakdown of the  traditional family with a man in the household over the last 60 years  of America.\n\nAs this Congress tries to make America great again, it is hard to  imagine America being that great if we continue to punish and penalize  any family that has both parents at home.\n\nAmerica has changed dramatically.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Speaker, as President Trump would say, the golden age is here. We  must continue to support our President as he leads this Nation forward.  I am proud to work with him to make America great again.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…home in Orange County in southern California. I am proud to  have witnessed many of them becoming very successful members of our  society, thriving in all sectors that make America great, and I am so  proud to call many of them friends.\n\nOur Vietnamese-American community knows well that we cannot take  freedom for granted.\n\nTo our Vietnam-era veterans:…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690417/recognizing-black-april"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…funded illegal immigration with your tax dollars, and  increased IRS audits on the middle class, all while leaving the working  class behind.\n\nPresident Trump promised to make America great again, and 77  million--77 million Americans supported that promise. They voted for  change. The One Big Beautiful Bill Act delivers for the American  people.\n\nThis is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…I believe that His plan in the days ahead is that we do everything in  our power to deliver on the promise that the voters asked us to do in  November, and that is to Make America Great Again.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…that Daniel Webster set  before us by realigning our institutions on behalf of the American  people so that we too can perform something worthy to be remembered, to  make America great again.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699690/critical-mineral-dominance-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…came out of school better than today, and I think you  would have to say the amount of antidepressants consumed was a tiny  fraction of what we have today--and really Make America Great Again.\n\nI implore President Trump's administration--we had a representative  from his administration here yesterday. I implore them to put together  a working group so…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…with this grand  experiment in self-governance now for almost two-and-a-half centuries,  and by God's grace, we are working hard and we are delivering on our  promise to Make America Great Again.\n\nThis is, without a doubt, the most important vote of this Congress,  and I think this one may be the most important vote that any of us take  in our entire lifetimes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}]