[{"senator": "Al Green", "party": "Democrat", "sentence": "…the killing of Palestinian babies and maybe every now and  then say something about how wrong this is, but we are not going to say  that about other babies. We want to make sure that people understand  that those babies have the right to life, that those babies should grow  up, and they should have an opportunity to succeed in the world.  Palestinian babies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…displeasure with the Republican agenda.  When we go home for this coming Easter break, I will do more townhalls,  both in my district and in Republican districts, to make sure that  people are being heard.\n\nThis is not winning for the American people. Trump's tariffs are  taxes on working people. He is crashing the stock market and making  costs go up.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…structure in place to make sure  that with this type of activity, people will be able to report it and  get a remedy and a response, in some cases punishment to, again, make  sure people are not hindered because of this unacceptable conduct.\n\nTomorrow when we take up this bill, those brave women who came  forward to testify and report their experience--and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…young kids but as a  caretaker of an older parent, it weighs on me, and I understand the  challenges that are there, knowing that you have to do everything you  can to make sure the people you love have the care they need.\n\nLife is hard enough. Care is hard enough. The point of Medicaid, the  point of government, is to make it a little easier, a little…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…comes to clean water, when it comes to being able to address  the needs of our people, there is never enough money.\n\nWhy is it that when it comes to, again, trying to make sure people  have healthcare, being able to address the Housing crisis, being able  to tell our families that we are doing the best that we can, all I see  is the bipartisan support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…meant to help working people. Let's pass it today.\n\nNevadans sent me here to fight for them, and so I am going to keep  working to lower costs, to raise wages, and to make sure people who  power our economy--our working families--can keep more of what they  earn. And through this bipartisan bill, it shows that I am not going to  allow Washington gridlock…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Preventative care is much more  efficient, much cheaper than curative care. Pay me now or pay me later.  Medicaid is a tool that allows us to pay me now and pay me far less.\n\nMake sure people are healthy. Make sure communities have what they  need. Make sure we are fully funding the National Institutes of Health  so we can identify these dreaded diseases and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…building those relationships, building community, and I think this  piece of legislation helps to really expedite that kind of community- driven policing and helps to make sure that people feel safe and secure  in their communities.\n\nI thank Congressman Roy for his leadership on this legislation, which  will help eliminate duplicative laws and allow us…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…an all-out war against public health, and this bill is just  one piece of that.\n\nIf my colleagues care about public health, if they care about prices,  if they want to make sure people can breathe and can still pay their  electricity bills, I urge my colleagues to oppose this bill. It just  makes common sense.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…not tempted or  tested with these kinds of, essentially, bribes to try and get them to  lean and issue support for their countries in making decisions. We want  to make sure we have people like the President of the United States not  tested by the money and not tempted by the money but always making the  decisions for the best possible reasons and the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…scientists are just kidding or that they are  making it up--and its dark money political corruption operation, which  shovels billions of dollars into our politics to make sure that people  obediently deny climate change in return for the money that keeps them  in office.\n\nSo my final point in Brazil was, if we want to win this, we not only  have to get…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Biofuels now comprise over 44 percent of their bottom line.\n\nIn the early days, I worked with Senators on both sides of the aisle  and led the effort here in the House to make sure people had access to  E85 ethanol at the fuel pumps. It has been a great gift of my career to  have served long enough to see that we have been successful.\n\nWe also flew the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698200/northwest-ohio-biofuels-summit"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…a little bit differently. It stings a little bit more when  things happen like the rolling back of an EEOC order that has been in  place since 1962 that was meant to make sure that people were not  discriminated against.\n\nIt means something a little bit different when the administration  hits a pause on funding to 1890 land-grant institution scholarships…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…$3.8 trillion.\n\nWhy isn't there this outcry regarding that number?\n\nIt only seems to be an outcry when we are trying to, again, feed  children who are hungry or to help make sure that people, again,  through no fault of their own getting sick, get covered by Medicaid.\n\nThe budget would cut crucial programs for the poor and working  families. That is a fact.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…including a Member of Congress who  is the Member of Congress in that jurisdiction of where that holding  center is: ``Just send an email.''\n\nMr. Speaker, I want to make sure that people understand. We have sent  emails, and we have sent letters. I want to make sure that the American  people understand what is happening to us.\n\nWe have sent emails,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…several days. I know there were a few rallies  that happened, and then we all voted. It was 427-1. Were they trying to  get the Epstein files out, or were they trying to make sure people got  in town for their rallies? That is what I would like to know.\n\nThe National Petroleum Council that we are referring to in this bill  is a part of the Department of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…the world: There was a pandemic going  on. People were dying. The United States Government was in an  emergency, and we were trying to save lives. We were trying to make  sure that people were safe, not just here but in every single State. In  New Mexico, it was devastating. We were trying to deal with this  worldwide pandemic.\n\nThey have not offered…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…to provide lower cost services, more technological  advancements, but, yes, you allow them to invest in what? They invest  in consumer protection.\n\nYou allow them to make sure that people in their organization are not  making mistakes with cross-selling, making sure that they are using the  latest technology to ensure that everybody is getting the right…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…discussions back and forth, and we  have three appropriations bills attached to this. They are  appropriations bills that do important things.\n\nThe Agriculture bill will make sure that people who rely on WIC and  SNAP don't have to worry about another government shutdown between now  and September 30 of next year.\n\nThe Legislative Branch bill will make sure…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…people's  pockets, and trying to deliver on the spending cuts, reversal and  termination of the green new scam, and the application of Medicaid work  requirements to make sure that people aren't getting benefits when they  should be working.\n\nMr. Speaker, I believe it is a good bill.\n\nMr. ROY. Mr. Speaker, I believe it is a good bill, and I will say…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…program two  times a year.\n\nPeople come in and out of the Medicaid Program based on that means  testing, based on their earnings threshold. So checking periodically to  make sure that people still qualify strikes me as making good sense.\n\nBut when Republicans talk about cutting redtape, we are talking about  ways we can get government out of the way of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…supply of electricity. Nobody can blame them for using dirty  coal and those Chinese technology plants, which are not as good as the  U.S. plants, because they want to make sure their people have a chance  at prosperity, as well.\n\nDOE plays an important role in this R&D, but we can do a lot more for  fossil energy innovation and exploration. That is what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]