[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…and scuba and skiing--as climate disruptions disrupt the natural  environments that they need.\n\nThe first biggest shock will come through insurance markets as  climate risks make real estate uninsurable. This disruption kicks off a  cascade: Climate risk collapses insurance markets; insurance collapse  cascades into mortgage markets; mortgage collapse…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…dedication to the rule of law--these must be part  of the bloodstream in this Agency. They are lacking now and are  absolutely necessary in the future. We have an obligation to make it  real.\n\nThe statement of Aliya Rahman can be found online at https:// www.blumenthal.senate.gov/imo/media/doc/2026-2- 3_aliya_rahman_statement. pdf.\n\nThe statement of Marimar…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…possibility. So is the promise. So is the extraordinary,  improbable, beautiful experiment that is America if we have the courage  to believe in it again and the determination to make it real. The  pursuit of a more perfect Union has to continue. It must, and it  continues with us.", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…and we  must do more to improve access to the critical services they need and  deserve. Right now, our veterans are facing great uncertainty and  anxiety. This bill would make a real change in their lives. We owe it  to them now more than ever before.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this important  bill.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689679/clear-communication-for-veterans-claims-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…overdoses for  the first time last year, showing that public investments that we all  voted for, public investments in treatment and in prevention, are  actually starting to make a real difference.\n\nMr. Speaker, I am horrified, and I am outraged that Trump is actively  dismantling our ability to respond to the opioid crisis moving forward.\n\nThe administration…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…In moments of hardship and frustration, my  staff offer hope and wise counsel. They make people feel heard and  understood and appreciated. In a very practical sense, they make real  our Constitution's promise to every American of the right to ``petition  the Government for a redress of grievances.''\n\nMr. Speaker, in recognition of their dedicated service…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688691/recognizing-my-congressional-staff-in-honor-of-national-employee-appreciation-day"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…rural geography presents unique  challenges in emergency situations, as the local hospital is located  miles away from most residents. EFR's quick responses consistently make  a real difference when other help isn't always readily available, and  we are grateful for their lifesaving service to our community.\n\nOn behalf of the people of Colorado's Seventh…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…all  of America. Their work demonstrates that when we invest in teacher  coaching, leadership development, aligned systems of support, and other  proven strategies, students make real and, importantly, lasting gains.\n\nMany in our country have taken aim at public schools recently. The  partnership is proof that our public schools can deliver for every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…so that people can use these products without putting       themselves, their families, and their communities at risk.       Your continued leadership on this issue will make a real       difference in the lives of everyday Americans.\n\nDoorDash empowers local businesses to reach more customers       and enables millions of Americans to earn supplemental…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…whether you  are battling a megafire or walking your child to school, is  fundamental.\n\nIt is time for every Member of this body to recommit to that goal and  take action to make it real.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695520/servicing-the-right-to-breathe-clean-safe-air"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…us  in a bipartisan effort. There is a lot more to be done. This is not all  that we will do, but extending this health insurance premium assistance  to these families can make a real difference.\n\nLet me tell you a story. If you are looking for breakfast in downtown  Chicago on a Sunday morning, let me recommend a restaurant. The name of  the restaurant…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…actions, such as staying physically active, maintaining a healthy diet,  protecting our skin from excessive sun exposure, and keeping up with  recommended screenings, can make a real difference in reducing risk.\n\nAt the same time, prevention must extend beyond individual choices.  Too many families face obstacles to early detection and timely care.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…foreign minerals, shores up supply chains, and significantly bolsters  national security, all while dealing a critical blow to Putin's war  machine. These factors combine to make a real difference in the lives  of hardworking Montanans who rely on these jobs to make ends meet.\n\nSignal Peak Mine, in Musselshell County, has faced a similar reality  after…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that thing called again? Yeah, inflation.  You debase the currency. Yes, you pay for it with inflated dollars, but  everything you have, your savings, become worth less. You make real  estate and things more expensive, so the next generation can't buy a  house. We are basically--it is an economic term--oh, yeah, we are  screwing over the next generation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…commonsense, America First  legislation that I came to Congress to support. It is proof that when  we put American small businesses, our families, and our travelers  first, we can make real progress.\n\nWhether you are headed out to one of my favorite spots, Lake of the  Ozarks, in my district, if you are flying to visit family, or just  filling up the tank for…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…to the  President's desk.\n\nThe American people expect results. They want a government that works  for them, not against them. With this legislation, we have the chance  to make real, lasting change for the American people. Let's get it  done.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…United States, but it is not the position of this government because we  are a coequal branch. And if that were to come to pass, there would be  a vote on the floor to make it real, not this surreal sort of  environment that some Deputy Chief of Staff thinks was cute to say on  TV.\n\nSo you want to get me back to thanking the President for all the good…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…provisions of the Tax Cuts and Jobs Act, like doubling the standard  deduction, expanding the child tax credit, and maintaining the death  tax exemption. These policies make a real difference for working  families, farmers, and small business owners, and allow them to keep  more of their hard-earned money.\n\nWe also need to fulfill our commitment of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to help fund this novel endeavor. It was one out of five  counties within the United States to receive this level of funding for  such programs.\n\nThis money will go on to make a real difference in the lives of  veterans by offering evidence-based treatment for substance abuse and  mental health.\n\nThe process of obtaining this grant was very competitive,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692311/recognizing-rockingham-county-veterans-treatment-court"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…program to help address this issue.\n\nUnfortunately, the application process for GPD grants is complex and  burdensome, often discouraging participation from groups that can make  a real difference.\n\nTo correct these inefficiencies, I am introducing the bipartisan  Simplifying Veterans Assistance Act, which requires the VA to provide  clear guidance and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688686/recognizing-essential-legislation-that-supports-our-nations-veterans"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…a mandate, a regulation.\n\nI am one who believes, because my constituents have told me this,  that one of the most important things we can and must do in this  Congress is make real progress on regulatory relief for the small  businesses that all of our communities rely on. We have begun to take  some steps.\n\nYou know, Mr. Speaker, that we are currently…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…allies and adversaries half a world away  are watching it closely for clues about America's resolve.\n\nCertainly, Europe's deepening commitments to collective defense will  make real peace more enforceable. The President's insistence has driven  much of this progress. Putin's brutality has reinforced it.\n\nSince 2022, our European NATO allies have made…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]