[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…communities, and public health. Tribes and local  communities most impacted by mining deserve more say, not less, in the  future of their lands and waters.\n\nThis bill is about making it easier for foreign entities to extract  and take away America's resources and leave the pollution to forever  scar the land. We must fight back. We must listen, and we must be…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…court because he keeps trying to do  unlawful and unconstitutional things, not because of judicial  overreach. This bill a scheme to give more power to the President,  making it easier for him to carry out his illegal actions without  consequence.\n\nI urge my colleagues to reject this bill.", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…speeding up the processing of the entire queue so power plants can get  online as quickly as possible because we need more power from all  sources.\n\nWe should focus on making it easier to build the necessary grid  infrastructure upgrades so power can get online. We should do it all in  a way that is fair to American families paying the bills.\n\nThis bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…that to people who make a lot of money and  who try to avoid taxation? The little guy has to pick up the tab. Mr.  Chair, that cut will cost the American people dearly by making it  easier for millionaires, billionaires, and corporations to avoid paying  the taxes they owe under existing law.\n\nNevertheless, this bill is better than it would have otherwise…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…facts, Republicans on the Rules Committee unanimously  blocked these amendments from even being considered. That tells you  everything you need to know. This isn't about making it easier for  Americans to vote. It isn't about so-called election integrity. It is  about tilting the playing field.\n\nRepublicans are losing support because voters aren't buying…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699934/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…eligibility, but we don't want to  do that. We want to make it tougher for people to actually get  registered to vote, and that is not what we should be doing. We should  be making it easier for people to vote.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690003/safeguard-american-voter-eligibility-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…haven't  done that. In fact, they are covering up for the President of the  United States.\n\nPeople are struggling more than ever because Trump's economy sucks.  They are making it easier for the elites, easier for the billionaires,  easier for the Epstein class, and harder for everybody else.\n\nMaybe that is why even Republicans are finally acknowledging…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…protections that are designed to keep us  safe. They have cut critical funding for gun  violence prevention programs at the Department of Justice and have  weakened the ATF, making it easier for guns to fall into the wrong  hands and for gun crimes to go unsolved. They even disbanded key  initiatives that tracked domestic terrorism and hate crimes tied to…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…is required when the EGC itself goes public.\n\nIn doing so, this bill streamlines the financial disclosure  obligations for emerging growth companies across the board making it  easier for them to raise capital from the public.\n\nI commend the gentleman from Iowa (Mr. Nunn) on this bill. I urge my  colleagues to support the ELEVATE Act of 2025, which…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692760/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…have no fear.  House Republicans have come up with an answer. This week, they are  focused on what really matters to the American people: Cutting taxes  for tasers and making it easier for multinational tech companies,  monopolies, to build undersea cables through marine sanctuaries.\n\nThose are the bills that we are considering today on the floor. That…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…about today would shorten the open enrollment periods and  introduce much more redtape, locking eligible families out of getting  their health insurance.\n\nWe should be making it easier, not harder, for Americans to see a  doctor. We should be making healthcare more affordable, not more  expensive.\n\nOver the past year, I have talked to countless constituents…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698978/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…lower costs  for American families on day one. He promised to cap interest rates on  credit cards at 10 percent, and so what is it that the Senate is  prioritizing today? Making it easier for banks to merge, raising the  cost of credit for small businesses and households, and eroding banking  services in local communities.\n\nThis resolution would undo commonsense…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…This is all part of the Republicans' war on women. These bills  are aimed to please anti-choice protesters who are flying into  Washington this week. The third is about making it easier for a foreign  mining company to dump pollution into a pristine wilderness recreation  area in Minnesota.\n\nAll of these bills are being brought to the floor under completely…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…researchers report  feeling unsafe. By publicizing the private, personal information of  certain faculty and staff on databases, this bill would make the  problem worse, making them much easier targets for xenophobic attacks.\n\nSafeguarding national security can be done through commonsense  reforms Democrats have offered that don't come at the expense of U.S.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…immigrant communities, I have seen the resilience and determination  they bring to our economy.\n\nThis bill sends the wrong message and sets the wrong priorities. We  should be making it easier for small businesses to access the tools  they need to thrive. That means focusing on the actual issues that they  raise with us every day. Let me remind my colleagues…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…helping to  make sure students and veterans understand.\n\nIn a time when government is filled with bureaucratic red tape, I am  happy that we, as a Republican majority, are making it easier for  veterans to get an education.\n\nMr. Speaker, I urge my colleagues to support H.R. 981, and I reserve  the balance of my time.\n\nMr. BOST. Mr. Speaker, at this time,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…10:15 a.m. eastern time on artificial  intelligence and its uses in education.\n\nNow, some folks might hear the topic of that hearing and think about  things like: Is AI making it easier for students to cheat, or is this  going to absorb young people even further into digital worlds?\n\nThose are certainly concerns. However, the focus of our hearing is…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…pregnancy centers who are providing real  help to new mothers who are taking the journey of parenthood. These  centers are a pillar for nearly 2 million families every year, making  it easier to provide and foster a loving bond throughout communities  just like mine in North Carolina.\n\nNo longer will political discrimination keep compassion at the  doorway.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699217/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Mike Flood. This bill  addresses a real problem in the housing market, one that affects our  most vulnerable homebuyers. It reduces the upfront costs of buying a  home, making it easier for Americans to achieve the dream of  homeownership. The Affordable HOMES Act restores clarity by placing  manufactured housing standards back under the Office of Housing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…slush fund to  pay for it?\n\nInstead of a one-size-fits-all mandate from Washington, House  Republicans are focused on limiting the authority of the Federal  Government, making it easier to build affordable homes and taking  advantage of abundant natural gas reserves beneath our Nation.\n\nImportantly, H.R. 4758 builds on the important work of the Working…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…rulemaking.''.\n\nMr. Speaker, I rise today in support of my bill, H.R. 3381, the  Encouraging Public Offerings Act.\n\nThis legislation builds on the success of the JOBS Act by making it  easier for companies of all sizes to go public while maintaining the  transparency and investor protections our markets depend on.\n\nH.R. 3381 allows any company, not just emerging…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…gentlewoman, the ranking member, is:  Why did she vote against that? If she is so concerned about no  branches, not enough branches, banking deserts, why is she voting  against making it easier for new banks to form in those places where  there are no financial services?\n\nMr. Speaker, as to our Democratic colleagues' concern that this  legislation and allowing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…waived penalties  related to it for 2 full years due to the ``continued challenges'' of  compliance.\n\nThe Trump IRS notice at issue today reduces compliance burdens,  making it easier for businesses to calculate their liability. Democrats  gave Treasury extremely broad discretion to implement the tax,  including on complex issues like how it should…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…We found that groups, including ISIS and al-Qaida, are actively  training in the use of artificial intelligence and using it to produce  highly convincing propaganda, making it much easier for terrorist  groups to recruit, radicalize, and carry out attacks on the U.S.  homeland.\n\nMy bill requires DHS to conduct annual assessments on threats to the  U.S.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…to protect themselves from identity  theft. Having a single point of reference, one point of contact, at the  Social Security Administration will simplify the process, making it  easier and faster for victims to get relief.\n\nThis piece of legislation was passed favorably out of the Ways and  Means Committee with a strong bipartisan vote. Mr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…factories in America, not closing them, especially for such  critical products as these that allow for large-scale food distribution  and storage.\n\nThe government should be making it easier to plan and establish food  distribution chains rather than undermining them with harmful  regulatory uncertainty.\n\nWe saw time and time again in the last administration…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…All'' program in       Xinjiang. For numerous years, this program has collected DNA       samples and other data from Uyghurs, facilitating Chinese       surveillance and making it easier to identify targets for       organ harvesting in Xinjiang.\n\nIn June 2021, 12 United Nations Special Procedures mandate       holders raised the issue of forced organ…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}]