[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…displacement. He has also led unapologetic efforts to expand  protections for immigrants, LGBTQ+ people, and workers in Chicago.\n\nCarlos shifted the dynamics of local politics by making sure that  neighbors and constituents had power over land use, development, and  zoning. In doing so, Carlos modeled what a collaborative co-governance  approach to community…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is no telling what policy is in place tomorrow? How can our  trading partners believe what we say when we are changing policy every  3 days? The swinging back and forth is making Americans worse off for  no apparent reason.\n\nMaybe Republicans think that some people need to be hurt in order to  fix our country. I love it when Trump puts up all of these…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…of  accidents, suicides, and theft.\n\nSecond, the legislation directs the Department of Justice to develop  and promote voluntary best practices for secure firearm storage, making  this information readily accessible to the public both online and in  print.\n\nThird, the bill requires clear labeling on all handgun, rifle, and  shotgun packaging, stating:…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…cultural vibrancy of the Haitian community.       Their music has uplifted hearts, provided solace, and       reinforced a shared cultural identity among Haitians       worldwide, making this reunion a truly historic and emotional       event; and\n\nTherefore, be it proclaimed that we, the 20th Congressional       District of Florida, do hereby commend CaRiMi…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…instead of being on the floor debating legislation on healthcare,  instead of debating legislation on bringing down the cost of groceries,  instead of debating legislation on making sure we can make this country  more affordable for working people, congressional Republicans want to  use this time to attack working families in the District of Columbia.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…economic activity.\n\nThese aren't just statistics. They are the foundation of our local  economies, providing essential services, from plumbers and electricians  to physicians, and making towns and cities across the country  attractive places to live and work.\n\nThey don't work on just their own behalf. They create millions of  neighborhood jobs and reinvest…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691730/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…obtained  from the Consumer Financial Protection Bureau and the Treasury  Department.\n\nMr. Speaker, this bill is an important step toward protecting  consumers from abuse, making sure that the fact that they applied for a  mortgage with one mortgage company isn't sold against their will to  every other mortgage company in the country.\n\nI urge my colleagues…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…their families.\n\nFederal workers are the backbone of our Nation. From FEMA teams  helping wildfire survivors to VA staff caring for our veterans to  Social Security workers making sure seniors can live with dignity,  these are the people who serve us every day. They are not faceless  government employees. They are our neighbors, our friends, and our…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…competition and  taking on monopolies, giving small businesses a shot to compete, and  fighting against these lousy trade deals that stripped communities for  parts. It means making more stuff in America, cracking down on junk  fees and price gouging, and standing up without apology for the union  way of life.\n\nThese are economic priorities to bring down…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…is no reason that we ought to have TSA shut down,  FEMA shut down, the Coast Guard shut down, and the Secret Service shut  down. They are really not shut down because we are making them work,  but we are saying, by the way, we can't pay you.\n\nIf Republicans get up and say Democrats are shutting down those  agencies, they are not telling the truth because…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700218/homeowner-energy-freedom-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…stay silent while  the risks grow and the guardrails fall away. The American people  deserve transparency about how nuclear launch decisions are made and  who is involved in making them. This is not just a matter of policy. It  is a matter of survival.\n\nMr. Speaker, Hiroshima and Nagasaki were not mere tragedies. They  were warnings. The people who died…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…won't hesitate for a moment to talk a big game and take  credit if he thinks it makes him look good, but the minute trouble  arises, suddenly Hegseth says someone else was making the decision.\n\nNow, let's be very clear about something: There is a very easy way  for the American people to get the truth. Pete Hegseth should release  the full tapes of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Medicare Multi-Cancer Early Detection  Screening Act.\n\nOur bill would create a pathway for Medicare to cover multiple cancer  early detection tests. Medicare will cover that by making sure that  once it is approved by the FDA, it immediately becomes available to  Medicare patients. This is so important because the promise of  screening for more than 40 cancers…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…sign  up for a bronze plan that comes with outrageously high deductibles-- $7,500, even $10,000 for individuals. Under the Cassidy-Crapo plan, a  60-year-old Florida couple making $85,000 would see premiums go up by  $21,000, and their deductible would go from zero to $7,000. That is  $28,000 net taken out of their pockets. How are they going to pay…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…now, is a significant part of the  solution, but it is not the whole solution.\n\nSenator Graham, I just hope that this can be a very positive starting  point. Thank you for making this offer here today. I would ask if we  could get together and try to find some common ground here to make sure  that some of the concerns that you have are addressed because…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…also introduced the Freedom to Cooperate Act to allow local authorities  to cooperate with Federal immigration enforcement. We have also seen a  number of executive orders making it very clear that sanctuary  jurisdictions are unacceptable and are in defiance of Federal law.\n\nIn California, U.S. Attorney Bill Essayli has found a way to  circumvent effectively…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…support of my bill, H.R. 1455, the ITS  Codification Act.\n\nThis legislation would codify the Institute for Telecommunication  Sciences, ITS, which plays a critical role in making spectrum available  for commercial use.\n\nAs we examine how Federal and commercial spectrum is allocated, it is  our job as Members to ensure the agencies tasked with managing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…relief into a global  giveaway.\n\nThis is about ensuring we have the validation mechanisms in place to  ensure the rule of law. It is about prioritizing Americans. It is about  making sure that when a small business owner like those in Texas, or  anywhere else, fills out an application, they know the system is fair  and the resources are theirs to access.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…has shown respect to, I think, the judgment of the  gentleman from Louisiana about his being the sole vote on the issue  before this body before with respect to what we are making public  because of the gentleman's, I think, very real concerns about what it  might mean for victims.\n\nWe had that debate and a colloquy back and forth in the Committee on…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and father Gideon. The Bowley family built the first  sawmill, called Bowley's Mills, on Webb River at the base of Lake Webb.  Webb River drains to the Androscoggin River, making the location  particularly appealing. The family went on to build a gristmill close  by the following year. The land was considered formally settled in 1812  and then founded…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with. She always has a  smile on her face and is ready with a quick joke to make those around  her laugh. The entire staff adores her and is so appreciative of her  efforts in making Double Branch a wonderful place for students to learn  and grow. Emily is an integral part of the Double Branch school climate  and culture.\n\nIt is clear Emily Mazzaro has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…in the classroom to real-life  scenarios.\n\nStudents help prepare ingredients, set up workstations, and create  menus. Those who work the afternoon shift are responsible for making  and serving food.\n\nThe students develop leadership skills and professionalism, assets  that  are needed for a successful career in the hospitality and culinary  industries.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699201/highlighting-student-run-cafe-at-clearfield-county-career-and-technology-center"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…technologies.\n\nIn the heart of west Texas, at Abilene Christian University, we are  building a first-of-its-kind molten salt research reactor, a game  changer, no doubt, for making nuclear energy safer, more efficient, and  deployable.\n\nThis project, Mr. Chair, isn't just pie in the sky. It has generated  over $110 million in private investment, $112…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…protective gear needed to  continue their mission safely and effectively. Generations of families  in Bernards Township have worn the uniform of Liberty Corner Fire  Company, making it both a proud tradition and a vital lifeline.\n\nMr. Speaker, as Bernards Township hosts its upcoming First Responders  Appreciation Night, I am especially proud to commend…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694757/recognizing-liberty-corner-fire-companys-115th-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Fire Prevention, spending many hours with  the Fire Prevention trailer educating the community, and has been an  essential contributor to fundraising events such as chowder-making,  lobster dinners, and the Farmers Breakfast. His dedication extends to  supporting both the operational and social functions that sustain the  Wendelville Volunteer Fire Company.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…hard-earned money. It means that small  businesses can spend more money on their employees instead of sending  it to Washington. This bill will make our communities safer by making a  historic investment in our border security. No more dangerous, illegal  aliens parading around with no consequences.\n\nMr. Speaker, this legislation is one of the most consequential…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…when people don't do their homework. What makes me cranky is when we  tarnish the extraordinary execution of a mission of fully supporting  Venezuela by turning around and making insane comments about how it is  our right to have territory owned by the Kingdom of Denmark.\n\nFolks, amateur hour is over. You don't speak on behalf of this U.S.  Senator…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…want to  talk about a cup of coffee.\n\nThe tariff negotiations that President Trump has used have created  new deals and new markets for our products around the globe. It is  making a more competitive America, and we are not going to be taken  advantage of by other countries anymore.\n\nAgain, more and more class warfare, Mr. Speaker. We hear the term  ``millionaires…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…women,  children, and our beloved seniors, by putting in place commonsense  guardrails to ensure that those truly in need always get the care that  they deserve. That means making sure that precious Medicaid resources  go to the living, breathing Americans who actually need the care, not  bureaucratic bloat, fraud, or people that have come into this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…KELLY of Mississippi. Madam Chair, I thank Chairman Rogers whose  critical work on acquisition reform with Ranking Member Smith set the  foundation for the advances we are making in this year's bill.\n\nI thank my friend and Seapower Ranking Member   Joe Courtney for his  commitment to bipartisanship and his continued collaboration toward  stronger naval…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]