[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…the F-35 Joint Strike Fighter, in my district. The  highly skilled workers in this plant are critical for our defense  industrial base, and the rising cost of living is making it harder for  them to make ends meet.\n\nThese workers bring immense value to Pratt & Whitney, to Connecticut,  and to our national security, and they recently fought for their value…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…shortages.\n\nThe administration just announced a plan that would remove  professions like nursing, teaching, and social work from their list of  graduate professional degrees, making it harder for people entering  these fields to access financial aid.\n\nWhat message does this send to people deciding whether or not to  enter these critical fields facing shortages?…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…harder for you to vote.\n\nIt is one unnecessary hurdle after another.\n\nWe know the SAVE Act is not about securing our elections. It is about  suppressing voters. It is about making it harder to vote and easier to  cheat. It is despicable. It is damaging--beyond damaging. It goes  against the very foundations of our democracy.\n\nDemocrats will never, never allow…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it is wildfire season in Oregon, and the  Trump administration is making it harder for fire crews to do their  jobs. I met with them, some of whom voted for the President. They told  me that the funding cuts are a problem, and they don't have the  resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694775/fighting-fire-with-fire"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…register to vote simply because they changed  their last name after they got married.\n\nWe need to pass legislation to stop billionaires from buying our  elections, not making it harder for the American people to vote. I am  going to vote ``no'' on this bill. I did it last term, and I am going  to do it again. Shame on those who continue to support this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Security and targeted before being  allowed to go about their business. That is called terrorizing people,  plain and simple. So instead of supporting teachers, Trump is making it  even harder for them to do their jobs, and our children will be the  ones stuck paying the price.\n\nA strong education system is fundamental to building a strong  democracy, a strong…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690856/teacher-appreciation-week"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…research, aviation security, and our  National Park System. It will decimate critical programs that support  the people we represent, stripping healthcare for millions and making  it harder for families to put food on the table and make ends meet. All  of this is for billionaires and corporations to get tax cuts they do  not need and that our country cannot…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…miles and miles, hours out of their way, to  stand in line at a local election agency.\n\nThe SAVE Act does nothing to make it easier to cast a ballot; it only  succeeds in making it harder for Americans to register to vote and to  exercise their rights.\n\nThis is not theoretical. Kansas tried to implement its own State- level SAVE Act in 2013, with disastrous…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…making the process  more transparent.\n\nRolling back these reforms is dangerous, especially at a time when  DOGE is firing staff at the OCC and the other bank agencies, making it  harder for them to carefully review these mergers.\n\nI guess Elon Musk didn't stop with all of the other agencies that  they were undermining and firing and laying off. They…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…loss of these jobs, and  the loss of promises and tax credits are impacting our ability to hit  our clean energy goals and lower our utility bills for consumers. It is  making it harder to attract investment and job-creating opportunities  in my district and around the upstate region.\n\nWe have fought for clean energy manufacturing. I did so in the State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…a less reliable grid with higher  costs because that is what this year has produced. Republican energy  policy is creating a less reliable environment for businesses, making  it harder for companies to invest in America.\n\nJust yesterday, Ford announced they were laying off all 1,600  employees at their battery manufacturing plant in Glendale, Kentucky.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…to accessing  healthcare. We also need to support veterans transitioning into  civilian life. Education is a key part of that transition for many, but  rising costs are making it harder.\n\nThe GI Bill book and supply stipend has remained at $1,000 since  2008, even as the cost of textbooks has skyrocketed. My Veteran  Education Assistance Adjustment Act…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…care for thousands of Texans with disabilities, and put even more  pressure on emergency rooms that are already stretched very thin,  causing hospitals to close and making it even harder to find care.\n\nIt is cruel. It is reckless. It is part of a broader agenda that  prioritizes tax breaks for Trump and his friends over healthcare for  the people who…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Republicans.\n\nMr. Speaker, House Republicans have also cosigned this extraordinary  assault on Social Security, closing offices, cutting off access to  phone service, making it harder for seniors to access their hard-earned  benefits.\n\nSocial Security is not an entitlement program. Medicare is not an  entitlement program, Mr. Speaker. I learned this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…ultimately lead me to financial  bankruptcy.\n\nThere are more stories just like this, and they are a window into how  the chaos and unpredictability of this administration is making it  harder on working families to succeed and thrive.\n\nSince January, we have dealt with the uncertainty and the chaos that  has been brought by this second Trump administration.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…institutions  to acquire weaker ones, especially those struggling due to local  economic conditions, we can prevent bank failures and the panic that  they cause.\n\nInstead of making it harder for banks to merge, we should be  eliminating outside obstacles to mergers, enhancing competition and  innovation, and ensuring that Americans, especially those in rural…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…because the child whom they  exploit is unaware. The harm is real. The intent is clear. This  loophole weakens 18 United States Code, section 2251(a), and related  statutes, making it harder to prosecute offenders and easier for  exploiters to walk free and then exploit others and create more  victims.\n\nThe Child Predators Accountability Act of 2025 closes…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…and solar. It is  because of the very generous subsidies that this body and the rest of  Washington continues to provide for these resources. This artificial  growth is making it harder for reliable baseload generation to connect  to the grid.\n\nNumber five, the incentives. These same incentives are distorting the  market. Eliminating these subsidies would…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…tax, that we have  created this burden that we have placed on the 99 percent of small  businesses in our community, which employ half the people working in my  State, making it harder for them to do what they do, what we rely on  them to do, what we count on them to do, and, more importantly, what  the people we represent, our constituents, count on…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…in Wyoming and our neighboring State of Montana.  Wyoming's energy warriors will lead the way.\n\nFor years, Democrats have held coal captive with reckless  regulations, making it harder for us to use American energy and making  us more dependent on foreign sources of energy. Joe Biden took coal  offline in America. Democrats' war on American energy strained…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…especially  first-time buyers, young families, and those in rural and working-class  communities. Rising interest rates, limited housing supplies, and  increasing costs are making it harder for Americans to put down roots.\n\nThat is why we must work together across the aisle to support  policies to expand access to affordable housing, invest in  infrastructure,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693119/recognizing-national-homeownership-month"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…broken process. It  need not be broken, especially as to this category of bills. This is  the easy stuff. Let's not make the easy stuff hard, lest we incur the  risk of making the harder stuff impossible.\n\n1084, North Dakota Trust Lands Completion Act of 2025 from Senator  Hoeven; S. 1142, the Scarper Ridge Golden Gate National Recreation Area  Boundary…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}]