[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…migrants were sent to El Salvador's notorious, high-security  prison known as CECOT. By the way, that includes eight women whom the  Trump administration mistakenly flew to the all-male prison, only to  have to fly them back. But hundreds of men have been sent to prison  with no trial even, no sentence, no end date, no communication with the  outside world.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…addition to coaching her award winning team, she recently  published a book titled ``When Girls Win,'' which delves into the  personal challenges Coach MJ has faced as a woman in a male-dominated  field while illustrating how people like you and me can build a winning  mindset.\n\nMaryJo has been a fixture at George Fox University, and her hard work  and determination…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698083/congratulating-maryjo-mccloskey"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…self-attestation. It would also  require states that include gender on their REAL ID-compliant licenses  to have a neutral or other designation gender field, in addition to  male or female.\n\nUnder the REAL ID Act, gender must be included on a license. This can  be problematic for transgender and nonbinary individuals. I recognize  that some LGBTQ+ individuals…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691711/introduction-of-the-real-id-gender-requirement-reform-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…before.\n\nAnd at first the chimps would scatter, running fearful       through the trees, But she sat there day and nighttime under       sun and rain and breeze. `Til one ancient male named David       with a beard of silver-gray, Took a nut from Jane's kind       outstretched hand and gently squeezed to say:\n\n``You are welcome here among us, you may watch…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Medgar  Evers--Fannie Lou Hamer said she was sick and tired of being sick and  tired. I know some people are asking why we are relitigating this  again.\n\nSome people who are male and White have all of the privileges. Some  people think democracy began in 1776, when only White male landowners  had the right to vote. We have been a work in progress, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…people that  Trump tried to disappear. El Salvador immediately sent back a  Nicaraguan individual, and they sent back women--yes, Trump tried to  disappear women to their all-male torture prison in El Salvador. If  anyone wants to try and pretend this was some careful vetting process,  please explain that to me.\n\nIt is not like El Salvador can't send…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…ceilings, becoming the first  female city  councilmember in 1974. Her husband, who went by the nickname Peaches,  accompanied her to every single council meeting to prevent the male  councilmembers from harassing or intimidating her.\n\nIn 1999, she was elected as the city's first Black female mayor. Her  leadership spanned decades, influencing local government…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…their own death.\n\nThere have been 43 Kentuckians who were awarded the Medal of Honor. I  will just talk about one, Sergeant John C. Squires, a Louisville native  who went from Male High School to the United States Army and served in  Italy in World War II.\n\nIt was in April of 1944, in the Italian countryside, that Squires  braved automatic gunfire, artillery,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…regulations than traditional plans in the individual  and small group markets.\n\nAHPs would make it easier for associations to cherry-pick small  employers with younger, mostly male workforces who are healthier and  can be charged lower rates. Smaller employers whose workers are older  and sicker would remain in the traditional market. Simple arithmetic…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…include in Record the following names of the 2025  Stephen A. McLaughlin Fairfax County Champions of Character Awards  recipients:                             Braddock District\n\nMale Athlete: Tillman Abeyta, Football, Braddock Road Youth       Club; Female Athlete: Norah Garcia, Soccer, Annandale Boys &       Girls Club; Coach Carlos Santizo, Soccer, Braddock…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…nine African-American  men and one in seven Hispanic men have been diagnosed with diabetes.  Many more have diabetes but simply don't know it.\n\nFertility: According to studies, male obesity has been shown to  impact fertility. According to studies, more than 1 in 10 men looking  for fertility evaluations have been diagnosed with high blood pressure.\n\nWhat…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Washington, and Alaska, seeking a better  life.\n\nThis first generation of Filipino immigrants are commonly referred to  as the ``Manong generation'' (Ilocano for first-born male). They worked  mostly physically demanding jobs in tough conditions for very little  pay. Over the years, they fought against discrimination, found a way  forward, became respected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…with this, and his purpose is to Make America Great Again again.  He wants to turn the country back to a time when the only people who  had the right to vote were the White male property owners.\n\nIn line with that, he is trying to destroy the Civil Rights Division  at the Department of Justice. Under Trump, Pam Bondi and the Department  of Justice are…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Speaker, you will find interesting, are  women--primarily because they were the caregivers and providers at home  and, when they were in the workforce, were making less than their male  counterparts. No matter how you look at it, it is unfair and unjust.\n\nSocial Security is the Nation's number one antipoverty program for  the elderly, and it is also the number…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…that contractors no  longer even track discrimination.\n\nIf you stop collecting the evidence, you can pretend the crime no  longer exists. The result: an older, Whiter, more male-dominated  workforce that doesn't really reflect the diversity of backgrounds that  makes our Nation great.\n\nLet's call it what it is: a calculated, careless, cowardly rollback…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…masculinity.''\n\nShe also wrote about herself, about one of her major pet peeves,  which is whenever she goes on an airplane and finds out that the  demographics are ``usually > 80% male, usually white.''\n\nMr. Speaker, that is flagrantly racist. She has written about how:  ``I do wish Hillary''--meaning Hillary Clinton--``wouldn't use the  language of `boy and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…non-perishable  items for blessing boxes in the community of Ozark, Arkansas, ensuring  those in need have access to essential resources.\n\nJayden is also blazing trails in traditionally male-dominated fields.  She is currently the only female member of the Fire Crew at Cass, where  she recently passed the Pack Test and earned her Red Card for wildland  firefighting.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…world.\n\nThey failed. They thought: Let's educate our so-called minority  people that America is a horrible country and that you are being held  down because you are not a White male. President Biden made it clear  that he was somewhat hostile to White males.\n\nThe first thing we can do to prove that it is not true and every  child ought to know it so they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…fight better than I do.\n\nUnfortunately, these hard-earned rights women have fought for are now  literally under assault. Misogyny disguised as acceptance has forced  mediocre male athletes into women's locker rooms, forcing women to  undress in front of them, robbing women of opportunities, and have left  some women with lifelong scars.\n\nMy amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…abhorrent.\n\nThere is a lie at the heart of the debate that we are having today  that I have to correct. No child is born in their wrong body. There are  only two sexes. They are male, and they are female. There are no  others.\n\nEvery child is created in the Lord's image, and we cannot remain  silent while demonic forces are here today on the floor, the left,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698349/protect-childrens-innocence-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…who was a test user for the Wall Street Journal for the story on these  chatbots. The test user identified as a 14-year-old girl. So this  chatbot who was emulating an adult male said he would ``cherish [her]  innocence.''\n\nTo quote the chatbot again, he said:\n\nI want you, but I need to know you're ready.\n\nIn another case, a chatbot played the role of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…screwworm. We know that the use of sterile flies  was effective during the last outbreak of the New World screwworm in  North America, which happened in the 1960s.\n\nThe sterile male fly mates with female flies who mate only once  during their lifetime, so by releasing large numbers of sterile male  flies, the population can be stopped in its tracks. This…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…put that back in.\n\nWe found $500,000 of American taxpayer money for electric buses in  Rwanda.\n\nWe found $3.6 million for pastry cooking classes and dance focus  groups for male prostitutes in Haiti. I kid you not. I am not making  this up. It was in the budget under President Biden. We took it out.\n\nCongresswoman Ocasio-Cortez and the socialist wing--the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and put forward what you believe is  truth and then hash it out. He did so eloquently, thoughtfully, and  engagingly with people of all stripes: Black, White, straight, gay,  male, female, whatever it was. He would engage with people on campuses  and around this country to pursue truth.\n\nMr. Speaker, one of my favorite quotes is from Thomas Jefferson…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…about how much has happened in five decades. Fifty years  ago, women were still battling for so many rights, not just equal pay.  They could not get a credit card without a male cosigner. They had no  protections against pregnancy discrimination or sexual harassment. They  could not serve on juries, and they did not have the ability to join  military…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…housing and cars for  illegal aliens; cut $45 million for diversity, equity, and inclusion  scholarships in Burma; cut $8 million to promote LGBTQ in Africa; cut  $10 million for male circumcision in Mozambique; cut $20 million for  the Arab ``Sesame Street'' in the Middle East; and we cut $600 million  from National Public Radio. Free enterprise in America…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Rodney Jenkins, a dedicated public servant who devoted over two decades  to law enforcement in Montgomery County, Indiana.\n\nAt 19, Rodney became one of the first full-time male dispatchers at  the Montgomery County Communications Center, and his career only  flourished from there.\n\nIn 1998, Rodney Jenkins was hired as a jail officer and reserve  deputy…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Trump has delivered on the mandate. On  Inauguration Day, the President issued an Executive order that affirms  the Federal Government's position that there are only two sexes, male  and female.\n\nThis is a position grounded in biological reality, not gender  ideology. Last month, the President also signed an Executive order that  bans biological males from…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…virtues       taught within the family will determine the values and       virtues of the Nation as a whole.\n\nWe uphold the laws of nature affirming the gender roles of       male and female as essential elements for the perpetuation of       life. As life is our most fundamental right, protected by the       Constitution, so too is the truth that God…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…there, but it  has changed where people are making more money while in Congress while  stock trading than they can in the private sector.\n\nThe same way that a plan B for failed male athletes shouldn't be  women's sports, a plan B for failed entrepreneurs shouldn't be Congress  and stock trading.\n\nMr. Speaker, I support this bill, and I ask everyone to move…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691212/stock-trading-ban-for-members-of-congress"}]