[{"senator": "Adrian Smith", "party": "Republican", "sentence": "…policy, rule of law, as well as worker and human rights. We  cannot sit on the sidelines while our global adversaries, including the  Chinese Communist Party, spread their malign influence across the  continent.\n\nAs the Trump administration engages on trade, AGOA can be a  complementary trade policy as we look to build mutually beneficial  reciprocal trade.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698901/agoa-extension-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…reporting threshold is zero for the People's Republic  of China, that only solves one part of the equation. What happens when  the leaders of the PRC attempt to continue their malign influence  through Hong Kong or Macau? It could really marginalize the admirable  intent of this legislation and could only temporarily, potentially,  derail the PRC when we know…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…cannot afford to wait and deal with the  consequences. The cost of inaction is too great.\n\nCongress must anticipate the threats, and we must work together to  curb the malign influence of foreign adversaries like communist China,  Russia, Iran, and North Korea. For too long now, we have allowed  foreign adversarial governments to secure a silent foothold…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…anything, it  is important as a discussion and ultimately important to make sure in  law that is put into motion in every way possible.\n\nIt is also a fact that we look at the malign influence that comes  from the CCP, yes, but there are other entities equally determined to  undermine America, and they are starting in its educational system.  Because if you…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…but my committee has worked very closely with the Select Committee on  the Strategic Competition Between the United States and the Chinese  Communist Party to combat malign influence at our universities.\n\nOne type of malign influence is very different than what we are  talking about here. The influence is known as transnational repression,  which is…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…transparency is critical. Americans deserve to know which  companies inside our tech and telecommunications markets are linked to  hostile regimes. Shining a light on this malign influence is the first  step toward a stronger action to defend our communications  infrastructure and our national security.\n\nWe know what these threats are. We have seen them…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…violent drug cartels have ravaged American communities.  They have flooded our streets with deadly narcotics. They have  destabilized our hemisphere, creating openings for malign influence  from China, Russia, and Iran. Year after year, they have killed  thousands of Americans.\n\nWe decided long ago that we would not tolerate threats to the  American people…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…people.\n\nThe United States must push back on China not only in our words but  through our actions. Failing to do so enables the CCP to grow in  strength and exert its malign influence over the world. It is past time  we enforce accountability against our greatest adversary. The U.S. must  act decisively against the companies that profit from these abuses…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…way to protect our Nation from the  insidious influence of the CCP, and that our students, our intellectual  property, and our national security are protected from the malign  influence of the CCP.\n\nMr. Speaker, I urge all of my Republican and Democratic colleagues to  support this legislation.\n\nMr. PFLUGER. Mr. Speaker, I will point out that this bill…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…strategy, not endless spending, is what  delivers results. We make critical investments in high-impact  initiatives that combat narcotics and human trafficking, confront the  malign influence of the Chinese Communist Party, and counter terrorism.\n\nWe reinforce democracy and human rights efforts, and we defend  religious liberty. As both a moral duty and vital…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law, countering       malign influence, and anti-corruption efforts and to impose       swift consequences on individuals who are directly       responsible for leading or have directly and knowingly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…and I urge my colleagues, both  Republican and Democrat, to support this bill.\n\nThrough the Belt and Road Initiative, the Chinese Communist Party has  been spreading its malign influence for over a decade. This initiative  has one goal: to increase China's economic and political dominance over  the United States and the world. Disguised as harmless global…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…my colleagues to support this rule,  which is the first step in ending our universities' appeasement of  China's crimes against the Uyghur people and countering China's malign  influence and espionage at our academic institutions.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Security Cooperation Agency's efforts will  continue to be our strategic hedge against an increasingly contested  and denied battle space by peer adversary capabilities and malign  influence. We will enable leaders to make informed decisions in an  increasingly complex world, enhancing the U.S. military's lethality  across the board.\n\nFinally, this bill,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695148/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Sanctions Act of 2025.\n\nThe Iran Sanctions Act was enacted back in 1996. For 29 years, this  law has acted as the cornerstone of U.S. efforts to address the Iran  regime's malign influence. From its support to terrorist proxies to its  dangerous nuclear program, the impact of the regime's provocative  actions continues to be felt far and wide.\n\nThese sanctions…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}]