[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that their locations are running out. In fact, they said  they would run out of this high-nutrition assistance for children 2  weeks from now.\n\nDoctors working with malnourished children are saying the wards are  quiet. And if you have been around a ward of children, you know that  they are not quiet. But why are these children quiet? Because they…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise for the 34th time to call on the  Trump administration to restore lifesaving food aid for malnourished  children.\n\nAs a reminder, in January, the Trump administration stopped funding  for emergency food aid that had been appropriated by Congress. Since  then, despite saying all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694817/restoring-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 27th time to call on  the Trump administration to restore funding for lifesaving food aid for  malnourished children.\n\nAccording to data compiled by Boston University, more than 70,000  children--children--have died this year because the Trump  administration has frozen food aid that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693466/lives-lost-due-to-us-ending-food-aid"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…during this time, it literally has  generational consequences.\n\nThankfully, as Congressman Magaziner has highlighted, we have a  proven treatment to save the lives of malnourished children: ready-to- use therapeutic food, or RUTF. RUTF is the go-to treatment for  malnutrition in hard-to-reach areas and emergencies because it doesn't  require refrigeration,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 28th time to call on  the Trump administration to restore lifesaving food aid for  malnourished children. I see some of my friends and colleagues are here  who perhaps haven't heard this before. I will set aside my prepared  remarks.\n\nThis is Plumpy'Nut. It is a peanut…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693597/restore-funding-for-edesias-plumpynut"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 19th time to call on  the Trump administration to restore funding for lifesaving food aid for  malnourished children.\n\nI am a father. I have a 3-year-old and 1-year-old at home, Max and  Lucy. Like any parent, I want the very best for my kids. I am so lucky  that I do not have to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Trump administration to honor its word and restore funding for  lifesaving food aid for starving children.\n\nThis is Plumpy'Nut, an emergency paste that is used to treat  malnourished children. Until recently, the United States shipped this  product all across the world, saving lives, saving the lives of  children suffering from malnutrition.\n\nThis is important…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 13th time to call  for the Trump administration to restore funding for lifesaving food aid  for malnourished children across the world.\n\nEvery 7 seconds a child in this world dies of malnutrition, of  starvation, needlessly and unnecessarily. For decades, the United  States has saved…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 31st time to call on  the Trump administration to restore lifesaving food aid for  malnourished children.\n\nOver the weekend, I had a chance to visit the Edesia Nutrition  factory in North Kingstown, Rhode Island, one of two factories in the  United States that manufactures…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693908/restore-food-aid-funding"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…nutrition, the first 1,000 days of a child's life  are critical for development for the rest of their lives, but there is  a miracle treatment that can save the lives of malnourished children,  even in the most remote corners of the world. Ready-to-use therapeutic  food, or RUTF, is a nutrient-packed peanut butter paste.\n\nRUTF, also known as Plumpy'Nut,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 25th time to demand  that the Trump administration restore funding for lifesaving food aid  for malnourished children.\n\nThis is Plumpy'Nut. It is a fortified peanut paste that has saved  millions of lives by getting safe nutrition to children in hard-to- reach places around the world.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 28th time to call on  the Trump administration to restore lifesaving food aid for  malnourished children.\n\nThis program began 70 years ago, an idea from a Kansas farmer, and it  was launched by President Eisenhower. They called it Food for Peace,  and it sent American-grown…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693626/restore-funding-for-lifesaving-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 24th time to demand  that the Trump administration restore funding for lifesaving food aid  for malnourished children.\n\nThis is Plumpy'Nut. It is used to treat malnutrition. Until this  Trump administration began, we were shipping Plumpy'Nut around the  world, saving millions of lives…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the sixth time to call  for the Trump administration to restore funding for lifesaving food aid  for malnourished children.\n\nIt has been 2 months since Congress passed and President Trump signed  a funding bill for fiscal year 2025. It included money that can be used  to continue purchasing…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the seventh time to call  on the Trump administration to restore funding for lifesaving food aid  for malnourished children.\n\nRhode Island's Edesia Nutrition has helped save 25 million lives with  this ready-to-use therapeutic food manufactured in North Kingstown,  Rhode Island, supported…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690893/impact-of-volatility-and-policy-reversals"}]