[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…them fleeing brutal conditions  under the Taliban.\n\nIn fact, Afghanistan today also faces the horrors of an  administration that has not delivered for their people: record  malnutrition, shortages of basic medicine, horrible repression of women  and girls, and instability that threatens the entire region.\n\nListen to this carefully. The State Department--our…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…I condemn that. But there is a significant  actor here, and that is the Netanyahu government. When they bar aid  trucks from going in, that leads to hunger, starvation, malnutrition,  and lack of medicine for people who desperately need it.\n\nI do want to thank folks who are continuing their efforts to do  anything they can to help feed these starving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise for the 34th time to call on the  Trump administration to restore food aid for children around the world  suffering from malnutrition. We have been doing this for months.\n\nWe have been doing this for months because after decades of United  States leadership in providing aid to children around the world…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…have to believe me, Mr. Speaker. Just Google members of the  Freedom Caucus and their objections. They hate the fact that after all  of this, we are going to have death, malnutrition, and the shuttering  of hospitals both in rural and urban America. Yet still, they are going  to drive us into further debt.\n\nWhen we talk about cutting SNAP, she was only…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691466/snap-and-medicaid-cuts"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…to treat  malnourished children. Until recently, the United States shipped this  product all across the world, saving lives, saving the lives of  children suffering from malnutrition.\n\nThis is important because it is the right thing to do, but it is also  the smart thing to do for the United States. I want to read a quote  from someone who I think understands…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today to speak about a matter of  life or death for millions of children around the world. Malnutrition  is the leading cause of death for children under 5 globally.\n\nWhen children starve, their bodies break down their own muscles,  bones, and organs to survive. Their immune…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Palestinians in a cage with very little resources. There  are emaciated children too weak to walk or speak. Doctors, aid workers,  and journalists struggling with hunger and malnutrition, or being  killed as they fight to save the sick and wounded.\n\nInstead of responding with mercy and moral clarity, the world watches  and  the Trump administration responds…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694981/gaza-is-starving"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the world who have a new chance at life.\n\nFinally, after months of advocacy and struggle, funding has been  restored for global emergency food aid for children. You see,  malnutrition is the number one cause of death for children under 5  globally, and when children are on the brink of starvation, their  organs break down, and they cannot even digest…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696874/recognizing-important-victory-for-countless-children-around-the-world"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Lucy. Like any parent, I want the very best for my kids. I am so lucky  that I do not have to worry about whether they will be fed today or  tomorrow. Yet, around the world, malnutrition and starvation is the  number one cause of death for children.\n\nWhen a child suffers from malnutrition, it stunts their growth. Their  organs shut down. For toddlers, like…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…today for the 24th time to demand  that the Trump administration restore funding for lifesaving food aid  for malnourished children.\n\nThis is Plumpy'Nut. It is used to treat malnutrition. Until this  Trump administration began, we were shipping Plumpy'Nut around the  world, saving millions of lives a year. Starvation is still the leading  cause of death…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…years old--picture that little child in your arm, their legs and arms  just a twig, their ribs showing every indentation, and then, finally,  their body, as it goes through malnutrition, starts to consume itself,  and they died of gastric arrest. Their stomach's ability to absorb  nutrition shut down, and they died. The hospital they were at, the  Patient's…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…gone to buying  this promised lifesaving food aid. Instead, Edesia  has boxes of food stuck in warehouses, factory workers laid off, with  children suffering from severe malnutrition and famine.\n\nThis is food that has already been paid for by the American taxpayers  that could be used to feed starving children who are victims of war and  famine, but…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…in Oregon, and it is  very meaningful. I have introduced a bipartisan House resolution  recognizing the value of these Older Americans Act programs in  addressing hunger, malnutrition, and isolation among seniors.\n\nI invite my colleagues to show their support for the Older Americans  Act nutrition programs by visiting their delivery and community meal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…instructions of the Netanyahu government from illegally  blocking international food aid from getting through Rafah. Yet we see  a continuation of children facing severe malnutrition and hunger. We  also see kids who are sick and had the promise of getting healthcare,  cancer treatment, women who need maternity facilities or basic  medicines and treatments…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…same as a newborn. Their bodies stop growing. Their immune  systems shut down. They lose the ability to walk and sometimes even the  ability to cry. That is what severe malnutrition looks like, and it is  the leading cause of death for children under 5.\n\nThere is treatment. Ready-to-use therapeutic food is a nutrient-rich  peanut paste that delivers…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and  enslaved to labor; or certainly no modest case, the Korean Peninsula,  North Korea, where people are in darkness for 12 months a year and  where people are stunted by malnutrition and oppression and live in  darkness, literally and figuratively.\n\nCompare that to South Korea, Mr. Speaker. In less than three  generations since the end of the Korean…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}]