[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…this. This seems rational; this seems  logical; it seems like something we should do. Then, when bipartisan  Senators step up like that and say, ``I want to work with the man or  the woman across the aisle,'' we will have the time to do it.\n\nSo, God, I am sorry that my friend who is truly a great American  leader and one of the smarter people in here--I…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…husband can't get coverage through an employer and are a few years from  qualifying for Medicare. So they are in kind of a black hole. They are  going to be left out in no man and woman's land, OK. That is where they  are going to be.\n\nAnd they are going without insurance next year. That is the decision  they are making. And they are hoping--they are hoping…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…overtime pay. It is unions  that gave us safe workplaces. It is unions that gave us fair wages.  Every worker in America benefits from the courage of organized labor  and every man and woman who has stood for their fellow workers.\n\nMr. Speaker, I will end with this. I know where I stand. I stand with  my mother and the countless generations that come before…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…like to just be an  authoritarian. We don't have that kind of government.\n\nThat is why the United States of America was created in the first  place, to make sure that one man or woman couldn't make unilateral  decisions around the United States Congress.\n\nMr. Speaker, this War Powers Resolution would immediately end  President Trump's extrajudicial boat…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…It is incumbent on all of us to ensure that these weapons  are never used again.\n\nNew START is a concrete step toward ensuring that future. It is one  where no person--no man, woman, or child--lives under constant threat  from nuclear annihilation.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…extreme Republican budget, this one big, ugly bill?\n\nWe are here on the House floor, Mr. Speaker, to say to Tim and every  single veteran who put on the uniform, every single man and woman who  served this country, we will not abandon you in your hour of need. We  are going to stand up for every single veteran in this great country  and make sure that the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…chosen the President of the United States, then that is the direction  we will go. We will give that President, whether it be Republican or  Democrat, whether it be a man or a woman, we will give that President  the opportunity for the control of this nomination and the system here  in Washington, D.C.\n\nWe have got a lot at risk. Mr. Speaker, we have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…1970s.\n\nWhether or not socialism is evil, however, is not the debate today.  The debate today is about one question and one question only: Does the  Constitution allow one man or one woman to take the Nation to war  without the approval of Congress? Full stop.\n\nThat question is bigger than regime change in Venezuela, bigger than  the claims that the ends…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "French Hill", "party": "Republican", "sentence": "…It is a statement that I would hope all of our elected leaders in the  United States up and down our system of government could support.\n\nSocialism ignores the side of a man and woman that is the spirit. It  dulls the human capacity for self-initiative, entrepreneurship, and  risk-taking. For those who have concerns about the resolution, I just  invite…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…it back. We are going to help them claim that back.\n\nHowever, it is not just a victory today if this vote prevails for  those survivors. It is a victory for every person, man or woman, boy or  girl, who has been victimized sexually in this country. Anybody who has  been a victim of sexual assault, or maybe they have been victimized by  a family member,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Congressional District, I rise today to enthusiastically congratulate  the Grand Ole Opry on a century of entertainment and a century of  significance. I am confident that the man or woman who is in my shoes  100 years from now will feel compelled to do the same.                       Congratulating the Upperman Bees\n\nMr. ROSE. Mr. Speaker, I rise today to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…impartial.\n\nSharia prohibits marriage between a Muslim woman and a non-Muslim  man. A Muslim man may marry a Christian wife, but not vice versa.  Sharia also gives the man, but not the woman, the unconditional right  to divorce.\n\nFreedom of religion is in our First Amendment, but freedom of  religion in sharia means one is permitted to embrace Islam but…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…semiconductor manufacturing in  the United States. I think we have to encourage more semiconductor  manufacturing, but it costs about $280 billion. That is about $700 for  every man, woman, and child in the country.\n\nDoes anybody really believe that the Federal Government should be  grabbing $700 from everybody just to promote one industry? I think we  could…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…recognizes this  is a problem.\n\nEven if they don't care if a man is in the house or not, at least  they shouldn't penalize him. They shouldn't hate families in which a  man and woman are raising their children together. I think that should  be the number one priority of Congress.\n\nMr. Speaker, the second issue that I will take on is that we passed a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Americans across Kansas and the  country continue to cover him in prayer. I ask for God's healing hand  on him, for strength for his family, and for protection over every man  and woman who serves.\n\nMr. Speaker, tragedies like this remind us that the cost of our  freedom is not free. None of these men and women were drafted or forced  to put on the uniform…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Congressional  District, I rise today to enthusiastically congratulate the Grand Ole  Opry on a century of entertainment and a century of significance. I am  confident the man or woman in my shoes 100 years from now will feel  compelled to do the same.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…served in the Gulf War, including Desert  Storm, or the liberation of Kuwait for their fearless and selfless  decision to fight so that freedom may reign.\n\nI thank each man and woman who lost their life fighting in these  operations for their love of country and willingness to lay it all on  the line to keep our Nation safe. They paid the ultimate price,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700137/recognizing-the-35th-anniversary-of-the-gulf-war-and-liberation-of-kuwait"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…``No taxation without representation.''\n\nOur Founding Fathers believed so strongly in this, they embodied it  in our Constitution. Our Constitution doesn't allow any one man or  woman to raise taxes. It must be the body of Congress.\n\nNow, this wasn't new. This was part of maybe a thousand-year  tradition from Magna Carta on. In Magna Carta, it is stated:…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Why would a councilwoman or a councilman in a  city of 100,000 people in Colorado not want to see more houses built?\n\nI will tell you why: because that city councilperson--man or woman-- controls the zoning laws and controls, for rules and regulations,  housing starts.\n\nA lot of the people--I am not just picking on Colorado; this is true  in every State--a…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…ready, and grounded in its core values. His  journey from an enlisted Iowa Army National Guardsman to Vice Chief of  Staff of the Army is a powerful example for every young man or woman of  how great our American opportunity is.\n\nOn behalf of a grateful nation, I extend my deepest thanks to GEN  James J. Mingus for his extraordinary service and sacrifice.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}]