[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…certainly for one that has already been rescinded, is just a recipe  for uncertainty and conflict and litigation.\n\nNearly a third of our Nation's land mass, 640 million acres, is  managed by the Federal Government. The Forest Service manages 193  million acres. BLM manages 244 million in addition to 713 million acres  of Federal minerals.\n\nFor nearly 50 years,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…Administrator of Derry. Throughout his tenure, Dave has been a  tremendous public servant in his role, overseeing all the day-to-day  operations of Derry Town Departments.\n\nDave has managed numerous projects to improve the lives of Derry  citizens, including renovating and constructing long-awaited roads,  conserving land, and expanding police and fire stations.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…that he will now represent in Congress. He graduated from  New York University with a degree in politics. He then returned home  and got involved in his local community. He managed our dear friend  Gerry Connolly's 2007 campaign for chairman of the Fairfax County Board  of Supervisors, and a year later he managed Gerry's successful campaign  for Congress.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…liberty, and the  pursuit of happiness, and that is for all of us that are here.\n\nLet's go through some of the things that he did manage to do and some  of the havoc that he has managed to wreak.\n\nIn the first 100 days of the Trump administration, we have had to,  unfortunately, endure a lot of pain. This administration clearly is not  ready to lead. They…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…partners on all the  military resources needed on Inauguration Day.\n\nChris Brantley, from visitor services in the Capitol Visitor Center,  recruited, tracked, trained, and managed employment of more than 350  volunteer ``JCCIC Ambassadors'' in tasks ranging from ticket counting  to wayfinding to escorting participants and guests. Though not all  served…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…vulnerable species.\n\nThe DOD covers millions of acres, spanning a vast array of natural  habitats and providing that realistic backdrop for training and  testing. Healthy and well-managed natural ecosystems play an essential  role in maintaining the readiness of our military troops, an advantage  that is unique to the U.S. military.\n\nThe military has even used…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…this country. We have a sick care system, a system where  people are forced to delay care until a problem becomes a crisis, a  system where chronic conditions go unmanaged or managed with  unprescribed medication, a system where cancers are caught later when  treatment is more expensive and outcomes are worse, and a system where  more people die.\n\nOne…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…debates and tries to unravel bipartisan support for  the progress that we have already made.\n\nOf course, it doesn't have to be this way. When I was Governor of New  Hampshire, we managed to expand Medicaid and balance the budget at the  same time, and we did both on a bipartisan basis. We did it with the  support of many business leaders and law enforcement…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…torn Europe. His service came at great risk. The plane we see there, he  liked to fly privately also and would wear a scarf around his neck. He  was a great teacher, and he managed community colleges after his  service.\n\nDuring one of his many missions, his plane was shot down in battle,  and he was captured as a prisoner of war. Even in captivity, Harold…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…that ignores the foundation of our public lands management       system and threatens not only the future of the Boundary       Waters, but how all federal public lands are managed going       forward. Attempting to revoke this mineral withdrawal through       this unprecedented manner completely sidelines the       environmental analysis and public…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, first of all, let me begin by thanking the  chair and the ranking member for their interest in good, managed,  efficient SBA offices. They are Federal taxpayer dollars being invested  to make sure that we continue to create jobs in our great country.\n\nThat being in mind, I would…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692099/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…plans during natural disasters and  other emergencies. He was instrumental in developing Jeffco's new  Emergency Operations Center. During the Quarry Fire in 2024, Nathan  managed the EOC and re-entry plans--ensuring all evacuees were able to  return home safely. Nathan's commitment to public service extends  beyond Jefferson County--he also deployed…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…in Minneapolis  is that it runs against the fundamental freedoms of who we are as  Americans.\n\nNow, the President, who ran, in many ways, on the issue of  immigration, has managed to piss off everybody--left, right, and  center. Whether you are Joe Rogan or Zach Bryan or everyone in-between,  the tide has turned, and the President knows it. That is…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…worthwhile efforts to increase  diversity among asset managers. There are about $82 trillion in  financial assets in retirement funds. Only 1.4 percent of those assets  are managed by women or minority firms. Women and minorities,  represented by two-thirds of the population, they are managing 1.4  percent of the assets.\n\nNow, apparently that creates…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…responsibilities.  The agency manages Federal spectrum and its users, as well as  coordinates with the Federal Communications Commission to ensure that  our airwaves are effectively managed in a safe and secure manner. It is  also charged with advising the President on advanced technologies.\n\nMr. Speaker, a lot has changed since the NTIA was last reauthorized…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…subsection (a).\n\n(d) Definitions.--In this section:\n\n(1) Covered federal lands.--The term ``covered Federal       lands'' means--\n\n(A) National Forest System lands; and\n\n(B) lands managed by the Bureau of Land Management.\n\n(2) Secretary concerned.--The term ``Secretary concerned''       means--\n\n(A) with respect to National Forest System lands, the       Secretary…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…prior to purchase when their product is equipped with a camera or  microphone.\n\nManufacturers today produce appliances that connect to software  applications that can be set, managed, and monitored through one's  computing device. They are designed to capture voice commands from  around the vicinity, recording information to adapt to the way  individuals…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…again--you have  been hearing the Armageddon being said, that it is Medicaid.\n\nI used to do my State's Medicaid budgets. Arizona has a somewhat  unique system. We actually buy managed care capitated policies for our  indigent population. It is remarkably effective, and we deliver  remarkably effective healthcare cheaper than almost every other State  in…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…costs and continue  serving their local communities.\n\nThey also play a vital role in ensuring the safety and soundness of  the financial system. By enabling stronger, well-managed institutions  to acquire weaker ones, especially those struggling due to local  economic conditions, we can prevent bank failures and the panic that  they cause.\n\nInstead…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…without clear evidence of effectiveness.\n\nAs the branch with the power of the purse, it is Congress'  responsibility to ensure tax dollars that go toward HUD's programs are  managed effectively, efficiently, and transparently. H.R. 225 delivers  on that responsibility.\n\nThis bill requires the Office of the Inspector General of the  Department of Housing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…really strong economy, but these  rural counties have really weak economies. The reason the rural  counties struggle is because almost all of the land in their counties  is managed by the Federal Government. The Federal Government can make  rules that restrict access to parts of their county over their  objections.\n\nThese roads we are talking about are…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "James Risch", "party": "Republican", "sentence": "…will be included: A Cooperative Logistics Supply Support       Arrangement (CLSSA) Foreign Military Sales Order (FMSO) II       case to requisition orders for centrally managed spares and       repair parts. This case supports the Royal Saudi Land Forces       Aviation Corps' UH-60A/L/M Black Hawk utility helicopters;       AH-64A/D/E Apache attack…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…infrastructure  projects.\n\nRight now, it takes years and millions of dollars to permit  infrastructure projects, especially in States like Utah, where most of  the land is managed by the Federal Government and everything we do has  to go through multiple layers of Federal processes.\n\nLastly, the GEO Act addresses the time that it takes to permit  geothermal…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…this Act:\n\n(1) County.--The term ``County'' means La Paz County,       Arizona.\n\n(2) Federal land.--The term ``Federal land'' means the       approximately 3,400 acres of land managed by the Bureau of       Land Management and designated as ``Federal Land to be       Conveyed'' on the map.\n\n(3) Map.--The term ``map'' means the map prepared by the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…life.\n\nIn addition to his public service, Stan was deeply committed to the  local community, civil rights, and his faith in God. Throughout the  1990's, he established and managed Lawson's Grocery, Stan Lawson's  Palace, and multiple residential and commercial real estate  enterprises. In 2006, he became the President of the Greater Harrisburg  Area…", "date": "2025-12-05", "source_url": "https://justfacts.votesmart.org/public-statement/1697565/recognizing-mr-stanley-r-lawson-sr"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming challenges into triumphs and ensuring no resident  was left behind. The team managed and helped coordinate efforts for  shelters that housed 485 residents. When Hurricane Milton struck  shortly thereafter, the team rose to even greater heights, coordinating…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…and warm ocean water. It is home to pristine beaches, miles  of walking paths and trails, ice cream shops, and award-winning  restaurants. Despite this, St. Simons has still managed to keep a low  profile and is often overlooked by out-of-State beachgoers.\n\nI am proud that St. Simons Island, my new home, is being recognized  for the stunning views and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692260/recognizing-st-simons-island"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…working when it comes to the far left that tends  to participate in primaries, which is another testament to just how  badly our leadership here has failed, that they have managed to play  into the hands of Gavin Newsom, who is not a very smart person and who  is not a very crafty politician. Yet, this redistricting war has played  right into his hands.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…58,500 acres of BLM-administered surface land and 4.1       million acres of BLM-administered mineral estate, mostly       split estate, across North Dakota will be used and managed       over the next 20 years. More specifically, it establishes       various land uses for recreation, motorized vehicles, oil and       gas leasing, renewable energy projects,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]