[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…CANTWELL. Mr. President, I come to the floor to speak on the  11:30 vote we are about to have. And I come because I want to speak  against the effort to overturn the land management plan for the Arctic  National Wildlife Refuge.\n\nCongress established the Arctic National Wildlife Refuge in 1980 to  protect the diverse and unique, very fragile ecosystem…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…lands should be our country's proudest legacy. They are our  natural heritage, a national treasure, and the agencies responsible for  stewarding them, like the Bureau of Land Management and the Forest  Service, diligently manage these resources for the future through the  careful development of these resource management plans and forest  plans.\n\nThe BLM…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…which is  the leading cause of disabilities in the United States of America. Mr.  Speaker, 90 percent of our annual health spending goes to chronic  disease and mental health management. While these chronic diseases are  common, they are also manageable if we just do everything that we can  to improve access to care.\n\nIn my 19th Congressional District on…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Intelligence Agency.\n\n22. Executive Calendar #289--Jeffrey Bartos, of       Pennsylvania, to be Representative of the United States of       America to the United Nations for U.N. Management and Reform,       with the Rank of Ambassador, and to serve concurrently and       without additional compensation as an Alternate       Representative of the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…success.\n\nFederal agencies award a record amount of contracting dollars to  small businesses each year. However, many other factors, complexities,  and policies, like category management and overly strict past  performance requirements, are countering the impact of these programs.  As a result, the government has over 40 percent fewer small businesses  in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…the deadly cold and the icy waters  of the Potomac as part of the rescue operations.\n\nThese include the best of Virginia's Eighth. They are the fire  departments, emergency management teams, and police departments of the  city of Alexandria, Arlington County, Fairfax County, the city of Falls  Church, the Metropolitan Washington Airports Authority, and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Justice grant programs which support police departments and reduce  violent crime, hate crime, and crime against women.\n\nMr. Speaker, $646 million from the Federal Emergency Management  Agency, FEMA, for violence and terrorism has been terminated. I can go  on and on, but I won't.\n\nThese terminations include a grant totaled at over $8 million to the  National…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…damage it caused  that could have been found from the beginning had there been a  consistent survey, saving that company money.\n\nThis is not new. The Bureau of Ocean Energy Management has had  guidelines on marine archeology since 1982, and since have been updated  during administrations from both parties to create greater consistency  and predictability…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…bridges. It was also protecting  our natural infrastructure because of its connection with our urban  areas and the wildland-urban interface and more. That involved more  management of our forests, more thinning of our forests. It required  more hiring up of Forest Service staff, which really emphasizes the  point my colleagues have made about how this…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Authorization Act, directing the sale of 21,000 acres of Federal land  to Clark County for the establishment of the Apex Industrial Area.\n\nThis law permits only the Bureau of Land Management and Clark County  to issue utility and transportation rights-of-way.\n\nOriginally, Clark County had this authorization in order to make the  permitting process shorter. In…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Department of the Interior, U.S. Fish and           Wildlife Service--Applicability of the Congressional           Review Act to Record of Decision for Barred Owl           Management Strategy.      File: B-337059.      Date: May 28, 2025.                                    digest\n\nIn August 2024, the U.S. Department of the Interior, U,S.       Fish and…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, today I reintroduce the ``Forest Legacy  Management Flexibility Act,'' alongside Representative Ken Calvert (R- CA). I thank my colleagues, Representatives Jim Costa (D-CA), Josh  Harder (D-CA), Kevin Mullin (D-CA), and Suzanne…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…entry-level analyst in 1973 after graduating  from Pennsylvania's Lycoming College with a bachelor's degree in  accounting. He went on to lead GAO's Accounting and Information  Management Division, which focused on financial management, computer  technology, and budget issues. He served in that role until 1999, when  he became GAO's Chief Operating Officer,…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…conferees must support the WIC level in the  Senate bill, $500 million over the budget request and the House bill.  This should be a simple ask. On Monday, the Office of Management and  Budget, OMB, asked for funding of the continuing resolution at the  Senate's level of $8.2 billion.\n\nMr. Speaker, this should be a simple ask. On Monday, the Office…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…should ensure that it continues to have the authorities it  needs to implement many of our Nation's broadband efforts and  technological advancements in such areas as spectrum management and  artificial intelligence.\n\nH.R. 2482 helps achieve this goal. This bipartisan bill reauthorizes  the NTIA and elevates its leadership by making its administrator an…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the joint resolution (H.J. Res. 105) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Bureau of Land Management relating to ``North Dakota  Field Office Record of Decision and Approved Resource Management  Plan'', and ask for its immediate consideration in the House.\n\nThe Clerk read…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…tools used by local agencies.\n\nThe bill encourages the adoption of basic but powerful best  practices, such as multifactor authentication and stronger identity and  access management tools across State and local networks.\n\nIt promotes continuous vulnerability assessment and monitoring so  that jurisdictions can detect and mitigate threats before those…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Self- Determination Program (SRS) through Fiscal Year 2026 and provide lapsed  payments for 2024 and 2025.\n\nAdministered by the U.S. Forest Service and U.S. Bureau of Land  Management, SRS funding goes to counties to help maintain schools,  infrastructure, and other essential community services for many rural  counties that contain federal lands exempt…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697660/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in shelters,  demonstrating their unparalleled ability to adapt and respond under  pressure. The team leveraged the Human Services Needs app to streamline  disaster case management, supporting 1,351 residents. Their follow-up  system, in partnership with other agencies, ensured personalized  service for every individual. This innovative approach epitomized…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…gentleman from Arkansas (Mr.  Westerman) for bringing this important issue up today.\n\nMr. Speaker, I rise in support of H.J. Res. 104, which nullifies the  Bureau of Land Management's restrictive Miles City Field Office  Resource Management Plan.\n\nThis resolution is a critical step toward restoring American energy  dominance, a cornerstone of President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694890/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…TIMMONS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 5810) to provide for mandatory training for Federal  Government supervisors and the assessment of management competencies,  and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5810…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Administration. He began his career out of college as a financial  advisor and sales representative for multiple firms. In 2014, Nate  joined the Utter, Pike, & Dobbs Private Wealth Management Group of  Wells Fargo Advisors, where he currently serves as a partner and  managing director. In addition to his work in the financial industry,  he was elected to serve…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…``agency'' has the meaning given the       term in section 551 of title 5, United States Code.\n\n(2) Director.--The term ``Director'' means the Director of       the Office of Management and Budget.\n\n(3) Guidance document.--\n\n(A) In general.--The term ``guidance document''--\n\n(i) means an agency statement of general applicability       (other than a rule…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Committee in September.\n\nThis legislation addresses legal uncertainties surrounding the  University of Utah's use of land initially conveyed to the school by  the Bureau of Land Management back in 1968. At that time, the  university requested land on the Fort Douglas Military Reservation for  academic and research use, a request approved and granted by the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698134/university-of-utah-research-park-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…and initial findings of the working group       not later than 60 days after the date of enactment of the       Act.            Department of State Information Technology Management\n\nThe Committees continue to be concerned with the management       of the Department of State's information technology networks       and believe the existing management…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…the       requirements of this section, including any identified       challenges and recommendations for additional legislative       action.       SEC. 3. PERSONNEL SHIFT MANAGEMENT AND SYSTEM MODERNIZATION.\n\n(a) Evaluation of the Personnel Tracking System.--Not later       than 180 days after the date of enactment of this Act, the       Director of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…purposes of housing.\n\nMr. Speaker, I have always insisted that any transfer of lands from  fee simple ownership to Federal trust must have the approval of the  local land use management agency that is responsible for this land,  since it takes that land off of the tax rolls and out of the agency's  jurisdiction. I am pleased to report that the El Dorado…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…abundance of prey species;\n\n(2) due to rapid biological change in the Great Lakes, the       Great Lakes need a collaborative, science-based program to       assist in making management actions regarding fish stocking       rates, the rehabilitation of important fish species, and       habitat restoration;\n\n(3) the States of Illinois, Indiana, Michigan,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…to  public service and to the residents of Crawford County. Her extensive  knowledge, attention to detail, and tireless work ethic have not only  ensured the responsible management of county finances but have also  earned her the respect and admiration of colleagues, local officials,  and community members alike.\n\nMs. Krzysiak's career reflects a deep…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…debt?\n\nThe other thing we also have to deal with is when we get our policies  wrong, when we make the bond markets nervous, when they don't see that  we are fixated on debt management, fiscal reality, and interest rates  go up on U.S. sovereigns. They raise everything. It is more than just  the money we spend.\n\nMr. Speaker, we had months last year when…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}]