[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Stanislaus National Forest land  to the National Park Service to be managed as part of Yosemite National  Park and transfer 170 acres of National Park land to the Forest Service  to manage as part of Stanislaus National Forest. The land in the  exchange is known as Ackerson Meadow.\n\nAckerson Meadow is one of the largest midelevation meadows in the  Sierra Nevada.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Zoom meetings with the team to talk through ideas for the       trip and has put together a scrapbook of her journey with       Type 1 diabetes, she said. She's had to manage her disease       constantly for nearly a decade. ``For me, since I've had it       for so long, it's pretty much my life, so I'm a lot more used       to it. I have two devices,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…USAID as an  independent Agency, this bill sustains investments in our diplomatic  workforce that provides new hiring authorities for the State Department  in order to properly manage the additional assistance. And on  oversight, we have closed loopholes and added new transparency  requirements so that Congress can better track the use of funds and  ensure…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this is racist. That  is the case.\n\nIt is not like anti-Semitism. There is a big movement to eliminate  anti-Semitism in the country, but when it comes to racism, we want to  manage racism and eliminate anti-Semitism. We need to eliminate both.\n\nWhere is the movement, Mr. President, to eliminate the racism in  lending in this country? It does exist. Racism…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…same people are silent. I find that  shameful.\n\nIn the past, whether our policy was more relaxed or tightened, our  government maintained consultations with Cuban officials to manage  migration, but the Trump administration has closed even that door,  turning off a basic level of dialogue.\n\nNone of this makes sense. Tightening sanctions increases suffering,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…more than three-quarters, of employers expanded  predeductible coverage for chronic diseases. Codifying this policy now  will save countless lives by helping more patients manage their  conditions and stay healthy.\n\nThat is why this bill is endorsed by so many, from chronic disease  advocates to health benefit groups to small business associations.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…residents who have come together in D.C. to  create laws, to bring community together, to fight for statehood and  representation, we are going to strip them from their ability to manage  their own city.\n\nThese efforts do nothing to reduce crime or improve public safety.  Once again, I know that the President is obsessed with Washington, D.C.  He is obsessed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…The U.S. Forest Service manages these public lands. We also have  agreements and rely on relationships between Federal, State, and Tribal  organizations and governments to manage our public land. When you cut  Federal staffing, it really has ripple effects and leaves State,  Tribal, and local governments lacking.\n\nI want to express gratitude to U.S.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…who is watching  C-SPAN now ought to ask themselves is: Why is the U.S. House of  Representatives spending so much time on debating cutting taxes for  tasers?\n\nHow did that manage to become the top priority of the House  Republicans in Washington, D.C.?\n\nInquiring minds would like to know.\n\nMr. NEGUSE.  Sanchez).\n\n``U.S. Manufacturing Is in Retreat and…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Oregon.\n\nThis land is vital to the City's watershed and supports roughly 80  percent of its annual water supply. Local ownership of this land will  allow the City to better manage its water resources, protect water  quality, and plan for future water infrastructure.\n\nUnder the bill, the land transfer would occur at no cost to the City  and be subject…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…cutting corners, and it leads to a spill that is  expensive to the company, that hurts shareholders. That hurts people  who are saving for retirement. That is a failure to manage an  environmental risk.\n\nIf a company maintains a culture in the office that allows rampant  discrimination that causes lawsuits that are expensive to the company,  that is…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…creating a  business plan, and submitting a video pitch for consideration.\n\nTheir project, the Orbital Ecosystem Engineers, was pitched as an  aerospace technology company to manage and remove space debris, which  is a big problem right now. The technology used includes satellites,  drones, and AI to find the best route to locate debris and the focus of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…percent figure?\n\nIt means that those who are presently working work extraordinarily  long hours. In fact, the normal routine at O'Hare with the air traffic  controllers who manage that airport is to work 6 days out of 7, 10  hours each day. So in one of the most stressful possible jobs in  America, they are working 6 days a week, 10 hours a day. The…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…cutting back on unnecessary trips to the emergency room. He  also established the Colorado Firefighters Benefits Trust Program,  which helps firefighters and fire agencies manage illnesses that affect  first responders. Chief Lombardi led the West Metro through many fires  on the Front Range, but his leadership extended to the wellbeing of his  team…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694720/recognizing-chief-don-lombardi"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…nephew, Michael. He is deaf, neurodivergent, and lives with  multiple chronic health conditions.\n\nFor years, Bonnie has been his primary support so he can live  independently, manage complex health needs, and navigate programs like  Medicaid, Medicare, SNAP, and subsidized housing.\n\nBonnie handles most of Michael's communications with medical  providers…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691458/medicaid-and-snap"}, {"senator": "French Hill", "party": "Republican", "sentence": "…likely as many financial  institutions now offer low balance alerts, automatic transfers from  savings, and other tools to help consumers avoid being in overdraft and  better manage their financial cash flow.\n\nCompetition and innovation, not government-mandated price caps,  remain the best way to ensure consumers have access to affordable  financial products…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…billion from  the clutches of globalist NGOs, projects that fund radical gender  ideology, and the green new scam.\n\nThe great people of North Carolina didn't send me here to manage  decline. They sent me here to help President Trump usher in the new  golden age. Let the left scream. Let the media moan and grown, but  today we are putting Americans first…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are stable, that we are  adults, and that we understand. We have a demographic problem, but we  are going to engage in adult-like technology and borrowing policy,  things to manage our debt, and minimize it.\n\nMr. Speaker, this chart is substantially unreadable, but I wanted to  actually just show it for the fun of it. This is one of the things that  we…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "French Hill", "party": "Republican", "sentence": "…frequently  working with children, adults, and seniors to teach them the importance  of financial literacy. His efforts prove it is never too late or too  early to learn how to manage your finances.\n\nAs a former community banker, I admire his efforts to uplift his  community and help those around him build a stronger foundation in  finance.\n\nI look forward…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688942/keaton-beasley-teaches-importance-of-financial-literacy"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…report to Washington,  DC, and Washington also has no authority over what is taught in our  schools around the country.\n\nThe job description of a Secretary of Education is to manage a  bureaucracy that runs a number of funding programs. By all accounts,  Linda McMahon did a great job running the Small Business Administration  in the last Trump administration.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…member at the University of Nevada, Las  Vegas.\n\nFinally, Paulina chose a career in nursing. Now a registered nurse in  Warren, Ohio, she and her husband run  two gyms and manage an office building that supports nonprofits.\n\nThe story of the Suarez-Delgado family reflects the best of the  American spirit. From humble beginnings to professional achievements,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…when a tree fell onto electrical lines. As we enter  into what is predicted to be another devastating fire year, it is more  imperative than ever that we take every step to manage our forests and  reduce wildfire risk.\n\nIn January, the world watched as communities in southern California  were virtually leveled by catastrophic wildfires. In the wake of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…funded it. This accounts for the Federal lands that reduce the  tax base of counties and boroughs across the country.\n\nWe also included substantial resources for our Agencies to manage and  maintain our national parks. We hear from so many who love and embrace  our national parks. We all love them. Sometimes, we love them so much  that we forget that their…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…since the 1950s, driving beef  prices up more than 14 percent in the last year. By opening more land  and cutting red tape, this amendment empowers ranchers to expand  grazing, manage habitat, control wildfires, and meet market needs.\n\nMr. Chair, I urge my colleagues to adopt this amendment, and I  reserve the balance of my time.\n\nMr. BIGGS of Arizona. Mr.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…harvesting. When done correctly, RMPs  help guide public land management in a way that provides fuel, food,  and fiber for the Nation and conserves our natural resources.\n\nRMPs manage the resources that are the backbone of western rural  economies and support thousands of good-paying jobs. That is what makes  the Miles City Resource Management Plan amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…was  very brief because the California High-Speed Rail Authority submitted  an incomplete update to those who had organized the hearing. The high- speed rail authority can't manage to complete anything on time, even  its own reports to the legislature, let alone a high-speed train from  Los Angeles to San Francisco or even that very first segment from…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…before fire season ever began.\n\nThe wildfires we witnessed in Los Angeles this year were just the  latest reminder of the devastation that can occur when we don't  proactively manage our forests and do everything possible to prevent  them from breaking out in the first place.\n\nMake no mistake that the wildfire crisis is just that, a crisis that  must urgently…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…mitigate risk to risk mitigation       plans;\n\n(7) require that any information technology acquisition       plan and any strategic plan contains information needed to       manage cyber risks;\n\n(8) require that a traceability analysis is performed and       documented;\n\n(9) require that security-related subject matter experts       are involved in selection…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…working for  larger financial institutions in Ohio and lower Michigan. Throughout  those years, he remained committed to a personal goal: returning to the  Upper Peninsula to manage and grow a community bank.\n\nFor the past 25 years, Mr. Williams has led Upper Peninsula State  Bank with steadfast commitment to both customer service and community  engagement.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695770/recognizing-mr-david-williams-for-receiving-the-best-community-banking-award-for-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…intelligence;\n\n``(5) best practices in coordinating with third-party       providers of artificial intelligence tools;\n\n``(6) how to effectively identify, evaluate, and manage the       risks of artificial intelligence;\n\n``(7) how to ensure the privacy of user inputs to       artificial intelligence tools;\n\n``(8) how to retain human involvement in…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}]