[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have a dramatically  smaller workforce and narrower mission.\n\nEliminating the existing CPSC or stripping it of the independent and  bipartisan structure that Congress has mandated puts children and all  Americans' physical safety in grave danger.\n\nThe CPSC is a small agency tasked with a massive job to protect  consumers from hazards associated with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…As ice and snow accumulate on  an aircraft's surface, particularly its wings, it can make the aircraft  much harder to control and fly. That is why operators are federally  mandated to use deicing equipment when ice and snow accumulate to  ensure that the plane can be operated safely.\n\nThis equipment is so important that improper use has been cited by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the true numbers are likely       far higher.\n\nTo confront these issues, the Act created a Use of Force       Review Board, required robust de-escalation training, and       mandated public release of body-worn camera footage after       shootings and other serious events. Jurisdictions that       release such footage consistently see improved community…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…report on and restrict senior officials of the People's Republic of  China and their families from financial institutions and accounts in  the United States.\n\nThe report mandated by the bill is intended to raise public awareness  of hidden and corruptly gained funds that are directly or indirectly  controlled by such officials--for those listed in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…he condones the  deportation by our Justice Department of anyone residing in the United  States of America to another country without providing them with  constitutionally mandated legal process owed to present evidence of why  they shouldn't be deported.\n\nRegrettably, the President is doing the above things that I just  mentioned in tandem with expressions…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Protection Act, would  shield the Department from efforts to dismantle the agency and ensure  that every student receives the free and appropriate public education  that is mandated by law.\n\nMy legislation would prohibit the use of appropriated funds to  decentralize, reduce staffing levels, or alter the responsibilities,  structure, authority, or functionality…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the United States Supreme Court just announced this morning  that they were turning back one of the illegal actions to, in essence,  rob money that has been congressionally mandated to fund essential  services.\n\nIt really is weighing on the entire economy. More importantly, people  back home want to know what the Congress is going to do about it, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…prison, and his  family and his lawyers have not heard anything about him in weeks.\n\nI did go to El Salvador to advocate for the release of not just  Kilmar, who has been mandated by the Supreme Court to come back, but  also for Andry. We told Andry's story to the Ambassador in El Salvador.  It was the first time he had heard his story. After the meeting,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690508/trump-immigration-policies"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…politically motivated,       ``extraordinary and cruel action'' and said the       administration has shown neither evidence of fraud nor the       legal authority to withhold mandated program funding.\n\nThe freeze could affect $5 billion in funding due to       California that helps pay for state child care subsidy       programs serving more than 300,000…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…the Omicron  Kappa Kappa Chapter of Omega Psi Phi Fraternity, Inc. for its  Achievement Week and Honorees.\n\nSince 1925, Achievement Week has been an annual, internationally  mandated program of the Omega Psi Phi Fraternity, Inc. The purpose of  the program is to inspire race, pride, and public appreciation of the  Negro's potential. Chapters celebrate…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…constituents to help them pay for healthcare. Second, it was the  Affordable Care Act, you know the bill that the gentleman and a lot of  Republicans want to repeal, which mandated that greedy insurance  companies have to spend 80 percent to 85 percent of premiums on medical  care. It is called the medical loss ratio. The gentleman should look it  up.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…limit       admissions because of staffing shortages and only 19%       currently meet the minimum staffing levels that the Centers       for Medicare & Medicaid Services have mandated these       facilities achieve by 2029. I myself have encountered       challenges with my own patients--some have lingered on       inpatient units for extra days waiting…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…largest nuclear arsenals for the  first time in more than half a century. The consequences of that  outcome would be serious and immediate.\n\nThe United States would lose treaty-mandated insight into Russia's  deployed nuclear forces. Both countries would be free to increase the  number of deployed warheads on existing missiles. Strategic planning  would increasingly…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employers of the obligation to  pay employees for training outside of their regular working hours.\n\nUnder the Fair Labor Standards Act, employees must be compensated for  employer-mandated education and training outside the regular work  hours. Essentially, the FLSA protects workers from being compelled to  volunteer their time for job-related training without…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…battle with Emory Hospital.\n\nThe hospital believed that the anti-abortion bill that Georgia  enacted in 2022 following the gutting of Roe v. Wade tied the  hospital's hands and mandated that Adriana's body, her brain-dead body,  remain hooked to machines. Mr. Speaker, this was not because there was  any chance of survival, she had already transitioned, but…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "James Risch", "party": "Republican", "sentence": "…group, the regional development banks, and       other international organizations established primarily for       development assistance purposes.\n\nThe committee is also mandated by Senate Rule XXV.1(j)(2)       to study and review, on a comprehensive basis, matters       relating to the national security policy, foreign policy, and       international…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…could no longer  profit from building vast numbers of affordable homes, so they focused  their limited permits on the pricier models.\n\nTo solve climate change, the socialists mandated outrageously  expensive add-ons like solar panels and hermetically sealed windows.\n\nTo solve their environmental angst, they required pointless studies  that were endlessly…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 50th anniversary of the Individuals with Disabilities Education  Act, IDEA, which mandated that every child with a disability in America  should have access to a high-quality public education.\n\nWhen Congress passed IDEA in 1975, it was a landmark step toward  educational…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Engineers, this is their  definition that is in this bill. Along comes the Obama administration,  and rather than take the very simple, easy-to-understand,  congressionally mandated standard of what a showerhead is, the Obama  administration, in some closet somewhere, decided we are going to  reinvent the definition of a showerhead.\n\nNow, why is this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…businesses thought this was going to benefit their businesses, I  guarantee you, Mr. Speaker, as a family business owner, we would invest  in it. We would not have to be mandated to invest in it.\n\nThis final rule does not even meet the statutory requirements laid  out in ECPA for new or amended energy efficiency standards. With a cost  of at least…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…resolution will rescind the rule implementing the Democrats'  natural gas tax that the Biden administration finalized late last year.\n\nCongressional Democrats and President Biden mandated this new tax  under the so-called Inflation Reduction Act, which was, of course, the  Inflation Acceleration Act, taking inflation all the way up to 9  percent. The Environmental…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…incentive under       paragraph (1).\n\n``(ii) Reports submitted pursuant to clause (i) may be       submitted by incorporating their contents into other       congressionally mandated reports to the committees described       in such clause.\n\n``(D) In this paragraph, the term `Senior Executive Service       position' has the meaning given such term in section…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…the cost of       the mandate would be small and not exceed the threshold       established in UMRA ($206 million in 2025, adjusted annually       for inflation) because the mandated entities generally       already possess or collect the information required to be       reported under the bill.\n\nEstimate Prepared By: Federal Costs: Cyrus Ekland (for the…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694306/ads-for-mental-health-services-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…billion of new taxes. Where did it come from? It came  from the Democrats.\n\nThis tax on American energy hits American families who use the energy  to heat their homes. It was mandated by the Democrats' reckless tax- and-spending bill. The Democrat tax penalizes oil and gas production in  America, and in doing so, it punishes American families.\n\nThe golden…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "John Rose", "party": "Republican", "sentence": "…eliminate unnecessary steel, waste, and cost.\n\nWe cannot sit by while 50-year-old policies prevent folks from  signing on the dotted line. Imagine if the Federal Government had  mandated that every vehicle coming off of Henry Ford's assembly line  had to remain permanently attached to a trailer in order to be owned.  We all know that didn't happen because…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…requirement from existing  Federal law, so this is what is in law: ``to conduct an expeditious  program of competitive leasing of oil and gas in the Reserve.''\n\nThe Department is mandated to do that while protecting important  values, including sensitive areas, as well as providing for subsistence  use for Alaskans. This is generally Alaskan Natives who live…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of recoverable oil.\n\nPrior to the passage of the Working Families Tax Cut law, which  requires four lease sales to be held over a 10-year period, Congress  had previously mandated energy leasing in the area, an action that has  the support of local North Slope communities and Native Villages.\n\nLast Congress, we held a bipartisan legislative hearing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…are  taking with S.J. Res. 80.\n\nFurther, this Congress has already taken decisive steps to unlock the  NPR-A. In the ``One Big Beautiful Bill Act,'' P.L. 119-21, Congress  mandated lease sales to be offered under the same terms and conditions  set forth in the 2020 IAP. Passage of S.J. Res. 80 would durably  protect against another rogue administration…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I rise today to urge my colleagues to  reject the Biden administration's unlawful attempt to stifle Alaska's  congressionally mandated oil and gas leasing program in the Coastal  Plain of the Arctic National Wildlife Refuge, ANWR. I urge my  colleagues to support the Alaska congressional delegation's joint…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…submit sensitive ownership  information to FinCEN, adding compliance burdens and creating legal  risk with little benefit.\n\nWe pushed back against the CFPB's 1071 rule, which mandated that  lenders collect and report demographic and financial data on small  business loan applications, raising costs and potentially limiting  access to capital.\n\nTo ensure…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}]