[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…are hoping you  will blame it on the electric utility that sends you the bill. They are  hoping that you won't notice that behind that soaring electric utility  bill is manipulation of the grid to knock out clean energy, to drive up  prices.\n\nAnd if that is not bad enough, what you then find out is that the  climate consequences of all that fossil fuel…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…years old;\n\nKorey Wise, 16 years old; and\n\nKevin Richardson, 14 years old.\n\nThese five boys with big smiles and bright futures ahead of them went  on to experience fear and manipulation that no child should. They were  threatened, harassed, coerced, abused, and tried as adults, the very  harm that this Republican bill would expand.\n\nFrom the moment of their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…when a bill that has been  carefully negotiated is nearing completion. Further, Chair Conrad used  a current law baseline to measure the farm bill. This was not a scoring  manipulation meant to skirt the guardrails of a fast-track process.\n\nSecond, the majority has repeatedly referred to the Obama  administration's supposed use of a current policy baseline…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Senate Agriculture Committee:\n\n`` . . . inaction will only result in greater risk to our financial  markets and investors, through lack of market transparency, fraud,  market manipulation, corruption, and conflicts of interest.''\n\nThat is lack of action.\n\nMr. Speaker, let me address the elephant in the room: the First  Family's involvement with digital assets…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…behavior, which is vitally necessary throughout the shipping industry.  It will also authorize the FMC to investigate complaints against  shipping exchanges concerning market manipulation and other  anticompetitive practices.\n\nThe bill creates a National Port Advisory Committee and a National  Ocean Carrier Advisory Committee which will provide critical informed…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…intimate images  online, one of the most significant harms proliferating on the internet  in recent years.\n\nAdvances in generative artificial intelligence and other photo  manipulation software have enabled the creation of digital forgeries  that place victims in sexually explicit situations that never actually  occurred but can still cause massive reputational…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…people around the world every year. Traffickers exploit their victims  by forcing them to provide labor, services, and commercial sex through  violence, fear, coercion, and manipulation. While awful, their  exploitation doesn't stop there. Traffickers often force their victims  to commit other crimes, including prostitution, money laundering,  fraud, drug…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…stock. This should be a no-brainer. Members of Congress should  not be allowed to profit off of their service. When Members are in a  position of directly benefiting from the manipulation of the stock  market, and they profit off of their position, it is corruption, plain  and simple.\n\nJust last month, numerous Members and Cabinet officials profited off…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691226/stock-trading-ban-for-members-of-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…hiding the pay-for-play scheme either. The winner of  Trump's contest--the grand winner--is Justin Sun, who faces a civil  fraud case from the SEC over allegations of market manipulation and  unregistered asset sales.\n\nSince the election, Justin Sun has poured nearly $100 million into  Trump's crypto ventures. And guess what. Trump's SEC--poof--it is not…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…spending through the Federal Agencies, especially regarding their  climate pet projects.\n\nInstead of transparency and objective analysis, Biden's bureaucrats  relied on manipulation, inflated so-called ``net benefits,'' and  completely disregarded economic reality in their rulemakings. And they  were prolific, churning out nearly 110,000 pages of regulations…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…for any term of years or for life, or both.\n\n``(3) In this subsection, the term `compel' includes the       use of a threat, extortion, blackmail, fraud, deceit, or       manipulation.''.\n\n(b) Juvenile Delinquency Conforming Amendment.--Section       5032 of title 18, United States Code, is amended by striking       ``or 2241(c),'' and inserting ``2241(c),…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Montana's congressional delegation is stepping up. I  stand shoulder to shoulder with Congressman Zinke and Senators Daines  and Sheehy. We introduced the Stop Russian Market Manipulation Act.  This bans imports of critical minerals from Russia.\n\nWe are creating a competitive market for U.S. mineral producers not  driven down by dumping from foreign actors…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…countries have reached out to representatives of the United States to  negotiate a solution on the subjects being discussed relative to trade:  trade barriers, tariffs, currency manipulation, and nonmonetary  tariffs. These will mean wins for the American worker.\n\nPresident Trump is taking decisive action, pausing tariffs for 90  days, except for China, as nations…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…of all  critical minerals.\n\nThe challenge we face today is exacerbated by burdensome permitting  processes and regulations, uncertainty in commodity pricing, and market  manipulation by Communist China.\n\nA few years ago, I launched the Western Hemisphere Prosperity and  Security Alliance as a soft power alternative to China. The Western  Hemisphere Prosperity…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…reign of Hamas is  unimaginable. The hostages have been subjected to inhumane conditions,  deprived of their basic human rights, and used as pawns in the cruel  game of manipulation.\n\nNow more than 500 days later, Hamas is still holding dozens of  hostages captive, including five Americans. Of the  five Americans in Hamas's captivity, four have been…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688469/hamas"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…majority, the production,  for at least 50 more critical minerals.\n\nThe Chinese wield this authority through export controls to disrupt  supply chains as well as market manipulation tactics to ensure no  investments flow into these job-creating industries.\n\nAlmost 50 years later, the answer to this problem lies in our ability  to reshore essential energy…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…vulnerabilities that foreign adversaries can exploit. Our  Nation has already faced significant challenges in scaling artificial  intelligence infrastructure. We cannot allow foreign manipulation or  interference to add to these challenges.\n\nDisruptions to the artificial intelligence supply chain will not just  weaken our country in our race against China but will…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…because it makes  sense, but because it will put our adversaries on notice that we are  watching them. Most importantly, it will protect our Nation's students  from foreign manipulation and provide them with the transparent and  safe learning environment that they deserve.\n\nAgain, I wish to thank Chairman Walberg for his leadership on this  issue.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689030/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Public Law 117-328); and\n\n(2) modernizing the regulation of human cell and tissue       products, including considerations associated with assessing       minimal manipulation and homologous use (as such terms are       defined in section 1271.3 of title 21, Code of Federal       Regulations (or successor regulations)) of human cell and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…districts. Voters have empowered an independent citizens  redistricting commission to set the boundaries of representation so  that free and fair elections, not political manipulation, are the  motive force in our democracy.\n\nThis principle is so important and so vital to safeguarding democracy  that the citizens commission is enshrined in our State constitution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}]