[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the rule, and I reserve the  balance of my time.\n\nI will correct the Record on something. Donald Trump promised he  would lower gas prices to $2 a gallon. I just did Google maps and  looked at the price of gas in the gentleman's district. It is like  $2.80. That is a far cry from $2.\n\nMr. Speaker, if we defeat the previous question, I will offer an…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…request of the Republican Party  officials in those States, ahead of the November 4 election.\n\nThose anti-voter campaigns are coupled with efforts to distort the  electoral maps. Since President Trump took office, he has pressured  Republican State legislators to ignore the will of their voters and  effectively elect representatives through extreme…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Contact me today. Contact me ASAP, as soon  as possible.\n\nI believe that there was a conversation that took place. I believe  that that conversation is, in part, why we have the maps that we have  today.\n\nThe attorney general for the State of Texas responded to the Justice  Department. I include in the Record the letter from the attorney  general.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…they lie and cheat in order to steal the midterm elections.\n\nGovernor Abbott bent a knee to the felon in the White House, calling  an emergency session to redraw congressional maps in Texas. These are  maps that he himself approved in 2021.\n\nWhile Texas Hill Country is still reeling in grief and trying to  recover from devastating floods, Republicans prove…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693660/redrawing-congressional-maps-an-attack-on-democracy"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…this bill because the federal  government's land-use interests in the Nation's capital are protected  by federal law and federal agencies.\n\nThe Commission creates the zoning maps and regulations, which must  ``not be inconsistent with the comprehensive plan for the national  capital.'' The mayor is responsible for the local elements of the  comprehensive…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…of the Voting  Rights Act, which outlaws racial discrimination in our electoral  system, still allows Black and minority voters to challenge racially  discriminatory voting maps in court, making clear that the fight to  protect our democracy is far from over.\n\nWe will never forget the horrors of January 6, nor will we turn a  blind eye to the efforts…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to know what our allies  and our adversaries are thinking and that we have adults at our  military academies who can sort out the difference and see the  differences in the maps.\n\nAs a geography teacher and a person who used to use maps, that is my  only opposition to the gentleman's amendment.\n\nI know what he is getting at. I don't disagree with it,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Zuccarelli.\n\nThe Capitol venues team was led by Grant Scherling from the Office of  the House Chief Administrative Officer, whose acquisition and use of  detailed Capitol complex maps, schematics, and diagrams were essential  to the planning effort. The east front team of Michael Delaune and  Brian Hublar coordinated with partners from the inaugural task…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…In recent months, President Trump's attempts to  interfere in the midterm elections have become more brazen and alarming  day by day.\n\nWe have seen State legislators redraw maps to benefit Republicans. We  have seen the FBI raid an election office and seize ballots in Georgia.  Most recently, President Trump threatened a Federal takeover of our  election…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…him and the State of Alabama in voting  rights cases. His role in that litigation was not confined to a  courtroom. After the Supreme Court recognized that Alabama's voting  maps likely violated section 2 of the Voting Rights Act, Mr. LaCour  helped State legislators draw new voting maps. He pushed for the  inclusion of so-called ``legislative findings''…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696470/executive-calendar"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…urgent telecommunications crisis.\n\nMr. Speaker, it is important to remember that these are multibillion- dollar projects spanning years and thousands of miles. They make their  maps public. Everyone knows where these projects are taking place. The  cost of environmental assessments is pocket change for these  operations, but it could mean the difference…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…places shutting  down in Black neighborhoods. We have long lines in indigenous  communities that stretch around the corner and throughout the night. We  have purges, ID laws, and maps drawn to divide rather than to unite.\n\nMr. Speaker, we have courts gutting the Civil Rights Act, statehouses  cooking up new restrictions, and a President threatening to override…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I rise to share the story of a Federal  worker, an FAA scientist, who DOGE and the administration fired. This  person's job was to create and maintain flight maps that air traffic  controllers and pilots could use to navigate airspace. Without these  maps, ``pilots would quite literally be flying blind.''\n\nYet the Trump administration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688198/fired-by-president-trump"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…storms, prolonged droughts, shifts in water management practices,  ongoing aquifer depletion, and other major water uses. It is all about  having a public website displaying maps depicting zones at greater risk  of sinkhole formation, helping save lives and helping us have more  resilient communities.\n\nI thank Chairman Westerman, Ranking Members Huffman…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693480/sinkhole-mapping-act-of-2025"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…they spread. I  brought Jasmin as my guest to the State of the Union where we talked  about how difficult it would be for local fire chiefs to control the  fires without the maps that she provided.\n\nNow, we are preparing to go into another bad fire season. People are  scared. If you look at the conditions on the ground in the American  West, they are…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689808/cuts-to-forest-service-endanger-millions"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…various schools around the Nation.\n\nWhat did they get, Mr. Speaker?\n\nWhat do you get for $30 million invested in our schools?\n\nIt is a clear act of anti-Semitism. Classroom maps where they funded  omitted Israel and instead labeled it Palestine. Following a  congressional hearing last year, New York Public Schools acknowledged  receiving large donations…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Mr. BIGGS of Arizona. Madam Chair, Taiwan is a great friend of the  United States, and it is a unique friend to Arizona.\n\nThe CCP uses every tool it can, including maps, to undermine truth  and assert illegitimate claims over sovereign territory. Congress  should not fund anything that supports the CCP's disinformation  efforts, and now is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693690/department-of-defense-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…extreme storm events, prolonged       droughts causing shifts in water management practices,       aquifer depletion, and other major changes in water use; and\n\n(2) develop maps that depict zones that are at greater risk       of sinkhole formation.\n\n(b) Use of Certain Data.--In developing maps under       subsection (a)(2), the Director of the United…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…This is an  antiquated and dishonest policy, and it is one that we should abandon.  While my amendment will not end that misguided policy, it will at least  require that the maps that we use reflect a simple reality: China is  China. Taiwan is Taiwan.\n\nMr. TIFFANY. Madam Chair, I yield such time as he may consume to the  gentleman from California (Mr.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693684/department-of-defense-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…located outside the tsunami inundation zone;\n\n(5) takes into consideration near-shore and distant tsunami       inundation of the property concerned;\n\n(6) includes--\n\n(A) maps of all applicable tsunami inundation zones;\n\n(B) evacuation routes and instructions for all individuals       located on the property concerned;\n\n(C) procedures to begin evacuations…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Citizens Redistricting Commission and  to seize its powers for himself. He initially proposed simply ignoring  the commission, ignoring the constitution, and overriding his maps with  those that he and the legislature drew. Yet, apparently, someone told  him that that would get immediately struck down in court.\n\nWhat they are now plotting is a special…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…collaborate with       relevant Federal agencies in real time;\n\n(vii) support visual features, including video, animation,       geographic information system displays, interactive maps, and       three-dimensional renderings;\n\n(viii) provide for the exchange of information to and from       Federal agency data systems via an application programming       interface…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Let's be clear: Taiwan is not a part of the People's Republic of  China. We should not appease the desires of the Communist Chinese  leadership by pretending that it is. Our maps should accurately reflect  this reality.\n\nMadam Chair, I urge my colleagues to support the amendment, and I  yield back the balance of my time.\n\nMr. CALVERT. Madam Chair, I…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…our energy companies want to go to the most affordable energy.  That is what they want to produce.\n\nWhat this does, if you look at the map, and a lot of people have  looked at maps of energy prices, what are the highest cost electric  prices in the country? I know my friend from Colorado  pointed out to my other friend from Colorado that Colorado is up…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…capabilities to win  the next generation of fight.\n\nMr. Chair, I rise in support of H.R. 4016, particularly our  amendments, the wireless power transmission, No. 371, as well as the  MAPS Generation II, a precision navigation and timing system.\n\nAs a combat veteran myself, I know firsthand how critical it is to  provide our warfighters with the tools they need…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…executive order on his first  day in office.\n\nEnacting this legislation will help make President Trump's historic  action permanent and ensure consistency in references to laws, maps,  regulations, and records of the United States.\n\nThe Gulf of America is critical to the United States because of its  energy resources and ecological significance. This renaming…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…non-MDE items: Contractor Logistics Support (CLS) services;       the Joint Mission Planning System (JMPS); classified and       unclassified software delivery and support; maps,       publications, and technical documentation; transportation       support; and other related elements of logistics and program       support. The estimated total value…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…deeply unpopular  with Members of Congress on both sides of the aisle, and it is deeply  unpopular with the American people.\n\nGerrymandering is bad enough, but throwing out the maps specifically  to gerrymander in the middle of the decade is even worse. At this point  in time, we have seen Texas and California both adopt gerrymandered  maps, although both…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…party does it. Both parties have been amply guilty.  That is why I proposed H. Res. 4889. H. Res. 4889 will bring this  redistricting war to an end by preserving the district maps that were  used in our last election until the next Census when redistricting is  supposed to be done.\n\nUltimately, by the time of the next Census, we need to come up with a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…by striking ``Kerr-McGee Site'' and inserting ``Kerr-      McGee Site and other lands conveyed in accordance with this       Act''; and\n\n(C) by inserting ``(or any successor maps created by the       Secretary)'' after ``May 1989'';\n\n(3) in section 4(c), by striking ``Pursuant'' and all that       follows through ``Clark County'' and inserting ``During…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}]