[{"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "In March 2019, Senate Judiciary Committee Chairman Lindsey Graham (R-SC) and Durbin introduced the Dream Act of 2019."}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "They are marching orders."}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "There was no Army marching in this Nation."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "In March, Duckworth wrote to Secretary Esper urging the Department of Defense to take proactive steps to ensure readiness of National Guard and Reserve units to support local civilian authorities throughout the COVID-19 pandemic."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Dear Secretary Chao:\n\nYesterday, the Special Committee to Review the Federal Aviation Administration's Aircraft Certification Process, which you established on March 25, 2019, delivered its final report to the U.S."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "\"The true test of our democracy will not come from the low actions of the one most on high; nor will it turn alone on the actions of this body -- a body that before has preserved slavery, denied women suffrage, and marched us to war when we should have sought peace."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "troops have been under stop movement orders since March, and more than 80 percent of the Pentagon's 23,000 personnel are working remotely to adhere to social distancing practices."}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "It is a freedom that generations of Americans have fought,  bled, and marched for, many in my hometown of Selma, Alabama."}, {"senator": "Mark R. Warner", "party": "Democrat", "sentence": "We applaud the actions you directed in your March 20 memorandum and encourage your continued engagement on contracting issues which may arise as the shipbuilding and ship maintenance industrial base works through the pandemic."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "Most recently, TPS designation for Somalia was extended through March 17, 2020 because conditions in the country, including \"ongoing armed conflict,\" \"extrajudicial killings,\" and \"the need for the rehabilitation of crucial infrastructure\" prevent approximately 500 Somali nationals from returning safely."}, {"senator": "Michael F. Bennet", "party": "Democrat", "sentence": "The Black Maternal Health Momnibus is endorsed by many leading health and family organizations, including the March of Dimes, Center for Reproductive Rights, the Black Mamas Matter Alliance, and the American College of Obstetricians and Gynecologists."}, {"senator": "Robert P. Casey, Jr.", "party": "Democrat", "sentence": "I am proud to join Congresswoman Hayes in introducing this legislation to expand delivery options to vulnerable SNAP recipients.\"\n\nIn March, Hayes and Neguse introduced a legislative package to protect and support children and families during this public health emergency."}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "On the contrary, nihilist criminals are simply out for loot and the thrill of destruction, with cadres of left-wing radicals like antifa infiltrating protest marches to exploit Floyd's death for their own anarchic purposes."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "\"In the last three days in the State of Maine, there were more claims for unemployment compensation than all of March last year."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "Components of this bill were included as part of the Phase 3 coronavirus emergency response package that was signed into law on March 27, 2020."}, {"senator": "John Thune", "party": "Republican", "sentence": "Prior to this, seasonal businesses generally had to calculate their average monthly payroll using a timeframe starting on either February 15, 2019, or March 1, 2019 based on provisions in the CARES Act."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "In March, Grassley encouraged all schools with an active Confucius Institute to seek an FBI briefing on how China uses the institutes to seed pro-China sentiments within U.S."}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "On March 8, 2023, in a dialogue with Chairman Hill, Federal Reserve  Chairman Jerome Powell said that they would need congressional approval  for a retail CBDC, but he went on to explain that you could have a  layered CBDC."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "Their legislation was included in the Coronavirus Aid, Relief, and Economic Security (CARES) Act, which passed the Senate 96-0 and was signed into law on March 27, 2020."}, {"senator": "Martha McSally", "party": "Republican", "sentence": "In March 2019, McSally and Kyrsten Sinema (D-AZ) pressed the U.S."}, {"senator": "Roger F. Wicker", "party": "Republican", "sentence": "In March, Wicker along with Sens."}, {"senator": "French Hill", "party": "Republican", "sentence": "Mary Fine turned 100 years old this past March 12."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "As you are aware, on March 18, 2020, USCIS temporarily suspended in-person services to help slow the spread of COVID-19, leaving over 100,000 individuals without an opportunity to participate in naturalization ceremonies, a legal requirement for U.S."}, {"senator": "French Hill", "party": "Republican", "sentence": "Speaker, I rise today to honor John Edward  Hain, Jr., who celebrated his 100th birthday on March 20."}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Over 150 years ago, on March 25, 1863, the very first Medals of Honor  were presented, establishing a tradition of recognizing those who  displayed unparalleled bravery in the face of overwhelming danger."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "From March 8th to April 4th, total miles driven dropped by 58 percent."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "On March 11, 2020, the World Health Organization declared the COVID-19 a pandemic and across our country and the world our brave health care providers and public health officials, including VA providers, are on the frontline both with regard to prevention and treatment."}]