[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…where we have a President calling out the military  over the objection of a Governor to try to intimidate and interfere  with law enforcement in California, calling out the Marines to try to  inflame tensions in our city; and, now, this latest act, when a U.S.  Senator goes to demand questions about the lawfulness or lawlessness of  these actions, to…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…for.\n\nThis bill means billions of dollars for masked ICE agents to  terrorize immigrant families who have been contributing to our country  for decades, including law-abiding marines and even American kids.\n\nThis bill means billions of dollars for DHS to continue obstructing  Congress and denying due process to legal immigrants.\n\nMy Republican colleagues…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693217/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, we gather on the floor of the House of  Representatives to pay tribute to two United States marines who died in  service to our Nation. Lance Corporal Albert A. Aguilera of Riverside  and Lance Corporal Marcelino M. Gamino of Fresno were both killed in a  tragic vehicle…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690810/moment-of-silence-in-memory-of-lance-corporal-albert-a-aguilera-and-lance-corporal-marcelino-m-gamino"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Afghanistan and Iraq. His time in uniform coincided  with some of the most dangerous years of conflict, ending in 2011.  During that period, he witnessed the loss of many fellow Marines-- brothers and sisters in arms who gave their lives in service.\n\nIn 2011, while deployed in Afghanistan, Corporal Donald was severely  injured in an explosion. Despite the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Insurrection  Act of 2024 before the current administration took office. In fact, a  Democrat was President at the time.\n\nBut after the President's decision to deploy Active-Duty marines  along with the National Guard in Los Angeles, I reintroduced this  legislation with my colleagues from California and 16 other States.\n\nThe danger of the President invoking…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…devotion left  lasting impressions on Marblehead students, making the lessons of  history real and deeply felt.\n\nHarry never wanted to be far from Marblehead Rock. He loved the  Marines, his country, his town, and--most of all--his family.\n\nMay Harry's life remind us all that public service is a calling  grounded in humility and honor. I extend my deepest…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690561/harry-christensen-remembered-for-decades-of-public-service"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…mass arrests and terrorize  families in Los Angeles.\n\nWhen people went to go exercise their First Amendment rights, he  deployed the National Guard and then the United States Marines against  the American people.\n\nThis is not only a distraction, this is a direct abuse of power  because the reality of what was actually going on in this Chamber a  week ago…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…undocumented immigrant. He got his opportunity at the  American Dream thanks to former California Governor and Republican  President Ronald Reagan. He then served our country in the marines for  6 years through two wars.\n\nToday, Chief Rodriguez is our Santa Ana chief of police. He fulfilled  a lifelong dream of being an American and serving his great country.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…someone who participated in an attack on this  Capitol would dishonor every servicemember who actually served to  uphold that oath.\n\nI have seen real sacrifice. I have buried marines who gave their  lives in protecting others. That is honor. Those who serve are expected  to uphold military standards even after they leave service. When you  violate the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Donald Trump, the emergence  of someone who said we should nationalize the elections, the emergence  of someone who said that he could invoke the Insurgency act in order to  put marines--an army--on the streets of America during election times  in order to serve the will of the President so that he would not have  the checks and balances of the leaders of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to recognize the outstanding  achievements of the Albany Young Marines of Albany, Georgia, who have  been named the National Young Marine Unit of the Year. The group  received this well-earned honor at the Young Marines 2025 Adult  Leader's Conference…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…have wept on my  shoulder, pleading for their husbands to come home and for their  families to be reunited, to Los Angeles, where Donald Trump sent the  National Guard and the Marines to descend on justice-seeking, peaceful  protesters, the hurt and harm of this hostile White House is felt by us  all.\n\nThis has nothing to do with law and order. That is…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…and disenfranchised most Native Hawaiians.  Fearing the Queen's desire to restore power to the monarchy and the  Hawaiian people, those same businessmen--supported by U.S. marines-- orchestrated an illegal overthrow of the Queen in 1893 and formed a  provisional government.\n\nAll the while calling for peace among her people, Liliuokalani  traveled to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…pint, maybe two--we were young-- talking about life.\n\nFather Shaughnessy joined the Jesuits and became an ordained priest  before making the noble decision to enlist in the Marines in 1994.\n\nLieutenant Commander Shaughnessy brought faith and comfort to many  soldiers, including a congregation of 32,000 in Iraq.\n\nHis impact has earned him a number of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692466/recognizing-father-paul-shaughnessy"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…know that  ICE is making our communities less safe.\n\nI will close with this. We have all seen the videos and images of  Narciso Barranco, a gardener and father of three U.S. Marines, who was  tackled and punched repeatedly in the head by ICE agents wearing jeans  and sneakers.\n\nAs one of his sons, Alejandro, a current marine, stated, while  deployed as…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Madam President, I rise today to honor a very special group  of Americans--the soldiers, the sailors, the marines, and the airmen  who have fought bravely for this Nation, but who have received the very  highest distinction that any member of the Armed Forces can earn, the  Medal of Honor.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Scott and his unit conducted hundreds of  combat missions, demonstrating bravery and commitment.\n\nDuring the intense second Battle of Fallujah, Scott was one of only  nine Marines from his 41-member platoon to survive. Five of these  survivors were critically wounded. Scott and his unit demonstrated  dedication to our country and made tremendous sacrifices.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…and strength that I proudly commend retired USMC Colonel John Battista  Airola of Huntsville, Texas to his friends, family, and colleagues, and  salute his service to the Marines, his country and Walker County by  awarding him the 2025 Congressional Veteran Commendation.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Infantry.\n\nDuring his military career, Domenico served as an Infantry Rifleman  and later as a Small Unmanned Aircraft System Operator. He was assigned  to 1st Battalion, 8th Marines, Bravo Company, where he served as an  Automatic Rifleman and advanced to become a Senior SUAS Operator. He  later transferred to 6th Marine Regiment Headquarters Battalion,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…of  the U.S. Marine Corps as they celebrate their 250th birthday today.\n\nThe Marine Corps was born in Philadelphia on November 10, 1775, when  two battalions of Continental Marines were established as a service  branch of infantry troops capable of fighting both at sea and on shore.  Two hundred fifty years later, it remains the maritime land force…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…founding 250 years ago, the Marine Corps has stood  as a symbol of excellence and steadfast commitment to defending our  homeland. From the Revolutionary War to the present, our marines have  demonstrated outstanding courage wherever and whenever they are called  to serve.\n\nI encourage my colleagues to join me as we honor those currently  serving in or retired…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…today to honor the 250th anniversary  of the United States Marine Corps, an institution championing courage,  discipline, and devotion to duty. For two and a half centuries, Marines  have stood on the front lines of freedom, defending our Nation's ideals  at home and abroad with unwavering honor.\n\nSince its founding on November 10, 1775, at Tun Tavern…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696572/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Reservoir and recognize the heroic veterans of the  Chosin Few.\n\nSeventy-five years ago, in the bitter winter of 1950, 30,000 United  Nations forces, most of them United States Marines, were surrounded by  more than 120,000 Chinese troops near the Chosin Reservoir in North  Korea. Facing the freezing conditions, overwhelming odds, and heavy  casualties,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695858/recognizing-the-75th-anniversary-of-the-battle-of-chosin-reservoir"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…were killed in the botched withdrawal  from Kabul, Afghanistan. One of them was Wyoming's own Rylee McCollum.  He embodied the best of Wyoming. He was a marine. He joined the Marines  on his 18th birthday.\n\nI spoke at his funeral. He was Wyoming's wrestling champion. He was  about to become a father. He was just 20 years old when he died. He was  the same…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…the Boxer Rebellion and Spanish-American War, ultimately earning  the Medal of Honor for his service in Peking, China, in the summer of  1900.\n\nIn addition to serving in the marines, Mr. Upham worked as a letter  carrier for the Guthrie Post Office for 40 years. He retired from the  U.S. Postal Service, and he died February 14, 1949, in Guthrie,  Oklahoma,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…continue that as long as I serve in the U.S.  Senate.\n\nI would also like to recognize that, this year, the day before  Veterans Day marks the 250th anniversary of the U.S. Marines. On  November 10, 1775, the Second Continental Congress established the  Marine Corps. I have been fortunate enough to have a brother who served  in the Marines in World War…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…North Carolina where he earned the Military Occupational  Specialty (MOS) of 0151 Administrative Clerk.\n\nFollowing his training, Timothy was assigned to the 2nd Battalion,  1st Marines, where he served as an Administrative Clerk. During his  time with the unit, he completed two Western Pacific deployments. His  dedication and preparedness during this period…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Corps, a truly remarkable milestone by  one of America's most remarkable institutions. That happens tomorrow,  on November 10--our birthday, the Marine Corps' birthday.\n\nNow, we marines--Mr. President, you know this--take our November 10  birthday very seriously. No matter where marines are anywhere in the  world, deployed, they always take time to celebrate…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in the world. But we  have to make sure at minimum that we aren't blindly watching American  investments into China in technology that could later be used to kill  American marines or American soldiers in a future conflict in the Indo- Pacific.\n\nSome estimates show that as of 2020, a total of U.S. investments in  Chinese companies totaled $2.3 trillion.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Commonwealth of Pennsylvania.\n\nThe Nittany Leathernecks Detachment of the Marine Corps League is a  community service organization composed of active, retired, and former  Marines. Since 1947, the mission of the U.S. Marine Corps Reserve Toys  for Tots program has been to collect new, unwrapped toys through  October, November, and December each year…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698118/recognizing-nittany-leathernecks"}]