[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA) released the following statement after Senate Republicans rejected attempts to hear testimony from key first-hand witnesses and produce important documents at the beginning of the impeachment trial of President Trump:\n\n\"Serious allegations have been made against the President, and the Senate needs to hear all the evidence to conduct a fair and impartial trial."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Senators Tammy Baldwin (D-WI), Richard Blumenthal (D-CT), Cory Booker (D-NJ), Maria Cantwell (D-WA), Chris Coons (D-DE), Catherine Cortez Masto (D-NV), Tammy Duckworth (D-IL), Kamala Harris (D-CA), Mazie Hirono (D-HI), Amy Klobuchar (D-MN), Bob Menendez (D-NJ), Patty Murray (D-WA), Jack Reed (D-RI), Jacky Rosen (D-NV), and Chris Van Hollen (D-MD), as well as U.S."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA) applauded the announcement that the University of Washington will receive $884,000 in federal funding from the U.S."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA) released the following statement on the ongoing novel coronavirus outbreak in Washington state and around the country:\n\n\"My thoughts are with everyone in Washington state and around the country being impacted by the novel coronavirus outbreak, and I want to thank our tireless workers who are treating patients and working to contain the spread of COVID-19."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senators Roy Blunt (Mo.), a member of the Senate Commerce, Science, and Transportation Committee, and Maria Cantwell (Wash.), Ranking Member of the Commerce Committee, introduced the National Air Grant Fellowship Program Act of 2020, bipartisan legislation to create 1-year paid aerospace policy fellowship roles for graduate and post-graduate students in Congress, at the Federal Aviation Administration (FAA), and in other federal agencies."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA) pressed Secretary of the Treasury Steven Mnuchin on the need for more affordable housing."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA) announced that Washington state's 29 federally recognized Tribes will receive a combined total of more than $12 million in funding for critical affordable housing programs."}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Markey (D-Mass.), Charles Schumer (D-N.Y.), Maria Cantwell (D-Wash,), Chris Van Hollen (D-Md.), Michael Bennet (D-Colo.), Maggie Hassan (D-N.H.), and Brian Schatz (D-Hawaii)."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "Coons (D-DE), Patty Murray (D-WA), Kyrsten Sinema (D-AZ), Elizabeth Warren (D-MA), Cory Booker (D-NJ), Patrick Leahy (D-VT), Kirsten Gillibrand (D-NY), Chris Murphy (D-CT), and Maria Cantwell (D-WA)."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA), a senior member of the Senate Committee on Energy & Natural Resources, applauded the inclusion of five of her bills in the American Energy Innovation Act, a bipartisan comprehensive energy modernization bill released today."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Senator Maria Cantwell (D-WA), the Ranking Member of the Senate Committee on Commerce, Science, and Transportation, and U.S."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Senators Martin Heinrich (D-N.M.), John Hoeven (R-N.D.), Jon Tester (D-Mont.), James Lankford (R-Okla.), Brian Schatz (D-Hawaii), Jerry Moran (R-Kan.), Catherine Cortez Masto (D-Nev.), Martha McSally (R-Ariz.), Tina Smith (D-Minn.), Steve Daines (R-Mont.), Tammy Baldwin (D-Wis.), Michael Bennet (D-Colo.), Richard Blumenthal (D-Conn.), Cory Booker (D-N.J.), Maria Cantwell (D-Wash.), Tammy Duckworth (D-Ill.), Kamala D."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Roger Wicker, R-Miss., chairman of the Senate Committee on Commerce, Science, and Transportation, Maria Cantwell, D-Wash., ranking member of the Senate Committee on Commerce, Science, and Transportation, Deb Fischer, R-Neb., chairman of the Subcommittee on Transportation and Safety, John Thune, R-S.D., and Tammy Duckworth, D-Ill., today released the following statements after the committee approved S."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "John Thune (R-S.D.), Maria Cantwell (D-Wash.), and Senate Energy and Natural Resources Committee Chairman Lisa Murkowski (R-Alaska) and Ranking Member Joe Manchin (D-W.Va.)"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Brian Schatz (D-Hawaii) and Maria Cantwell (D-Wash.) last month."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "Senator Maria Cantwell (D-WA) joined U.S."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "After several weeks negotiating a bipartisan agreement with the  ranking member of the Senate Commerce Committee, Maria Cantwell, the  committee passed the ROTOR Act unanimously."}, {"senator": "James Lankford", "party": "Republican", "sentence": "He introduced the Prescription Pricing for the People Act of 2019 with Senators Chuck Grassley (R-IA), Chairman of the Finance Committee and Senator Maria Cantwell (D-WA)."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "Senators Jim Risch (R-Idaho) and Maria Cantwell (D-Wash.) celebrated a major victory for the U.S."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "He has done this since FY2018.In addition to Hoeven and Murkowski, Savanna's Act was introduced by Senators Catherine Cortez Masto (D-NV), Maria Cantwell (D-WA), Dan Sullivan (R-AK), Christopher A."}]