[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…$3 billion shoreside  infrastructure backlog, a lack of icebreaking capacity in the  Arctic and Great Lakes, and reduced capacity across several essential  missions, such as mariner safety and mariner credentialing.\n\nThe committee recognized this need, and H.R. 4275 begins to address  the shortfall by authorizing the Coast Guard far beyond the  administration's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…II, the U.S. merchant marine has  shrunk to an unacceptable level. My bill is an actionable step that we  can take right now to improve the maritime industry, grow the U.S.  mariner pool, and increase the number of U.S.-flagged ships.\n\nFrom a national security perspective, cargo preference remains an  effective shipping strategy in maintaining our Nation's…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Moreover, I am proud that this bill includes several provisions that  I sponsored regarding U.S. merchant mariners. This bill tackles long  outdated methods for processing mariner credentials by investing in and  revamping the Coast Guard's process.\n\nThis bill also improves merchant mariner credentialing tests by  ensuring the most relevant and technologically…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…line with President Trump's efforts to rebuild America's maritime  capacity, this bill strengthens America's maritime base, including  provisions that streamline the merchant mariner credentialing process  and laying the groundwork for the responsible deployment of new  technologies at sea.\n\nThrough this legislation, the United States Coast Guard will…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…St.                Thomas. Sec. 283. Report on East Rockaway inlet navigation.                     TITLE III--SHIPPING AND NAVIGATION                  Subtitle A--Merchant Mariner Credentials  Sec. 301. Merchant mariner credentialing. Sec. 302. Nonoperating individual.                         Subtitle B--Vessel Safety  Sec. 311. Grossly negligent operations…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]