[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mrs. DINGELL. Mr. Speaker, I rise to read the letter that the  Governor of Michigan and I received from Marie Adkins.\n\n``I'm a mom to a son with special needs. I'm also a nurse in primary  care settings. My story is from the front lines. . . . If you cut  Medicaid, Americans will die.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691504/gop-tax-scam-hurts-women-and-families"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Officer, retired; Marcia Wong, Former       Deputy Assistant Administrator, USAID; Kenneth Yalowitz, US       Ambassador, retired; Stephen Young, US Ambassador, retired;       Marie Yovanovitch, US Ambassador, retired, Former Principal       Deputy Assistant Secretary of State; Jane Zimmerman, Former       Deputy Assistant Secretary of State; Ricardo Zuniga,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…due  process and no transparency, just families being illegally ripped apart  and left to fend for themselves.\n\nIn severe instances, innocent people have actually died, like Marie  Blaise. She was a 44-year-old Haitian woman who was in ICE custody in  Pompano Beach. Marie had been complaining about chest pain for hours.  They gave her some pills and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690462/immigrants-are-being-treated-without-basic-dignity-and-being-denied-medical-care"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…look forward to continuing to serve our       city in discharging our critically important       responsibilities.            Respectfully Submitted,\n\nFor the Commission:\n\nHon. Marie C. Johns, PPC-Leftwich, Washington, DC.\n\nBenjamin F. Wilson, Esq., Washington, DC.\n\nAddy R. Schmitt, Esq., Kropf Moseley Schmitt, Washington,       DC.\n\nVincent H. Cohen, Jr.,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the strength and hope it instills in generations to  come.\n\nColorado and the United States owe Chairman Heart a profound  gratitude for his decades of service. We also thank Marie, his wife,  and their entire family.\n\nWorking with him has been one of the greatest honors of my life and  of my time in the Senate, and I wish him well in his retirement as…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…budget that will hurt  working families. It is a budget that will especially hurt families who  are struggling in poverty.\n\nRepublicans have succeeded in putting together a Marie Antoinette  budget, helping the richest of the rich while hurting the poorest of  the poor. Let them eat cake. That is the Republican motto.\n\nI have never seen such cruelty…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise today to honor Major Jennie Marie  Fregoso for her outstanding 25 years of service in the United States  Army. From May 2000 to July 2025, Major Fregoso exemplified the Army's  core values of duty, honor, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my privilege to extend  warm congratulations to Sylvia Marie Thornton on the occasion of her  98th birthday. Sylvia was born in Bainbridge, Georgia, on November 29,  1927, and this momentous milestone will be joyfully celebrated with…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697547/recognizing-sylvia-marie-thornton-on-her-98th-birthday"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Mallon, Elaine: Washington       Examiner; Malone, Kelly: Canadian Press; Malone, Scott:       Thomson Reuters; Mann, Ted: Bloomberg News; Marcus, Ilana:       New York Times; Marie Courtois, Theo: Agence France-Presse;       Marimow, Ann: Washington Post; Mark, David: Washington       Examiner; Marlow, Iain: Bloomberg News; Marrow, Michael:       Breaking…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…concentration camps, and island-hopping across the Pacific.\n\nWhen the war ended, Clyde returned back home. This Hoosier boy  married. He was wed for many years to his late wife Marie. He worked  for and then owned a small business. He dedicated himself to his  community and his church. He is still spending his energy to this day  on behalf of New Hope Christian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…grants each year. Over the past  century, they have raised more than $1 million to support organizations  such as Centre Volunteers in Medicine, the Tides Program, the Jana  Marie Foundation, and Centre Safe.\n\nTheir impact goes far beyond fundraising. Whether promoting literacy,  supporting youth mental health, or investing in dental care, their work…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691117/recognizing-state-college-kiwanis-club"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Mr. Speaker, I rise today to recognize Marie and David  Troy of Greenwich, New York for their admirable patriotism.\n\nMarie Troy is a lifelong New Yorker and resident of Washington  County. For four years now, she and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…BROADCASTING CORPORATION;       Clarke, Casey: FOX NEWS; Clarke, John: FEATURE STORY NEWS;       Clarke, Kayla: FOX NEWS; Clarke, Megan: FOX NEWS; Clary,       Gregory: CNN; Claudet, Marie: CBC (CANADIAN BROADCASTING       CORPORATION); Clemons, Steven: AL JAZEERA ENGLISH; Clifford,       Jordan: NEXSTAR MEDIA GROUP; Clifton, Jackson: CNN; Climaco,       Manuel:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…he successfully bid for and  coordinated American Legion conventions for fourteen consecutive years.  In this role, he also secured future convention dates in Sault Sainte  Marie, ensuring the continued success of these important gatherings.\n\nHis commitment extends beyond organizational leadership. As Commander  of Post 44, Mr. Carlson spearheaded a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694083/recognizing-raymond-e-carlson-as-the-2025-upper-peninsula-veteran-of-the-year"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…courage of their family  members who gave the gift of life on their behalf: Chase Agudelo, Seth  Anthony Beyrooti, Michael Robert Brown, Shawn Carpenter, Jose Collins,  Linda Marie Couch, Giovanni Cruz, Brooke Dawkins, Andrew Dorsey, Blake  Eden, ``CJ'' Jordan-Michael Grey, Melissa Houser, Kory Humphrey, Jacob  Monroe, Tribhawan Anand Persaud, Dylan Rowe,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691332/fourteenth-annual-footprints-in-the-sand-kidney-walk"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Marie Bienkowski has made to our community  through her volunteerism as part of the Save Crystal River Board of  Directors. She has helped forge a path to secure more than $50M in…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691243/recognizing-marie-bienkowski"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Hawaii,   Jim Costa of California, Laura Gillen of New York,\n\nJames Himes of Connecticut, Chrissy Houlahan of Pennsylvania, Marcy  Kaptur of Ohio, Jared Moskowitz of Florida, Marie Gluesenkamp Perez of  Washington, and  Tom Suozzi of New York.\n\nThe other 200 Members who were present chose not to censure that  conduct. I find that remarkable. Indeed, the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}]