[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…The fifteenth and final Wishes & Heroes Benefit Concert marks the  culmination of an incredible journey. Corey's dedication, passion, and  commitment have left an indelible mark on our community. She has  inspired others to give back and has demonstrated the power of music to  heal, uplift, and unite.\n\nOn behalf of the Sixth Congressional District of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Maryland for more than four decades. His patriotism, mastery of the  legislative process, and steadfast commitment to America's working  families have left an indelible, positive mark on our Nation.\n\nSteny has been a steady presence in our Caucus and the Democratic  leadership and a valued colleague. He has been a great leader in  bipartisanship in this body.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…buts about it. I hope the President makes that clear today.                            Operation Midway Blitz\n\nMr. President, on an unrelated topic, this coming weekend will mark 2  months since President Trump launched his so-called Operation Midway  Blitz in my home State of Illinois. The Presiding Officer will remember  what it is all about. The President…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Kathie Brewington and A.J. Woodson;\n\nIn White Plains-Greenburgh, Janice Griffiths;\n\nIn Port Chester-Rye, James Henderson III.\n\nI also recognize other leaders such as Minister Mark McLean, Reverend  Frank Coleman, and Reverend Margaret Fountain-Coleman.\n\nTheir hard work and principled advocacy for equal rights, economic  justice, and education warrants…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that the public understand that these rivers,  particularly in Snohomish and Skagit Counties, are going to reach  catastrophic levels, literally 4 to 5 feet above the historic mark of  these rivers. So this weather event of what is called an atmospheric  river, bringing about this much precipitation into our region is going  to cause the need for evacuations.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…keeping Mill Creek's unique identity  intact.\n\nMr. Speaker, I ask my colleagues to join me in thanking Mayor  Holtzclaw for his leadership and service. He has left a lasting mark on  Mill Creek, and I wish him well as he begins the next chapter of his  life.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "Mr. HARDER of California. Mr. Speaker, I rise today along with my  colleague, Congressman Mark DeSaulnier, to recognize and celebrate the  retirement and career of Stacey Mortensen, whose visionary leadership  has transformed public transportation across the Central Valley…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696403/recognizing-the-retirement-and-career-of-stacey-mortensen"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today with a heavy heart and  growing concern for the safety of our democracy.\n\nOn June 14, in Minnesota, Speaker Emerita Melissa Hortman and her  husband, Mark, were gunned down in their home. That same night, State  Senator John Hoffman and his wife, Yvette, were shot and wounded in a  separate attack. These were not random acts of…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692857/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…orchestra, on the stage and in the art room.  They brought home a golf State championship and led the football team  all the way to the State championship game.\n\nThey left their mark on Kettle Run, and I look forward to watching  all that they will accomplish in the future.\n\nI congratulate the class of 2025 of Kettle Run High School.                Recognizing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…security. It remains one of  the most effective tools we have to reduce nuclear risk while  maintaining a credible deterrent.\n\nThe expiration of New START without a successor would mark a  dangerous turning point, signaling that restraint and verification no  longer matter.\n\nThis Special Order hour is about sounding the alarm, but it is also  about reaffirming…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "Mr. TRAN. Mr. Speaker, I rise to mark the beginning of the most  solemn month of the year for Vietnamese Americans and diaspora. We  refer to this month as Black April, or Thang Tu Den, because so many of  us lost…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…and commitment to being a voice for the community. Though  Jim has passed, his legacy and impact on his community will remain long  past our mortal lifetimes. I am reminded of Mark 10:45--``For even the  Son of Man did not come to be served, but to serve, and to give his  life as a ransom for many.'' Jim's life was one dedicated to serving  others in need,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, I want to thank Senator Mark Kelly for  bringing people to the floor to talk about that which is,  unequivocally, the greatest threat to American democracy right now. It  is the cancer that is metastasizing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…government and programs that can  serve everyone, but when the fraudsters themselves claim to have the  fix, the American people see right through it.\n\nYet, DOGE's end does not mark the end of our work. We know that the  time to organize is now, that we must stay focused and resist the  barrage of distractions designed to sap our resolve, that we must…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697304/ode-to-doge"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…tattoo they may have. And at  the end of the day, due process means they get an actual determination  of guilt or innocence, instead of getting disappeared with a question  mark.\n\nBut no one here was told they are facing x years in a foreign prison.  There is no end date in El Salvador because there was no sentence,  because there was no trial. There…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…political violence.\n\nEarlier this month, a deranged gunman shocked the State of Minnesota  and this entire Nation by murdering Speaker Emerita Melissa Hortman and  her husband, Mark, and attempting to kill State Senator John Hoffman  and his wife, Yvette.\n\nI am absolutely devastated by this terrifying act of violence. While  I didn't know Melissa Hortman…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…support H.R. 469, the  Semiquincentennial Congressional Time Capsule Act.\n\nThis nonpartisan legislation would authorize a time capsule to be  buried on the Capitol Grounds to mark the Nation's semiquincentennial.  America is turning 250 on July 4, 2026. This time capsule represents  one way that Congress will participate in the Nation's yearlong  celebration…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, the so-called wealth tax being  proposed in California has now caused individuals worth a combined $1  trillion, by some estimates, to leave the State. The latest are Mark  Zuckerberg and Steven Spielberg. Others include Larry Ellison and the  founders of Google, Larry Page and Sergey Brin, among many others.\n\nThe wealth tax would confiscate 5…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, as we prepare to mark Memorial Day, a  time to honor those who gave their lives in defense of our country, I  rise today to recognize the enduring service and sacrifice of the  Washington Army National…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691526/recognizing-washington-army-national-guard-1st-battalion-161st-infantry-regiment"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…dedication to historic preservation,  volunteerism, and community service. Her passion for preserving the  cultural and architectural heritage of our town has left an indelible  mark, ensuring that future generations can appreciate and learn from  the past. For many years, Andrea has been a champion of historic  preservation, tirelessly advocating for the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…toward  achieving their goal of equipping these communities with the resources  needed for self-sufficiency.\n\nAmericans for Native Americans continues to leave an indelible mark  on the Hopi, Navajo, and Zuni Nations in the American Southwest. I rise  to recognize the incredible accomplishments of this esteemed  organization and I commemorate their…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…my good friend Chairman Bost and Ranking Member Takano for  their support in advancing this bill as one part of the effort to  support our veterans.\n\nI also thank my friend Mark Berry, a former adjutant general for the  great State of Arkansas and a former State representative, for his  advocacy on behalf of our veterans on this issue. Mark brought…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…2025 Elected City Official of the Year by the Kentucky League of  Cities.\n\nMayor Cotton's exemplary leadership, dedication, and service to his  community have left an indelible mark on the city of Madisonville and  the Commonwealth of Kentucky.\n\nSelected from nominations all across the State, Mayor Cotton stood  out for his innovative, hands-on approach…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696906/recognizing-mayor-kevin-cotton"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…wife, Yvette Hoffman;\n\nWhereas the gunman then entered the home of Minnesota State       House Speaker Emerita Melissa Hortman and assassinated her       and her husband Mark Hortman;\n\nWhereas the gunman had documents that listed dozens of       lawmakers targeted for assassination;\n\nWhereas the law enforcement officers of Brooklyn Park and…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…endangered species listing, but that is what happens when  administrations make bad decisions.\n\nMr. Speaker, first, I acknowledge and agree with my friends from  across the aisle. Mark Twain was correct. The more I learn about water,  the further west you go, the more it is for fighting. We can agree on  that.\n\nMr. Speaker, I also want to try to help them…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…achievements during  Hurricanes Helene and Milton, coupled with their dedication to long- term recovery and cutting-edge approaches to disaster management, have  left an indelible mark on Pasco County.\n\nIt is clear Kyle Smith has made a profoundly positive impact on our  community with his work as part of the Pasco County Human Services  Team, and I am grateful…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…CALVERT. Mr. Speaker, I rise today to congratulate Eastern  Municipal Water District (EMWD) as it celebrates a major milestone in  the district's history. This year, EMWD will mark its 75th Anniversary  and a proven legacy of service to our community.\n\nEMWD was established on October 16, 1950, through a public vote by  San Jacinto Valley property owners…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696365/congratulating-the-eastern-municipal-water-district"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…were more than a quarter of their follow recommendations for people  that they suspected were child predators.\n\nOf course, Meta was very well aware of what was going on. Yet Mark  Zuckerberg reportedly refused to strengthen the platform's safety teams  because--guess what--he didn't want to spend the money to fix the  problem. Now, 6 years later, Meta's…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…confront those who wish us harm.\n\nIt also prioritizes strong and resilient communities by bolstering  disaster preparedness, response, and recovery efforts. Subcommittee  Chairman Mark Amodei prioritized safety at every level. Even in the  face of political challenge, he and the ranking member, Mr. Cuellar of  Texas, worked together to produce a serious and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…had the honor to work with her on various issues, both here in  Congress and in the Minnesota State Senate. Her dedication to the  healthcare community has left a permanent mark on Minnesota.\n\nMr. Speaker, I thank Mary for her decades of service, and I wish her  a long, happy, and well-deserved retirement.                      Recognizing Richard ``Dick''…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698583/recognizing-mary-krinkie"}]