[{"senator": "Al Green", "party": "Democrat", "sentence": "…their hearts and were determined to prevent people of color  from having the same rights that they enjoyed, meaning the people who  were Anglos enjoyed--this Bloody Sunday is marked by violence, but it  is also a mark in history that gave us the 1965 Voting Rights Act.\n\nThe 1965 Voting Rights Act was signed on August 6, 1965, by Lyndon  Johnson. Here is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…a trailblazer in American  aviation is preserved every time a plane lands at that field along the  Mississippi River.\n\nIn 2008, when Delta and Northwest Airlines merged, it marked not the  end of Northwest's legacy, but its continuation. Delta wisely built  upon Northwest's deep roots in Minnesota and throughout the Upper  Midwest, ensuring that the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Melania Trump  launched her memecoin.\n\nOn March 25, 2025, World Liberty Financial launched a dollar-pegged  stablecoin just 1 week before the House Financial Services Committee  marked up stablecoin legislation and 2 weeks after Senate colleagues  held their markup.\n\nOn March 31, Eric Trump and Donald Trump, Jr.'s, American data  centers merged with American…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…author of the bill.\n\nMrs. WATSON COLEMAN. Madam Speaker, I thank my colleague for  yielding.\n\nMadam Speaker, the signing of the Declaration of Independence on July  4th, 1776, marked a turning point not just in our Nation's history but  in the global pursuit of democracy and self-governance. The work  remains unfinished, and each generation has been tasked…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that  day. We cannot and we must never forget what happened that day.\n\nJanuary 6 was not an isolated incident. It was the first page in  Trump's authoritarian playbook. It marked the start of Trump's  sustained attack on our democracy, on the legitimacy of our elections,  on our government institutions. In just the last year, Trump has  unlawfully imprisoned…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…congratulations to the congregation of First African Baptist  Church in Columbus, Georgia, as they celebrate a remarkable 185 years  of faith and community. This great occasion will be marked by a  celebration at the church on Sunday, August 10, 2025, at the church in  Columbus.\n\nFounded in 1840 by enslaved individuals in the antebellum South,  First African Baptist…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…even while enslaved, segregated, and denied  basic rights.\n\nDuring the American Revolution, Black patriots fought in the  Continental Army. Just this summer, as our Nation marked the birthday  of the United States Army, we also lifted up Black heroes too often  left out of history, men like Mr. Clyburn mentioned: Salem Poor, Peter  Salem, James Armistead…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Manhattan Project's Los Alamos Laboratory in a way that--it was widely  believed then and is to this day--no one else could have done.\n\nThe use of the atomic bomb against Japan marked the end of the Second  World War. It also demonstrated to the world that a war between two  nuclear powers would be cataclysmic for both and potentially  apocalyptic for the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the most vulnerable: our  children. Too often, fentanyl is peddled in the open on some of the  world's largest social media platforms.\n\nWhen the Senate Judiciary Committee marked up the HALT Fentanyl Act  last month, I filed amendments that would finally hold these companies  accountable and demand they put safeguards in place to protect our  children.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, this week marked a stunning  milestone: 100 days of chaos, cruelty, and lawlessness under the Trump  administration. We see it in our economy, in our homes, and in our  relationships abroad.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…the lifeblood of our country  and the jobs in our country.\n\nMr. Speaker, I thank the gentlewoman from Missouri (Mrs. Wagner) for  agreeing to these changes when this bill was marked up in committee.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bill, and I  reserve the balance of my time.\n\nAgain, I thank the gentlewoman from Missouri (Mrs.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693959/small-entity-update-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…language  to children in Virginia. Tamil, one of the world's oldest languages, is  spoken by over 80 million people globally, including 360,000 Americans.\n\nThis past weekend marked a major milestone: the VTA's 15th Annual Day  Celebration.\n\nI was honored to join students, families, and community leaders to  celebrate and recognize the work that has been…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692089/recognizing-valluvan-tamil-academys-15th-annual-day-celebration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Supreme Court has recognized  that children are ``constitutionally different from adults for purposes  of sentencing.''\n\nIn these cases, the court noted that childhood is marked by  ``rashness, proclivity for risk, and inability to assess  consequences.'' The court said its decisions ``rested not only on  common sense--on what any parent knows--but…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…with them  to demand justice and accountability.\n\nShireen Abu Akleh, an American-Palestinian Journalist, was killed on  May 11, 2022. She was killed while wearing a clearly marked press vest  on assignment, reporting on a military raid that took place in the  Israeli occupied city of Jenin. Shortly after her death, I led a  letter, signed by 58 Members…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…until CISA releases it, I must object to this  nomination.\n\nCISA permitted my staff to read the report in person at the Agency's  office in the fall of 2023. However, CISA has marked this unclassified  report ``For Official Use Only'' and has refused to provide copies of  the report to Congress and in response to FOIA requests from the  public. I directly…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…fighter, and a leader who has paved the way for so many in Omaha. As a  prominent politician and community leader from North Omaha, she has  established a historic career marked by several firsts for African- American women in Nebraska.\n\nShe was the first African-American woman to serve on the Omaha City  Council and president of the Omaha School Board…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…resided in an assisted living  community where he is deeply loved by residents and staff alike. I am  told that they are all watching today.\n\nOn his 109th birthday, it was marked by a joyful celebration of  family, friends, and community members gathering in great numbers.  Surrounded by his two daughters and loved ones, the occasion was  fittingly…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Army from 1970 to 1974, including time stationed in Germany, and  later in the Army Reserve until his honorable discharge as a Captain in  1981. His service to our Nation was marked by integrity and continued  through his 35 years dedicated to public education in Texas. He worked  as both a teacher and administrator, with 16 of those years at Cuero  ISD.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690584/recognizing-the-retirement-of-bill-matthys"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, yesterday marked 100 days  since President Trump took office for the second time. It has been a  whirlwind 100 days, to say the least, as his administration has taken  swift action to reverse…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…advancing  the cause of global democracy, particularly during the most recent  disruptions in the freedom and democracy landscape globally and within  the United States.\n\nIn an era marked by profound challenges to democratic institutions,  Ms. Boyajian has demonstrated unparalleled leadership and resolve.  Relentlessly, alongside the entire leadership team and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the safety and prosperity of the Colombian  people.\n\nPresident Uribe assumed office in 2002 during one of the most  challenging periods in Colombia's modern history, a time marked by  violence, narco-terrorism, and instability. Through his bold and  visionary ``Democratic Security'' policy, President Uribe restored law  and order, dismantled the strongholds…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…ensures that his legacy not only  endures but continues to shape future generations.\n\nMr. Speaker, I offer my congratulations and deepest gratitude. May  the next fifty years be marked by continued growth, service, and  achievement. I ask my colleagues to join me in extending heartfelt  congratulations to the faculty, staff, and volunteers as they celebrate…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696635/recognizing-the-50th-anniversary-of-the-philip-jaisohn-memorial-foundation"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…County Transportation  Authority, the San Bernardino Council of Governments, and the Victor  Valley Wastewater Reclamation Authority. Her service on these bodies  has been marked by professionalism, collaboration, and a deep  commitment to transparency and good governance.\n\nDebra's accomplishments would not have been possible without the  support of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…years in two separate stints and  joined the organization as their Chief Operating Officer in 2008.  Following the departure of Gerry Meck, Bill became CEO in 2010 and has  marked his tenure as a vocal advocate for people with disabilities.\n\nBefore his position with UDS, Bill was the Chief Operating Officer  for the Inglis Foundation, a Philadelphia…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690790/congratulating-bill-kepner-on-his-retirement"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the innovators building the future of  finance.\n\nFor years, American entrepreneurs and developers in the digital asset  space have been forced to navigate a regulatory maze marked by  conflicting guidance, shifting definitions, and enforcement actions in  place of actual rules. These inconsistent conditions have stifled  domestic innovation, discouraged…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…deployment, while routine at the beginning, was set to be  special before anybody stepped foot on the ship.\n\nAs it was, Fighter Squadron 14's final deployment with the F-25  Tomcat marked the end of an era. Once this mission was complete, the F- 14 would be retired, and in its place the squadron would transition to  the F-18 Super Hornet.\n\nWith both excitement…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…County, Pennsylvania  has served the Neshaminy School District for the past 32 years. On July  1, Principal Kern retired from his career in public education, closing  a chapter marked by educational leadership, unwavering support for  students, and dedicated service to his community.\n\nIn August 1993, Principal Kern began his career in education as a  Music…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…York High School by just three shots for the victory. This hard-fought  win secured Tabb a well-earned berth in the Virginia High School League  (VHSL) state tournament and marked a historic return to regional  prominence for the golf team.\n\nMr. Speaker, I ask you to join me in congratulating the Tabb High  School Tigers Golf Team of York County, Virginia.…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696433/congratulating-the-tabb-high-school-tigers-golf-team"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…occasion to honor her outstanding service and dedication to our  communities.\n\nBased in the Greater Philadelphia region, Ms. Kelly Botti has built a  distinguished career marked by integrity, compassion, and an unwavering  commitment to financial empowerment. As CEO of Trumark Credit Union,  she has championed innovative approaches to serve the underserved…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…dedication to mission and to the Airmen and women with whom  he served.\n\nAfter earning his degree from the University of Iowa, Colonel Twedt  received his commission in 1999. This marked the beginning of a new  chapter in a remarkable career that advanced from the enlisted ranks to  the highest levels of leadership within the Iowa Air National Guard.\n\nHis service…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}]