[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Palisades and other fire-prone areas.\n\nMr. SHERMAN. Mr. Speaker, my party has put confidence in me and made  me the chief Democrat dealing with the Subcommittee on Capital Markets.  Our SEC oversees our capital markets which are the nerve center of  global capitalism. Virtually all the most powerful companies in America  and really the world focus on…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…President has done is, unleashed an economic chaos on  the American people. Recessions are normally caused by complex factors  like oil price shocks, overleveraged financial markets, or global  pandemics.\n\nThis new economic disaster isn't caused by war or by an act of  nature. It is the result of one man who lied to the American people.  His name is Donald…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…that is involved in this iteration of the  bill that will inform us about ways to improve the bill.\n\nAs we look at healthcare as a whole, it is one of those sort of  broken markets that we have. We have 60 percent  of folks who get healthcare through their employer or government or  labor unions. We have another group of people who are disabled who get…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…or possessing a big enough bank account have access to  them. Anyone can tell you that just because you have a lot of money,  that doesn't make you knowledgeable about the markets. Knowledge is the  key here, and the definition needs to be revised to center around this  core concept of knowledge and expertise.\n\nThe committee has heard from investors…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the big  oil industry sees California's clean cars and clean truck sales as  existential threats. California has made tremendous advancements not  just in technology but in markets, but that is why the fossil fuel  industry has launched an all-out assault on California's rules.\n\nI will give you just one example. If you happened to be reading the  Wall…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…allows women, people of color, and those of  every demographic to grow businesses and buy services and products that  expand our economy and make us competitive in worldwide markets.\n\nThen, there is the morality of helping others. The Good Samaritan  stopping by the roadside to help a beaten stranger not of his own  religion is a testament to: ``Who is…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…consumers are vulnerable to scams, and  businesses are desperate for the regulatory clarity they need to  compete with foreign countries, foreign entities that do business in  our markets effectively.\n\nDoing nothing and protecting the status quo is not only  irresponsible, it is unacceptable. Unlike the United States, our global  competitors have moved to regulate…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Solar power is set to account for nearly 80% of the global       increase due to its low costs and faster permitting       processes.\n\n``In addition to growth in established markets, solar is       set to surge in economies such as Saudi Arabia, Pakistan and       several Southeast Asian countries,'' Executive Director Fatih       Birol said. ``As renewables'…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…a global evolution in the way we  communicate. If we lead the race for next-generation wireless, then  this global technology will be based on our values, democracy, open  markets, and transparency.\n\nIf we fall behind, our foreign adversaries will have a new way to  expand their reach. That means less openness, less security, and more  top-down control.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690227/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…that, regardless of  what period of time you examine, IPOs from about $30 million up to  about $200 million are always subject to a 7 percent fee. Now, all of  us who observe markets know that that is odd behavior in what should be  a competitive market.\n\nThis is money, of course, that goes to the investment banks that  underwrite these IPOs. I know this…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693905/middle-market-ipo-cost-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…And burning more fossil fuels intensifies climate chaos and wildfires  and  hurricanes. It blows the top off the cost of insurance for people's  homes as insurers flee the markets. That is Trumpflation.\n\nMeanwhile, fossil fuel companies make even bigger profits. Families  lose; billionaires win.\n\nYou know, this is not a red State or a blue State issue.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…have rules. Rules-based trade is essential  to have predictable and stable trade and promoting economic growth and  development and global cooperation.\n\nNo doubt, opening up markets has grown the pie, not just for those  economies, but for the U.S. economy. When you establish clear rules- based mechanisms, you can also resolve trade disputes and encourage…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Across our country, millions of working families are battling rising  costs, our elders are targeted by financial scams, and investors are  trying to recover from volatile markets. Republicans are ignoring all  of that to prioritize the crypto industry's wish list.\n\nTo be clear, the people deserve crypto legislation that is fair,  transparent, and accountable,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693786/digital-asset-market-clarity-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…occupy and govern  all these countries to reverse that history? Would the President wield  our military as tax-funded security for the expansion of American oil  giants in these markets?\n\nRemarkably, incredibly, this seems to be his plan. President Trump  has floated sending American troops to secure U.S. companies to rebuild  Venezuela's oil infrastructure.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…has injected uncertainty into the  marketplace.\n\nAt the same time, the administration is doubling down on fossil fuel  policies that leave families exposed to volatile global markets and  rising prices.\n\nMr. Speaker, let's be honest about what is happening. Families are  paying more because this administration is choking off the supply of  clean, low-cost…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…revisions to address concerns raised by the ranking member.\n\nI thank Chairman Hill for advancing this bill, as well as my  colleague, the chairwoman of the Subcommittee on Capital Markets, and  Congressman Gottheimer for his partnership.\n\nThe HALOS Act builds on the bipartisan success of the JOBS Act and is  a commonsense step forward to modernize our rules…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…American families who are paying the price.\n\nAs one of the fastest growing States in the Nation, this is a harsh  reality for Utahns. We face one of the most expensive housing markets  in the Nation, and too many families are being priced out of the  American Dream.\n\nThe truth is simple. When the government makes it slow, expensive,  and unpredictable to…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…all of us. Whether it is helping our seniors access telehealth services  or allowing students to complete homework assignments or enabling small  businesses to reach global markets, our people, country, and economy  run on a reliable internet connection.\n\nFarmers in rural Ohio also know that reliable broadband connections  are essential to their operations.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…see their revenue continue being eaten up by  input suppliers.\n\nSo we need to do what we can to ensure that competition in seed and  fertilizer industries is fair and that markets are transparent to our  farmers. That is a very important consideration, at this very time, as  the Trump administration and we Members of Congress look to provide aid  to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697521/farmers"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…I didn't put my foot down and say, ``No one is  going to fill that seat until this investigation is done,'' that we  could have literally had headlines across all financial markets that  the United States no longer has an independent Federal Reserve.\n\nUnless you track it as closely as I have, in my current role as  Senator and in my past role as a partner…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…investment policy with private-sector entities based in       trusted countries encourages other countries to reciprocate       and enable the United States to open new markets abroad for       United States companies and their products;\n\n(4) while foreign direct investment by responsible private-      sector entities based in trusted countries can…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…importantly,  users of digital assets.\n\nThis regulatory certainty means that all parts of the ecosystem can  engage with digital assets with confidence. It promotes healthy markets  by establishing commonsense requirements to protect consumers. Those  are all built on the existing requirements in the financial services  markets.\n\nSecondly, the CLARITY…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…jeopardized by politically motivated mismanagement. What I am  hearing is that, I think, this bill fixes everything that the other  side has been talking about as far as free markets and capitalism.\n\nFor those listening at home, it is important to understand how we got  here. In 2022, the Biden administration heavy-handedly put the  retirement security…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…U.S.  cooperation with our Indo-Pacific allies.\n\nThe Indo-Pacific is home to over one-half of the world's population,  vital trade routes, and rapidly growing economies and markets. It is a  region that I hold as a key priority as chair of the East Asia and the  Pacific Subcommittee of the House Foreign Affairs Committee due to its  significance to national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…forward on year-round E15.\n\nFarmers are hurting. Across the country, input costs and interest  costs are up. Our producers are also dealing with tariff pressures and  shifting markets, and at the same time, commodity prices are down. That  is a difficult combination for anyone.\n\nThe future of many farm families hangs in the balance both in my  State and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699351/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…subsidies for wind and solar energy paid  for by taxpayers.\n\nBy continuing to incentivize these intermittent energy sources with  generous tax credits, we are distorting energy markets, sending the  absolute wrong signal to investors, and spending hundreds of billions  of dollars in taxpayer money.\n\nWe must stop providing generous incentives that run contrary…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion of new debt.\n\nWhen the United States sells a 10-year bond and Greece sells a 10- year bond today, Greece has a lower interest rate than the United  States. When the debt markets think Greece is more creditworthy than  the United States--I don't know how to make it more simple. Why is it  so hard to tell the truth about the math?\n\nMr. Speaker, there…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "James Risch", "party": "Republican", "sentence": "…developing into a bipolar  position, where, on the one hand, you have democracies and semi- democracies like the United States, made of up of free people, of  capitalism, of free markets, of entrepreneurs, and of people who very  much value human rights and value the individual way, ahead of the  state. On the other hand, you have countries like China that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…are willing to be both the janitor and  the CEO, sometimes even on the same day. You have a growth mindset and  are willing to take on the challenges brought by fluctuating markets.  You both strive to progress into new areas but are willing to take time  for one-off projects in order to help an individual in your hometown.\n\nFor Wyoming's business community…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…if you have $38  trillion--and remember, we play this game. The United States does this.  Other countries don't do this.\n\nHere is $30 trillion that we have to go to public markets. People  from all over the world, primarily from the United States, buy our  bonds. It is in your pension. It is in the bank note you buy. There are  another several trillion…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]