[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…rights, so surely they wouldn't take away a State's right to  enforce their laws and have a voice in the pipeline siting process.\n\nDemocrats offered an amendment at our committee markup that would  have struck this provision, and Republicans voted against it.\n\nHere we are. Republicans are on the House floor pushing forward  legislation that actively and intentionally…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…launched a dollar-pegged  stablecoin just 1 week before the House Financial Services Committee  marked up stablecoin legislation and 2 weeks after Senate colleagues  held their markup.\n\nOn March 31, Eric Trump and Donald Trump, Jr.'s, American data  centers merged with American bitcoin, a bitcoin mining operation.\n\nOn July 8, Trump Media and Technology Group,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the grant  funding.\n\nSecond, Republicans made clear that rescissions from environmental  grant programs only touched funding that had not yet gone out the door.  During the markup of the Energy and Commerce Committee title for the  House version of this bill, the chair of the Environment Subcommittee  Mr. Griffith of Virginia made the following statements:…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government           Reform,      Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: The House       Committee on Oversight and Government Reform is scheduled to       markup fourteen bills tomorrow related to the operations of       the District of Columbia. With the exception of H.R. 2693,       the District of Columbia Electronic Transmittal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…down the community  relationships that we have with community banks.\n\nMoreover, I do not know why Republicans rushed this bad resolution to  the floor, bypassing a committee markup. That would have been prudent.  As I would point out, this resolution is actually a giant waste of  time, as it would rescind a rule that was already rescinded by the OCC.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…offerings  should be fully aware and knowledgeable of the risks involved.\n\nAs my friend and ranking member of the Financial Services Committee,  Ms. Waters, has said during our markup of this bill:\n\nJust because you have $1 million doesn't mean you       understand the complexities of the private markets. On the       other hand, you shouldn't be prohibited…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government           Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: The House       Committee on Oversight and Government Reform is scheduled to       markup fourteen bills tomorrow related to the operations of       the District of Columbia. With the exception of H.R. 2693,       the District of Columbia Electronic Transmittal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Ranking Member Scott and I introduced a  resolution of inquiry that was scheduled to be considered yesterday  during the Committee on Education and Workforce's reconciliation  markup.\n\nUnfortunately, while the markup was in recess, the Republicans  adopted a rule that blocks resolutions of inquiry from being  considered. It was especially frustrating because…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…construction in section 7(f)(4). This was always  the intent of the bill, as evidenced by the public discussion between  Senators of both parties during the March 13, 2025, markup in the  Committee on Banking, Housing, and Urban Affairs. The amended, final  version of the bill includes this negotiated rule of construction to  prevent State consumer protection…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692635/genius-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…ensure  that the strategy required by this bill prioritizes Afghan women and  girls, as well as our Afghan allies. These amendments, adopted with  bipartisan support during the markup, underscore that there remains  considerable areas of bipartisan consensus in the House about our  Afghanistan policy.\n\nUnfortunately, there is not a consensus about what the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government           Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: The House       Committee on Oversight and Government Reform is scheduled to       markup fourteen bills tomorrow related to the operations of       the District of Columbia. With the exception of H.R. 2693,       the District of Columbia Electronic Transmittal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Health and Human Services to  conduct research and education campaigns to prevent TB outbreaks caused  by contaminated human cell and tissue product donations.\n\nThrough the markup process, we have also included an important  provision to allow the Federal Government to pursue civil penalties  from providers who caused an outbreak of the infectious disease.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692765/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…from Flight Coffee roasters in Bedford, NH. They are  worried about the President's threat to place new tariffs on Brazil  because they have already been paying a 10-percent markup on coffee  because of these tariffs. Now they are facing a 50-percent tax on  Brazilian coffee starting on Friday, and they have no choice but to  charge consumers more. Their…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Chair, I rise in strong opposition to this bill.\n\nI was very proud of the markup that passed out of the Armed Services  Committee. The bill that we delivered to this floor this week was  overwhelmingly bipartisan. It supported our men and women in uniform…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…terrorist. It just means that someone's travel  patterns indicate a need for further scrutiny. It means they need more  detailed questioning to determine what is going on.\n\nDuring markup and during the Rules Committee meeting, we heard from  my Republican colleagues how the Department already publishes  information about known and suspected terrorists. That…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…those in the medical  community performing these grotesque procedures on children are  committing some serious harm. In fact, these procedures are so  grotesque that during the markup of this legislation, our colleagues on  the other side of the aisle had a hard time hearing these specific  procedures described. This begs the question: If they cannot bear…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…passed constitutional  muster with the House Legislative Counsel, CRS, and various outside  stakeholders. None of our Democrat colleagues brought up these concerns  during the markup.\n\nLet me say this. For those of us who have worked here in Washington,  D.C., for a decade, we are very aware of the crime, the repeat  offenders, and the juvenile crime rates…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…our offices to demand that Republicans  listen to them. Some are protesting in their wheelchairs.\n\nYesterday, I spoke to a disabled woman named Julie outside the  committee markup. Thirty-five years ago, Julie crawled up the House  steps to demand that Congress pass the Americans with Disabilities Act.  She is now back to beg for the bare minimum. She…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…athletes.\n\nOver the last few weeks, we have been talking a lot about the big,  beautiful bill, as it has been named. This morning, the Ways and Means  Committee adjourned from our markup after 18 straight hours. We went  through the night. Other committees did that as well. The Energy and  Commerce Committee recently finished up, just a few hours ago.\n\nI want…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, the appropriations process is officially  underway here in the Senate.\n\nLast week, the Appropriations Committee held its first markup of  appropriations bills for fiscal year 2026, and I am pleased to report  that the committee referred two bills to the floor with bipartisan  support. Today, I want to talk…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the  House and the Senate, respectively. I also recognize the work of  Representative Pete Stauber, who offered a thoughtful amendment during  our Natural Resources Committee markup to expand this bill to national  forests, refuges, and all public lands.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. Speaker, as we get ready to celebrate…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Chairman, this is essentially the same amendment  that my friend and colleague, Ranking Member Scott, offered last  Congress on the floor as well as this Congress during committee markup.\n\nSadly, the same serious problems remain, I believe. Instead of taking  the threats of foreign influence seriously, this amendment is  insufficient to protect our students…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Madam Chair, I rise in support today of the National Defense  Authorization Act. This bill is painstakingly thorough with over 900  amendments considered, over 13 hours of markup deliberations, and a  final passage vote in committee of 55-2.\n\nI am proud to offer my voice in support of the National Defense  Authorization Act for Fiscal Year 2026.\n\nIn…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Energy  and Commerce Committee in January of this year and was a critical farce  in making sure committee markups and hearings went smoothly, including  a nearly 27 hour long markup to help pass our portion of President  Trump's One Big Beautiful Bill.\n\nSoon, Emily Hale will depart the House Committee on Energy and  Commerce to serve another member of…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…transfer the parcel directly to the club.\n\nMr. Speaker, I thank Representative Comer for working with the  Natural Resources Committee to amend this bill during our committee's  markup to ensure that this area remains dedicated to public and  recreational purposes in perpetuity. This is a commonsense bill that  cuts red tape, empowers local leaders, and strengthens…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…need more national oversight, and that is  precisely what my bipartisan bill, authored together with Mr. Costa,  will do.\n\nMr. Speaker, I am calling today for an immediate markup of this  legislation so that we can get it passed through the House and signed  into law in order to protect our communities.                      California High-Speed Rail…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…DC.\n\nDear Chairman Comer: I am writing to respectfully clarify       my intent regarding a vote I cast during the House Oversight       and Government Reform full committee markup held on September       10, 2025. Because of miscommunication during the evening vote       series, my recorded vote on H.R. 5143, the District of       Columbia Policing Protection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…controlled items through the cloud and finally  close this loophole.\n\nThe Remote Access Security Act received unanimous support in the  House Committee on Foreign Affairs during markup, passing with a  bipartisan vote of 51-0.\n\nMr. Speaker, I thank Chairman Mast, as well as my bipartisan co- leads, Speaker Johnson, and Leader Scalise for helping to move this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…have to  tell you, it doesn't help that the House wasn't even here. For 6  straight weeks, House leadership decided to cancel our sessions, every  oversight hearing, every markup of legislation, everything. Why? To  this day, there has been no coherent rationale offered.\n\nThroughout this time, I warned that this was not only holding back  our own legislative…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…needs to go. We know the challenge isn't the access  to gas, it is actually moving it to where it needs to be.\n\nWe need to work together. I think Natural Resources today had a  markup, T&I is working on a markup, and we hopefully can work together  as Members across the aisle in the Energy and Commerce Committee to do  our share to make sure this explosive…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}]