[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…the mom in Gresham who can't take unpaid time off to track  down new documents. It is for the woman in Hood River whose name no  longer matches her birth certificate after marriage and who lacks the  $160 it costs to get a passport. Are we really going to tell her she  doesn't have a right to vote?\n\nI ask my Republican colleagues to show courage in this…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…recommendations.\n\nAs a key member of my senior staff, Andrew has been at the center of  my legislative work. He was instrumental in helping pass my landmark  legislation, the Respect for Marriage Act, which enshrined marriage  equality into law. Andrew worked tirelessly to ensure its passage in  both the House and the Senate, and it was a privilege to celebrate with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…clear that under his  constitutional philosophy, there is no protection for rights that most  Americans take as fundamental, including the rights to reproductive  freedom, marriage equality, and even private consensual relationships.  That is not constitutional interpretation; it is a radical blueprint  for rolling back decades of progress on individual…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…impressive skill set, and his  friendship. He has been by my side when I faced the toughest primary  challenge of my career, when we fought together to pass the Respect for  Marriage Act into law--ensuring marriage equality for LGBTQ+ families  across the country, and to make the Pregnant Workers Fairness Act the  law of the land.\n\nMatt has worked for…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…other drastic cuts to foreign aid have already reduced or eliminated  food aid for many families, forcing parents to remove their young  daughters from school and into child marriage, increasing sexual  violence and the risk of pregnancy-related deaths.\n\nThis administration's ideologically driven disregard for global  public health worldwide is appalling.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…need a birth certificate that states their current legal  name. This act could suppress the votes of millions of women in this  country who have changed their names after marriage.\n\nTo be clear, if you are a married woman, I guess Republicans don't  want you to vote. If you can't afford a passport, Republicans don't  want you to vote. If you are a college…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…administration.  One out of four Americans--69 million women--would have to navigate  barriers that should not be necessary to vote because they changed  their last name after marriage. Republicans claim that this new version  will ``fix'' this problem by adding in a provision about affidavits to  prove identity. However, the bill remains vague, leaving…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…additional proof of citizenship, a  requirement that excludes nearly all driver's licenses and REAL IDs  issued today.\n\nFor women who have changed their names, often through marriage, this  means showing a passport or a birth certificate that may not match  their legal name. That would have meant that my grandmother, who had  long since lost her birth…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to honor Mrs. Emily McLaughlin  Wisniewski and Mr. Branden Anton Ehrenreich, who were joined in  marriage on Saturday, April 26, 2025. This special occasion celebrated  the love between two remarkable individuals and marked the beautiful  journey they have shared together. This…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690468/recognizing-the-marriage-of-emily-mclaughlin-wisniewski-and-branden-anton-ehrenreich"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…vote. Sixty-nine  million American women--one out of four Americans would face an  additional burden to register to vote simply because they changed their  last name after marriage. Simply put, this Republican bill is about  voter suppression.\n\nIn 2012, Minnesotans rightly rejected a state constitutional  amendment that would have imposed voter ID requirements.…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Further, under the SAVE Act,  almost 70 million American women will be unable to register to vote  using their birth certificate simply because they changed their name  upon marriage. The bill would disenfranchise survivors of domestic  abuse who have changed their names for safety purposes, which is truly  shocking.\n\nThe SAVE Act will also have a steep…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…lot. It makes it harder for families  impacted by natural disasters who lose documents. It makes it harder  for the nearly 70 million women who have changed their name after  marriage and have a birth certificate that no longer matches their  voter IDs. It also makes it harder for the half of Americans who don't  have passports.\n\nThe President claims that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700001/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…are not  always easy to come by for certain Americans.\n\nThis backward legislation would immediately disenfranchise the 69  million women who have changed their names after marriage or divorce  and do not have a matching birth certificate. There is no cure in this  bill.\n\nMillions of Americans would be forced to navigate the complicated  process to change…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690015/safeguard-american-voter-eligibility-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…ceremony.\n\nBeyond his extraordinary career achievements, Gerard has always been  a dedicated family man. He and his lovely wife, Julie, are celebrating  nearly 32 years of marriage, and enjoy the company of their four  children and respective families, Mary Kate Rohlfs (Brock), Caroline  Riese (Ian), Matthew Grimaldi, and Gabrielle Grimaldi, as well…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, 10 years ago today, our Nation made a  remarkable step toward equality with the legalization of gay marriage.  This was a day that came after decades of advocacy by individuals and  organizations across the country, including Garden State Equality in my  home State of New Jersey.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693017/fighting-for-lgbtq-rights"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…yesterday in this building, we had a panel  put together to address the situation of the lack of two-parent homes  in America and the degree to which it is caused by huge marriage  penalties in our welfare system.\n\nThe panel consisted of Matt Dickerson of the Economic Policy  Innovation Center, Terry Schilling of the American Principles Project,  Jamie…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…of  a non-Muslim is deemed inadmissible. In an Islamic sharia court, the  only testimony allowed is that of a Muslim. That is hardly fair and  impartial.\n\nSharia prohibits marriage between a Muslim woman and a non-Muslim  man. A Muslim man may marry a Christian wife, but not vice versa.  Sharia also gives the man, but not the woman, the unconditional…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…retired from the Center for Arizona Policy after  serving 20 years as president.\n\nCathi dedicated her life's work to promoting and defending the  sanctity of life, traditional marriage and families, and religious  freedom.\n\nShe joined CAP in 1997, shortly after its founding, as legislative  counsel. Upon retirement of CAP's founder, Len Munsil, in 2005,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690597/congratulating-cathi-herrod-on-retirement"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…served the Minerva community as a volunteer fireman where  he currently serves as their treasurer.\n\nAlongside his wife, Linda Matocha Masur, Danny has dedicated 58 years  of marriage to raising four children and has extended his love and  commitment to nurturing nine grandchildren and one great-grandchild.\n\nDanny's heart has never left the sky. As a pilot…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…is Kate Millett, who has been described as the mother of women's  studies classes which dot our universities around the country: ``The  complete destruction of traditional marriage and the nuclear family is  the `revolutionary or utopian' goal of feminism.''\n\nLinda Gordon, another prominent feminist: ``The nuclear family must  be destroyed. . . . Whatever…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…another parent at home, you are eligible for low-income  housing, which means almost no rent and the ability to get away from  your parents.\n\nOther programs that also discourage marriage, programs that you would  lose eligibility for if both parents were working and had a child are  the food-share programs, the Medicaid programs, the earned income tax  credit,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…married because they lose $20,000 or $25,000 a year.\n\nIndeed, in this program, we are expanding the Pell Grant program. It  is a program that was one of these things that has a marriage penalty  associated with it.\n\nWe are expanding the low-income housing tax credits. While some of  those credits do not come with a marriage penalty, particularly when  coupled…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…University, followed by North Carolina State  University, where he received a graduate degree in mathematics.\n\nHe married Lena Lockamy, with whom he shared 48 wonderful years of  marriage before Lena passed into her eternal heavenly home nearly 5  years ago.\n\nRichard and Lena had one son, Marcus, who, in his own right, is now a  wonderful man.\n\nProfessionally,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Program and  Logistics Management program. In 1971, he married his high school  sweetheart, the love of his life, Paula Graham Lewis, with whom he has  shared 54 years of marriage, three kids, six grandchildren, and five  great grandchildren.\n\nAfter graduating, Dennis began his professional career with the  Department of Army at Red River Army Depot…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…children will carry forward.\n\nJaime's success was never about business. It was about service.  Together with Patricia, he served Our Lady of Guadalupe Church,  teaching pre-marriage classes. In 1995, they became ordained family  life ministers.\n\nJaime volunteered in Millard Public Schools as a translator, mentor,  and soccer coach. He helped Hispanic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…described in       the matter preceding clause (i).''; and\n\n(2) in section 502B (22 U.S.C. 2304)--\n\n(A) by redesignating the second subsection (i) (relating to       child marriage status) as subsection (j); and\n\n(B) by adding at the end the following:\n\n``(k) Forced Organ Harvesting and Trafficking in Persons       for Purposes of the Removal of Organs.--…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Members in this  Chamber remember that as we put together Donald Trump's big, beautiful  bill. We should not pass that bill unless we do something first about  the massive marriage hatred that we have.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…trials.\n\nShortly after returning home to Kansas following the war's end, Jim  would marry his wife Marilyn, with whom he would raise their three  children and enjoy 69 years of marriage.\n\nFollowing the passage of the GI Bill, Jim attended Kansas State  University, where he graduated with a bachelor's degree in business  administration. Jim then applied his…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…former Senator that I sat next to  from my State was sharing with me, one of the great frustrations of  Democrats in my area is, for 15 years, they raised money and ran on  marriage equality. Well, that is pretty much settled. They ran on the  right to terminate pregnancies. Well, now that is in my State  constitution.\n\nWhat do they run on now? They run…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Woody began a distinguished career in education. She taught both junior  high and high school English before earning two master's degrees in  Pupil Personnel Services and Marriage, Family, and Child Counseling.  For the final sixteen years of her career, she served as a counselor at  Centennial High School in Bakersfield, where she dedicated herself…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}]