[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…rehearsals and walkthroughs, and  executing the day. The operations team supporting JCCIC included Abby  Stahl, Randall Bethea, Elizabeth Khader, Jordan Prince, Destiny Davis,  Martha McPhee, Zachary Hassay, and Chris Brantley.\n\nAbby, a JCCIC veteran from Senator Fischer's office, effectively led  multiple timeline meetings, ensuring both the production…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…scheme pushed through in the middle of the night last month is putting  school meals for hungry kids and food assistance for working families  at risk.\n\nA constituent of mine, Martha, from Somersworth is raising her 15- year-old grandson and battling breast cancer while living on a fixed  income. Without SNAP, she wouldn't be able to keep food on the table.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692014/food-assistance-for-working-families-at-risk"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…development of the STAR Center providing acute behavioral  health care services to Skagit County, in addition to the county's  first permanent supportive housing development, Martha's Place, and the  Skagit First Steps Shelter.\n\nCommissioner Janicki's heartfelt leadership, strategic foresight, and  compassion are an inspiration to leaders and community…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…on Intelligence; Mary Draper, Senior Foreign Service Officer,       retired; Melvin Dubee, Former Deputy Staff Director, Senate       Select Committee on Intelligence; Martha Duncan, Senior       Executive Service, DOD, retired; William Eacho, Former       Ambassador to Austria; William Eaton, US Ambassador, retired;       Luigi Einaudi, US Ambassador,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to share an incredible story of  one of my constituents, a proud DACA recipient, Martha Delgado.\n\nRaised by a single mother who worked in the fields and cleaned  houses, Martha was determined to earn the American Dream. She graduated  with high honors from Godinez…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688313/daca-recipients-need-pathway-to-citizenship"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Daniella lives in Colorado's Eighth Congressional  District, a district currently represented by Congressman Gabe Evans;  currently represented.\n\nMr. Speaker, we heard from Martha, who writes from Florida: ``I have  an adult daughter with developmental and intellectual disabilities who  needs Medicaid for her medical care. As a mom, I worry a lot about…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "Mr. SESSIONS. Mr. Speaker, I am honored to present retired USAF  Technical Sergeant Martha Socorro Ybarra of Waco, Texas, with a  Congressional Veteran Commendation. Her 20-year service to our country  followed by her heavily involved community service is a template…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…celebrations.\n\nWhen Susan Mason founded her catering company in 1985, she was  recently divorced, living rent-free in a friend's home, and inspired by  a then-up-and-coming Martha Stewart.\n\nWhat she lacked in resources, she made up for with resolve, talent,  and a sparkling sense of humor. Over the next four decades, Susan Mason  Catering became synonymous…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693702/susan-mason-savannahs-style-and-service-icon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Martha Narvaez and Vincent Leandry have made to our  community through their volunteer service at the American Red Cross,  Mid-Florida Chapter. Every now and then, we encounter volunteers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…representation to several county offices, boards, commissions, and  employees.\n\nAfter a four-year tour in private practice, Mac joined the office of  United States Representative Martha Roby as her Military Legislative  Counsel. Mac's military and legal background perfectly positioned him  for his role in the office. His primary responsibilities included…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…regulations often prevent the advocate from asking the right type of  questions.\n\nThe former director of the Office of the Advocate for Small Business  Capital Formation, Ms. Martha Miller, said that: The office went  through a yearlong process just to collect registration information for  our annual forum and ask a few basic questions to understand the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693953/improving-access-to-small-business-information-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…that the women who came before us get credit for what  they have done. Their influence is undeniable.\n\nWhen we think of remarkable women, let us be reminded of women like  Martha Hughes Cannon, a physician, suffragist, and pioneer who went on  to become the first female State Senator in the United States.\n\nWe are a Nation of pioneers. Martha beautifully…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…deep respect. From the most liberal Democrat in  California to the most conservative Republican down in Texas, they all  loved Doug LaMalfa. He will be missed.\n\nMr. Speaker, Martha and I share our condolences. We pray for the  family at this tragic loss, but we are grateful for our friendship and  service with Doug LaMalfa.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "David Valadao", "party": "Republican", "sentence": "Mr. VALADAO. Mr. Speaker, I rise today to recognize Ms. Martha Elias  for her well-earned retirement from Nueva High School and for her  decades of dedicated service to the Lamont community. Shortly after  completing her education in Mexico,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698972/recognizing-ms-martha-elias"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Kelly, Erin: SPECTRUM NEWS; Kelly, Mary:       NATIONAL PUBLIC RADIO (NPR); Kelly, Shannon: INDEPENDENT       TELEVISION NEWS (ITN); Kelly, Terence: NBC NEWS; Kelner,       Martha: SKY NEWS; Kemmer, Katharina: ZDF GERMAN TELEVISION;       Kendall, Tyler: BLOOMBERG RADIO & TV; Kennedy, Benjamin:       WPLG-TV10; Kennedy, Diamond: NATIONAL PUBLIC RADIO…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]