[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Their names are  forever remembered--six hard-working men devoted to their community,  beloved by their families, and forever Marylanders in our hearts."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "The Maryland Health Benefit Exchange created an open enrollment period starting on March 16 and extended it through June 15 to help Marylanders obtain health insurance during the COVID-19 pandemic."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "To date, more than 14,000 Marylanders have tested positive for COVID-19, more than 3,000 have been hospitalized, and nearly 600 have died."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Raskin, today announced $422,690 in federal funding for Maryland Legal Aid (MLA) to provide legal services to low-income Marylanders."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "As climate change causes severe weather patterns  to increase, these ecosystems will act as pollution filters and buffers  from storm surge and flooding, minimizing the damage to Marylanders'  homes and businesses."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "I've been touched by the compassionate acts of Marylanders across our state -- from our healthcare workers battling this day in and day out, to first responders, communities, non-profits, and businesses providing each other and our most vulnerable with constant support."}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Of deep concern to myself and Marylanders, President Trump has  threatened to rescind funding that is vital to the reconstruction of  the Francis Scott Key Bridge in Baltimore, a project critical not only  to our local economy but to the Nation as a whole."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Raskin, and David Trone, today announced $422,690 in federal funding for Maryland Legal Aid (MLA) to provide legal services to low-income Marylanders."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "Many Marylanders have turned to their local food banks and SNAP for assistance."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Federal assistance in this case would help preserve the continuity of government by protecting the health of all Marylanders, including those who are putting their lives on the line every day working to combat COVID-19 and safeguard the well-being of all Americans."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "I was deeply disappointed by this missed opportunity, but I will continue working to represent and uphold the best interests of Marylanders and the American people.\""}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Since the beginning of April, more than 500 Marylanders have reached out to us via our helpline (410-884-8691), email, and over social media seeking mental health resources for themselves and their loved ones,\" said Kate Farinholt, Executive Director of NAMI Maryland."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "There are countless other  healthcare providers, law enforcement agencies, nonprofits, small  businesses, higher education institutions, and individual Marylanders  pitching in to defeat COVID-19."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "\"Marylanders who have served their time deserve a second chance, and this program has the potential to reduce recidivism and help reintegrate individuals back into their communities."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "For Marylanders living in underserved areas, patients with underlying health conditions, or individuals with mild cases of COVID-19, these telehealth services offer a proven method to receive safe and effective care,\" the lawmakers said."}]