[{"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…identifying information, masks,  breaking your car window when your 2-year-old is in the backseat.  Imagine peacefully protesting and having rubber bullets shot at you.\n\nImagine masked men detaining a 5-year-old who is coming home from  preschool. Imagine being pepper-sprayed as clergy while you are praying  out loud. Imagine tear gas filling your car on…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…your Second  Amendment rights was not in itself a provocation in the eyes of the  Federal Government.\n\nBut in so little time, so much has changed. In this America, we see  masked agents hiding their faces from the world and even hiding their  identification, terrorizing communities across the Nation, smashing car  windows and dragging mothers and fathers…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…undocumented.\n\nTrump's actions tell us that no one is safe from his storm troopers.  How ICE agents are going about fulfilling Trump's arbitrary arrest  quotas is also alarming.\n\nMasked, plainclothes officers have been entering communities and  abducting people to process them for deportation. This is extremely  dangerous for several reasons. The first is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…they work, then deporting U.S. kids with stage IV  cancer, pulling women by their hair down the street, and now just  murdering citizens in daylight. We have an unqualified, masked militia  eager to escalate.\n\nOne lady who I met recently in San Jose asked me: We have only been  through 1 year of this. How will we survive 4 years?\n\nWe won't. Not until…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699568/no-funding-for-ice"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…outrageous overreach on immigration that is tearing  families apart in my district and around the country.\n\nSince taking office, Trump has declared war on our communities.  Masked ICE and CBP thugs--I call them thugs because they don't identify  themselves. In our State, police officers, law enforcement, always  identify themselves. They have detained…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of these people.\n\nThree weeks ago, Omar Huerta Cisneros, a legal resident of the United  States, a green card holder, was going for a walk in the South Side of  Chicago when masked immigrant agents abruptly pulled him into a red car  and drove away. Mr. Huerta Cisneros was detained and disappeared by the  Trump administration simply for walking down the…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…disappeared.\n\nICE tricked a Vermonter, Mohsen Mahdawi. He has been legally in our  State for 10 years. He showed up for the final step in his citizenship  process only to have masked men detain him after he exited the  courthouse. He knew it was a risk to show up, but he decided it was  worth the risk to maybe finally become an American.\n\nImagine going…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Donald Trump's inhumane, out-of-touch mass  deportation agenda.\n\nI am infuriated by story after story of extreme overreach, excessive  force, and brutal tactics being used by masked ICE agents to arrest and  detain Oregonians.\n\nIn Portland, ICE wrongfully separated a young, loving mom from her  four little children for 4 months.\n\nIn Hillsboro, multiple…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…DACA recipients, but now they  are threatening to arrest DACA participants as well. That is exactly  what has been happening in my hometown of Los Angeles when, last month,  masked immigration officials--unidentified and masked immigration  officials--carrying weapons, raided a carwash in Temple City. It was  there that they confronted and arrested Javier…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…sweetens the deal for the devil.\n\nThis deal means billions of American tax dollars to build a wall  Trump promised Mexico would pay for.\n\nThis bill means billions of dollars for masked ICE agents to  terrorize immigrant families who have been contributing to our country  for decades, including law-abiding marines and even American kids.\n\nThis bill means billions…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693217/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…is the largest ag State in the Union. There are a lot of  farmworkers in my district. What happened? One day, we are going about  our business in Santa Ana, Orange County, masked Federal agents start  going into our neighborhoods, picking up hardworking neighbors. Oh,  yeah, you bet, people were concerned, scared, and nervous.\n\nA lot of people expressed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…America has existed for 250 years without mass detention centers, but  apparently, Noem and her cohorts plan for a different America to start  the next 250 years, one where masked, unmarked agents seize people  without judicial warrant, whisk them away to remote detention centers  en route to uncertain final destinations. When such things have been…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699213/in-opposition-to-ice-facility-in-hudson-valley"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…separations. I witnessed one of these raids myself in  Carpinteria, California, where ICE agents unleashed a disproportionate  show of force.\n\nWhat I saw was completely unacceptable, masked ICE agents in military  gear firing tear gas and other projectiles into a crowd of peaceful  civilians and reporters. Even a child was injured by shrapnel.\n\nUpon seeing these…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…police can circumvent due  process. We do this to ensure that all residents will cooperate with  local law enforcement.\n\nWestchester rejects the deep state police that appear masked and  without badges and proper identification. This bill represents an  attempt by House Republicans to enact retribution on places because  this administration wants to impose…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…deported to a prison in El  Salvador, a country that he is not even from.\n\nThis week, a landscaper, Narciso Barranco, with no criminal record  was beaten in the streets by masked agents. His three sons are all  United States marines.\n\nThis has to stop. The Trump administration needs to do what they said  they were going to do: Go after criminals, not…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…play out in our Nation today as it is in other countries around the  world.\n\nIn barely more than a year, we have seen journalists covering  protests arrested. We have seen masked and unaccountable government  agents murder American citizens and then senior members of the  administration lying about who they were and what they were doing. We  have seen…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…taxpayer dollars for  Trump's reckless military action in Venezuela and everywhere else he  decides to invade or bomb.\n\nTrump and Kristi Noem have militarized our streets. Masked men in  full military gear roam the streets of our cities. These masked men  invade church properties and schools, knock down doors without  warrants, ram cars, and assault…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…``kidnapping,'' said ``resistance'' to ICE is  ``inspiring,'' and claimed ICE officers will ``shoot at you and kill  you.''\n\nRepresentative Eric Swalwell smeared ICE officers as ``masked  thugs,'' called them ``terrorizing bandit[s],'' said it was his  ``priority'' to ensure officers are ``no longer faceless,'' compared  them to the KGB, and demanded they ``stay…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…impressionable students.\n\nAs my colleagues have pointed out, many American universities have  been far too cozy with our international adversaries. They accept  generous investments masked as research projects and infrastructure  opportunities, which turn out to be funded by regimes that wish to do  us harm.\n\nNot only did those corrupt arrangements create dangerous…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689030/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]