[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "That is  why the administration's mass firings of thousands of HHS employees are  deeply troubling.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "Instead of continuing senseless mass firings of VA personnel, this  bill provides funding so that the VA can recruit and hire to fill long- term clinical vacancies that are contributing to long wait times for  care in Georgia and across the country.", "title": "-9999", "date": "2025-07-23"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Madam Speaker, I rise today to address the dire  consequences of the Federal funding freezes and mass firings that are  devastating communities across the country, including in my home State  of New Mexico.", "title": "Dire Consequences of Funding Freeze and Mass Firings", "date": "2025-02-25"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Whether it is an elder whose  Social Security  check was delayed into her direct deposit, likely because of Trump's  mass firings, or the young college student who makes the innocent  mistake of confusing a savings and checking account, anyone can be  affected by unnecessary junk fees.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''", "date": "2025-04-09"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "From  withholding billions in Federal funding to conducting mass firings of  Federal workers and shuttering critical Agencies with hardly any notice  at all, to implementing countless, harmful Executive actions, the Trump  regime has sown chaos, corruption, and cruelty from day one.", "title": "-9999", "date": "2025-11-19"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "If my Republican colleagues are sincere in their desire  to win the race to adopt advanced technologies, they will start to  speak up rather than quietly stand by while the Trump administration  recklessly cuts critical Federal research programs, engages in mass  firings of crucial experts, and engages in wild swings in national  trade policy from week to week.", "title": "Deploying American Blockchains Act of 2025", "date": "2025-06-23"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "These aggressive and sweeping mass firings of hundreds of thousands  of Federal employees will have profound and devastating consequences  across the country.", "title": "Fired By President Trump", "date": "2025-02-26"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Now, this self-anointed fourth branch of government, DOGE, which I  think is getting run out of town right now because of its rank  incompetence and lawless assaults on the privacy data of hundreds of  millions of Americans and its unlawful summary mass firings of  professional civil servants like air traffic controllers, food and drug  inspectors, pediatric cancer researchers in my district, Forest  Service, and firefighters.", "title": "Improving Law Enforcement Officer Safety and Wellness Through Data Act", "date": "2025-05-15"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Under this  administration, we are seeing mass firings at Social Security offices,  hours-long wait times, delayed checks, websites crashing, and field  offices closing.", "title": "Threats to Social Security", "date": "2025-05-14"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "With the Trump administration's mass firings of federal  employees, budget cuts and proposed relocation of federal agencies, as  well as the continued prevalence of remote and hybrid work, this bill  is especially important.", "title": "Introduction of A Bill to Designate the District of Columbia As An Empowerment Zone", "date": "2025-12-09"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "However, over the last month, we have seen and heard from Tribes all  over the country whose Federal funds have been frozen and their  programs impacted by mass firings, including at Indian Health Service,  BIA and BIE, including in my district at SIPI and at Haskell's College  where faculty and students have been devastated by mass firings.", "title": "Sovereign Tribal Nations", "date": "2025-02-27"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "In response to mass firings at NOAA and the National Weather Service,  Andrea Young of Hidden Creek Farm in Fauquier County, Virginia, said  this: ``I cannot bring the animals to safety.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''", "date": "2025-05-01"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "We  worked to maintain the CDFI Fund at the current level, and we made sure  it would be adequately staffed so Trump can't try to sabotage that work  with mass firings again.", "title": "Appropriations", "date": "2026-01-30"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Unfettered by the rule of law and driven by  unchecked hubris, DOGE unleashed chaos, illegally dismantled agencies,  conducted mass firings, canceled contracts, and mined the sensitive  data of millions of American people.", "title": "Ode to Doge", "date": "2025-12-02"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The CR does not change the underlying law  making the Trump administration's impoundments and mass firings  illegal.", "title": "Full-Year Continuing Appropriations and Extensions Act, 2025", "date": "2025-03-14"}]