[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that our kids are healthy to ensuring that seniors can live  with dignity.\n\nIt directly touches more lives than any other Cabinet Agency. That is  why the administration's mass firings of thousands of HHS employees are  deeply troubling.\n\nWhen a new CEO comes in and wants to see a new direction for a  company, they look at it, they look at all the divisions,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…support healthcare for  more than 9.2 million veterans and disability benefits to nearly 7  million veterans, survivors, and their families.\n\nInstead of continuing senseless mass firings of VA personnel, this  bill provides funding so that the VA can recruit and hire to fill long- term clinical vacancies that are contributing to long wait times for  care…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Madam Speaker, I rise today to address the dire  consequences of the Federal funding freezes and mass firings that are  devastating communities across the country, including in my home State  of New Mexico.\n\nOver the past few weeks, I have spoken with New Mexicans who have  been…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…life-changing, but this  resolution would undo that progress. Whether it is an elder whose  Social Security  check was delayed into her direct deposit, likely because of Trump's  mass firings, or the young college student who makes the innocent  mistake of confusing a savings and checking account, anyone can be  affected by unnecessary junk fees.\n\nLet's be honest,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689838/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…regime--that is what I call the Trump administration. It is  a regime hell-bent on dismantling the Federal Government. From  withholding billions in Federal funding to conducting mass firings of  Federal workers and shuttering critical Agencies with hardly any notice  at all, to implementing countless, harmful Executive actions, the Trump  regime has sown chaos,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that includes devastating cuts to Medicaid, all so they can give tax  breaks to their billionaire buddies.\n\nEvery day for the last 6 weeks, we have heard horror stories of mass  firings across the Federal Government, funding freezes, and Elon Musk  and his minions having access to every American's private, personal  financial and healthcare information.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…continued confidence in the donor system, efficient spending       of taxpayer dollars, and a secure, modern technology       infrastructure.\n\nThese aggressive and sweeping mass firings of hundreds of thousands  of Federal employees will have profound and devastating consequences  across the country.\n\nOur dedicated civil servants work tirelessly each day…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…getting run out of town right now because of its rank  incompetence and lawless assaults on the privacy data of hundreds of  millions of Americans and its unlawful summary mass firings of  professional civil servants like air traffic controllers, food and drug  inspectors, pediatric cancer researchers in my district, Forest  Service, and firefighters.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…weeks later, he referred to Social Security as the  big one to eliminate\n\nThese are not empty comments. They are real threats. Under this  administration, we are seeing mass firings at Social Security offices,  hours-long wait times, delayed checks, websites crashing, and field  offices closing.\n\nMy district office in Raleigh, North Carolina, has received…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691162/threats-to-social-security"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…This bill effectively would reauthorize many of the unique  federal tax incentives for business investment in D.C. that expired in  2011. With the Trump administration's mass firings of federal  employees, budget cuts and proposed relocation of federal agencies, as  well as the continued prevalence of remote and hybrid work, this bill  is especially…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697733/introduction-of-a-bill-to-designate-the-district-of-columbia-as-an-empowerment-zone"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…promises of cost- cutting and efficiency. Unfettered by the rule of law and driven by  unchecked hubris, DOGE unleashed chaos, illegally dismantled agencies,  conducted mass firings, canceled contracts, and mined the sensitive  data of millions of American people.\n\nThe speed with which DOGE brought destruction to lifesaving agencies  was matched only…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697304/ode-to-doge"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…they are not  having any townhalls these days. They need to hear from farmers and the  folks in these rural communities that their policies are hurting.\n\nIn response to mass firings at NOAA and the National Weather Service,  Andrea Young of Hidden Creek Farm in Fauquier County, Virginia, said  this: ``I cannot bring the animals to safety. I cannot cover…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…have his way. We  worked to maintain the CDFI Fund at the current level, and we made sure  it would be adequately staffed so Trump can't try to sabotage that work  with mass firings again.\n\nWe also took an important step to prevent Washington, DC, from not  being able to spend its own taxpayer dollars again after House  Republicans completely shortchanged…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…communities.\n\nHowever, over the last month, we have seen and heard from Tribes all  over the country whose Federal funds have been frozen and their  programs impacted by mass firings, including at Indian Health Service,  BIA and BIE, including in my district at SIPI and at Haskell's College  where faculty and students have been devastated by mass firings.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…branch have a legal and constitutional duty  to faithfully execute the CR. The CR does not change the underlying law  making the Trump administration's impoundments and mass firings  illegal. This is true as a matter of law.\n\nNothing in the CR changes the Impoundment Control Act, the foundation  of Congress's appropriations authority, and the authorization…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}]