[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Wildlife Preserve Commission.\n\nCouncilwoman Giamboi leaves a legacy of environmental advocacy and  stewardship, including her contribution to the creation and adoption of  a master plan of local ecology preservation for the largest undeveloped  ecosystem in northern Middlesex County. This oversight will be  instrumental in the continued restoration of…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…unwavering faith  in our Lord and Savior, Jesus Christ.\n\nInstilled with a love of learning, Mrs. Booker graduated from Albany  State College with a Bachelor of Science Degree, a Master of Science  Degree in Counseling and Guidance from Fort Valley State College, and a  Specialist Degree in Education and Counseling and Guidance from Auburn  University.\n\nArmed…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Broadcast  Schools of New York. Overseer Carter pursued theological studies at  Bethany Bible School and Theological Seminary, earning both a  Bachelor's in Ministry and a Master's in Theology.\n\nOverseer Carter began his ministry through the power of music. He  launched his career as a DJ in Brooklyn, New York, gaining recognition  as one of the best…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…supervisor,  but he was no ordinary public servant. After getting his LLB from  George Washington School of Law, he decided that was not taxing enough  and proceeded to earn a master's of law in taxation from George  Washington School of Law.\n\nGerry was a man who wore many hats, from Air Force colonel to lawyer,  but it was his role as a community leader…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Dodd-Frank Wall Street Reform and Consumer Protection Act. As  some of us here know who served with Barney Frank, he was the chair of  the then Financial Services Committee and a master of his agenda there.  Senator Dodd from Connecticut was on the Senate side with that.\n\nIt was necessary, Mr. Speaker, because of what was happening in the  financial community.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…next two decades, he took on several  roles with the department including as a DARE officer, School Resource  Officer, detective, sergeant and lieutenant. New also earned a master's  degree in public administration from Metro State University and  graduated from the FBI National Academy.\n\nIn 2016, New became a Deputy Chief before being named Eagan Chief…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…her husband, the  late William Henry Coleman, and relocated to Gary's Midtown  neighborhood.\n\nEdith is an accomplished scholar, having earned both a Bachelor of  Science and Master of Science in education at Indiana University in  Bloomington. After graduating, Edith pursued a career in the teaching  profession where she went on to enrich the lives of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Office building on the Mississippi River Bluff downtown. She  is a 1976 graduate of Blackburn College in Carlinville, Illinois, with  a degree in Sociology. She received a Master's degree in Higher  Education Administration in 1985 from Southern Illinois University-- Carbondale, and a Doctor of Education degree in Higher Education  Administration in…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…most  physical tasks. But this Minnesotan, who is now 26, has been able to  thrive because he has Medicaid coverage. He got an education. He got a  job. He graduated with a master's degree in public policy. He is paying  taxes. In his words, Medicaid gave him the affordable health coverage  he needed to manage his rare condition.\n\nFor him and millions…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…graduate student loan program, which was  created by the one big, ugly bill.\n\nFor the 4.7 million actively registered nurses and the 250,000  students enrolled in bachelor's, master's, and doctoral nursing  programs across the United States, this decree that they are not  professionals is both a disgraceful insult that shocks the conscience  and an order…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Hawaiian language itself due to  mass population loss and laws preventing the teaching of Hawaiian.\n\nBut beginning in the 1960s-70s, a cultural renaissance took hold.  Kumu hula (master teachers in the art of hula) like George Na`ope, who  founded the Merrie Monarch Festival, worked tirelessly to preserve and  revive ancient hula traditions. Language advocates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…and accessibility of  health care in New Hampshire, Vermont, and the rest of the country.\n\nTess has dedicated her entire career to improving public health.  After earning her Master's in Nursing and Public/Community Health in  1990, she worked in Nepal as a Peace Corps nurse for five years. There,  Tess taught women to be birth attendants and designed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, I rise today to recognize the distinguished  career and dedicated service of Chief Master Sergeant Sharma J. Haynes  on the occasion of her retirement from the United States Air Force.  Chief Master Sergeant Haynes has served our Nation with unwavering  commitment…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…a  constituent and Vietnam War veteran living in Farmington, Minnesota.\n\nPeter was born in Boston in 1941, attended college at the University  of Cincinnati and received a master's degree from George Washington  University before enlisting in the United States Army in 1966. After  enlisting, he completed Officer Cadet School, Army Airborne School, and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Republicans,  through it, are surrendering more and more unrestrained power to  President Trump. This rule is but another step on the march to tyranny.\n\nTrump is seeking to create a master file of information on every  single American, a digital ID tracking your movements, where you live,  where you work, when you see a doctor, how much money you have, even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…service--first to his  country, and then to his people. He served honorably in the United  States Navy for over three decades, retiring in 1994 with the esteemed  rank of Force Master Chief, Naval Surface Force, U.S. Atlantic Fleet.  He was a veteran of both the Vietnam War and Desert Storm, embodying  courage, commitment, and leadership throughout his military…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692114/recognizing-gerald-jerry-danforth"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…range of issues, from natural  resources to veterans affairs, and has done so with exceptional  diligence and precision.\n\nWhile working in my office, Michael also earned his master's degree  in national security policy studies. He quickly established himself as  an indispensable asset. I have often said that a good Member can become  a great Member with…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the DOGE Caucus, I am proud to support the  Ending Improper Payments to Deceased People Act. It is a commonsense,  bipartisan effort to strengthen the accuracy of the Death Master File,  improve data sharing across Federal agencies, and ensure that benefits  programs have the timely, reliable information they need to verify  eligibility, and a pulse,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Psychology  from Gonzaga University in 2009 as a Distinguished Military Graduate.  He also attended the Marine Corps University and George Washington  University, where he earned master's degrees in military studies and  legislative affairs, respectively. During his 16-year career in the  Army, Rob served in key tactical and strategic positions. He has  successfully…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694101/recognizing-the-service-of-major-robert-coleman"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…also essential in Committee efforts  in writing letters pertaining to the Greenhouse Gas Reduction Fund.  Most recently, Kristen completed another degree graduating with a  Master of Arts in Defense and Strategic Studies from the Naval War  College in 2024.\n\nKristen's time as detailee with the House Committee on Energy and  Commerce is ending this week…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691958/recognizing-kristen-pinnock"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Farming, a churchgoer, a political volunteer,  and is himself a farmer in Peach Bottom, Pennsylvania. He holds  bachelor's degrees in agronomy and plant science, and has a master's  degree in environmental pollution control, all of which are from Penn  State.\n\nAs he transitions his focus from Penn State Extension back to his  farm, I thank Leon Ressler…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Partnership.\n\nFor 43 years, Stan has dedicated his career to championing community  and economic development throughout Pennsylvania's 15th Congressional  District.\n\nAfter receiving a master's degree in public administration from Penn  State in the summer of 1982, Stan began his career in Titusville,  Pennsylvania, where he worked as the assistant director of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Elias' impact extends far beyond the classroom. She has been a mentor  to colleagues, a trusted partner to parents, and a pillar of the  greater Kern County community. As the Master of Ceremonies for academic  award assemblies, she brought families together to celebrate student  achievement, often receiving heartfelt thanks from parents whose  children's…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698972/recognizing-ms-martha-elias"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, I am proud to award Master Sergeant  Duane C. Bygum, Jr., USMC and USAF, Retired, with a Congressional  Veteran Commendation. His unwavering commitment to our country and  community is a shining example…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689326/saluting-the-service-of-master-sergeant-duane-c-bygum-jr"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Mr. EMMER. Mr. Speaker, I rise today to recognize Dennis Eugene  ``Denny'' Butcher of Watertown, Minnesota, for his retirement after 53  years as the town's beloved Master Barber. Denny's impact reaches far  beyond the barber chair through the many other ways he sewed  Watertown's community.\n\nKnown for his generosity and compassion, he routinely…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698267/recognizing-the-retirement-of-dennis-eugene-denny-butcher-of-watertown-minnesota"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…California, found himself interested  in American History and Politics, which brought him to the University  of Dallas, where he received his bachelor's degree in history and a  master's degrees in American studies. Following graduation, Jeff moved  to Washington, D.C. and started his career in public service.\n\nThroughout his time in Washington, Jeff's distinguished…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Administration, ETA, at the United States Department of Labor.\n\nMs. Bearden earned her bachelor's degree in political science from  Columbus State University in Georgia and her master's degree in public  administration from Auburn University.\n\nIn this role, Ms. Bearden will assist Labor Secretary Lori Chavez- DeRemer in executing President Donald Trump's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690088/recognizing-deputy-assistant-secretary-lori-frazier-bearden"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to recognize the  extraordinary service of Master Sergeant Arcadio Santiago-Rodriguez, a  proud member of the Army's 65th Infantry Regiment, known as the  Borinqueneers.\n\nDuring the Korean war, then-Private First Class Santiago-Rodriguez…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688609/recognizing-arcadio-santiago-rodriguez"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…involvement with the Kern County Cattlewomen, Ms.  Woody began a distinguished career in education. She taught both junior  high and high school English before earning two master's degrees in  Pupil Personnel Services and Marriage, Family, and Child Counseling.  For the final sixteen years of her career, she served as a counselor at  Centennial High…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with profound respect and  gratitude to recognize the extraordinary service and unwavering  dedication of Master Sergeant Tommy J. King, a proud veteran of the  United States Army and our distinguished Veteran of the Month for  September 2025 from Michigan's 9th Congressional District.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}]