[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…moved to Ohio  to assist local farmers sell produce locally. That job is gone.\n\nA young farmer with a newborn daughter and a single mother with two  children just back from maternity leave were hired to help citizens  understand how to save money through the Centers for Medicare and  Medicaid Services. They are out in the cold too, and so will the  American…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…continuation of children facing severe malnutrition and hunger. We  also see kids who are sick and had the promise of getting healthcare,  cancer treatment, women who need maternity facilities or basic  medicines and treatments still not having access to them.\n\nThe Netanyahu government cannot be allowed to, once again, turn on  and off the supply of…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…pay more for  their healthcare and shouldn't be forced to. Allowing premiums to  skyrocket, enacting a backdoor abortion ban, and allowing plans to not  cover things like maternity care and preexisting conditions is not a  solution. It is abandonment.\n\nMr. Speaker, I urge a ``no'' vote on this bill.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698363/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…40 percent of rural hospitals operate at a loss. They  rely on Medicaid to keep the lights on and the doors open. Take that  funding away, and entire regions lose access to maternity care, cancer  treatment, mental health services, and more.\n\nThis isn't hypothetical. Before Medicaid expansion, clinics were  closing, nurses were being laid off, and people…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…because it protects people with  preexisting conditions, provides free preventative care, and requires  coverage for essential health benefits like emergency services and  maternity care.\n\nThe ACA gave health insurance to millions of people, and improvements  made to the law made premiums more affordable. Failing to act and  failing to extend these tax…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…demands  immediate action from our Nation's legislators.\n\nYet, the Republican majority is shoving a budget through that would  gut Medicaid, which is the single largest payer of maternity care in  our country, in order to give tax cuts to billionaires.\n\nAs an OB/GYN who has spent my life caring for women and delivering  babies, let me tell you: It is unconscionable…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689164/womens-history-month"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…budget bill of the Trump administration. These hospitals will  face longer emergency room wait times. They will be forced to cut  services, including behavioral health and maternity care. They will  have to lay off doctors and nurses, which is exactly the opposite of  what we need in rural America.\n\nMy Republican colleagues know exactly how devastating…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…care is being slimmed down or eliminated because of cutbacks to  Medicaid. They will have to explain to the young mother preparing to  have a baby why there is no longer a maternity ward in her county.\n\nThis bill flies in the face of American values that we celebrate on  the Fourth of July and everything we stand for. The other party has a  lot of explaining…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…up the  Affordable Care Act Medicaid expansion option for adults.\n\nIn a struggle to keep their doors open, many rural hospitals opt to  close less lucrative units, such as maternity wards. That means women  driving further for prenatal checkups or to give birth.\n\nFor the hospitals left and places that provide care, there has  largely been one saving…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the country that are being  forced to close their doors and cut services.\n\nSt. Mary's Sacred Heart Hospital in Lavonia, Georgia, recently  announced it will shut down its maternity unit next month, and they  pointed to ``recent congressional cuts to Medicaid'' as the reason for  the closure.\n\nIn rural Virginia, August Medical Group is closing an urgent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695820/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…solve every problem the GOP has created. We still  have to reverse their cuts to Medicaid and Medicare. We still have to  stop the closure of rural hospitals and deal with the maternity health  crisis and work together--yes, work together--to create a healthcare  system that is affordable and accessible to everyone.\n\nToday, we can begin. Today, the people's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698792/breaking-the-gridlock-act"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…security assurances from  the U.S. and its allies. We want peace but not without accountability.\n\nI stood on the grounds of Bucha and the mass grave. I have seen the  flattened maternity hospital. I have learned of the tens of thousands  of kids kidnapped by the Russians. These Ukrainian children were taken  into Russia, never to see their families again.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690213/supporting-ukraines-independence"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…construct a perinatal substance stabilization unit.\n\nLet me repeat: Seattle Children's Hospital, the Ann & Robert Lurie  Children's Hospital, Rady's Children's Hospital, maternity delivery  units, and a perinatal substance use stabilization unit are all at  risk.\n\nI will be clear that this amendment is not limited to children's  hospitals. It would…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…response line  in case someone needed to take a bus 3\\1/2\\ hours from their college  campus into the city. That is because that was the only place they  could access either maternity care, OB/GYN care, or access abortion  care. We have not funded healthcare in rural communities across the  country. We have gutted programs that provide actual support for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…time in need of better healthcare, I thank  them for understanding the healthcare needs of the citizens of the  Third Congressional District.\n\nIt is, Mr. Speaker, the only IV maternity care hospital in central  Ohio. It includes 16 labor and delivery rooms and 51 NICU rooms. It is  in partnership with Nationwide Children's Hospital. We salute Columbus…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698915/congratulating-dr-john-j-warner"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…breaking  cycles of abuse, poverty, and homelessness. With five campuses across  Palm Beach and Martin Counties, they provide critical services like  neighborhood foster care, maternity care, independent living programs,  human trafficking prevention, and family outreach.\n\nOver the past 25 years, Place of Hope has served more than 150,000  children, youth,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…tell you that.\n\nYou don't have to walk that road by yourself. There is support out  there for you. In Ohio alone, women have access to nearly 200 pregnancy  help centers and maternity homes that serve expectant mothers. I have  visited many of them. They want you to go see them, if you are in need,  if you are scared, if you need someone to talk to. They…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…authority for certain personnel. Sec. 244. Command sponsorship for dependents of members of Coast Guard                assigned to Unalaska, Alaska. Sec. 245. Authorization for maternity uniform allowance for officers. Sec. 246. Consolidation of authorities for college student                precommissioning initiative. Sec. 247. Additional available guidance…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]