[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…delays.\n\nWe must prioritize investments that rebuild our domestic  manufacturing capabilities. Our military should never have to fight  with or depend on foreign sources for materials, critical minerals, or  key military components. Furthermore, by cutting all funding for  Ukraine, this bill dangerously ignores history at our own peril.\n\nAt our founding,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…in tariffs  against one of the main trading partners of the United States, like  China, it creates a major problem for companies that trade with China  and that get their materials or send their finished products to China.\n\nMany of them are small American businesses. We have seen and heard  from many of those over the past couple of days. I have been…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…unanswered  questions leading up to, during and after the fatal shot that killed  Ms. Abu Akleh. Additionally, this bill requires an identification of  any United States defense materials or services that were implicated in  the death of Ms. Abu Akleh. No U.S. weapons or military services by the  U.S. should be used to kill Americans on foreign soil. American…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…dollars more each year because Donald Trump doesn't  like the internal goings on in Canada or Argentina or Brazil. That  hurts Americans, and we pay more for construction materials, for  aluminum, for paper, and so much more.\n\nBut do you know what? The truth hurts. What President Reagan said,  back in those years, about the danger of tariffs was true…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…we had a chance to deliver it today, and we failed them.\n\nMy bill, which was introduced as the amendment by Senator Schumer,  requires the Attorney General to release all materials and records  related to Jeffrey Epstein and Ghislaine Maxwell, including the flight  and travel records, the names of individuals, the names of businesses  and nonprofits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…attend schools where 90 percent or more of their  classmates are also students of color. These schools too often have  fewer counselors, overcrowded classrooms, and outdated materials. When  you cut the Department of Education, you don't just cut red tape--you  cut protections. You cut resources. You cut off opportunities.\n\nAnd while this assault affects…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…gas cylinders are used every day in life for medical,  auto, defense, oil and gas, residential, firefighting, and other  purposes.\n\nIn January, the Pipeline and Hazardous Materials Safety  Administration issued a safety advisory notice regarding unsafe  cylinders being sold online to consumers, shippers, and heating,  ventilation, and air-conditioning…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692181/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…violations of nonproliferation  agreements.\n\nThis bill leaves wide open opportunities for countries like Iran and  other nefarious actors to more easily get their hands on the materials  needed to build nuclear weapons. With tensions mounting in the Middle  East and the internet containing significant bomb-making instructions  which are much more accessible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…on Canada, I have to point out that his trade war against our  close ally is making American allies and us less safe.\n\nFor one, Canada is a reliable source of energy, raw materials, and  critical minerals that China has repeatedly used as a bargaining chip  in trade talks. Critical minerals are essential to manufacturing in the  high-tech and defense…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…most comprehensive rail safety proposals before Congress.\n\nThe bill would require two-person train crews and increased  inspections, especially for trains carrying hazardous materials. It  would strengthen emergency notification so first responders are not  left in the dark. It would raise penalties for safety violations and  address the exact equipment…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…keep us  safe.\n\nFinally, money talks, so let's talk money. This administration  slashed funding of seven government agencies that provide Black  communities with educational materials and economic opportunities,  including the Minority Business Development Agency, the only Federal  agency dedicated to uplifting minority businesses. This agency helped…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…abandoned nets and traps. One abandoned net can trap fish,  seabirds, and marine mammals for decades. Through this program, local  partners recover that gear, return usable materials to fishers and  anglers, and stop the cycle of loss.\n\nIn the Great Lakes, communities use these funds to intercept plastic  before it reaches open water, cleaning up shorelines,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Trump administration  tariffs on the American people's purchases are taxes that cost them  more money on everything, a lot more: a lot more for food, for gas, for  building materials, for cars, for trucks, for everything.\n\nToday, after the market bled off nearly $10 trillion in lost U.S.  wealth last week, the President adjusted some tariffs, but nothing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…come  to confront the complex tapestry of our past: our triumphs, our  failures, and the lessons that bind them together.\n\nThat is why the recent removal of the interpretive materials titled  ``Life Under Slavery,'' ``The Dirty Business of Slavery,'' and signage  addressing climate change should alarm every American.\n\nThese changes don't make us more patriotic.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…a partnership between the Federal and local government, driven by  the leadership of the Southeastern Colorado Water Conservancy District.\n\nIn the face of rising costs and materials and labor, once again,  southeastern Coloradans, just as the generations before them have, came  together to put forward an inventive solution to lower costs by  changing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…committee at a meeting or by proxies, shall have authority to       subpoena the attendance of witnesses or the production of       memoranda, documents, records, or any other materials. At the       request of any member of the committee, the committee shall       authorize the issuance of a subpoena only at a meeting of the       committee. When the committee…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…other territory       or possession of the United States.\n\n(13) Systems.--The term ``systems'' means a combination of       personnel, structures, facilities, information, materials,       equipment, networks, or processes, whether physical or       virtual, integrated or interconnected for a specific purpose       that enables an organization's services,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…from the  war in Ukraine, it should be this, this is a fundamental principle: No  nation, let alone America, should be reliant on adversarial nations for  energy and refined materials, critical minerals, rare earth elements  that would threaten our economy and threaten our national security, but  that is where we find ourselves and where we put ourselves…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…pass the bill (H.R. 5284) to require the Social Security Administration  to make changes to the social security terminology used in the rules,  regulation, guidance, or other materials of the Administration, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 5284\n\nBe it enacted by…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…contains abundant  timberlands and substantial sand and gravel material resources that are  essential for roads, airstrips, and other infrastructure. Local access  to these materials allows rural villages  in this region to avoid costly imports that contribute to the high cost  of living in these communities.\n\nImportantly, the area also contains the Dalton…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Otto--Communication Services, Debbie Mallory-- Finance, Steve Bushnell-Fowler--Human Resources, Karen Miller-- Information Services, Public Affairs, and Public Education, Joe  Garisto--Materials, Mavrick Putnam--Marine Safety and Environmental  Protection, Lisa Repetto--Publications and Recreational Boating Safety  Program Visitations, Gerard Gaudry--Navigation Systems,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…the important  role of Security Manager. As an employee of the Select Committee, Mac  analyzed thousands of pages of documents, communications, and other  executive branch materials relating to the terrorist attacks in  Benghazi.\n\nOnce his tenure with the Select Committee ended, Mac landed in the  Office of the Chief Administrative Officer in 2016 and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…described in paragraph       (1) jointly determine appropriate.\n\n(B) Limitations.--Any item included in the Time Capsule       under subparagraph (A)--\n\n(i) shall be made of materials that pose a low risk of       degrading, such as metal or archival paper; and\n\n(ii) shall not be made of any organic or inorganic material       that poses a high risk of…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…``(C) Improved efficiency of resource consumption and       material demand.\n\n``(2) Alternative fuels.--The term `alternative fuels'       means any solid, liquid, or gaseous materials, or a       combination thereof, used to replace or supplement any       portion of fuels used in combustion or pyrolysis for low-      emissions cement, concrete, or asphalt.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…drafted by this body, if you  broke it, you have to fix it. We have to fix the voting laws.\n\nThe National Voter Registration Act requires States to give voter  registration materials when an individual comes to get a driver's  license. In States that give driver's licenses to illegal aliens, like  the State of Illinois, just to the south of my home State…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…agreements with the  Government of the People's Republic of China. This includes  partnerships with Confucius classrooms, language programs funded by the  CCP, and instructional materials or personnel tied to the Chinese  Government.\n\nAmerican education should teach American values, not communist  propaganda.\n\nMr. Speaker, I urge my colleagues to support this…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…we used publicly       available information to construct our applications for       coverage and subsidies. We also used publicly available       hardware, software, and materials to produce counterfeit       documents that we submitted, if appropriate for our testing,       when instructed to do so. We then observed the outcomes of       the document…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…has been made       under such section 7(b) have full access to assistance       provided under such section, including by providing targeted       outreach and marketing materials to such individuals.       SEC. 3. TECHNICAL AMENDMENT.\n\nThe second paragraph (16) (relating to statute of       limitations) of section 7(b) of the Small Business Act (15…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Indians, done at       the Qui-nai-elt River July 1, 1855, and Olympia January 25,       1856 (12 Stat. 971) (commonly known as the ``Treaty of       Olympia'').\n\n(e) Hazardous Materials.--For purposes of the taking of       land into trust under subsection (a), the Secretary of the       Interior--\n\n(1) shall meet disclosure requirements for hazardous…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697703/quinault-indian-nation-land-transfer-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Secretary may strike and sell duplicates in bronze of       the gold medals struck under section 3, at a price sufficient       to cover the costs thereof, including labor, materials, dies,       use of machinery, and overhead expenses.       SEC. 5. STATUS OF MEDALS.\n\n(a) National Medals.--Medals struck under this Act are       national medals for purposes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}]