[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…communities of Santa Barbara and  Lompoc, and later in Goleta.\n\nAfter graduating from Lompoc High School, he attended Cal Poly San  Luis Obispo, where he earned a degree in mathematics.\n\nUpon graduation, General Lopez joined the United States Marine Corps  in 1967. Soon after, he was deployed overseas for the Vietnam war,  serving as an infantry rifle…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…known as the Nation's report card, has shown us that this knowledge and  talent shortage is a nationwide challenge. In 2022, the assessment  registered the largest decline in mathematics scores since we first  started assessing in 1990. The scores of the average fourth grader were  down 5 points. Worse, the average eighth grader recorded a score of 8  points…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Biomedical       Engineering: Aaryasinh Vaghela and Rishik Puli, Basis       Independence School\n\nCharles ``Chuck'' Smith Award for Excellence in Computer       Science and Mathematics: Eamon O'Leary, South Lakes High       School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford Crenshaw\n\nSuperior Service…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr Speaker, I rise today to honor and celebrate March 14,  3.14, or Pi day. Pi is a Greek letter, and in mathematics it is a  symbol for the number you always get when you divide a circle's  circumference by its diameter. Many people approximate pi as 3.14 or  3.14159.\n\nBut the number…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…class of 2025.\n\nIn their time as Patriots, this class excelled in the classroom and  on the field. They have achieved excellence across different fields-- student journalism, mathematics, science, engineering, English, and the  arts. They have demonstrated curiosity toward the world and compassion  for others.\n\nWhether it is on the sports field or a variety…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…both in their fourth term. I have passed legislation with both of them.  Now they have joined together to pass H.R. 730, a STEM bill, science,  technology, engineering, and mathematics. You don't have STEM without  mathematics.\n\nWe call on the National Science Foundation to support mathematical  and statistical modeling education starting in elementary…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…program, we must not forget  the people behind these budgetary numbers. As such, I will highlight  one Massachusetts family today. I will be reading a poem entitled,  ``The Mathematics of Mercy.'' It was written by Betsy Johnson. Betsy is  an autism educator with the ARC of Massachusetts and a mother of two  young adult children with autism and other intellectual…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…legislation also  authorizes collaborative initiatives in education, training, and  development to build a stronger workforce in the science, technology,  engineering, and mathematics fields.\n\nLastly, this legislation promotes secure data and information  transfer capabilities between these agencies so that we are not working  in silos but are working…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the first U.S. mission to orbit the earth and that  the astronaut leading the mission, John Glenn, refused to go up into  space without the final sign off on the orbital mathematics of the  mission by NASA's Katherine Johnson.\n\nThese pivotal moments are all instances where the coming together of  people of very different backgrounds had immense benefits…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…testament to remarkable  intellectual ability, diligent preparation, and an unparalleled  commitment to academic excellence. It demonstrates not only mastery  across English, Mathematics, Reading, and Science, but also the  persistence, focus, and determination required to perform at the  highest level under rigorous testing conditions.\n\nMadeline's dedication…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 730) to coordinate Federal research and development efforts  focused on modernizing mathematics in STEM education through  mathematical and statistical modeling, including data-driven and  computational thinking, problem, project, and performance-based  learning and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…them.\n\nThose contracts paid for luxury hotel rooms, room service, 24-hour  snacks, laundry, bilingual television, recreation, cultural events, and  individual tutoring for mathematics and social studies. Most  shockingly, it paid for  pet therapy, music therapy, and horticultural therapy for illegal alien  children.\n\nIn 2021 alone, Endeavors paid Christy…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…grew up in Benson, North Carolina, the oldest of  four. He attended Shaw University, followed by North Carolina State  University, where he received a graduate degree in mathematics.\n\nHe married Lena Lockamy, with whom he shared 48 wonderful years of  marriage before Lena passed into her eternal heavenly home nearly 5  years ago.\n\nRichard and Lena had…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…light'' who ``lifted up those around her.''  I can't think of a better legacy to leave behind than that.\n\nShe went off to college at Brown, where she was studying French,  mathematics, economics, and was obviously very, very smart. She also  was a patriot who loved this country, and she served as vice president  of the College Republicans at Brown University.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698419/unanimous-consent-requests-the-calendar"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…achieving a high percentage of points based on  student performance across a wide range of academic indicators. These  include standardized assessments in English Language Arts, Mathematics,  Science, and Social Studies, as well as learning gains in English  Language Arts and Mathematics.\n\nAmong the most notable improvements were a 15 percent increase in  Algebra…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…represent our Nation's  next generation of STEM innovators. They serve as inspirations for  those around them to pursue opportunities in science, technology,  engineering, and mathematics. Their success helps provide recognition  for the important role STEM plays in keeping our country safe. I thank  them for their ambition and drive to participate in such…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694803/recognizing-penn-manor-high-school-students-for-their-achievement-in-the-sea-air-and-land-challenge"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Act seeks  to improve the quality of STEM education in America. This bill will  allow us to modernize math curricula and improve K-12 science,  technology, engineering, and mathematics (STEM) education.\n\nWhile this bill directs the National Science Foundation to grant  awards to educational institutions, it does not award any new funding.  As we look at…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688977/mathematical-and-statistical-modeling-education-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…in the  United States gave them all the techniques that we are using to teach  our students to be better scientists, to be better in the technology  field, to be better in mathematics, and to be able to compete better  with the United States. It doesn't make any sense.\n\nThat is why some of these bills are great bills that make sure that  we are reining…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}]