[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…is not just an inconvenience. It is a barrier that can mean the  difference between preventative help and a crisis.\n\nCommunities across the country face the same impossible math: too  many needs and too few providers.\n\nThat is why I have introduced legislation to support clinicians who  commit to practicing in rural areas and to expand telemental health…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696908/rural-mental-healthcare"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…to imagine that a friend came  over to you and said: Donald Trump taught me how to save 50 percent on  my shoe purchases. All you have to do is cut off one leg.\n\nIt is just math, as the gentleman from Arizona says. So let's get out  the saw and head to Foot Locker.\n\nNow, Madam Chair, if you were a good friend, you would tell them: You  are crazy, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688021/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…weakest among us--those who are disabled, those  who are elderly, those who are children--just not having access to  care?\n\nAs the Senator said, when you look around at the math--right?--this  isn't a political statement. The math of needing to find $880 billion  with a ``b''--the math just doesn't work without gutting Medicaid. I  think it is important…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…stamps.\n\nIn my district, Mr. Speaker, there are over 200,000 households that  rely on food stamps. If we multiply that by an average of three people  per household, we can do the math, and we can see that it will  devastate that community. This budget proposal by Republicans seeks to  cut, again, $230 billion in nutritional programs.\n\nThe $200 billion in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…he is actually walking  down the street naked because he doesn't have magic robes--in this  case, again, lying to the public about the cost.\n\nIn the real world, you have real math. In this special new world  under the Republican plan, you have the magic math.\n\nThis was not the vision that was laid out back 51 years ago, in 1974,  when the Senate created,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…getting squeezed from every  direction. Groceries cost more. Rent costs more. Childcare costs more.  Healthcare costs more. For too many families, every month feels like a  math problem they can't solve.\n\nFor generations, the American Dream meant that if you worked hard,  you could build a stable life, you could afford a home, you could raise  a family,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…STEAM Academy at the University of New  Hampshire. This program offers underrepresented young teens of color  the opportunity to explore science, technology, engineering, arts,  math, and black history in America for no cost. In addition, the  location of Dinah Whipple's trail blazing school is now a stop on the  Black Heritage Trail of New Hampshire.\n\nOn…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688247/recognizing-dinah-whipple"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…students, because of the  lifetime cap on student loans which are $257,000.\n\nToday, I talked to a physician from Roanoke, Virginia, who has  $500,000 in medical school debt. That math doesn't math. When you have  enough medical school debt, you have enough debt to pay for somebody's  house. Yet now, the next generation of students coming up behind him  can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…empower students. She helps them feel seen, heard, and  confident in classrooms where they are often told to shrink or stay  silent. She teaches her students more than just math. She teaches them  that they matter. She gives them a voice.\n\nI thank Ms. Suarez for being an incredible teacher and for her work  and deep commitment to her students.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…our government.\n\nNo nation can maintain its leadership status in the world without  investments made and attention paid to science, to science technology,  engineering, and math.\n\nIt is essential that we grow that population of scientists, of  engineers who can then provide for the muscle of our innovation  economy, to allow for that intellectual capacity…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…100 days, more than 220 lawsuits were filed  directly challenging his agenda. Federal judges have issued over 130  court orders blocking or pausing those actions. If we do the math,  Trump is being sued more than twice a day, and he is losing in court  more than once a day.\n\nThey have tried to fire Federal workers without cause, detain and  deport people…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…needs to have skin in the game, and if I pay a copay with my private  insurance, then why can't the expansion population pay a copay?\n\nHere is the difference. I have done the math, and someone in the  expansion population, an individual, is making $21,597 at most a year.  That is about $1,799 a month. In Richmond, the average rent on an  apartment is…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…from deepfakes, no protection from the poison  they are feeding our children. They want free rein, so they are putting  up $100 million in this next election.\n\nI just did the math, sitting at my desk, quickly. The average  individual contribution today is about $25. That is a lot of money for  some people, to give $25 to an election. If every single resident…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…eviscerate Medicaid would be devastating to  our country. The Republican plan is, unsurprisingly, short on details.  But they have put forward proposals that, if you do the math, mean  cutting a third of Federal Medicaid funding, all to give billionaires  and corporate special interests a tax break.\n\nNow, let's look at what this decidedly unreasonable,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…don't.\n\nPeople who are just struggling to get by are having precious  resources taken away from them.\n\nRight now, across this country, Americans are trying to figure out  the math. Are they going to be able to afford groceries for their kids?  They are trying to decide whether they can afford to go to the doctor.\n\nWhile that is happening, in real time,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…say that it is too much to ask to show an ID, I say  that it is nonsense. One citizen, one vote is the foundation of our  Republic.\n\nMr. Speaker, let me go ahead and do the math for you and everybody in  this room. One illegal vote is one too many. Let's pass the SAVE  America Act now, and let's save voter integrity and voter elections  right now.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…every which way possible to  avoid accountability and responsibility, and that is, as I have been  putting it around here to reporters and getting reported out, to do  basic math because that is, in fact, our obligation, is to do basic  math.\n\nUnfortunately, a whole bunch of my colleagues on the Democratic side  of the aisle and a whole bunch of my colleagues…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…of World Energy  reports that coal accounted for 58 percent of China's energy. Oil was  at 20 percent, and natural gas was at 10 percent. Some of my colleagues  struggle with math. I will just add that up for them. That is 88  percent of their energy production comes from hydrocarbon sources. That  means that the remaining 12 percent came from hydroelectric,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tonight, and some of what we  are going to do this evening is a little bit complex. It is going to be  a little bit thick, but we have double-checked and triple-checked the  math, which means that a number of our brothers and sisters will turn  their ears off almost immediately because, remember, Mr. Speaker, we  all work in a math-free zone.\n\nA couple…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…been made to the American people will be kept.\n\nWe need to have that conversation that Ms. Moore talked about. We  need to make structural changes to the program. We have a math problem.  In 8 years, if nothing is done, beneficiaries will not receive their  full payments. It is time we begin to have that discussion.\n\nMr. Speaker, for individuals who…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697234/claiming-age-clarity-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…fat content  to help students absorb vitamins like A, D, E, and K. It is also packed  with protein that helps keep the student full all the way through those  long afternoon math classes and then on through gym and on through  their sports activities, until they get home at night for dinner.  Simply put, it is one of the healthiest--it is the healthiest--option…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 998) to amend the Internal Revenue Code of 1986 to  require additional information on math and clerical error notices, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 998\n\nBe it enacted…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…enrolled in subsidized  ACA plans as well as Medicaid plans.\n\nThey don't want to talk about that because it screws up their pitch  when you actually walk through what we see in the math. We know the  American people believe and understand the morality and the great  economics of encouraging those that are able-bodied, able to work to  participate in society.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…excellent  performance on State-required tests, a 95 percent graduation rate, and  exceeding expectations for college readiness.\n\nIn high school, students learn more than just math and chemistry  equations. Rather, students build their work ethic, establish critical  thinking skills, and learn what it means to be a citizen of our great  country. Teachers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, let's have some fun with math and the  reality of what is going on in the world.\n\nFirst, let me get something off my chest. I hate it when I make a  mistake. Mr. Speaker, have you ever had that moment when…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…dollars? How  can you with a straight face go home and say: Oh, well, we were just  off a trillion.\n\nAnd this year, we don't have a budget because--I don't know--maybe  our math was so bad last year, we decided not to do it. But the deficit  next year is going to be $2.1 trillion.\n\nIt is getting worse, not better. Next year's deficit will be $100  billion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…public school serves 5,946 students from pre-K to 12th  grade, maintaining a student-teacher ratio of 18:1. Additionally, 70  percent of students are at least proficient in math and 65 percent in  reading.\n\nI thank the teachers and the Buford community for setting an example  for the State of Georgia and the rest of our Nation to follow.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691892/recognizing-buford-city-schools"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…twice,  whether it was in the American Rescue Plan or the Inflation Reduction  Act. Instead, they wanted to put their resources into their wealthy  environmentalists.\n\nCheck the math. Nearly half of all Americans get their insurance from  their employer, nearly a quarter from Medicaid, and a bit less than  that from Medicare.\n\nMr. Speaker, only 7 percent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…behind these microphones day  after day after day, is we have people who tell stories. We tell about  our feelings, but we don't seem to actually bother doing something  called math. The family slogan is: The math will always eventually win.\n\nI am going to do this a couple of times here.\n\nWe are in the middle of the reconciliation budget battles, the  propaganda,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the short end of the stick because it  absolutely increases deficits. No one can deny it.\n\nAnyone who wants to get in a room and come debate me with a  whiteboard, show me the math. At some point, if you are in Congress,  pass a math test because the Senate bill doesn't add up. It will  destroy this country with more deficits and the inflation tax that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689906/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]