[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…on right now while we try to  overturn Citizens United. I thank all the speakers today. I thank  Representative Neguse for helping organize this. I thank my staff,  including Matt Fisher, for helping get everyone together today.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Security-Department  of State, who led these negotiations and secured important provisions  which we could all be proud of.\n\nI thank the Appropriations Committee staff in particular: Matt Smith,  Erin Kolodjeski, Philip Tizzani, Ed Etzkorn, and Laurie Mignone, who  worked tirelessly to produce this legislation.\n\nI thank our counterparts in the majority, led by…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Thomas Blanford, Jackson Blodgett, Anthony Bocchino, Micah       Bock, Jody Bogoslavski, Savannah Bolender, Claire Bossong,       Scott Boswell, Taylor Bradley, Lindsay Brand, Matt Brennan,       Alyssa Bretan, Caroline Broom, Joseph Brown, Sarah Brown,       Alex Brunner, Britney Butler, John Byers, Larry Calhoun,       Jillian Cantrell, Molly Carpenter,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gentleman was  doing was cherry-picking cases basically to sow distrust in our  elections, just like Donald Trump does.\n\nIf the gentleman wants to read a list, I will read a list.\n\nMatt DePerno, a former Michigan Republican State attorney general  candidate, was charged with conspiracy and undue possession of a voting  machine.\n\nFormer Republican Michigan State…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…article in the Washington Post a  little while ago. This is a gentleman in Altoona, Pennsylvania. That is  not my district, obviously; that is the district of Congressman Joyce.  Matt Hornberger is 61 years old and from Altoona, Pennsylvania. Monthly  payments for him and his wife will rise from $670 to $2,054. He said  this: ``Between the high deductible…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Republicans are doing. We support anything       that can be done to maintain Medicaid. Please, Senator.\n\nDanielle, she writes:\n\nI am the oldest sibling to my two younger brothers, Matt       and Christian, who have been living with a rare neuromuscular       disease since they were diagnosed as babies. Throughout their       lives, Matt and Chris, along with…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…GARCIA of Illinois. Mr. Speaker, I rise to celebrate the 20th  anniversary of New Life Centers, an organization that I am proud to  represent in my district.\n\nLed by Pastor Matt DeMateo, New Life Centers started as a small group  working on community violence intervention programs and is now a  citywide movement providing our youth with mentoring, education,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Congratulating Loudon County High School's Football Team\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise to congratulate Loudon County  High School's football team, led by Head Coach Matt Reidenbaugh, on  making it to the State championship. They have put together a pretty  impressive season, and they will be taking on the Varina Blue Devils.  We wish Coach Reidenbaugh…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…President-elect Anne Murphy,  Vice President Jeffrey Landsman, Immediate Past President George John,  and other key officers: Greg Arcaro, Christian Fassetta, Philippe  Charles, Matt Koppe, Alix Schnee, and many more.\n\nFrom the floor of the House of Representatives, we salute the Rotary  Club of Yonkers-East Yonkers, and I wish them continued success in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I rise today to thank Matt Jansen for over  six years of outstanding service in the United States House of  Representatives working with the House Judiciary Committee, the House  Ethics Committee, and…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Co-op City in my 16th Congressional District.\n\nCo-op City benefits from the leadership of Joseph Russo, chairman of  the community board, and the excellent district manager, Matt Cruz. Co- op City residents on Community Board 10 include Board Secretary Nancy  Rosario; Stephanie Woods, who chairs the Youth and Education Committee;  and board members Janine…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…censuring him, and expelling him  is because the process hadn't happened yet. Democrats and Republicans  together did it, but they are thinking in solely partisan terms.\n\nEven Matt Gaetz, accused of having sex with a 17-year-old, was never  censured by the House of Representatives. Even with Speaker McCarthy  and others condemning him for what he did,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…with us today as a result of Congress stepping up.\n\nThis reauthorization keeps the momentum going, and it makes sure that  first responders--first responders like my husband, Matt, who is a  paramedic and a SWAT medic/firefighter--have the resources that they  need to save lives in the field.\n\nIt doesn't stop there. This bill supports a full range of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Global  Security Studies in May of 2025.\n\nKathy has returned to Michigan to continue her career in public  service and is currently the Digital Strategy Director for Speaker Matt  Hall in the Michigan House of Representatives, where I have no doubt  that she will continue to lead and serve with purpose in this new role.\n\nAlthough Kathy has moved on to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…agriculture. She supported world-class  faculty and helped prepare the next generation of leaders and  innovators to solve challenges and better our State and our Nation.\n\nMy husband, Matt, an Iowa State alum, and I, of course, look forward  to many more Cyclone games and know that Dr. Wintersteen will be  cheering on the Clones for many more years to come.\n\nMr.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697328/recognizing-dr-wendy-wintersteen"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…stand here today with our Republican  colleagues, including Mr. Fleischmann, who joins me as the dean of our  Republican delegation, to welcome our new colleague to the House.\n\nMatt Van Epps brings a great personal story to us here in the  Congress. He is a West Point graduate and a lieutenant colonel, and he  has a distinguished record of combat service…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Dr.  Matt Hanley on his well-deserved recognition as one of Georgia Trend  Magazine's 100 Most Influential Georgians for 2026.\n\nIn just under a year since assuming the role of president…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…address the situation of the lack of two-parent homes  in America and the degree to which it is caused by huge marriage  penalties in our welfare system.\n\nThe panel consisted of Matt Dickerson of the Economic Policy  Innovation Center, Terry Schilling of the American Principles Project,  Jamie Gillespie from the White House, Robert Rector from The Heritage…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Macomb, Illinois;       Joseph Ketcham, Paramedic Supervisor, MedicWest, Las Vegas,       Nevada; PJ Lowe, Advanced EMT, American Medical Response,       Jackson; Mississippi; Matt Magiera, Paramedic, Medstar EMS,       Summerdale, Alabama; Beau McFarlin, Flight Paramedic, Air       Evac Lifeteam, Marion, Illinois; Alexander Megquier,       Paramedic,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…been transported  back to Utah, where she continues to receive physical and speech  therapy and close care from her parents.\n\nI don't know Ashlyn, but I know her parents, and Matt and Shelly  Gwynn are the best people I have ever known. I am so fortunate to have  gotten to know them in this role. He is a police chief back home as  well as a State legislator,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699245/recognizing-ashlyn-gwynn"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…USA in the upcoming Olympics and  Paralympic Winter Games starting this Friday, February 6.\n\nLiam Cunningham of River Falls is competing in sled hockey. Dan Rose  of Tomah and Matt Thums of Ogema are both competing in wheelchair  curling. They overcame tremendous obstacles and hardships to earn their  position with Team USA. They are role models to young…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699752/congratulating-wisconsins-seventh-district-paralympic-athletes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to celebrate the  unanimous appointment of Matt Harris as president and chief executive  officer of the Northwest Georgia Joint Development Authority.\n\nMr. Harris brings a strong track record of innovation and leadership…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, I rise today to recognize my outgoing  communications director, Mr. Matt Reed.\n\nMatt has been on my staff for 2\\1/2\\ years. During that time, he has  been a crucial member of my team.\n\nMatt has tremendous work ethic, an infectious sense of humor,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700048/recognizing-matt-reed"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…NEWS       (ITN); Blair, Michael: SKY NEWS; Blair, Robert: NEW TANG       DYNASTY TV; Blakey, Leona: C-SPAN; Blanco, Hugo: AP-      BROADCAST; Blevins, David: SKY NEWS; Blitz, Matt: WAMU;       Blitzer, Wolf: CNN; Bloom, Daniel: CNN; Bluey, Robert: THE       DAILY SIGNAL; Blum, Andrew: BBC; Blumberg, Emily: C-SPAN;       Blumenstein, Rebecca: NBC NEWS;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…a moment to thank my subcommittee staff who worked  tirelessly on this legislation: John Rayfield, Reed Linsk, Lindsay  Sakal, Spencer Thompson, Nicole Bredariol, as well as Matt Dwyer and  the ranking member's team.\n\nMadam Speaker, I urge support of the bill on both sides of the aisle,  and I yield back the balance of my time.\n\nMr. GRAVES. Madam Speaker,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…to celebrate the birth of  Henry David Boylan.\n\nHank was born on November 24, 2025 at Virginia Hospital Center  weighing eight pounds, two ounces to loving parents Ansley and Matt  Boylan. Ansley serves as a valuable member of my team on the House  Committee on Energy and Commerce.\n\nI am grateful to have Ansley as a part of the Energy and Commerce  family,…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698466/recognizing-henry-david-boylan"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…as they navigate life after  loss. This resolution was inspired by one such organization, Camp  Freedom in Carbondale, Pennsylvania. Their executive director, my good  friend Matt Guedes, is in the Chamber with us tonight. He brought this  idea forward, and I thank Matt very, very much for a great idea and for  helping us see it through.\n\nMr. Speaker,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}]