[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…to debate this Congress where it  seems like it was just written by the gun industry and the gun  manufacturers.\n\nIt is disappointing. When gun violence happens, it doesn't matter if  you are a Democrat or a Republican. Bullets don't care who you voted  for. It impacts every single one of us in all of our districts.\n\nI am member of Gen Z, but I call…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695142/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…gentleman from Kentucky (Mr.  Barr) referred to me because the big banks hate me. They love him. They  support him. They don't support me. Let's see whose side he is on.\n\nAs a matter of fact, he is here talking about not being in support of  big bank mergers because he is trying so hard to get more community  banks. We need more community banks, but he…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…to provide  healthcare for their family, for their kids, or serving their country  does not make our military stronger, does not make our country safer,  and it will not--no matter what the Member says, it will not make  transgender people in this country disappear.\n\nI urge my colleagues to vote ``no.''", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…policy question, then we, Congress, have to draft laws that  are far more technical in specificity than we do now. That cannot be  done without major assistance from subject matter experts such as those  at the Congressional Research Service.\n\nTo that end, it is my hope that the millions we save from passing  this bill will be promptly reinvested in CRS…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…making that ideal a reality. In 1965, we  ensured that the Federal Government could rigorously protect the right  to vote--a right that protects all other rights, for that matter--with  the passage of the Voting Rights Act.\n\nTwo years later, after passing that civil rights bill, we confirmed  the first Black American to ever serve on the Supreme Court,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…epidemic.\n\nMr. Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to commend Omar Martinez Gonzalez for his work to ensure  that our neighbors, no matter their sexual orientation, gender  expression, ZIP Code, background, HIV status, or citizenship status  receive every single thing they need and deserve to live healthy,  thriving…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…her alive. I  have people, small business people in my district, that are calling to  say this is the first time they have ever had to go without insurance.\n\nThe fact of the matter is this is the right policy.\n\nNow, if people want to talk about how to deliver quality, affordable,  appropriate healthcare with less money going to hedge fund-owned  medical…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "Ms. MATSUI. Mr. Speaker, I rise today to speak in opposition to H.J.  Res. 88.\n\nIt shouldn't be controversial to say that air pollution is dangerous.  Every year, particulate-matter pollution kills more than 50,000  Americans. Study after study has linked air pollution to higher rates  of cancer, heart disease,  diabetes, cognitive decline, and, of course,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Education affirmed what Black America had  long known: separate is not equal. That landmark decision was more than  a legal ruling--it was a promise. A promise that every child, no matter  their ZIP code, deserves a fair and quality education.\n\nSince then, the Department of Education has helped to keep that  promise. It protects students from racial and gender…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…with us to build a pipeline and export more fossil  fuels to the United States. Right now, we barely have a relationship  with Canada because of the tariffs.\n\nThe fact of the matter is that there is a tariff on Canadian exports.  The bottom line, I guess, is the only way that we could get Canada to  maybe send us more oil or gas is if we did what President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…it was a leftwing person--I don't put any special boundaries  around that person--whoever it is, ought to be punished to the fullest  extent that the law allows. It doesn't matter what their party  affiliation is. But what does matter is you shouldn't jump to  conclusions. We don't have the empirical evidence of what happened,  last I heard. Maybe it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…perpetrators be held accountable in a showdown between the       colonial legal system and the British courts--helped unify       the colonies for the war to come.\n\n``[T]his is a Matter in which the whole American Continent       is deeply concerned and a Submission of the Colony of Rhode       Island to this enormous Claim of power would be made a       Precedent…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…States can just ignore it? As I said, that is illegal, and the  courts will likely tell him: You can't shut off the funding that we  appropriated and authorized.\n\nThis should matter to Republicans and Democrats. Every single one of  my Republican colleagues worked really hard to get this job, worked  really hard to become a U.S. Senator. Those of us who…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…feel seen, heard, and  confident in classrooms where they are often told to shrink or stay  silent. She teaches her students more than just math. She teaches them  that they matter. She gives them a voice.\n\nI thank Ms. Suarez for being an incredible teacher and for her work  and deep commitment to her students.           Celebrating Centennial Anniversary…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…With these advancements, mobile consumers now have  even greater connectivity and the comfort of knowing they can reach  first responders and loved ones in a time of need, no matter where they  may be.\n\nThe satellite evolution is also touching American farms by  facilitating advancements in precision agriculture. H.R. 1618 promotes  the innovation of satellite…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693468/precision-agriculture-satellite-connectivity-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…I could go back to the beginning of the Republic, with the Barbary  pirates off the coast of North Africa, but there is another example  much closer in time and, for that matter, on the border. That would be  President George H. W. Bush's decision to invade and topple the  Government of Panama in 1989. Without prior congressional approval, he  ordered…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…left American workers behind. Republicans continue to advance  progrowth, proworker policies that expand opportunity, reward hard  work, and help Americans to get ahead.\n\nNo matter where I go out in Iowa--Main Street businesses, farm shops,  manufacturing facilities, healthcare facilities--I meet the hardworking  men and women of Iowa who want to take…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698956/flexibility-for-workers-education-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…the  Oversight and Government Reform Committee for recognizing me and  allowing me to speak in support of H.R. 5143, the District of Columbia  Policing Protection Act.\n\nAs a matter of background, Mr. Speaker, in January 2023, the D.C.  Council enacted the Comprehensive Policing and Justice Reform Amendment  Act of 2022, the CPJRA Act, D.C. Law 24-345,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…thank my Republican colleagues and certainly House leadership,  particularly Mr. Crane and Mr. Nehls, for helping elevate the  Conference's concern on this very, very important matter.\n\nMr. Speaker, we must maintain a standard in the House of  Representatives, and any Member's refusal to adhere to the Speaker's  direction to cease such behavior, regardless…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…even say a word about in your opening statements? It is about spite. It  is about the fact that you don't want President Trump to arrest Maduro,  and you will condemn him no matter what he does, even though he brought  Maduro to justice with possibly the most successful law enforcement  operation in history.\n\nYour hypocrisy is clear, as you chant and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…rural communities. Oil and gas revenues fund education, essential  infrastructure, and community services across the State, making  responsible resource development truly a matter of life or death for  Alaskans. In 1954, the Interior Department, with the help of the  University of Pittsburgh, conducted a study of the health of Alaska  Natives. Many of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…all about methamphetamine in  our part of the world. It was the clandestine meth lab in the trunk of  a car or an abandoned barn or an old house. We dealt with that, as a  matter of public policy, by putting Sudafed behind the counter. We made  it harder for people to pilfer Sudafed and go out and cook up their own  meth. We knew that that was going…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691880/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…their voices pleading for a solution.  They are not asking for handouts or special favors. They are asking for  the basic recognition of their community's existence, that they matter,  and that they deserve the same tools for success as their neighbors.\n\nH.R. 3095 answers that call with a direct and practical solution.  This bill directs the United States…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Agriculture will forego any further       consideration of this bill. However, by foregoing       consideration at this time, we do not waive any jurisdiction       over any subject matter contained in this or similar       legislation. The Committee on Agriculture also reserves the       right to seek appointment of an appropriate number of       conferees,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…find a single thing to say  about Epstein when President Biden was in office, but now they want to  make this the centerpiece of their entire conversation.\n\nThe fact of the matter is right now they know it is true, and right  now what they don't want to do is have the American people focusing on  the Republicans in Congress who are doing the thing they…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you, they look  at you and say: But we right now take those dollars that you send us  because you have been buying our stuff, and we are buying your debt.\n\nThe fact of the matter is if you are a country that is borrowing $6  billion a day, does anyone understand the fragility, and I am going use  that fancy word a couple of times, because also interest--we…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "John Thune", "party": "Republican", "sentence": "…veterans. I know my  dad, a World War II veteran, never talked much about himself; it was  always about the men he served with, especially those who didn't come  back. But no matter how many times I hear this, it always stops me in  my tracks because it reminds me that we ask those who serve our country  to be willing to sacrifice everything--their entire…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Agriculture will forego any further       consideration of this bill. However, by foregoing       consideration at this time, we do not waive any jurisdiction       over any subject matter contained in this or similar       legislation. The Committee on Agriculture also reserves the       right to seek appointment of an appropriate number of       conferees,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…the technology that can do it. With artificial  intelligence, it is even quicker. We are here, talking about an AI  provision in the One Big Beautiful Bill Act that stays. No matter what  else they rule out, they seem to find a way for the AI provision to be  there for more surveillance on more people.\n\nWe have got to stop this. We need the legislature…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…ranking members: ``Hey, if you don't send us  anything up, you are making us happy. We want you to make the  decisions.'' The members of the subcommittees know the subject matter  better than anybody else. They have done the hearings. They have done  the work. They work well. The higher up the food chain it goes,  frankly, the more political the decisions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]