[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…can accept and our colleagues on the other side of the  aisle should embrace.\n\nThe problem here is one of trust. What we have seen from the  administration is a strategy of maximum pain to magnify political  pressure.\n\nIn just minutes from now, in the U.S. Court of Appeals for the First  Circuit, this administration will argue that SNAP benefits should…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…making the novel system changes to       implement the benefit reductions, USDA must notify States of       the effective date of the reduction and by what percentage       maximum SNAP allotments are to be reduced. See 7 C.F.R.       Sec. 271.7(d)(1)(i) and (ii).\n\n26. USDA is prepared to issue such notice and revised       issuance tables to State agencies…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Veterans' Appeals with  attorneys that have demonstrated expertise in this area, attorneys who  are experienced and who can see beyond quotas and metrics to apply the  law to the maximum benefit of veterans at the heart of the process.\n\nSo, Madam Speaker, I strongly support H.R. 659 and urge my colleagues  to do the same.\n\nI also want to mention another bill…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…states have been permitted to apply for       waivers to tax hospitals at rates exceeding the safe harbor       limit. Connecticut, for example, taxes hospitals at the       maximum       6 percent for inpatient revenues, but received a federal       waiver to tax outpatient revenues at slightly over 10       percent, said Paul Kidwell, senior vice president…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…finalized net payment.  Second, this bill would allow a penalty-free withdrawal if an  individual is involuntarily separated from the federal government. In  both cases, the maximum withdrawal would be $100,000. Individuals would  be able to make a withdrawal for up to a year after separation and to  repay the withdrawn amount within three years to avoid…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698468/introduction-of-the-thrift-savings-plan-emergency-withdrawal-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…foremost a public health protection measure. It requires facilities  that emit the worst of the worst hazardous air pollutants to monitor,  report, and cut those emissions to the maximum degree of reduction  achievable, even eliminating them entirely if possible.\n\nThe rule also prevents any backsliding by major sources of the seven  most dangerous hazardous…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…hypergraphs. This project, ``Tetrahedron-Intersecting Families of 3- uniform Hypergraphs,'' utilized computer programming techniques to  answer a long-standing question about the maximum number of unique  connection conformations that can be found in 3-uniform Hypergraphs  with the same vertices. Owen believes the result of his project is the  first time such…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688578/recognizing-owen-zhang-for-scientific-excellence"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…avocados sold in the U.S. Is Mr. Trump now an  avocado nationalist?\n\n``Then, there is the prospect of retaliation, which Canada and Mexico  have shown they know how to do for maximum political impact. In 2009,  the Obama administration and congressional Democrats ended a pilot  program that allowed Mexican long-haul truckers into the U.S. as  stipulated…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Russian economy is afloat but stagnant.\n\nAny shrewd negotiator should recognize that Russia is on the ropes.  Now is not the time to appease Putin. This is a time to exert maximum  pressure to bring him to the negotiating table hat in hand.\n\nThere are three things we must do now.\n\nFirst, we must continue to pressure Russia economically. This means…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…recognize  that our communities rely on the health of the Bay and signed the  Chesapeake Bay Watershed Agreement to regulate pollutants and implement  standards like the Total Maximum Daily Load, or TMDL. It is extremely  concerning that the PERMIT Act includes language specifically targeting  the Chesapeake Bay Watershed Agreement's TMDL by weakening the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…by Congress. The plain language of the       District Clause says no such thing; it does not mandate that       the District be any size or shape, except it limits the       maximum size of the federal enclave to ten square miles.\n\nHistorical practice confirms that Congress can change the       size of the District. In 1791, Congress altered the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…stay. On average, a  NICU stay is $70,000 a day. That is more than a single person who  qualifies for the enhanced premium tax credits under the Affordable  Care Act at the maximum rate of 400 percent of the Federal poverty line  makes in a year. That person makes $62,600. The average NICU stay is  $70,000.\n\nI was lucky not only because I was able to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…pay of all its employees. In the  117th Congress, the House Committee on Oversight and Accountability  passed this bill.\n\nUnder the D.C. Home Rule Act, Congress established a maximum rate of  pay of the CFO, and the D.C. Council does not have authority to  increase that rate. Congress does not cap, or otherwise establish, the  pay of any other D.C. employee.…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…today, entering the U.S. without inspection is  already a misdemeanor punishable by a fine and a sentence of up to 6  months in prison with enhancements that can increase the maximum  sentence up to 2 years. Under 8 U.S.C. 1326, if you unlawfully reenter  the country or are found to be here in the United States following a  removal or denial of admission,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…warfighters to intimidate, demoralize, hunt and       kill the enemies of our country. No more politically correct       and overbearing rules of engagement, just common sense,       maximum lethality and authority for warfighters.\n\nHe then gave them an ultimatum:\n\nIf the words I'm speaking today are making your heart sink,       then you should do the honorable…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "James Risch", "party": "Republican", "sentence": "…existing U.N. sanctions. Once U.N. sanctions return, all  member countries will have a duty to crack down on this illegal  activity.\n\nPresident Trump has once again instituted a maximum-pressure policy  to bring Iran to the negotiating table. I hope our European friends  will also take the next step to counter Iran's threat to regional and  global security…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…stretches nearly a mile--more than 4,500 feet--across the Tennessee  River. The site plays a crucial role in the movement of goods through  our country. The main lock has a maximum lift of 100 feet, making it  the highest single-life lock east of the Rockies. More than 3,700  vessels on average and 11.4 million tons of goods pass through Wilson  Dam's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Commandant       through a competitive search process;\n\n``(2) have expertise in Federal Indian law and policy,       including government-to-government consultation;\n\n``(3) to the maximum extent practicable, have expertise in       legal and policy issues affecting Native Hawaiians; and\n\n``(4) have an established record of distinguished service       and achievement…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…legislation or       State agency and department procedures;\n\n(B) include recommendations regarding--\n\n(i) the reduction or elimination of parking minimums;\n\n(ii) the increase in maximum floor area ratio requirements       and maximum building heights and the reduction in minimum lot       sizes and set-back requirements;\n\n(iii) the elimination of restrictions…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…invaluable tool for investing in small businesses  that build critical technologies and support American national  security.\n\nH.R. 754 builds on this success by increasing the maximum allowable  investments by SBICs from 5 percent to 15 percent of their excess  capital. This change will allow more significant private equity dollars  to go toward small businesses.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687921/investing-in-main-street-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…purpose of increasing water  flow.\n\nPresident Trump has taken executive action to restore the regulatory  definitions and standards to the law's original intent by allowing a  maximum water use of 2.5 gallons per minute for each faucet in a shower  system. H.R. 4593 would codify President Trump's definition by allowing  the 2.5 maximum flow rate to apply…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…moving or stationary targets at standoff range in a variety       of attack modes. The SDB-II employs a multi-effects warhead       (blast, fragmentation, and shaped-charge) for maximum       lethality against armored and soft targets. The SDB-II weapon       system consists of the tactical AUR weapon, a 4-place common       carriage system, and a mission…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Committee, consultants to the Committee, or       any other person engaged by contract or otherwise to perform       services for or at the request of the Committee. To the       maximum extent practicable, the Committee shall rely on its       full-time employees to perform all staff functions. No       individual may be retained as staff of the Committee…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Mohammad Anwar was murdered in  D.C. during a carjacking by two teenage girls. One of the criminals was  15 years old. She was convicted of felony murder, and she was given a  maximum sentence under D.C. law. She will be free when she turns 21  years old. That is 6 years for murder. That is 6 years for taking a  father away from his family. This bill ensures…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…to suspend the rules and pass the bill  (H.R. 970) to amend title 38, United States Code, to require the  Secretary of Veterans Affairs to periodically review the automatic  maximum coverage under the Servicemembers' Group Life Insurance program  and the Veterans' Group Life Insurance program, and for other purposes.\n\nThe Clerk read the title of the bill.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…actions of the People's Republic of China, it is the       policy of the United States to seek to exclude       representatives of the People's Republic of China, to the       maximum extent practicable, from participation in meetings,       proceedings, and other activities of the following       organizations:\n\n(1) The Group of Twenty.\n\n(2) The Bank for…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…goals of the program.\n\n``(d) United States Vendors.--Commercial Earth remote       sensing data and imagery referred to in subsections (a) and       (c) shall, to the maximum extent practicable, be procured       from United States vendors.\n\n``(e) Report.--Not later than 180 days after the date of       the enactment of this section and annually…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I have consistently called for  the maximum possible level of transparency when it comes to the heinous  crimes of Jeffrey Epstein. That is why I have consistently said that I  am inclined to vote for this bill, and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696819/epstein-files-transparency-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…concrete, and asphalt.--The       term `low-emissions cement, concrete, and asphalt' means       cement, concrete, asphalt binder, or asphalt mixture that       reduces, to the maximum extent practicable, greenhouse gas or       directly-related copollutant emissions to levels below       commercially available cement, concrete, or asphalt.\n\n``(8) Rural…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Secretary an application containing the substantive       work record and educational transcripts of the veteran that       the Secretary determines appropriate.''.       SEC. 3. MAXIMUM DURATION OF EMPLOYMENT ASSISTANCE UNDER                     VETERANS READINESS AND EMPLOYMENT PROGRAM OF                     DEPARTMENT OF VETERANS AFFAIRS.\n\nSection 3117(a)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695445/veterans-readiness-and-employment-program-integrity-act"}]