[{"senator": "Sharice Davids", "party": "Democrat", "sentence": "…through the torrent  of emotions--sadness, rage, loneliness, and regret. While counseling  cannot bring back the loved ones lost, it can help survivors process  the storm and maybe, just a little bit, blunt some of the pain.\n\nThe NTSB is also leading the accident investigation itself. The  agency deployed over 40 investigators alongside the Coast Guard,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…when a President negotiates in secret to have his  political rivals detained abroad? Is that allowed? Can he argue the  courts can't require him to call such a deal off? Or maybe he just  denies it and says any agreements are state secrets. Does that work?\n\nIf President Trump said he would pay El Salvador $6 million to  assassinate his rivals, I think we…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…to have air as clean as what California was  striving to achieve.\n\nAnd, yes, a lot of States adopted those standards, and some of the  other States might not like it. Maybe they are just fine with having  dirtier air, and that is their judgment.\n\nBut to tell California we can't set our own air standard, to tell  California that because other States are…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…how we can actually take the  power of the purse. You passed a bill for fiscal year 2025, and now we  are in--we are no longer in fiscal, but let's say we were. Well, maybe  I can just slow-walk the funds for the programs I don't want to fund.  That way, the decision is transferred to the Executive. Maybe I can  freeze them. Maybe I can impound them,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…remaining questions regarding  the insurrection on January 6, 2021.\n\nI have a radical idea. Instead of wasting time creating a select  subcommittee to investigate January 6, maybe, just maybe, we should  read the report that the January 6th Select Committee already finished  in 2022. Here it is: thousands of pages, millions of records, testimony  from Trump's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…similar condemnation and reaffirm the alliance's formidable defensive  capabilities.\n\nBut the response from President Trump has been silence or bizarre  musings saying maybe it was just a mistake by Russia. After months of  Russian President Putin ignoring Trump's deadlines for negotiations to  end the war in Ukraine, he is once again letting Putin embarrass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the military, the Justice Department, the  courts, many of them are bending knees and genuflecting.\n\nSomehow, you believe that you are showing respect, I suppose, or  maybe you are just currying favor.\n\nBe that as it may, the Justice Department, generals in the military,  and many of the courts are giving a genuflect. Wittingly or  unwittingly, he is…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…they are just bums and they are just  going to take that money and go buy crack or a bottle of wine, perhaps.\n\nLet me tell you why, Mr. Speaker. Consider this for a moment: Maybe,  just maybe, the only way they have to feel normal and to silence those  voices is to take a hit on that crack pipe and have 30 seconds of calm.  I am not just suggesting it.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…these guys suddenly decided they are in favor of endless  wars. The mental gymnastics that takes is nuts.\n\nMr. Speaker, if it looks like a cult, if it acts like a cult, maybe,  just maybe, it is a cult.\n\nI thought Republicans said they were going to lower food prices. Food  is just as expensive as it was 6 months ago, and now, we are dragged  into another…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…came to the House floor on Washington, D.C., we  could have done something to maybe rein in ICE, this agency that is  going around and terrorizing our neighbors. I mean, maybe--maybe, just  maybe--Renee Nicole Good and Alex Pretti would be alive right now if  maybe on the seventh D.C. bill, we did something about this.\n\nOn the eighth D.C. bill, we could…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…kindest, most  gentle, and genuine people I have ever met.\n\nI don't know about you, Mr. Speaker, but the House floor feels a  little less warm and a bit empty without Doug, but maybe I just miss my  friend.\n\nTo his wife, Jill, and the LaMalfa ``family''; ``family,'' our  prayers, our aloha, and our love are with you.\n\nMay you rest in aloha, my friend, until…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698745/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…it against  his political enemies or his business competitors, ignorant of what he  may do if you have ever expressed any criticism of him, his family, his  policies, or maybe you just expressed support for someone that with his  latest whim he is opposed to. Now he will have a master file that  includes you to persecute and even prosecute.\n\nToo intimidated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…protect the American homeland, protect the people of the United States  of America, and he has done a damn good job.\n\nMr. MAST. The President never explained it to me. Maybe he was just  trying to make room for Maduro and his wife.\n\nLet me answer some of the questions that my colleagues put up.\n\nWhy did President Trump take Maduro? It was to protect…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…that invites all people, regardless of  politics, religion, age, or income bracket to be united in taking part  in the freedoms we enjoy as a result of our Constitution.\n\nMaybe, just maybe, by joining together to mark this milestone, we can  awaken a fresh reverence and respect for our founding documents, our  collective national blessings, and the ideas…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hard. You can't actually talk about that.''\n\nIf we can't do the work, how do you save the country? How do you save  my kids' future? How do you save your own retirement? Maybe we can just  keep lying to each other and the public because the public really  doesn't want to hear these things.\n\nThere is a path to make this math work, but you keep telling me…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are around, the local sheriffs always say: What can we do to  help you? Maybe it is to secure a perimeter, maybe it is to transport  somebody who has broken the law, but maybe it is just to have a squad  car visible to let local people know that some serious law enforcement  work is going on.\n\nWhatever it is, the sheriffs of the State of Wisconsin are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…billion of fraud. Are we  allowed to work on that? Is that Republican or Democrat, or is it just  time to find a better way to actually think about these things?\n\nThat is maybe what we just opened up, assuming that my own leadership  and my own committee chairman are ready to do hard work, really  difficult things that, just like that baby, just like my…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Biden left office, he raised the bounty on Nicolas  Maduro to $25 million. Now, I don't know if my Democratic colleagues  thought that he would go: Wow, $25 million, maybe I should just turn  myself in.\n\nI would like to believe that when they put that bounty out there they  actually believed he should be removed from office.\n\nThere is an old Twitter…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]