[{"senator": "Al Green", "party": "Democrat", "sentence": "…ourselves now with the National Guard being sent into  various cities around the country, various States, without a request  from the Governors, without a request from the mayors, without a  request from the officials who are in a position to make that request,  without a request from the people, we the people not making that  request. I know that we…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Guard troops off the streets of Los Angeles, ruling  the deployment was unlawful. But that won't stop Trump from targeting  States and cities led by Democratic Governors and mayors for speaking  out against his power grabs.\n\nNow, just imagine if President Biden would have federalized and  deployed troops into Florida or Texas to combat gun violence.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…and public housing.\n\nThe bill reinforces efforts to combat homelessness by increasing  funding for homeless assistance grants by $366 million.\n\nIt protects investments for mayors and Governors by providing $3.3  billion for the popular Community Development Block Grants program.\n\nIt includes $58 million for housing counseling assistance for renters…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699579/consolidated-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…some  might think: Oh, this is just a nice issue? No, this is an economic  issue as well. If you can talk a little bit about the impact that this  is going to have and why mayors across this country should care, why  Governors across this country should care, and city councils. Why  should they care?\n\nMr. BOOKER. Well, that is the thing that is so significant.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…it is true. We work as a team, one of the strongest teams in  the country--a coordinated effort between our Federal delegation, our  Governor, and our county executives and mayors on the local level. It  is true in good times, it is true when we face adversity, and it was  never truer than we saw 1 year ago today.\n\nGovernor Moore and Mayor Scott raced…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…available for community members in  need of urgent crisis support. She was a founding member of North Star,  a partnership between the county commissioners and government, the  mayors of the four largest cities in Skagit County, and service  organizations to end homelessness and enhance effective delivery of  crisis response,  recovery and support services…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…1930, they started the Federal income tax code in the  United States of America. When they said we are going to tax people's  income at the Federal level, a lot of Governors, mayors, and local  elected officials said, no, they don't want a Federal income tax  because that will stop them from raising the taxes at the State and  local level. Since America's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…significance, including the  construction of Concourse E at Hartsfield-Jackson Atlanta International  Airport. He worked alongside influential figures such as former Atlanta  Mayors Maynard Jackson and Bill Campbell, and specialized in building  church structures.\n\nAdditionally, Overseer Carter was a trailblazer in agriculture,  producing livestock and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Operating Engineers, and  a legislative aide to the State Representative Jim McPike. He also  proudly led as president of the Illinois chapter of the National  Conference of Black Mayors.\n\nAs mayor, he prioritized bringing new business opportunities to  Venice and making sure that his door was always open to constituents.\n\nHis dedication to public service is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691471/retirement-of-mayor-tyrone-echols"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Madam Speaker, I rise to recognize the city of Beaverton  and Mayor Lacey Beaty for being selected as 1 of 50 finalists in the  2025 Bloomberg Mayors Challenge.\n\nSelected from over 630 global applicants, Beaverton's bold initiative  reimagines housing through community-led, intergenerational models that  put homeownership…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693977/recognizing-the-city-of-beaverton-and-mayor-lacey-beaty"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Fraternal Order of Police, Major County Sheriffs,  Hispanic American Police Command Officers Association, Peace Officers  Research Association of California, African American Mayors  Association, Moms Against Police Brutality, and the Prince Jones, Jr.  Foundation.\n\nThis collaboration, this coalition of law enforcement leaders and  community justice advocates,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700042/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…Minnesota--people who are  organizing mutual aid to get groceries and diapers to families; but  smalltown folks that hate to see this happen to their neighbors; and  local mayors and farmers and small businesses; Democrats, Republicans,  people who aren't political at all; law enforcement officers, faith  leaders, Second Amendment supporters, and civil…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…York City, even a city official,  Comptroller Brad Lander, was detained by ICE while trying to support an  immigrant friend.\n\nIf they are willing to rough up city officials, mayors, and even a  sitting U.S. Senator, what does that mean for the rest of us? These  tactics are to scare people. People are now afraid to go to court.\n\nHow does that possibly…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and personal whims.\n\nBut there is no question as to the fact that members of the military  are in major cities despite clear and consistent objections from  Governors, from mayors, from police chiefs, from community groups, from  citizens across the United States, and, yes, from Members of the U.S.  Senate.\n\nToday, in DC, California, Oregon, and Illinois,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…don't propose to change those  rules for anybody else, not for more than 300 million Americans, not  for the Members of the House of Representatives, not for Governors or  mayors but for themselves. They want to deal themselves a special legal  privilege.\n\nIn this Republican class war, a Great Gatsby economy where President  Trump has made more than…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696679/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…distinguished himself through public service as a  volunteer firefighter, councilmember, and Mayor of the City of Celina.  Sean has also served as President of the North Texas Mayors Association  and board member of the Celina Rodeo Foundation Board. In addition, he  has been the Vice President of Entitlements for Centurion American  Development Group since…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Police Command Officers Association       (HAPCOA)\n\nPeace Officers Research Association of California (PORAC)\n\nCivic, Community & Reform-Focused Organizations\n\nAfrican American Mayors Association\n\nNext Generation Alumni Leadership Council\n\nPrince Jones Jr. Foundation\n\nCoalition of Moms Against Police Brutality\n\nThis broad coalition reflects a shared understanding…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…mandate this. We are going to mandate that.\n\nThe truth is, we are not housing experts. We are not there in the  community. That is why God created members of city councils and mayors.  They are closest to the people. They should be in charge of housing.  They should be in charge of zoning. They should be in charge of  deciding what size the streets and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…President Trump has  delivered on this promise.\n\nDespite the incredible efforts by this administration to secure our  border and remove criminal aliens from our country, Democratic mayors  have doubled down on their failed sanctuary city policies that harbor  criminal illegal aliens and defy cooperation with Federal immigration  enforcement.\n\nIn my home State…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…issues that we have already heard about, but  it is important to note that those are not small issues for those  communities. They are problematic issues.\n\nWe have heard from mayors, local elected officials, and constituents  for many, many years--I think all of us that this bill is dealing  with--but I am referring particularly to Miami Lakes in Miami-Dade…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…not only  poorer, but America will become much less free.\n\nWe must enforce our immigration laws. It is going to be messy in some  cases, particularly because we have horrible mayors and horrible  Governors who want to ignore our laws. They want to fundamentally  change America, but our President, whoever that President is, has to  have the courage and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…don't need those or this piece of legislation that  involves the tax code isn't legit, it is just atrocious.\n\nHere is a list of people that support it: The African American Mayors  Association. The Hispanic American Police Command Officers Association,  the Federal Law Enforcement Officers Association, the Fraternal Order  of Police, Major County Sheriffs…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…held multiple hearings on the  failings of the Biden-Harris administration to secure our borders and  protect our citizens. In March, the committee heard from sanctuary city  mayors, who offered carefully crafted, lawyerly statements defending  their decisions not to work with the Trump administration as it works  to remove criminal aliens as quickly as…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Speaker, there was an important hearing that was not covered  enough in this Congress this week. In the Oversight and Government  Reform Committee, we brought in four Democratic mayors who refused to  say that our immigration laws should be enforced.\n\nIt is very difficult for President Trump to protect our country when  we have elected officials, mayors and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688662/highlight-of-trump-administration"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…challenges are not unique to Colorado. Across the Nation, over  65 communities, from rural communities to growing suburbs, are  struggling with these same issues. Governors, mayors, town boards, and  everyday citizens have raised their voices pleading for a solution.  They are not asking for handouts or special favors. They are asking for  the basic recognition…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]