[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Speaker, let's understand who is doing you in. It is the people  on the other side of the aisle. It is not too late. All we need are  four Republicans to join us and to show John McCain levels of courage,  not on the battlefield as he did in such an extraordinary way. Yes,  John McCain was an American hero and patriot.\n\nHe was an American hero and patriot.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…high ground.\n\nFolks who also took money from somebody named Jeffrey Epstein, as I  had my team dig in very quickly: Mitt Romney, the NRCC, Lee Zeldin,  George Bush, WinRed, McCain-Palin, Rick Lazio.\n\nI just want to be clear: If this is the standard that we are going to  make, just know we are going to expose it all, and just know that the  FEC filings…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…political activities to  disclose the true owner.\n\nThe Freedom to Vote Act also includes my Honest Ads Act, bipartisan  legislation that I first introduced with Senator John McCain, whom we  miss very much and his leadership when it comes to campaign finance.  This bill would require online platforms to take steps to prevent  foreign nationals from buying…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…individuals who served as air crew in the Armed Forces.\n\nI can't help but think of some of the giants of aviation our country  has had: Admiral James Stockdale, Chuck Yeager, John McCain, the  groundbreaking Women Airforce Service Pilots or WASPs of World War II,  the Tuskegee Airmen, astronauts, including the crew of Apollo 11. As a  nation, we have been lucky…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…too dangerous for journalists to even witness it.\n\nMr. President, I want to tell you, that was an incredible statement  and, I believe, totally wrong.\n\nAt the outset, Cindy McCain and others told us there is no diversion  by Hamas of the humanitarian aid. It just isn't coming into Gaza.\n\nThey went on to say that these children--of course, we see them…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…protections for preexisting conditions, and get away  with it.\n\nAnd the public turned so hard against the Republicans on that issue  that in this body, on this floor, John McCain cast the deciding vote,  thumbs down, on repealing ObamaCare. That is why we have it today  because of the bravery of that man.\n\nI wish and pray for the bravery of someone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…watching. If some people are not up at this  hour, watch it tomorrow. It is inspiring.\n\nAnd I would just ask my colleague a question. I was there. I spent 4  hours with John McCain before he voted. We talked and talked and talked  and went over the courage of his father and his grandfather in the Navy  and the courage that he hoped to show, as they did.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…amount of money that the Republican budget bill wants to give in tax  cuts to the very, very wealthy.\n\nSo you, I think, rightly put emphasis on and drew attention to John  McCain's decision--and, of course, we should always give credit to Lisa  Murkowski and Susan Collins, who also voted no in 2017 on the repeal of  the Affordable Care Act bill--because…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…meaningful, bipartisan climate  legislation was constant here in the Senate. I can think of four major  bipartisan bills here in the Senate. And I remember my friend John  McCain running for President, carrying the Republican banner into that  Presidential election with a completely solid and respectable climate  platform.\n\nWell, right after Citizens…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…once again letting Putin embarrass him on  a global stage.\n\nCan anyone here imagine Ronald Reagan being played over and over  again by the Russians like this? How about John McCain? How about the  Republican Party before Trump, which has sat quietly month after month  afraid to speak the truth about Vladimir Putin?\n\nIs there anyone in this Chamber who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…am still proud of was the formation  of the so-called Gang of 8--four Republicans and four Democrats who sat  down to write a comprehensive immigration reform bill. Senator McCain  led the effort on the Republican side, and Senator Schumer joined me  with others on the Democratic side. We produced a measure that had the  support of business and labor…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Military, National, and Public Service. The  Commission was established in the 2017 National Defense Authorization  Act. Back then, Senate Armed Services Committee Chairman John McCain  and I were trying look at how we could encourage the most qualified  individuals of all backgrounds to volunteer for military service. We  quickly understood that the question…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Care Act  50 times in the past decade--50 times they have gone after the  Affordable Care Act, and they have failed.\n\nOne time, thanks to the courage of the late Senator John McCain and  two of my other colleagues on the other side of the aisle, the last  significant threat to our healthcare system was defeated in 2017. Maybe  some people here still working…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…seniors, and hard-working       families.\n\nI love the appeal in that letter because it was an appeal that I am  reminded of when my colleagues Lisa Murkowski and the great John McCain  and an extraordinary friend Susan Collins when they voted to save the  Affordable Care Act. They listened to the appeal of people like this  gentleman.\n\nMy colleague sitting…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…was the closest possible vote. In the end, at least three  Republican Senators voted to save the Affordable Care Act, but the one  key vote and the one I remember was John McCain's. John McCain, an  extraordinary man, served this country in ways that we could hardly ask  anyone else to serve: a prisoner of war for over 5 years during  Vietnam, came…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…territory of Greenland from their nation.\n\nThis coming weekend and week, I will travel to the annual Munich  Security Conference, which my friend and late colleague Senator John  McCain helped build up into a critical gathering of the North Atlantic  community, of NATO allies, of Ministers of Defense, heads of state,  parliamentarians from all over the world,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…State, local, or Tribal agency to conform       with the revised regulations described in clause (i),       including any agreement pursuant to section 1046 of the John       S. McCain National Defense Authorization Act for Fiscal Year       2019 (49 U.S.C. 40101 note).\n\n(B) Report.--If the Administrator fails to issue or revise       regulations pursuant…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…more than 10 percent of that FMOC, has been found guilty of a       criminal penalty or assessed a civil penalty under section       1760 of division A of the John S. McCain National Defense       Authorization Act for Fiscal Year 2019 (50 U.S.C. 4819).\n\n(G) Whether the FMOC applying, or any entity controlling       more than 10 percent of that…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…chain).\n\n(C) Whether a company or stakeholder produces or provides       covered telecommunications equipment or services, as defined       in section 889(f)(3) of the John S. McCain National Defense       Authorization Act for Fiscal Year 2019 (Public Law 115-232;       132 Stat. 1918).\n\nMr. Speaker, I rise in support of H.R. 1765, the Promoting United…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…conduct an independent boat       traffic study at mile 7.4 of the St. Lucie River.       SEC. 317. LARGE RECREATIONAL VESSEL REGULATIONS.\n\nSection 3529(a)(3) of the John S. McCain National Defense       Authorization Act for Fiscal Year 2019 (Public Law 115-232)       is amended by striking ``this Act'' and inserting ``the Coast       Guard Authorization…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]