[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…percent of students who go to public schools.\n\nColleagues, that is the situation. That is the context in which we  find ourselves today as we consider the nomination of Linda McMahon to  serve as Education Secretary.\n\nWe could talk about Linda McMahon's qualifications, or, frankly, lack  thereof, but I am not shocked because President Trump isn't looking…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…to public schools.\n\nThe person who will help him do this, meaning totally weaken our  public school system and eliminate the Department of Education, is  billionaire Linda McMahon. As Trump's Secretary of Education, she will  dismantle the Department of Education from the inside out.\n\nPresident Trump told her that he wants her to ``put herself out of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…adulthood or regressing. They can be the difference  between a lifetime on disability versus a good job that someone can  actually raise a family on.\n\nThe President and Secretary McMahon claim that students with  disabilities will not be affected by their plans to gut the Department,  but they already are. Time and time again, they say one thing, and they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…prioritizing       weaponizing these laws to advance discrimination instead       of protecting students, including pregnant and parenting       students. Education Secretary Linda McMahon fired nearly       half of Department staff--with the Office for Civil Rights       (OCR), which is responsible for ensuring schools comply       with federal civil rights…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…first, not billionaires; who will stand  up for our kids--every single one of them--even if it means standing up  to Donald Trump and Elon Musk.\n\nOn each of these counts, Linda McMahon fails to make the grade. I  have had concerns from the outset about whether Mrs. McMahon has the  experience we should expect from an Education Secretary, and I am sorry…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, as we celebrate Public Schools Week, Senate  Republicans are preparing to confirm Linda McMahon, another of  President Trump's billionaire patrons, as Secretary of Education, and I  oppose such nomination.\n\nDuring her confirmation hearing, Mrs. McMahon demonstrated little…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…worries about sending her two kids with  special needs to kindergarten next year if there are cuts to IDEA, the  Individuals with Disabilities Education Act.\n\nUnlike Secretary McMahon, I actually know what IDEA stands for and  what it means for students. I have been an education advocate for  decades, and no one has ever said we need less money to meet…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Department of Education earlier this year when we were demanding  answers on when President Trump would illegally try to close the  Department.\n\nSince then, we have seen Secretary McMahon fire staff from the  building who investigate and protect the civil rights of students. We  have seen her slash funding for minority-serving institutions. We have  seen her…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…funded special education. Right now, the Federal Government is only  covering 12 percent of the tab, and that is unacceptable.\n\nNow President Trump and Education Secretary Linda McMahon are  threatening the very foundation of public education. They are slashing  education funding, stealing from children to give tax breaks to CEO  billionaires and millionaires.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. President, I rise today in opposition to Linda  McMahon's nomination to serve as the Secretary of the Department of  Education.\n\nAll across America, from small towns like Grand Marais to cities like  Grand Rapids, public schools…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688249/nomination-of-linda-mcmahon"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…institutions.\n\nThese are statutory responsibilities that Congress directed the  Department  of Education to fulfill. Instead of fulfilling those legal  responsibilities, Secretary McMahon decided to follow the Project 2025  playbook by outsourcing the work as part of the Trump agenda to abolish  the Department of Education.\n\nThese actions will make it more…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…hundreds more workers from the Education Department,  including the Office of Special Education and Rehabilitative Services  and the Office for Civil Rights.\n\nEducation Secretary McMahon--herself one of Trump's billionaire  buddies--has made the preposterous claim that the shutdown proved the  Education Department is unnecessary. This is the kind of  unsubstantiated--I…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…July 1 deadline.\n\nMore than 150 Democratic Members of the House of Representatives  joined a group of 42 Senators, including 10 Republican Senators, in  calling on Secretary McMahon and Director Vought to release the funds  by July 15. That date has obviously passed, but we have received no  answers.\n\nAlthough the administration did release the 21st Century…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, I was absent from the Senate on March 3,  2025. Had I been present for rollcall vote No. 99 on the nomination of  Linda McMahon, of Connecticut, to be Secretary of Education, I would  have voted no. As Secretary, Mrs. McMahon will be a rubberstamp on  President Trump's agenda to dismantle the Department…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, before my colleagues vote on the next  vote, Linda McMahon's nomination for Secretary of Education, they  should remember that a vote for Mrs. McMahon is a vote for draconian  cuts to education and rising property taxes for middle-class…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688393/nomination-of-linda-mcmahon"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, the Senate will soon vote to confirm  Linda McMahon to be Secretary of Education.\n\nI know that some people feel that the Secretary of Education should  have extensive experience in a school system; however, it is important…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…rightly noted that `` . . .  the decline and the quality of public education began when Federal aid  became Federal interference.''\n\nFortunately, President Trump and Secretary McMahon are committed to  returning control of education back to the States where it belongs and  empowering parents, local leaders, and definitely teachers, but putting  funding…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I rise today to recognize an exceptional  public servant, David McMahon, whose career reflects unwavering  leadership, unwavering patriotism, and a true commitment to the  security of America.\n\nDave has spent much of his life and service to the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, the Senate will vote later today to confirm  Linda McMahon to be Secretary of Education. Mrs. McMahon is an  accomplished businesswoman and public servant. She is known for her  role in building World Wrestling Entertainment, better…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…McDonald, Natashka:       Hispanic Link News Service; McFarland, Pamela: Engineering       News-       Record; McIntire, Mary Ellen: Roll Call; McLeod, Paul:       Capitol Forum; McMahon, Kevin: Townhall; Mejdrich, Kellie:       Law360; Menezes, Andrew: Roll Call; Mesch, Shelley: Inside       Washington Publishers; Messerly, Megan: Politico; Meszoly,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in California\n\nMr. KILEY of California. Mr. Speaker, I have sent a letter along with  several of my colleagues in the California delegation to Secretary of  Education Linda McMahon and Attorney General Pam Bondi asking them to  investigate a simple question: Why is it so stunningly easy to commit  fraud against the State of California?\n\nDuring the COVID…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]