[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…all the spending in  2010. By 2024, it was 15 percent. If you extrapolate that, by 2038,  about half of our spending could end up being from the top 100  individual donors. I mean, that is sort of where we are headed right  now, where you are going to have such a concentration of wealth.\n\nThere are countries that have that right now, today, and those…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…effectively, placing additional strain on State  and local resources.\n\nAt a time when grocery prices remain high and demand for assistance  is great, the loss of these shipments could mean fewer meals for  families in every corner of my State.\n\nFurther cuts at the hands of the administration to the USDA's local  food purchasing assistance program only add to this…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…President's clear desire to limit documentary  proof of citizenship to a small, exclusive, difficult-to-obtain list of  options?\n\nI would say in addition to my dear friend--and I mean that  sincerely--the gentleman from Wisconsin, I would like to remind him  that an estimated 165,000 women in his district in Wisconsin have a  different name on their birth…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to say to them:\n\nPlease know that you have won a battle. You have been able       to bring Mr. Garcia back to this country with your work.       However, that battle doesn't mean that the war is over. We       still have a war to fight because we have an authoritarian       President in office.\n\nI have in my hand, Mr. Speaker, a column from The Washington…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…installations  that operate on public lands in Alaska, California, and New Mexico.\n\nOur public lands do a lot. As we have already discussed on the floor  of the House today, they mean a lot to the American people.\n\nOne critical function that many Americans may not know about is their  role in supporting military training, readiness, and other strategic  missions…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697635/public-lands-military-readiness-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…saw, it's 600 times more  than what average workers are receiving. Yesterday the said news that  Elon Musk is going to be the first trillionaire in the world. What does  that mean and what's that about? If that is the only thing that has  value anymore, then we're in big trouble.'' I agree with Pope Leo and  hope our bill will have a significant effect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695551/introduction-of-the-billionaire-income-tax-act-and-noting-the-popes-concern-on-income-inequality"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…being cut.\n\nWith respect to reconciliation, as we just talked about a moment ago,  the $881 billion in cuts to Medicaid are a shocking development. We  know what that could mean for communities across the country is that  hospitals have to shut down, medical treatment facilities might have to  be closed, and people who perform medical services like…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…legislation that could hinder research at institutions of higher  education.\n\nIt is important to understand what calls for the closure of the  Department of Education would mean to local communities.\n\nThe Department of Education is responsible for protecting the civil  rights of students, exactly what this DETERRENT Act would do. The  Department of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…their  premiums.\n\nMr. Speaker, 22 million people, including 400,000 Arizonans with  marketplace coverage, are already seeing their healthcare premiums  skyrocket. These cuts mean the closure of rural hospitals in Arizona,  job losses in our healthcare sector, higher healthcare costs for those  with private insurance, and the overall stress to an already…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…percent  in SBICs. Raising this cap would dramatically increase the amount of  investment capital available to our country's small businesses for whom  even small investments can mean so much.\n\nAlready SBICs have helped marquee American companies like Costco,  Apple, and Intel get off the ground, back when they were just starting  out. SBICs fill a gap in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…we believe that when you work  hard and play by the rules, you should be able to live an affordable  life, a comfortable life, and live the good life.\n\nWhat exactly does that mean: good-paying job; good housing; good  healthcare; good education for your children; and at the end of the  day, a good retirement. That is the good life. That is the American…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…patriotic men and women,  many of them nonpartisan, who come to this work with the basic belief  in this country and in the power that must be checked by government.\n\nWhat do we mean? What kind of power are we checking?\n\nEvery day on this job, as I have traveled around the State of New  Hampshire, I hear about how big agricultural corporations are screwing…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…scared.\n\nMy office recently received a letter from Alexander, a special  education and social studies teacher in my district. Alexander is  worried about what funding cuts would mean for his students, who are  among the most vulnerable and underserved.\n\nToo often, the most vulnerable among us are forced to suffer from bad  policy decisions. In this country,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…dictatorship. It is their way or the highway.\n\nThere are six bills that are allowed to be considered under this  rule. Every single one of them is completely closed. What does that  mean? It means nobody can offer amendments. Democrats can't offer  amendments. Republicans can't offer amendments. They didn't even ask  for people to submit amendments. They like…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…arms behind him, and Alex Padilla writes: If they do that  me, what are they doing to farmworkers and cooks and domestics?\n\nWhat are they doing to other people? What does that mean if they are  using the violent force of government unjustly against him? This is a  breach. This body has not seen such a breach in my lifetime or longer  where the executive…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Korea.\n\nMama Gump said that stupid is as stupid does. President Putin is not  interested in peace. President Putin thinks President Trump took the  bullet train to Chump Town.\n\nI mean, I can tell you how I look at this and, I think, how most  Americans look at this situation. I think to myself: You know, my mama  didn't raise a fool, and if she did, it was…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…century or, in this case, 34 years since 1991.\n\nWe can do better. If we want to actually authorize force, we should  deliberate, vote, and authorize force, but Article I has to mean  something. Please support this amendment to end an endless  authorization of force.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695255/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…colleagues and  friends on the other side of the aisle is often used for political  purposes, and that is what we are seeing today. It is for political  purposes, but that does not mean we should not vote for this rule, and  it does not mean we should not vote for these bills.\n\nMr. Speaker, there they go again. It is just amazing. It is. It is  fascinating…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…disinflation.\n\nWhat is disinflation? It just means disinflation is when the rate of  inflation decreases, in this case from 9 percent to roughly 3 percent.  Disinflation doesn't mean prices are going down. It just means that  prices are rising less quickly. Under President Biden, they were rising  at 9 percent. Now they are only rising at 3 percent.\n\nIn…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…think the American taxpayers feel the same  way.\n\nWhat I am about to tell you, Mr. President--let me apologize in  advance--is deeply disgusting. It is deeply disgusting. I mean, it is  clown world on steroids. When I first read about this, I read it a  second time because I experienced slack-jawed astonishment. When I read  it a second time and I realized…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are actually every bit as bad as last year.  That means for every dollar we take in, in tax receipts--remember that  our tax as a percentage of GDP is basically back to the mean that it  has been for decades. For every dollar we take in, we will spend $1.43.  That is $1 in and $1.43 out. How long can we carry that on, Mr.  Speaker? Yet, you start looking…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…themselves. They will not be drained anymore by people who are  illegally in this country, ineligible, or who are able-bodied adults  who just simply refuse to work. That is all. I mean, I think that is,  as we say, an 80-20 issue in this country.\n\nNo, people aren't starving and being thrown into the streets with no  support who need it. We are protecting and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699637/supporting-safety-net-services"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…without indoctrination. I would  hope my esteemed colleagues on the other side of the aisle would agree  with me on that. Cultural exchange is valuable, but it should never  mean sitting through lessons created by the CCP propagandists  attempting to rewrite history and change our minds.\n\nOur classrooms are becoming front lines in a battle of ideas,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…exists,  from the driver at fault in order to have the damage paid for.\n\nFor the one in four American households who lives paycheck to  paycheck, an unexpected car accident might mean having to choose  between repairing their car or paying their rent.\n\nOf course, if the driver at fault is an illegal alien, it is more  likely to be a hit-and-run because they…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Thune", "party": "Republican", "sentence": "…partisanship President Trump  has encountered.\n\nWhen the American people elect a President, they expect that  President to be able to get his or her team in place. That doesn't mean  that Senators should never oppose nominations, but it does mean the  nominations should not be held up for purely partisan reasons. Or, in  the words of the Democrat leader,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…country.\n\nFor a change, I think a lot of people are finally saying that the  government is working for them instead of against them. Let's send a  clear message that law and order mean something, the Constitution means  something, and we can finally end this constitutional crisis.\n\nI applaud the President for moving forward and allowing the American  people…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…an estimated loss of $34 million  annually in State revenues from oil and gas production. These funds are  used to finance K-12 public education in the State.\n\nWhat does this mean for children in North Dakota? Failing to pass  this CRA could result in a $441 reduction in the amount of funds spent  on each child's education annually. This means fewer after-school…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…services, in the previous 240 years, we  borrowed about $28 trillion from the public. That is from investors  around the world, from your pension system, from everything. It would  mean, over the next 10 years, it pretty much would double. We are going  to double it or come close to doubling it in the next 10 years.\n\nThat is the perversity of what you have…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…participant-controlled brokerage windows and similar arrangements with  the investment returns generated by investments selected and monitored  by plan fiduciaries.\n\nWhat does that mean in plain English? It means basically, do you want  to be involved in the decisions surrounding your investments?\n\nMost defined contribution plans, like 401(k) plans allow participants…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…being the sole vote on the issue  before this body before with respect to what we are making public  because of the gentleman's, I think, very real concerns about what it  might mean for victims.\n\nWe had that debate and a colloquy back and forth in the Committee on  the Judiciary a few hours ago, about what we can do to ensure victims  are protected and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]