[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, the stock market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means we  are going to have to pay more on our debt.\n\nAt the same…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…with us exercising any oversight of it, to declare  war on any drug cartel in the world whenever he wants to, then our  Constitution, Article I, pretty much ceases to have meaning.\n\nWe just had an amendment to repeal the AUMFs. I listened to some of  those arguments. I support that amendment. I think it was a good  argument. The argument was for Article…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…increased taxes. Small businesses,       manufacturers, and ranchers are struggling with higher costs,       with additional economic pain likely coming in months.\n\nThe Chamber--\n\nMeaning the U.S. Chamber.       has long supported legislative proposals to reassert       congressional prerogatives on trade as a means to secure       durable outcomes. The Constitution…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…conflict, some of those Afghans who risked their  lives to help American soldiers came to the United States, and they  were given what is known as temporary protected status, meaning they  could stay in this country until the dangers in their home country had  abated.\n\nTPS is a temporary designation allowing certain foreign nationals  from countries experiencing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to deliver. I am,  unfortunately, not surprised.\n\nWhy is this? I think it is best summarized, actually, by paraphrasing  the pithy tweet of Elon Musk when he said, You guys, meaning you guys  on Trump's tariff team, haven't built squat, though he was a little  more rude in his choice of words.\n\nThe point I want to make is that this is not new. The ignorant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…thank my colleague from Alaska for  those very powerful words from himself and the Commandant.\n\nAs he has remarked, this Marine Corps birthday always has enormous  personal meaning for all of us who have served in the U.S. Marine  Corps, including for my son Matthew, who was in Helmand Province. I am  hopeful that he will invite his younger brother to…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…buying ads. It would ensure that all online  platforms disclose their buyers of digital political ads if the  platforms reach 50 million or more unique U.S. visitors per month,  meaning online platforms would finally have to follow the same rules  that TV and radio stations already follow for political ads.\n\nIt is simply insane that, in one medium, there…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…of our people over the course of her more than 50-year  career in social work.\n\nPhyllis was a beloved wife, mother, sister, grandmother, and friend.  She embodied the true meaning of public service and made a lasting  impact on her community and state. I ask my colleagues to join me in  recognizing the inspiring life and service of Phyllis Fulton.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…can take Gaza from the Palestinians. He seems to believe that the  Gazans can be relocated. Just place them someplace else. Give them nice  homes in some other place. Let us, meaning the United States or Israel,  have Gaza.\n\nMr. Speaker, that won't happen because the Palestinians have made it  very clear that they don't intend to leave their homeland,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…a lot of support for  public education in our country. Why? Because most of the people in our  country have to go to public schools.\n\nThe person who will help him do this, meaning totally weaken our  public school system and eliminate the Department of Education, is  billionaire Linda McMahon. As Trump's Secretary of Education, she will  dismantle the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…a gun that he or she used when they were  actually in service, at fair market value.\n\nNow you have riddled it with all of these other exceptions and  completely changed the meaning of the legislation in a way that moves  us backwards in terms of public safety. In America, 80 or 90 percent of  the American people want a universal violent criminal background…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to be known for.\n\nTo be clear, they made history for running the most closed,  antidebate Congress we have ever seen. In total, Republicans issued 115  totally closed rules, meaning 115 times where the House could not  debate a single amendment on the House floor. Republicans basically  told us: nope, no debate, no amendments, no input to make these bills…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…we are sending the message back, a  message that Jewish people have a place in America; that this is our  home as well; that our lives, that they have value and they have  meaning, just like anyone else; and that our country stands with it.\n\nSo I thank my colleagues on both sides of the aisle for allowing this  resolution to pass, and I want to thank…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…funding for the VA.\n\nBut I am here today to speak on behalf of all veterans who have been  fired by President Trump and Elon Musk.\n\nLook, Donald Trump couldn't tell you the meaning of the words  ``service'' or ``sacrifice'' if he had a dictionary laying open in  front of him. So how dare a coward who cried ``bone spurs,'' when his  Nation needed him…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…less for their work and  to pay them less than $7.25 an hour.\n\nThis bill allows employers to classify anyone who may receive a  seasonal or random tip as a tipped employee, meaning they can now be  paid below minimum wage by their employer. Those tips should be in  addition to a worker's wage.\n\nEmployers should not be able to pay their workers less because…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Administrator submits such report to Congress.\n\n``(d) Limited or Special Purpose Property Defined.--In this       section, the term `limited or special purpose property' has       the meaning given by the Administrator in the guidance titled       `Lender and Development Company Loan Programs' (SOP 50 10 8;       as in effect on June 1, 2025).''.\n\nMr. WILLIAMS…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spending--the rest comes out of the general fund and members'  participation, I think is about 15 percent, the fees they pay--but that  38 percent, that trust fund is gone in 7 years, meaning hospitals,  surgery centers will have an 11 percent cut, but I know we are all  going to talk and work on how we are going to revolutionize the cost of  healthcare.\n\nOne of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…spend as  much as $1 trillion through his illegal and irresponsible student loan  bailouts. Virtually nothing was done to control the cost of Federal  student loan programs, meaning students will be able to take on even  more in student loan debt and drive up the burden on all Americans,  even those who never went to college or received a degree.\n\nWhy…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…that right now. That is exactly what they  are doing, and they are fighting for it. Allowing illegal aliens to  vote is not only grotesquely unjust, but it waters down the meaning of  citizenship for American citizens who are here.\n\nMr. Speaker, our government should represent our people, American  citizens. Illegal aliens have no right to vote. They…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…and eating  disorders. Bear in mind, the responsibility is on the online platform,  and the duty of care would only apply to product features like  algorithms, not content, meaning that KOSA would safeguard free speech  while protecting our children.\n\nIn many ways, KOSA is common sense. We have many protections for  children in the physical world. Yet,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…alternatives.\n\nIf the plan fiduciary places pooled asset funds, like mutual funds,  on the investment menu, the fees are almost always lower, which  bolsters the fund's net return, meaning more money in the pockets of  the investor.\n\nBrokerage window participants are bypassing the investments selected  by the plan's investment fiduciaries and self-selecting…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…leak, Democrats released just 3 of the  23,000 pages of documents from the Epstein estate, and they made  redactions to two of those emails that changed both the context and  meaning of the three pages they released.\n\nWhen CNN called them out for their deceptive redactions,  Representatives Stansbury and Crockett tried to blame Republicans for  their own…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…smelt's entire range, the service ignores the fact that the species has  been found in dozens of locations, including in and around every  tributary of the San Francisco Bay. Meaning the longfin smelt is not at  risk of extinction and does not meet the statutory definition of an  endangered species.\n\nInstead of being based on science, this listing comes…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…established under section 2406(a) of the       John D. Dingell, Jr. Conservation, Management, and Recreation       Act (Public Law 116-9).\n\n``(3) Reserve.--The term `Reserve' has the meaning given       such term in section 8902(a)(3) of title 40, United States       Code.''.       SEC. 3. CONFORMING AMENDMENTS.\n\nSection 2 and section 3 of Public Law 107-315 (116…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…broken bone.\n\nBy the way, we can prove this.\n\nIn 2014, taxpayers covered 68 percent of an ObamaCare exchange  enrollee's premiums. By 2020, 60 percent had become 80 percent, meaning  that is how much the taxpayer was subsidizing. From 2021 to 2025--the  era of the enhanced premium tax credits--the taxpayers' share of  subsidizing the premiums on the exchanges…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…2(d)(2)(B) of Public Law 117-78 (135 Stat. 1527) under the       strategy developed by section 2(c) of such Public Law 117-78.\n\n(2) The term ``forced labor'' has the meaning given that       term in section 307 of the Tariff Act of 1930 (19 U.S.C.       1307).\n\nMr. Speaker, I rise today in strong support of the No Dollars to  Uyghur Forced Labor…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…respectively, in section 101 of the Federal       Credit Union Act (12 U.S.C. 1752).\n\n``(ii) Insured depository institution.--The term `insured       depository institution' has the meaning given the term in       section 3 of the Federal Deposit Insurance Act (12 U.S.C.       1813(c)).\n\n``(iii) Residential mortgage loan.--The term `residential       mortgage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…policies, accumulating over 26,000 days       of subsidized coverage--the equivalent of 71 years.\n\n66,000 SSNs in 2024 had more than a year's worth of       subsidized coverage, meaning multiple SSNs were being reused       across different policies.\n\n$21 billion in subsidies were paid out with no evidence of       tax reconciliation for 2023--meaning 32…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) Human cell and tissue product.--The terms ``human cell       and tissue product'' and ``human cell and tissue products''       have the meaning given the term ``human cells, tissues, or       cellular or tissue-based products'' in section 1271.3(d) of       title 21, Code of Federal Regulations (or successor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…correctional officers are unable to  carry firearms in the course of their official duties. Many State laws  also prohibit or restrict the use of firearms in schools and hospitals,  meaning security officers would be unable to purchase these devices if  they are needed.\n\nFor police departments, law enforcement officers can be unfairly  subjected to higher levels…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}]