[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, the stock market is decimated, almost 20  percent down, entering bear territory. At the same time, bond yields  are skyrocketing, meaning ordinary Americans are going to have higher  interest rates on their credit cards and their mortgages. It means we  are going to have to pay more on our debt.\n\nAt the same…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…with us exercising any oversight of it, to declare  war on any drug cartel in the world whenever he wants to, then our  Constitution, Article I, pretty much ceases to have meaning.\n\nWe just had an amendment to repeal the AUMFs. I listened to some of  those arguments. I support that amendment. I think it was a good  argument. The argument was for Article…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…increased taxes. Small businesses,       manufacturers, and ranchers are struggling with higher costs,       with additional economic pain likely coming in months.\n\nThe Chamber--\n\nMeaning the U.S. Chamber.       has long supported legislative proposals to reassert       congressional prerogatives on trade as a means to secure       durable outcomes. The Constitution…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…questioned a Justice Department attorney about the government's  shifting position on the scope of Trump's January 6 pardons.\n\nJudge Freidrich said, ``[p]ardons have to have a fixed meaning'' on  the day they are issued, and there has to be a ``clear definition of  the pardon that doesn't evolve or change.''\n\nUnfortunately, these individuals continue to pose…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to deliver. I am,  unfortunately, not surprised.\n\nWhy is this? I think it is best summarized, actually, by paraphrasing  the pithy tweet of Elon Musk when he said, You guys, meaning you guys  on Trump's tariff team, haven't built squat, though he was a little  more rude in his choice of words.\n\nThe point I want to make is that this is not new. The ignorant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…thank my colleague from Alaska for  those very powerful words from himself and the Commandant.\n\nAs he has remarked, this Marine Corps birthday always has enormous  personal meaning for all of us who have served in the U.S. Marine  Corps, including for my son Matthew, who was in Helmand Province. I am  hopeful that he will invite his younger brother to…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…buying ads. It would ensure that all online  platforms disclose their buyers of digital political ads if the  platforms reach 50 million or more unique U.S. visitors per month,  meaning online platforms would finally have to follow the same rules  that TV and radio stations already follow for political ads.\n\nIt is simply insane that, in one medium, there…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…of our people over the course of her more than 50-year  career in social work.\n\nPhyllis was a beloved wife, mother, sister, grandmother, and friend.  She embodied the true meaning of public service and made a lasting  impact on her community and state. I ask my colleagues to join me in  recognizing the inspiring life and service of Phyllis Fulton.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689503/recognizing-the-life-and-legacy-of-phyllis-fulton"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…these other persons.\n\nI have here something that has been removed from the wall of my  office. It is something that indicates who the persons were who  participated favorably, meaning indicating that there should be an  impeachment, when the first Articles of Impeachment were filed. This is  on the wall in my office. The press assumed that it would be only…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…a lot of support for  public education in our country. Why? Because most of the people in our  country have to go to public schools.\n\nThe person who will help him do this, meaning totally weaken our  public school system and eliminate the Department of Education, is  billionaire Linda McMahon. As Trump's Secretary of Education, she will  dismantle the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…frequently praises Mr. Posobiec online and calls his anti- Semitic insights valuable and incredible. Mr. Martin's own views are  saturated with deranged analogies that dilute the meaning of Nazism and  Fascism.\n\nIn one episode about the 2024 election, he compared President Joe  Biden to Adolf Hitler, which either means that Biden committed genocide  or that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enhanced ACA tax credits expire at the end of 2025,  which means that now people are paying more. Tens of thousands of  people in Massachusetts alone have now dropped coverage, meaning they  have no insurance at all.\n\nRepublicans don't have a plan to replace ObamaCare. They never have.  Fifteen years later, I am starting to think that they never will.\n\nNow,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…know cares--and it matters.\n\nThat is why I introduced my No Tariffs on Groceries Act. This bill,  it is simple--simple. It would exempt your groceries from Trump's  tariffs, meaning the costs won't be raised because of the tariffs. So  it is time that Congress reasserts its authority over trade and pushes  back against Trump's cost-raising tariffs.\n\nI…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…funding for the VA.\n\nBut I am here today to speak on behalf of all veterans who have been  fired by President Trump and Elon Musk.\n\nLook, Donald Trump couldn't tell you the meaning of the words  ``service'' or ``sacrifice'' if he had a dictionary laying open in  front of him. So how dare a coward who cried ``bone spurs,'' when his  Nation needed him…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…less for their work and  to pay them less than $7.25 an hour.\n\nThis bill allows employers to classify anyone who may receive a  seasonal or random tip as a tipped employee, meaning they can now be  paid below minimum wage by their employer. Those tips should be in  addition to a worker's wage.\n\nEmployers should not be able to pay their workers less because…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Utah, wildfire risk is  increasing. In 2024, more than 90,000 acres burned in the State. Along  the Wasatch Front, the number of fire weather days has grown by 15  since 1973, meaning fires now have a longer window to ignite and  spread. This is exacerbated by the accumulation of hazardous fuels,  caused by a century of fire suppression and a lack of active…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…that right now. That is exactly what they  are doing, and they are fighting for it. Allowing illegal aliens to  vote is not only grotesquely unjust, but it waters down the meaning of  citizenship for American citizens who are here.\n\nMr. Speaker, our government should represent our people, American  citizens. Illegal aliens have no right to vote. They…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Washington, DC and Environs'', numbered 869/86501 B,       and dated June 24, 2003; or\n\n(2) the Reserve.       SEC. 3. DEFINITIONS.\n\nIn this Act, the term ``Reserve'' has the meaning given       such term in section 8902(a)(3) of title 40, United States       Code.\n\nMr. CRANK.  2290, the bill now under consideration.\n\nMr. Speaker, I rise today in support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…with workers' compensation  fraud.\n\nThe State auditor also just came out with a scathing high-risk audit  identifying the agencies in California that qualify as high risk,  meaning they exhibit a serious risk of waste, fraud, abuse, or  mismanagement, and have failed to take corrective steps.\n\nThe number of these high-risk agencies is now at an all-time…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Bill Act is the  best chance in a generation to pass critical reforms that the American  people voted for:\n\nIt delivers tax relief, the largest tax cut in American history,  meaning an extra $5,000 in Americans' pockets with double-digit percent  decrease to their tax bills.\n\nIt makes the Trump tax cuts permanent, preventing the largest tax  increase…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…alternatives.\n\nIf the plan fiduciary places pooled asset funds, like mutual funds,  on the investment menu, the fees are almost always lower, which  bolsters the fund's net return, meaning more money in the pockets of  the investor.\n\nBrokerage window participants are bypassing the investments selected  by the plan's investment fiduciaries and self-selecting…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…correctional officers are unable to  carry firearms in the course of their official duties. Many State laws  also prohibit or restrict the use of firearms in schools and hospitals,  meaning security officers would be unable to purchase these devices.\n\nFor police departments, law enforcement officers could be unfairly  subjected to higher levels of liability exposure…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…SEC. 2. DEFINITIONS.\n\nIn this Act:\n\n(1) Human cell and tissue product.--The terms ``human cell       and tissue product'' and ``human cell and tissue products''       have the meaning given the term ``human cells, tissues, or       cellular or tissue-based products'' in section 1271.3(d) of       title 21, Code of Federal Regulations (or successor…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…event tickets are generally sold or       distributed in interstate commerce.\n\n(5) Event ticket; ticket issuer.--The terms ``event       ticket'' and ``ticket issuer'' have the meaning given those       terms in the Better Online Ticket Sales Act of 2016 (Public       Law 114-274).\n\n(6) Event ticket fee.--The term ``event ticket fee''--\n\n(A) means a charge…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…overtime, no tax on Social Security for senior citizens, no tax on auto  loan interest for certain personal car loan deductions, and even the  increased standard deduction, meaning that D.C. taxpayers who do not  itemize their tax deductions will not be able to claim the full amount  of the federally expanded standard deduction in their local tax  returns.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…population that used to, at least, make an attempt to be moral? How do  we keep our promises in--what is it--7 years now, the Social Security  trust fund is empty.\n\nBasically, meaning, if Social Security follows the law, my math a  couple weeks ago was a 21 percent cut in Social Security checks across  America. So 2033, it is gone. Mr. Speaker, 2034 is…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…``together''--I am not making this up--and so you now have your  premiums together, but it is defined as being separate.\n\nOnly in government can you define ``separate'' as meaning  ``together.''\n\nSo we still have this one form of healthcare in America that violates  this 50-year-old compromise: We don't use taxpayer dollars and compel  Americans who…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…walk-in coolers. These are rules that  would have driven up costs and reduced choices for small businesses.\n\nOne standard had a payback period--if you can get this--of 90 years;  meaning, a small business would start saving money almost a century  after purchasing an appliance. That is absurd, and it is just one  example of the regulatory burdens Congress…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…2023. In 2022,  those powerplants announced they would no longer close, which EPA  counted for in their good neighbor rule, so the Supreme Court  subsequently stayed that rule, meaning that Indiana was forced into  their now-outdated 2021 emissions budget.\n\nThe Trump administration's EPA finalized this interim rule that this  CRA would repeal to adjust Indiana's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…our  own leadership and the executive branch. That is something I was not  going to do. There was bipartisan support that this was not a good  idea.\n\nThe rule did not pass, meaning that this accounting trick of a day is  not a day is no longer in effect. As such, a resolution has now ripened  regarding one particular state of emergency. This is to say,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}]