[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…changes to our public health  system that have caused needless outbreaks of disease. This President  has most assuredly not made America great again, but he has managed to  make measles great again. And when experts gently try to correct these  falsehoods, they are attacked, doxed, and threatened. This is part of a  deliberate cultivation of ignorance as…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…in danger.\n\nWe cannot put our heads into the sand. We absolutely need a Secretary  of Health and Human Services--not a ``Secretary of Conspiracies,'' not  a ``Secretary of Measles and Food Poisoning,'' certainly not a  ``Secretary of Canceled Research and Chemtrail Nonsense.'' It does not  take a shred of imagination to see how dangerous R.F.K., Jr.'s,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…detention  facility, recently reopened by Trump, a facility where families report  there is contaminated food, limited access to clean water, and where  there have been confirmed measles cases.\n\nYour tax dollars are funding this.\n\nLast Friday, I traveled to Texas to fight to bring Diana and her  family home to Oregon. I am grateful that Diana is home safe…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…these  cures that has always been so bipartisan or the rhetoric around  vaccines, which so many of them know their kids need. I just found out  this year I had no immunity to measles. I got the shot, but it was at  the wrong time. So I got that vaccine. Right now, so many people don't  even know. They turn on the TV, and they hear the HHS Secretary  question…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Kennedy should be lauded for his campaign to remove dyes  from food, and I think that is admirable, but removing dyes from drinks  and foods won't protect kids from the threat of measles, chicken pox,  polio, or other diseases.\n\nVaccines are safe, effective, and our best defense against life- threatening diseases.\n\nI urge all Americans to trust our scientists,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…an ICE detention center. Also, Mr. Speaker, what they are  doing right now to my own constituent, Steven, a 14-year-old boy with  autism in a detention center plagued with measles, it is  unconscionable. It is unacceptable.\n\nMany of us are clear: The Department of Homeland Security is the  greatest threat to the homeland right now, and that is why we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…school,  they rightfully expect that they will be safe and protected. Parents  expect their kids to bring home knowledge, not polio. They expect them  to share stories, not measles. They expect them to get smart, not  smallpox.\n\nThe reality is, this has been the case for decades because we have  had vaccines to safely and efficiently keep students protected…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…He is doing the administration's bidding to  eliminate funding that goes toward finding cures for cancer,  Alzheimer's, and rare diseases; and in the midst of outbreaks of  measles--a disease that researchers had virtually eliminated--he has  pressed forward with firing thousands of vital workers in our health  Agencies. This is not efficient, and it…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…just  so unchristian.\n\nThen, we are talking about cutting Health and Human Services so that  if we are trying to make sure that folks don't get tuberculosis, that  we keep measles at bay, that we keep HIV at bay, well, if you are at  risk, you are going to be in greater danger because the proposed cuts  would be cutting NIH, the National Institutes…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Speaker, I rise today to demand the resignation of  Robert F. Kennedy, Jr., as Secretary of Health and Human Services.\n\nSince taking office, RFK Jr. has failed to recommend the measles  vaccine for children, even after the deaths of two children. He said  pregnant women should not receive COVID vaccines. He has pulled funding  for vaccines for diseases like…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692028/demanding-resignation-of-robert-f-kennedy-jr"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…charade wrecks public services and Trump's ``beautiful''  tariff wrecks our economy and heads us straight toward a recession.\n\nWith soaring debt, plummeting markets, and a measles outbreak, I have  to give the Republicans credit for turning America red, but not the way  we expected.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689897/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…to enter, and to this point, he has  utterly failed and is making Americans sicker.\n\nLook at what he has done in just 4 months. We are currently watching  the largest single measles outbreak in our Nation in 25 years--25  years. There are 1,000 cases, and one-third of them are children  younger than 5 years old. Three people have died, including two young…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…dire  consequences of these terminations.\n\nFor example, he terminated people who were running clinical trials at  NIH, clinical trials on things like Alzheimer's, cancer, and measles.  Take the measles one, for example. I ran into a woman at a church I was  attending a few weeks ago. She had a Ph.D., and she was working on a  clinical trial in measles.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…forced into unnecessary gender- affirming care. There is not.\n\nThe epidemics killing our children are drug addiction, overdoses, gun  violence, and preventable diseases like measles. Let's work on that.\n\nBanning doctors from providing healthcare to transgender young people  has serious unintended consequences. Politicians are getting in the way  of doctors,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698358/protect-childrens-innocence-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the health of their communities. As of March 20, when it comes to  vaccines, what we are seeing in America--talk about getting less safe-- there were 378 confirmed cases of measles throughout the United States.  As one of my doctor friends said, there are more children with measles  right now than there are trans athletes in the NCAA.\n\nThis is a real…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "26, 2025]     RFK Jr.'s Leadership Brought an End to the Texas Measles Outbreak                         (By Rep. Jodey Arrington)\n\nThe world has witnessed a concerning surge of measles       cases. Europe reported 127,350 cases in 2024--the highest…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}]