[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…got ready for Black Maternal Health Week, I wanted to first  figure out is there a theme this year on which we should focus our  efforts. As I got ready to prepare my social media posts, as I got  ready to prepare the topics that I would have if I had a roundtable, I  thought, well, the Office of Maternal Health, the Office of Minority  Health, they…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…assessment. The links are as  follows:\n\nThe combined letter notification to Congress can be found at:  mccollum. house.gov/sites/evo-subsites/mccollum. house.gov/files/evo- media-document/blm-correspondence_rep-westerman_ rainy-river- withdrawal-combined.pdf.\n\nThe redacted environmental assessment can be found at: Mccollum.  house.gov/sites/evo-subsites/mccollum.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is about taking from the  most vulnerable to pay off the already powerful. It is about pleasing  one man who is holding this Congress hostage with primary threats and  social media tantrums.\n\nThis bill is cruel. It is cowardly. It is a betrayal of everything  this country is supposed to stand for.\n\nI want to alert all Members to something about this rule.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…other definition, by the way, has to do with command and control.  Those are words we remember from the Communist era, command and  control. Well, holy smokes, there is not a media company, a law firm,  or a university that has not been subject to the command and control of  the Oval Office.\n\nThe President has demanded money. It looks a little like extortion…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…funding, can broadcast local school board meetings  for parents and families to stay in touch with what is happening in  their communities.\n\nWithout Federal support for public media, this critical information  could disappear for Wisconsin families. This is what public  broadcasting means for Wisconsinites, but it applies to all the States  that we represent.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…year--because of  what? President Trump's economic policies are driving up the prices of  groceries. The President claims the opposite, but that is not a fact.\n\nIn a social media quote, President Trump said, ``Prices for a  Thanksgiving Dinner is now down 25% . . . since 2024.''  ``AFFORDABILITY,'' he said, ``is a Republican Stronghold.''\n\nDoes the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…taught to regulate emotions.  Things that in my age were settled on the playground with a fist are  now settled with a gun. Mr. Speaker, you can call someone a name on  social media, and the next thing you know, you are shot dead. We need  to do something to address that gun violence.\n\nI was proud to come to Congress to try to continue to work on that,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…concern about the trend of private  equity firms attempting to buy up college sports. These deals will be  bad for athletes, students, and fans.\n\nWe have seen this play before. Media corporations' pursuit of college  football and basketball viewers created nonsensical conference  realignment that destroyed the regional nature of  college sport. For generations,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699263/college-sports"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Members of Congress to make these  decisions in their best interests.\n\nWe have to put our foot down because we know it will not stop here.  Today it is funding for local public media, but tomorrow it could be  funding for infectious disease research, public education, or weather  forecasting--all on the chopping block.\n\nThey have made it pretty clear that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…law enforcement--Deerfield and Springfield Police,  and the Hampden, Hampshire, and Franklin County Sheriff's Departments-- for keeping us safe along the march.\n\nI thank our media sponsors--New England Public Media and WRSI 93.9,  The River--for broadcasting the walk and raising awareness among people  in western Massachusetts.\n\nI am so grateful to my…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697684/16th-annual-march-for-the-food-bank"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…will be hurt by Donald Trump's cuts. Forty billion  dollars would cancel a chunk of student loan debt for nearly 4 million  borrowers. Forty billion dollars would fund public media.\n\nMs. WARREN. OK. I am almost there.\n\nAm I recognized to do that, Mr. President?\n\nMs. WARREN. As I was saying, I was talking about what this $40  billion that Donald Trump…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696350/trump-administration"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Chamber will have a chance to do, but that really is  being had by millions of Americans across the country in their living  rooms and their group chats, in the comments on social media. There are  a lot of things that we debate here that fly under the radar that,  maybe, impact a lot of people but are not on their minds. This is on  everyone's mind. Whether…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…these individuals continue to pose a dangerous threat  to our democracy--and law enforcement.\n\nJust last month, dozens of former January 6 offenders joined forces  on social media to compile and publicize the identities of at least 124  individuals who had been involved in their cases--including  prosecutors, judges, and FBI agents.\n\nThe post, which…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…not. These changes will increase transparency while  including commonsense exemptions to protect the First Amendment rights  of websites that are simply part of traditional media.\n\nThird, the Freedom to Vote Act would strengthen rules banning the  coordination between candidates and super PACs to make sure candidates  cannot evade contribution limits…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…that Vice Chair  for Communications, I have worked hand-in-hand with Emma to find new  ways to address the challenges facing our country, adapting to a  constantly evolving media environment to connect with the American  people and earn their trust. Emma's hard work has ensured every New Dem  Member and their staff has the tools, knowledge, and resources…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…equal       to six months, or an employee of a federal government agency       liaison office housed within Senate space. Interns, clerks,       unpaid fellows, members of the media, and other non-      government employees that provide services to the Senate are       not covered under this term.\n\n2.6 Fitness facilities means the U.S. Senate Health and…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690978/us-senate-health-and-fitness-facilities-regulations"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Committee,  Leadership, and House Officer organizations, enhancing the orientation  program and professional development offerings for the Aides, and  launching the program's social media presence and dynamic website.\n\nMac's impact on the program is best seen in the lives and careers of  the many Aides who came through during his tenure as Director. From  December…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…market-based       policies that promote innovation, competition, consumer       access, digital inclusion, workforce development, and       economic growth in the communications, media, and technology       markets;\n\n``(B) conduct studies, as delegated by the Assistant       Secretary or required by Congress, on how individuals in the       United States…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…None of these tax hikes are necessary. The populists argue that the  threat of tariffs is needed to force Canada to stop the flow of illicit  drugs. In fact, one of the social media posts today said there was  going to be a tariff on fentanyl. Really? You think the drug dealers  are going to pay a tariff on fentanyl? Fentanyl is not being tariffed.  That…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…what Big Tech is doing to our children in this  country. There is an entire generation of children that have become the  product when they are online on some of these social media platforms.\n\nWhat we have learned, as we have worked in a bipartisan basis-- Senator Blumenthal and I, working for over 5 years addressing these  concerns--what we have learned…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…examination authority of these firms and what it would bring. The firms  within the scope of this rulemaking are payments firms, but some of  these firms also have a social media element to their businesses.\n\nIf we fail to act here in Congress, there will be career bureaucrats  from the CFPB with the authority to examine some of the most  influential…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Secretary of the Treasury       shall make the unclassified portion of the report required       under subsection (a)(1) available to the public on the       website and social media accounts of the Department of the       Treasury--\n\n(A) in English, Chinese, and any other language that the       Secretary finds appropriate; and\n\n(B) in precompressed, easily…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Tech'' would be willing to do to shut  down the predator superhighway if they faced actual consequences. While  I could fill hundreds of pages with stories about how social media is  harming our youth and supplement it daily, I want to focus on stories  from my district and my home state of Florida.\n\nAs a successful Section 230 defense often results…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the Staff Director's designee, and the Vice Chairman       may authorize the Minority Staff Director and the Minority       Staff Director's designee, to communicate with the media       in a manner that does not divulge classified or committee       sensitive information.\n\n10.6. No member of the Committee staff shall be employed by       the Committee…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fund endless war. They wear it to say that they care.\n\nBut where were they when Iryna Zartuska was being brutally stabbed in  public transit in North Carolina? Where is the media who were outraged  when Daniel Penny, a marine, stopped a violent offender on a New York  subway and then was the one being charged and prosecuted for a crime?\n\nWhat if Iryna…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Appalachian region.\n\nOther Notable Partners: Shelcy Mullins, Sr. Fairgrounds; Lonesome  Pine Airport manager, Jarrod Powers; RX Partnership executive director  Amy Yarcich; Ryan Media Lab chief executive officer Mark A. Ryan and  partner Kyle Mark Ryan; and Wise County UAS event coordinator,  Andrianah Kilgore.\n\nAt that time, delivering medical supplies…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…are our children and young adults.  They are being targeted and exploited through their phones, through  their computer systems, through gaming systems, and through social  media. Every 30 seconds a child is sold into slavery. Every 30 seconds  another child is sold into slavery.\n\nHuman trafficking is not just a distant overseas problem. The issue…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…The great people of North Carolina didn't send me here to manage  decline. They sent me here to help President Trump usher in the new  golden age. Let the left scream. Let the media moan and grown, but  today we are putting Americans first and looking out for their hard- earned tax dollars. I urge a ``yes'' vote.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…embarrassment, humiliation,  and shame that we still deliver on the backs of women who have been  brutalized, who have been raped, and who have been assaulted. There is  shame that the media pours over their heads. Their colleagues, their  friends, their neighbors, their loved ones--because you come forward  and because you talk about sexual assault, you are not…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise to provide an 11-month update to the  American people.\n\nWhile most media outlets struggle to be honest with the American  people, under the administration of President Donald Trump, a  Republican House, and a Republican Senate, America is back.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}]