[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Committee forced  through their reckless 2026 Labor, Health and Human Services, and  Education, and Related Agencies funding bill that assaults public  health, slashes medical research, eliminates funding for reproductive  health, and eviscerates education and job training.\n\nThey used this bill not to right the wrongs of their big, ugly law,  but to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Members are  out of touch. It is part of a very disturbing Republican trend, led by  the President, to purge the government of real experts and to slash and  burn, like medical research, finding the cures and treatments that we  need to survive and thrive; trying to illegally dismantle the  Department of Education; and going after public health and really…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…lose health protection, and millions more  will lose educational opportunity. For those who are facing a dreaded  disease like cancer, Republicans are cutting innovative medical  research in the hope for a cure. With the looming threat of a flu  pandemic, there would be a 40 percent cut of staff at the Centers for  Disease Control and Prevention, CDC.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688064/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…research but into Alzheimer's research and Parkinson's research.\n\nWe used to have a bipartisan consensus in this country that we did  not cut Medicaid, that we did not cut medical research, and that we did  not give more tax breaks in my district in Silicon Valley, to the  billionaires in my district, at the expense of medical research and the  working class.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…crucial investments to support  our servicemembers and our national security.\n\nThe bill includes essential funds for VA care, including rural  health, women's health, medical research, and the caregivers program I  have long championed, and for the first time, it puts funding levels  for those important programs in statute. It also expands the pilot…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…ever, we must support our dedicated scientists and  doctors across the country who work to treat and care for patients.\n\nI urge everyone to support robust funding for medical research for  cancer so we can find a cure and stop the cuts to cancer research.\n\nMr. Speaker, I wish a happy National Cancer Research Month to  everyone.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…from stroke are down 75 percent, and NIH  funding has led the fight to save countless lives with groundbreaking  discoveries. NIH is the greatest credit to sustaining medical research  in history.\n\nBut now, we are dealing with an administration that is a direct  threat to our health. Since Donald Trump has taken office, NIH has  fired 1,300 employees…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…illegally refusing to spend money that Congress has directed. He is  picking winners and losers by withholding Federal grant funding for  programs like disaster relief and medical research unless people  basically bend a knee to his draconian demands.\n\nHe is picking winners and losers by firing nonpartisan experts in  programs that he doesn't like, and he…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…coincidentally, his 79th birthday.\n\nSpending up to $45 million of taxpayers' money on this kind of pomp  and circumstance, while at the same time proposing a budget to  eviscerate medical research for the military and to take health  insurance away from 16 million Americans is not a cause for national  celebration.\n\nMeanwhile, the President's crypto business unfolds.…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am pleased to reintroduce a resolution  recognizing ``Medical Research Week'' from September 15 through  September 19, 2025. This important resolution will look to recognize  the important breakthroughs of medical research improving health…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…exercise that you are engaged in, Senator Booker, is a simple  one: just trying to make sure that all the facts are on the table.\n\nThat last segment you did on the impact on medical research should be  reason alone for folks to reconsider the path this administration is  taking. But the Medicaid cuts as a mechanism to further enrich those  that are already…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Championed economic justice through the Pay Equity Act of 1984,  ensuring that the federal government could not undervalue work  performed by women.\n\nFought for inclusion in medical research, shaping the NIH  Revitalization Act of 1993 so that women and minorities could no longer  be excluded from the clinical studies that guide lifesaving treatments.\n\nCo-founded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Let's be clear. Republicans are gutting healthcare and behavioral  health programs. DOGE has cut thousands of employees at healthcare  agencies, frozen funds for vital medical research, and eliminated  mental health and substance abuse programs. They have rescinded a  billion dollars in State and local behavioral health programs and cut  40 different…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691917/reconciliation"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…in the Bend  Bulletin highlighting Abby's work.\n\nA Bend teenager who was diagnosed with Type 1 diabetes at       age 6 is going to Washington, D.C. to advocate for medical       research and affordable insulin. Abby Lachman is traveling to       D.C. Monday through 10 with Breakthrough T1D, an organization       that supports those with Type 1 diabetes.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…private and nonprofit partners.\n\nMaryam developed her expertise in technology transfer after beginning  her career as a microbiologist and researcher at the U.S. Army Medical  Research Institute of Infectious Diseases. Discovering a passion for  technology transfer and a talent for the intersection of science and  the law, she lent her expertise to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "John Carter", "party": "Republican", "sentence": "…$113.8 billion in  discretionary funding for VA medical care.\n\nIt includes critical funding for mental health services, telehealth  services, veteran homelessness programs, medical research programs, and  rural health initiatives.\n\nIt invests in information technology, including robust investment in  VA's electronic health record modernization.\n\nIt fully…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…and dozens of  targeted appropriations, and then, more broadly, through all of these  different subcommittees, to help fund critically needed investments in  medical research, in university research, in the volunteer fire  service, in law enforcement, in education, in infrastructure, it is  important that this body do its principal job.\n\nThe power of the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…by Senators Kelly and Cotton, and the House version was  introduced by my  friend and fellow Representative, Mr. Pfluger.\n\nThe bill would ensure that there is trusted medical research  available to pave the way for toxic-exposed military pilots and aircrew  to access their VA disability compensation benefits.\n\nColonel Andrew Shurtleff, who testified…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Public Purposes Act in  1968, this parcel has grown into a nationally recognized hub for  innovation, home to 81 university departments and more than 50  pharmaceutical, medical research, and biotechnology companies. Today,  Research Park employs over 14,000 Utahns and provides invaluable  educational opportunities for students preparing to lead in the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…milk is the number one source of protein  for kids ages 2 to 11. Milk is also the top source of calcium,  potassium, phosphorus, and vitamin D for children ages 2 to 18.\n\nMedical research has proven that whole milk has several benefits,  such as strong bone density, a healthier immune system, reduced  cardiovascular risk, lowered blood pressure, reduced…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…term premiums and what all these things mean and what  happens when just clicks of interest rate consume every available  dollar that you and I might want to invest in medical research or the  left wants to do whatever the hell they want to do and it is going to  be consumed by paying interest.\n\nDemographics, which is the primary driver of our debt,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to veteran  medical care, including funding for  mental health, telehealth services, homelessness programs, caregiver  programs, opioid misuse prevention and treatment, medical research,  healthcare tailored to our female veterans, rural healthcare  initiatives, and construction for new VA hospitals and veteran  cemeteries.\n\nWe are also funding veteran…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…Additionally, we allocated approximately $23 billion to support  critical mental health issues and programs to prevent veterans'  homelessness and provide funding for innovative medical research.\n\nThe bill also funds mandatory veterans' benefits, which are earned  benefits that include disability pensions, employment training  programs, and educational benefits.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Memphis also has a lot of major corporations. FedEx is located  in Memphis. It was started in Memphis and has remained there. You also  have St. Jude, which is so vital to medical research in our Nation;  International Paper; so many other companies are located there.\n\nBut the crime crisis in Memphis has been driven by gang violence, and  it has held that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…rise today in support of H.R. 530, as amended. The  bill was introduced by my friend and fellow veteran, Representative  Pfluger. This bill would ensure there is trusted medical research  available to pave the way for toxic-exposed military pilots and air  crew to assess their VA disability compensation benefits.\n\nAs someone who served as a helicopter…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…MILLER-MEEKS. Mr. Speaker, I rise today to congratulate Dr.  Michael Welsh, a University of Iowa professor of internal medicine, on  winning the 2025 Lasker-DeBakey Clinical Medical Research Award. The  Lasker Award is one of the most prestigious biomedical and clinical  research awards.\n\nDr. Welsh was recognized for his extraordinary research on cystic  fibrosis,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}]