[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Speaker, Republicans already slashed $1 trillion from  Medicaid, $500 billion from Medicare, and let Trump steal billions in  medical research."}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "It is part of a very disturbing Republican trend, led by  the President, to purge the government of real experts and to slash and  burn, like medical research, finding the cures and treatments that we  need to survive and thrive; trying to illegally dismantle the  Department of Education; and going after public health and really  ruining a lot of the expert public health advice that helps keep our  neighbors healthy and safe."}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "We used to have a bipartisan consensus in this country that we did  not cut Medicaid, that we did not cut medical research, and that we did  not give more tax breaks in my district in Silicon Valley, to the  billionaires in my district, at the expense of medical research and the  working class."}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "The bill includes essential funds for VA care, including rural  health, women's health, medical research, and the caregivers program I  have long championed, and for the first time, it puts funding levels  for those important programs in statute."}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "I urge everyone to support robust funding for medical research for  cancer so we can find a cure and stop the cuts to cancer research."}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "NIH is the greatest credit to sustaining medical research  in history."}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "He is  picking winners and losers by withholding Federal grant funding for  programs like disaster relief and medical research unless people  basically bend a knee to his draconian demands."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "There are a few that stand out,  including my steadfast belief that the promise of medical research  funding is one of the most important."}, {"senator": "André Carson", "party": "Democrat", "sentence": "Speaker, I am proud to introduce the Medical Research  for Our Troops Act, a bill to amend the Full-Year Continuing  Appropriations and Extensions Act, 2025, by restoring essential funding  for Congressionally Directed Medical Research Programs within the  Department of Defense Account."}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "That last segment you did on the impact on medical research should be  reason alone for folks to reconsider the path this administration is  taking."}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Fought for inclusion in medical research, shaping the NIH  Revitalization Act of 1993 so that women and minorities could no longer  be excluded from the clinical studies that guide lifesaving treatments."}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "DOGE has cut thousands of employees at healthcare  agencies, frozen funds for vital medical research, and eliminated  mental health and substance abuse programs."}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "``Because we want to help increase       funding or continue it, especially at a time when a lot of       medical research is getting cut."}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Army Medical Research and  Materiel Command and the Naval Research Laboratory."}, {"senator": "John Carter", "party": "Republican", "sentence": "It includes critical funding for mental health services, telehealth  services, veteran homelessness programs, medical research programs, and  rural health initiatives."}, {"senator": "Mike Bost", "party": "Republican", "sentence": "The bill would ensure that there is trusted medical research  available to pave the way for toxic-exposed military pilots and aircrew  to access their VA disability compensation benefits."}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Since its conveyance under the Research and Public Purposes Act in  1968, this parcel has grown into a nationally recognized hub for  innovation, home to 81 university departments and more than 50  pharmaceutical, medical research, and biotechnology companies."}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Medical research has proven that whole milk has several benefits,  such as strong bone density, a healthier immune system, reduced  cardiovascular risk, lowered blood pressure, reduced hunger cravings,  reduced type 2 diabetes risk, and increased sleep quality."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Crack open an article about bonds and the stress and bond  vigilantes and term premiums and what all these things mean and what  happens when just clicks of interest rate consume every available  dollar that you and I might want to invest in medical research or the  left wants to do whatever the hell they want to do and it is going to  be consumed by paying interest."}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "For our troops, this bill demonstrates our dedication to veteran  medical care, including funding for  mental health, telehealth services, homelessness programs, caregiver  programs, opioid misuse prevention and treatment, medical research,  healthcare tailored to our female veterans, rural healthcare  initiatives, and construction for new VA hospitals and veteran  cemeteries."}, {"senator": "John Boozman", "party": "Republican", "sentence": "Additionally, we allocated approximately $23 billion to support  critical mental health issues and programs to prevent veterans'  homelessness and provide funding for innovative medical research."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Jude, which is so vital to medical research in our Nation;  International Paper; so many other companies are located there."}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "This bill would ensure there is trusted medical research  available to pave the way for toxic-exposed military pilots and air  crew to assess their VA disability compensation benefits."}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Michael Welsh, a University of Iowa professor of internal medicine, on  winning the 2025 Lasker-DeBakey Clinical Medical Research Award."}]