[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…destruction, deception, and  corruption.\n\nThe bill doesn't protect Tribal broadcasting, doesn't protect  emergency alerts, and doesn't protect the working families who rely on  public media for news, safety, and education.\n\nRepublicans are eating your public programs to serve caviar to their  donors. The public will remember who stood with Big Bird and who  strangled…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…heard Republicans  blame everyone but themselves: blame Biden, blame Democrats, blame  George Soros, blame the Clintons, blame Kamala Harris, blame the blue  States, blame the media, blame fill-in-the-blank.\n\nHere is a thought, Mr. Speaker: Why don't you guys blame yourselves?  You control the House, the Senate, and the White House. You are in  charge.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…more sizzle than steak,'' Dunne said.\n\nChina has more than 13 million EV-charging facilities       nationwide, counting both publicly and privately operated       ones, state media has reported. The U.S. has around 77,300       charging locations with about 230,000 EV-charging points in       total, data from the Joint Office of Energy and       Transportation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…step to bring Members of Congress, industry, civil society, and  families to the table to discuss the future of the internet. It does  not aim to end the conversation.\n\nSocial media, and the internet broadly, continue to evolve. We need  to keep up. Tech platforms must be appropriately incentivized to  address the harmful content that has been allowed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…return to your phones  very soon, which I think this is probably going to be looked back upon  as one of your better periods when you weren't scrolling and weren't  doing social media. In many ways, you were liberated from that toxin,  which feeds in our society so much hate and so much disagreement.\n\nThese are corporations actually that feed us through…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…funding for the United States  to have a seat at the table at the U.N. and many other international  organizations.\n\nIt rejects the closure of USAID, the U.S. Agency for Global Media and  its grantees, and other independent entities.\n\nCritically, this bill includes new transparency and oversight  requirements to close loopholes that were abused by the Trump…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Club's Green Giant  Award. Through her legal expertise, community leadership, and  commitment to access to justice, she continues to drive positive change  across Virginia.\n\nMedia and Communications Champion Award--Claudia Massey: Claudia  Massey has made a lasting impact in media and communications as a  bestselling author, TV and radio host, columnist,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…got ready for Black Maternal Health Week, I wanted to first  figure out is there a theme this year on which we should focus our  efforts. As I got ready to prepare my social media posts, as I got  ready to prepare the topics that I would have if I had a roundtable, I  thought, well, the Office of Maternal Health, the Office of Minority  Health, they…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically ended free and fair  elections, crushed independent media, quashed protests, and killed,  jailed, or exiled political opponents.\n\nThree years ago, Putin invaded Ukraine, showing complete disregard  for European borders, UN and NATO…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…have been murdered by sniper fire and starvation. Every one of those  more than 20,000 children murdered was someone's whole world.\n\nSince the cease-fire was declared, the media and the world have  shifted their gaze, but families in Gaza still live under constant  threat: of violence, of the elements, of starvation.\n\nEarlier this year, my colleagues,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…undermines and outright  destroys long-held, bipartisan American values at home and abroad.\n\nI'll start right here at home. This bill makes an unprecedented  attack on public media that Americans rely on for unfettered access to  information, educational programming for kids, cultural programming, as  well as nationwide emergency alerting. Spanning many…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…FTC may face cuts just as it is gearing up to take  Meta--one of the world's richest companies--to trial this upcoming  Monday for buying up competitors to dominate social  media markets. None of this helps consumers. None of this helps small  businesses. None of this lowers prices or spurs innovation. Until these  illegal firings are reversed, I cannot…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…orders. No one has to carry out orders  that violate the law or our Constitution.''\n\nOn November 20, 2025, in response, President Trump called for their  execution. In one social media post, he wrote: ``It's called SEDITIOUS  BEHAVIOR AT THE HIGHEST LEVEL. Each one of these traitors to our  Country should be ARRESTED AND PUT ON TRIAL. Their words cannot be…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and in the region, authorizing the Secretaries of State  and Commerce to hire locally employed staff in the region, establishing  a workforce development program, codifying a media program and more.\n\nIt increases U.S. security assistance to address regional maritime  security, transnational crime and law enforcement issues by authorizing  the Secretary…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…community a  cornerstone of her tenure as a public servant and educator. She has  also tirelessly worked to increase reading comprehension, counter the  harmful impacts of social media on young people, and she supports  phone-free schools.\n\nHer work reminds us that educators don't just teach; they shape the  future. As a dad of two kids who have attended…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690735/constituent-of-the-week-mayor-kerry-devine"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Itar-Tass News Agency; Baldor, Lolita:       Associated Press; Balingit, Moriah: Associated Press; Ball,       Emily: Wall Street Journal/Dow Jones; Ball, Michael: Argus       Media; Ballard, Mark: Baton Rouge Advocate; Balls, Kathryn:       Times of London; Balz, Daniel: Washington Post; Banks,       Adelle: Religion News Service; Baptiste, Nathalie:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Committee,  Leadership, and House Officer organizations, enhancing the orientation  program and professional development offerings for the Aides, and  launching the program's social media presence and dynamic website.\n\nMac's impact on the program is best seen in the lives and careers of  the many Aides who came through during his tenure as Director. From  December…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…market-based       policies that promote innovation, competition, consumer       access, digital inclusion, workforce development, and       economic growth in the communications, media, and technology       markets;\n\n``(B) conduct studies, as delegated by the Assistant       Secretary or required by Congress, on how individuals in the       United States…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…None of these tax hikes are necessary. The populists argue that the  threat of tariffs is needed to force Canada to stop the flow of illicit  drugs. In fact, one of the social media posts today said there was  going to be a tariff on fentanyl. Really? You think the drug dealers  are going to pay a tariff on fentanyl? Fentanyl is not being tariffed.  That…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…what Big Tech is doing to our children in this  country. There is an entire generation of children that have become the  product when they are online on some of these social media platforms.\n\nWhat we have learned, as we have worked in a bipartisan basis-- Senator Blumenthal and I, working for over 5 years addressing these  concerns--what we have learned…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…examination authority of these firms and what it would bring. The firms  within the scope of this rulemaking are payments firms, but some of  these firms also have a social media element to their businesses.\n\nIf we fail to act here in Congress, there will be career bureaucrats  from the CFPB with the authority to examine some of the most  influential…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Secretary of the Treasury       shall make the unclassified portion of the report required       under subsection (a)(1) available to the public on the       website and social media accounts of the Department of the       Treasury--\n\n(A) in English, Chinese, and any other language that the       Secretary finds appropriate; and\n\n(B) in precompressed, easily…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…designed to replace them. Algorithms  and chatbots fuel addiction, depression, self-harm, and even suicide,  all while these companies hide behind section 230.\n\nWhen social media leads our kids to suicidal thoughts, our children  believe they are better off gone, and no one is held responsible. This  is a deeply broken system.\n\nI demand accountability.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699340/repeal-section-230"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…many of these schools are located near  military bases.\n\nMy Democrat colleagues are correct that the known number of Confucius  classrooms has declined after attention from media and advocacy groups  increased, including from Congress, but that doesn't prove the CCP  threat is gone.\n\nThere are 500 Chinese Communist Party-affiliated Chinese nationals--I…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to say whether that is good or bad, but can we at least just have the  backbone as the Republican Party to not allow our colleagues on the  other side of the aisle and the media to say that we are cutting  Medicaid when we are increasing Medicaid spending? I mean, it is mind- boggling that we allow that narrative to set in on a program that is  broken,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Appalachian region.\n\nOther Notable Partners: Shelcy Mullins, Sr. Fairgrounds; Lonesome  Pine Airport manager, Jarrod Powers; RX Partnership executive director  Amy Yarcich; Ryan Media Lab chief executive officer Mark A. Ryan and  partner Kyle Mark Ryan; and Wise County UAS event coordinator,  Andrianah Kilgore.\n\nAt that time, delivering medical supplies…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…are our children and young adults.  They are being targeted and exploited through their phones, through  their computer systems, through gaming systems, and through social  media. Every 30 seconds a child is sold into slavery. Every 30 seconds  another child is sold into slavery.\n\nHuman trafficking is not just a distant overseas problem. The issue…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699002/human-trafficking-awareness-month"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…The great people of North Carolina didn't send me here to manage  decline. They sent me here to help President Trump usher in the new  golden age. Let the left scream. Let the media moan and grown, but  today we are putting Americans first and looking out for their hard- earned tax dollars. I urge a ``yes'' vote.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692537/rescissions-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…embarrassment, humiliation,  and shame that we still deliver on the backs of women who have been  brutalized, who have been raped, and who have been assaulted. There is  shame that the media pours over their heads. Their colleagues, their  friends, their neighbors, their loved ones--because you come forward  and because you talk about sexual assault, you are not…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise to provide an 11-month update to the  American people.\n\nWhile most media outlets struggle to be honest with the American  people, under the administration of President Donald Trump, a  Republican House, and a Republican Senate, America is back.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}]