[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…attempts to  rectify part of this problem by expanding license portability, allowing  practitioners to perform exams for veterans across State lines.\n\nAt a time when medical professionals in many specializations are  particularly difficult to access at the VA, it is vital that we ease  access to these practitioners where possible.\n\nThis bill mandates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695497/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…pregnancy centers.\n\nAs a medical doctor, I want to be crystal clear. Crisis pregnancy  centers are not medical facilities. They do not even have to employ  licensed medical professionals.\n\nWomen who seek help at these centers routinely report being misled,  pressured, or given false information during one of the most vulnerable  periods in their lives.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699215/funding-crisis-pregnancy-centers"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…enforcement officers and factory  workers. They are hurting teachers and students. They are hurting  factory workers and union members. They are hurting doctors and medical  professionals and researchers.\n\nAcross the political spectrum and across all demographics, the only  thing we have to show for the first 100 days is losing, the kind of  losing that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…to ensure that our President  doesn't strip basic protections from our Federal workers. We are  talking about our Federal nurses, our firefighters, law enforcement,  medical professionals, the men and women who are working across our  airports, that are taking care of our nuclear reactors in this country.  They deserve the right to organize.\n\nI do agree.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…a remarkable act of bravery, Sergeant Dollinger and his team  successfully rescued a wounded woman from the window of her apartment  and brought her to the safety of medical professionals, all while the  alleged assailant continued to fire shots from inside the apartment  building.\n\nIn the end, without discharging their firearms, the Canton Regional…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697308/champions-of-the-week-north-canton-first-responders"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…before they could receive care for a  miscarriage, hemorrhage, or sepsis.\n\nAn obstetrician, Dr. Donell Oliver, testified: ``Women are dying;  families are suffering; and medical professionals' hands are being  tied.'' That is the result of the kind of strict abortion ban  Republicans have imposed on Texas women that some here want to impose  on all 50 States…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699233/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…not. They  might look like a normal doctor's office with ultrasound machines and  employees wearing lab coats, but the coats are for show, and the  employees are not medical professionals.\n\nMr. Speaker, don't be fooled. The primary purpose of these centers is  to deceive women, and the organizations promoting these centers are the  same organizations…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…prevention that are rooted in health and  science, not just increasing criminalization.\n\nCongress should bring forward a comprehensive bill that reflects the  input of medical professionals, addiction specialists, researchers, and  law enforcement. Republicans are trying to present a ``quick and easy''  solution to a complex problem.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692633/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…across  America, and yet they often go unaddressed until it is too late.\n\nWe are working hard to change that. We are educating Congress and the  public, bringing in medical professionals and public health experts,  and pushing for legislative solutions that will have real and lasting  impacts.\n\nWe know that men and boys historically have not been as…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the  child--it is not going to happen to me.\n\nBut when it does and they can't imagine how they will make ends meet,  they find in the Cherry Hill Clinic doctors and medical professionals  willing to step up. And they have been doing extraordinary things. It  would make every American proud. And now they see what is coming from  this Republican, from…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…and it is called a pregnancy center of some sort.\n\nWhen she gets there, she is greeted so warmly with open arms. There  are people in white coats, who she assumes are medical professionals.  They tell her she can get so many things for free: pregnancy tests,  ultrasounds, pregnancy counseling, and, after the birth, even free  diapers and formula. It all…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Program Improvement Act of 2025, as amended.\n\nFor many years, the Health Professionals Scholarship Program has  allowed VA to provide financial assistance to future medical  professionals in return for a promise of service at VA facilities to  ensure VA can meet its staffing needs. The program has had longstanding  success in both ensuring prospective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695433/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…you--of the millions of Americans who have a parent who  has struggled with dementia or physical disabilities--to those people,  we know that our parents need the help of medical professionals to care  for them properly. That is why Medicaid is so vital, so important, such  a lifeline to tens of millions of families across America. The  Republican Medicaid…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…leaders for their leadership in their ongoing response to this  senseless tragedy.\n\nWe are grateful to the first responders for their prompt action on  the scene and medical professionals for caring for the wounded.\n\nAs law enforcement continues their work, we thank them for their  efforts and wish them strength in their pursuit to bring to justice…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698196/moment-of-silence-in-honor-of-victims-of-brown-university-mass-shooting"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…their communities first,  and it has earned them the respect and gratitude of generations of  Nebraskans.\n\nOnce again, I congratulate all of Bryan Health's staff and medical  professionals for their 100 years of remarkable service and leadership  in healthcare.                     Rebel Robotic FTC World Championship\n\nMr. FLOOD. Mr. Speaker, today, I…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…However, countless studies show that when veterans seek care at  private hospitals and clinics, they wait longer to see providers, and  they get worse care. They know VA medical professionals choose this  work due to their mission to care for our veterans, and that is  something the private sector simply cannot replicate.\n\nWe should invest more in VA provider…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…College of Osteopathic Medicine. This will  help educate more doctors in the State of Iowa.\n\nWith all of these efforts, Iowa is set to continue leading in the  training of medical professionals needed in our communities.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…confronting, for example, the  regime in Cuba and includes limitations on funding for countries and  organizations that participate in the human trafficking of Cuban  medical professionals while directing the Secretary of State to revoke  visas for officials of countries involved in this grotesque human  trafficking.\n\nMr. Chairman, a smart foreign policy…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…about esophageal cancer empowers       individuals to seek preventive care, recognize symptoms, and       pursue early detection strategies;\n\n(8) survivors, caregivers, medical professionals, and       researchers have made tremendous strides in advancing       treatment options and improving the quality of life for those       affected by the disease;…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…permanently classify all  fentanyl-related substances as illegal and give our law enforcement  officers more tools to combat the crisis. The bill also ensures that  medical professionals can research fentanyl-related substances so that  we can better understand their effects on human health.\n\nIn 2023, more than 100,000 people nationwide, including 2,190…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it be allowed to prescribe?\n\nIt is uncomfortable, but it would help crash the cost of healthcare.  It would actually help us with the fact that we have a shortage of  medical professionals.\n\nWe are on the cusp of these things. As a matter of fact, that  technology has been around for 5 years except it is functionally  illegal. We don't reimburse it, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…medical record storage, use, and       sharing and the associated consequences for member health and       well-being.\n\n(3) The ability of members of the Coast Guard, medical       professionals of the Coast Guard and of the Department of       Defense, personnel of the Department of Veterans Affairs, and       other personnel to access and search, as appropriate,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…The violent storm took the lives of 19 individuals, 17 of whom were  in Laurel County. Had it not been for the rapid response and  coordination between police, fire, medical professionals, and good  Samaritans, the loss of life would undoubtedly be higher. Within 24  hours, every life had been accounted for, despite the mass destruction.  Heroic stories…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…them for their hard work and commitment.\n\nIt is an honor to celebrate this significant milestone. This  conference provides tremendous opportunities for our State's medical  professionals. Congratulations to the Office of Emergency Medical  Services on the 50th anniversary of the Wyoming Trauma and  Emergency Medical Services Conference.", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…in support of H.R. 3951, introduced by my  colleague Representative Ciscomani from Arizona.\n\nThis bill would extend the license portability authority for  contracted medical professionals conducting compensation and pension  examinations for veterans until 2031. These exams are a vitally  important part of going through the VA benefits process.\n\nVeterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695499/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…offered opportunities for  women to serve in the armed and uniformed services. WACs, as its  members were called, served in a variety of roles, including as  mechanics, medical professionals, photographers, and clerks. As for  Mary, she served as a phone operator and translator.\n\nWomen like Mary were integral to our victory, as they worked  tirelessly to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…beyond the factory  floor. My grandmother served as a Rosie the Riveter, stepping up to  fight on the home front, as well. Women became welders, code breakers,  pilots, medical professionals, truck drivers, and community caretakers.  Their contributions were essential to the Allied victory, supporting  our troops overseas and redefining women's roles in…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}]