[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…President Harry Truman-- is even broader than that. It will increase Social Security benefits  for all of our older Americans. It will improve a wide range of health  and medical services for Americans of all ages.\n\nThen President Lyndon Baines Johnson leans in on the importance of  Medicaid with a greater degree of precision. He says: ``But there is  another…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…treated people at Lanterman State Hospital in the Department of  Developmental Services. He worked there as a physician, Chief Medical  Staff, and as the Coordinator of Medical Services.\n\nIn May of 1982, Dr. Vo joined Pomona Valley Hospital and a medical  practice in Pomona. His involvement in our community has been vital not  only through his medical…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Protection District.\n\nDeputy Chief Jeremy Metz has served the West Metro Fire Protection  District for over 27 years. In his previous roles, Jeremy oversaw  emergency medical services, administration, special teams operations,  and strategic planning for personal safety and benefit. He has over  three decades of on-the-ground experience in fire science…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694725/recognizing-jeremy-metz"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…first responders who  arrived almost immediately on the scene to try to rescue survivors.  Responding parties initially included Washington, D.C., Fire and  Emergency Medical Services, the Metropolitan Police Department,  Virginia State and municipal police departments, and multiple Federal  agencies, including the NTSB, FBI, and U.S. Coast Guard.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Squad as they celebrate their 75th Anniversary this year.\n\nIn 1950, residents of the Borough of Deal, New Jersey founded the  Deal First Aid Squad to provide emergency medical services day  and night. For 75 years, this organization has operated uninterrupted,  completely volunteer-based, and performed a range of reliable services  from routine transport…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…that could mean for communities across the country is that  hospitals have to shut down, medical treatment facilities might have to  be closed, and people who perform medical services like doctors and  nurses might not be available.\n\nCertainly, in urban areas and suburban areas like mine, there is  going to be a major impact from that, and in red States…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…advocates for Community Health Centers in New  Hampshire and Vermont. Community Health Centers play a crucial role in  delivering primary care, especially in areas where medical services are  limited or unaffordable. Offering accessible, preventive, and routine  care, they serve as a vital lifeline for low and moderate-income  families who might otherwise…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Department.\n\nDeputy Chief John Curtis has served the South Metro Fire Department  for over twenty years. In his previous position, John oversaw Emergency  Medical Services, dispatch, fleet services, and special operations. His  educational background in organizational leadership, along with his  extensive on the job experience, has separated him from…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692026/recognizing-john-curtis"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…be fired, have been fired, are being fired.\n\nNot only are we talking about firing 6,000 veterans, but we are also  talking about cutting their services, cutting their medical services,  forcing longer wait times for them because when they call, when they go  to the VA to get help, there will be fewer people there to help them.\n\nI think about the veterans…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…another:\n\nWe have a son born with Down syndrome and we are now       retired, depending on our Social Security for the three of       us--for food, utilities, clothing, medical services, things       that we worked [for] all our lives, only to have billionaires       come in and take what little we have to live on away.\n\nYes, the billionaires may not…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…unnoticed.\n\nClaudia, who worked at Carlsbad Caverns National Park, shared this:  In 4\\1/2\\ months, I dedicated myself to my work, training others,  providing emergency medical services, ensuring visitor safety. Then,  without warning, I was fired. I was told I failed to prove my skills,  despite my experience, my positive evaluations, and my commitment.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Republicans think that it is more  important to give tax cuts to billionaires than to make sure that  America's children, veterans, and seniors have food, housing, and  medical services, and that we protect the air we breathe, the water we  drink, and the food we eat.\n\nIt is the gulf that causes the Speaker to bring ridiculous  legislation to the floor…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first  responders, to help break the cycle of mental health challenges.\n\nI applaud the city of Joliet's efforts, which are serving as a new  national model for emergency medical services and using first  responders to address the root causes of suffering in the community. I  look forward to working with them to identify additional Federal  resources and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…education as anyone in major cities in my  district, like Albuquerque or Las Cruces. It ensures that when there  was a medical emergency in the middle of the night, emergency medical  services had the roads that they needed to save lives.\n\nThat stability vanished when SRS expired in 2024. Rural counties  across the West, including mine, were forced to make…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…board renamed the  health district Mercer Health. Since then, Mercer Health has continued  to expand and grow, opening new offices and campuses to house their  network of medical services.\n\nMr. Speaker, by celebrating the seventy-fifth anniversary of Mercer  Health, the county and its residents can recognize the outstanding  achievements of the staff and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…are about something very simple: Protecting the dignity  of the unborn and meeting very real needs of mothers and families.\n\nPregnancy resource centers offer counseling, medical services,  parenting resources, and support systems through some of the most  difficult moments that a mother can face. They should never be targeted  or defunded because they…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699218/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…consistently ask us  for in Congress. They want high-quality medical care at the VA; not  privatized care that takes longer to receive.\n\nBy transferring record funding from VA medical services to community  care, which is a 67 percent increase of $14 billion, this bill pushes  veterans into private care, even though veteran polls and studies show  that when…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…the Global  Medical Response (GMR) Stars of Life award recipients for 2025. A proud  member of the American Ambulance Association (AAA), GMR is a leader in  emergency medical services across the country--providing care to  communities and residents of all walks of life.\n\nThe AAA created the Stars of Life program to celebrate the  contributions of ambulance…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Regional Emergency Medical Service, which recently  received the 2025 Dick Ferneau Career EMS Service of the Year Award.\n\nThis is one of the top national awards in emergency medical services  and highlights organizations that exemplify outstanding care,  innovation, and commitment to the people who they serve.\n\nThe Susquehanna Regional EMS covers a 3,000-square-mile…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699537/recognizing-susquehanna-regional-emergency-medical-service"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…TITLE.\n\nThis Act may be cited as the ``Produce Prescriptions for       Veterans Act''.       SEC. 2. PROVISION OF PRODUCE PRESCRIPTIONS TO VETERANS.\n\n(a) Inclusion as Medical Services.--Paragraph (6) of       section 1701 of title 38, United States Code, is amended by       adding at the end the following new subparagraph:\n\n``(J) The provision of produce…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…for me and our families and our communities to stop the flood  of drugs and crime pouring into this country. It is unacceptable.               Honoring the UMC Emergency Medical Services Team\n\nMr. ARRINGTON. Mr. Speaker, I rise today to honor a group of heroes  that have been a lifeline for the people of Lubbock County for 50  years: the UMC Emergency…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Mr. EDWARDS. Mr. Speaker, I rise today to recognize the Sheriff's  Office and Emergency Medical Services of Clay County.\n\nOn September 27, 2024, Hurricane Helene slammed into Western North  Carolina, leaving a trail of devastation and destruction. While Clay  County was largely…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…(E), by striking ``A'' and inserting       ``a''.\n\n(e) Technical Correction to Definitions.--Such section is       further amended, in subsection (q)(5), by striking ``Medical       services'' and inserting ``The term `emergency treatment'       means medical services''.\n\n(f) Required Use of Certain Screening Protocol.--Such       section is further amended,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…health       care provider described in section 1703(c) of title 38,       United States Code, who has entered into a contract or       agreement to furnish hospital care, medical services, or       extended care services (other than care related to breast and       gynecologic cancer) to veterans under section 1703 of title       38, United States Code.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I rise to recognize the inspiring career of  Eddy Haynes who recently retired from Putnam County, Tennessee,  Emergency Medical Services. For 37 years, he faithfully served his  community as an advanced emergency medical technician.\n\nOver the years, he endured long shifts and countless challenges but  never…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691822/recognizing-eddy-haynes"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize and honor the  courageous divers and first responders of the District of Columbia Fire  and Emergency Medical Services Department, whose swift and selfless  actions in the aftermath of the devastating collision between American  Airlines Flight 5342 and a United States Army Blackhawk Helicopter…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690276/recognizing-the-heroism-of-the-district-of-columbia-fire-and-emergency-medical-services-department"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Sergeant Wagner  assisted ski patrol in securing the skier onto a toboggan for transport  down the trail.\n\nUpon arrival at the ski patrol room, Emmet County Emergency Medical  Services assumed care and transported the skier to McLaren Northern  Michigan Hospital, where he is expected to make a full recovery.  Medical staff later confirmed that the rapid…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699808/recognizing-michigan-state-police-sergeant-dennis-wagner"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…other offense;\n\n(2) the contact information for the Coast Guard       Investigative Service;\n\n(3) external resources for--\n\n(A) wellness support;\n\n(B) work-life;\n\n(C) medical services; and\n\n(D) support relating to behavioral health, civil rights,       sexual assault, and sexual harassment; and\n\n(4) cadet and officer candidate rights with respect to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…years later, in 2023.\n\nThe rural emergency hospital program allows rural hospitals to  voluntarily right-size their healthcare infrastructure, while  maintaining essential medical services for their rural communities. It  gives these hospitals the flexibility to operate without hospital  inpatient services, while still retaining a 24/7 emergency department,…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}]