[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…populations.\n\nThe Georgia Budget and Policy Institute also found that Georgia's  Pathways to Coverage program created burdensome red tape and paperwork  for state agencies and Medicaid recipients.\n\nGeorgia's experience offers a stark warning for the Nation as  Republicans consider steep Medicaid cuts and work requirements for low- income Americans. The focus…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…not trickle down to people. People are already having trouble  affording rent, home prices, food, and other goods.\n\nPutting this kind of financial pressure not just on Medicaid  recipients but on everybody else, because insurance rates and medical  costs are going to go higher, only makes that squeeze worse.\n\nTokuda).\n\nMs. SCHRIER. Mr. Speaker, I thank…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…deadly serious vote. This is a vote  about life and death.\n\nI represent just slightly over 780,000 constituents. Out of those  780,000 constituents, 524,000 of them are Medicaid recipients, and over  100,000 of them are Medicare recipients, so over 600,000 of the 780,000  constituents who I represent receive either Medicaid or Medicare. In  addition to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688045/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…have ever seen of people waiting to get dental  services because they live in a dental desert.\n\nNow, this clinic was able to open, and 80 percent of their patients  are Medicaid recipients. The other 20 percent are uninsured. They are  worried what happens when the Medicaid cuts take effect and the 80  percent starts to decline as to how many are actually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…District represented  by my colleague, Congressman Doug LaMalfa.\n\nLaura lives in the Central Valley of California, an area of the  country with the highest concentration of Medicaid recipients, the  highest concentration of Medicaid recipients.\n\n``I have been raising my six grandchildren for 15 years and they are  coming of age, but not many jobs are available.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…trying to decide whether they can afford to go to the doctor.\n\nWhile that is happening, in real time, my colleagues are spending  time demanding more work requirements for Medicaid recipients when we  know that almost half of adults on Medicaid are already working. They  act like they are not working. They are working, and 27 percent of  those working-age…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Congressional District, encompassed by  Harlem, east Harlem, Washington Heights, Inwood, and the northwest  Bronx, more than  one-half--close to 500,000 of my constituents--are Medicaid recipients.  They receive primary and emergency healthcare. Almost 4 million  residents in New York City, one-half of the city, rely on Medicaid.\n\nMr. Speaker, this discussion…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…statistics show that SNAP is a net positive return  on the local economy.\n\nWe have to recognize that Medicaid keeps working families healthy.  Mr. Speaker, 61 percent of Medicaid recipients in the State of Alabama  are working. The majority or remainder are either children or people  with disabilities. These programs are not luxuries. They are lifelines…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692812/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…we are desperately afraid of.\n\nWhen we do the math, in Congressman Schweikert's district, Arizona 1,  people who count on SNAP to put food on the table are 85,000; Medicaid  recipients at risk of losing their healthcare, 127,000; Affordable Care  Act recipients who will see their premium payments go up by varying  amounts, 44,000. We would love to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…healthcare clinic to come where they could get basic dental  care, such as dentures and other types of dental care.\n\nWhen this clinic opened, 80 percent of their patients are Medicaid  recipients. Twenty percent are uninsured.\n\nNow thanks to the pending Medicaid cuts, they don't know what they  are going to do. They are worried about the uninsured in that community…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…services. They get that  largely through Medicaid. It is also a benefit for people with  disabilities.\n\nThe Republicans' devastating budget plan would push about 14 million  Medicaid recipients off lifesaving healthcare and leave countless  vulnerable families exposed to catastrophic medical bills. This is  terrible. This is about health and financial health…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…It  is cruel. It is heartless. It is nasty. It is lacking knowledge and  fact-based, and it hurts America--in this case, our farmers.\n\nI am also proud to welcome two Medicaid recipients, Jessica Martinez  and Ana Medina Garcia. Jessica and Ana are both cancer survivors who  depended on Medicaid to afford their medication and receive treatment.\n\nAnd,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…one-third of my State--depend on Medicaid. And the Republicans  are talking about cutting this program by at least $880 billion, which  would be devastating. Looking at the Medicaid recipients in Rhode  Island. It is interesting. One in five adults ages 19 to 64 are  covered; one in three children are covered. And we all know how  critical healthcare is for…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…able-bodied grownups who  refuse to get off the couch and look for work, illegal aliens who  refuse to go home, and fraudsters.\n\nWhat happens when millions of legitimate Medicaid recipients who have  been terrified by the Democrats realize that their benefits are  untouched? Well, we are going to find out.\n\nWill the national debt balloon? Only if you accept…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are not the most vulnerable, compared  to the vulnerable population who only get 50 to 60 to 70 percent? Why  would we do that? Why would we give more to Medicaid recipients than  Medicare recipients, which we often do?\n\nWhy would we continue to allow States like California and other  States to game the system, to get Federal dollars sent back in a money-…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]