[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…premiums are not isolated, Mr. Speaker.  They come on the heels of the One Big Beautiful Bill Act that slashed  more than 10 million Americans out of healthcare through the Medicaid  program, cut over a trillion dollars in Medicare, and a half-trillion  dollar liability in the Medicare fund. Hospitals will close, patients  will suffer, and millions of American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…give more benefits to people at the top, but the way we  are going to do it is we are going to cut people's healthcare benefits  who are on Medicaid. By the way, Medicaid is also the program that  helps provide long-term care for a lot of middle-income families in  this country.\n\nMr. Speaker, the notion that we can make all these cuts and don't  worry,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…a tax break for billionaires like Elon Musk  paid for by working people, including millions of our veterans. The  Republican rip-off cuts at least $880 billion from Medicaid, the  program that 80 million Americans, including 9 million veterans, rely  on for health insurance coverage.\n\nThis extreme budget also cuts $230 billion from SNAP. Every year,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688057/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…behavioral  health treatment for fentanyl?\n\nAll this costs taxpayers more, actually, a lot more, a lot more than  just covering Medicaid. It would be better if we just kept the Medicaid  Program and funded patients so they could get the  care when they needed it. My Republican colleagues know that this bill  will cause harm; hospitals and physicians and various…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…but he failed to  mention the most important part of it: It ended up giving tax breaks to  the wealthiest people in America. It ended up cutting $1 trillion from  the Medicaid Program. Wait until that cut works its way through the  economy to your local hospital and clinic, and watch what happens.\n\nThey have already warned us: Unless something is done,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…talk about that in a few moments; but  also in the big, ugly bill is the big problem coming up at the end of  this 2026 year.\n\nThey have put in place a dismantling of the Medicaid program. They  pushed it off until after the election, but the facts of the matter are  those impacts are already being recognized across the healthcare  system. It is going to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…other additions that they put into the budget, which  are going to add to the deficit. To pay for it, they included a whole  bunch of cuts. The big one is to cut the Medicaid program, a program  which provides healthcare for 70 million Americans, such as people in  nursing homes. Almost half the live births in this country are covered  by Medicaid. Young,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…talking about the horrors and tragic  costs of the drug trade and the impact it has on American people, let  us not forget how people get drug treatment. It is from the Medicaid  program that has already been cut by a trillion dollars and the ACA  marketplace health plans.\n\nThe Republicans' failure to act is literally going to kill people  across this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…coverage.\n\nThis budget would impose endless red tape and import the worst parts  of the private healthcare system, confusing paperwork and needless  bureaucracy, into the Medicaid program.\n\nIn total, 16 million people could lose coverage. Millions more could  lose access to care in their community. In Delaware, that will mean  40,000 of our neighbors--working…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…This is not a healthcare reform plan to improve our  healthcare system or lower costs for families and patients. Nope.  Republicans are looking to dismantle the basic Medicaid Program to help  the tax cuts for billionaires.\n\nDon't take my word for it. It is not just another political speech.  Last week, the nonpartisan Congressional Budget Office issued…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Let's be clear. These cuts wouldn't just impact individuals covered by  Medicaid. In my congressional district, 59 percent of individuals are  covered by California's Medicaid program. That means that doctors and  hospitals in my district rely on Medicaid for nearly two-thirds of  their revenue. Without that revenue, these providers would not be able…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688099/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the whole list, Senator  Booker, but I just pulled out some States that are represented by our  Republican colleagues.\n\nIn Alabama, 20 percent of Alabamans are on their Medicaid Program. In  total, 330,000 people in one State--Alabama--would lose their  healthcare if this cut went through.\n\nIn Arkansas, 25 percent of families are on the Arkansas Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "Mr. AUCHINCLOSS. Mr. Speaker, I rise today to advocate against the  funding cuts to the Medicaid program that have been proposed for  consideration during the budget reconciliation process.\n\nSpecifically, the Energy and Commerce Committee, of which I am a  member, has been…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Many  of them will not be able to buy insurance at all.\n\nLet's add to that, since the bill, also, is just 15 months out now  from slashing in a devastating fashion our Medicaid Program, which in  combination with the effects on the Affordable Care exchange will put  15 million people out of healthcare, 235,000 in my home State of  Oregon--and 70 percent…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…rights are in trouble and need you to advocate for       them. I urge you to continue to fight for Medicaid. Please       work to oppose any and all cuts or caps to the Medicaid       program.\n\nDear Senator Booker, my name is--I am a registered voter in       New Jersey. I am writing today to strongly urge you and your       fellow policymakers to oppose…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "Mr. BIGGS of Arizona. Mr. Speaker, the original Medicaid program was  designed to help the disabled, pregnant women, seniors, and children.\n\nThen there was this expansion that came along, and it is filled with  able-bodied adults of…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690836/increasing-medicaid-funding"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…someone is touched by an issue, they certainly become  passionate about it. I greatly appreciate her passion on the issue.\n\nThe section 1115 waivers are important to the Medicaid program.  States are the laboratories for democracy. Section 1115 waivers provide  key State flexibility to test new authorities and ideas in the Medicaid  program.\n\nIn substance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…average people cannot afford. As a matter of  fact, a lot of the average people may still be living with their  parents for a while even after they get married.\n\nWe have our Medicaid program, which is a fine program, providing  healthcare for the poor. Again, there are a lot of people out there  working who may have a $10,000 or $15,000 or $20,000 deductible…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…through Feeding Our  Future, a program that theoretically opened more than 250 sites and was  supposed to be feeding 91 million meals. It was not doing that.\n\nThere was a Medicaid program, the Early Intensive Developmental and  Behavioral Intervention program, where the Federal Government was  paying 64 percent and fake autism treatment firms were created.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698688/fraud-in-minnesota"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Medicaid, we all know, is that it was  formed in favor of pregnant women, disabled people, as well as the  elderly. What the Republicans are trying to do is rightsize the  Medicaid program so that it survives for the long-term, vital needs of  the people of the future.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693220/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…points. The latest argument, apparently, to hide the fact that  illegal immigrants are accessing Medicaid is that they are only  accessing State health systems, not the Medicaid program. I will point  out in a news flash that Medicaid is a State administered program that  supports State health systems.\n\nMr. Speaker, don't take it from me. Let me quote…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…American people.\n\nThe One Big Beautiful Bill is not taking healthcare coverage away  from grandmas who are on a fixed income or single mothers. Rather, the  reforms to the Medicaid Program in the One Big Beautiful Bill will  ensure that the money that is spent goes to people who are eligible and  who need it the most. That is the truth about the One Big…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…once again, we  hear myth after myth when we talk about reforms to Medicaid, which its  greatest threat is $37 trillion in debt.\n\nYet, when we talk about reforms to a Medicaid program, it is to  preserve Medicaid, and children, the disabled, and nursing homes would  not be impacted.                     Honoring Chief Keith Kimball on His Retirement…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trust funds, we have to pay interest and pay it back.\n\nFor those who are willing to run around here and are interested in  having discussions on Medicaid--remember, Medicaid is the program that  was designed for indigent populations, for women, children, infants.  Yet, you hear almost protests from the left. Here is a $2.5 billion  fraud in Medicaid…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…another program in which you can pay to have someone take  care of your kids while at work if you don't get married to the other  spouse.\n\nWe have talked a lot about the Medicaid program. Again, we use the  program for healthcare and poor people to try to penalize those foolish  people who get married first.\n\nIt is easy. It varies from couple to couple…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…fact, our healthcare system had gotten so out of whack that more  money was going to able-bodied adults than to the disabled, to pregnant  women, and to children under the Medicaid Program. Our bill fixed that.\n\nAre work requirements for able-bodied adults some sort of radical  conservative or Republican idea? Not if you look at the polling, which  says…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…grows every day, and that is one thing  that is shocking to people.\n\nBut what you have is tens of millions of dollars that were stolen  through Minnesota's Medicaid Housing Stabilization Services Program.  The money was appropriated. The money was sent from the Federal  Government to the State of Minnesota, and poof, it has gone into  pockets, not into…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…member of the Florida State Senate, and Medicaid is the  fastest-growing government program in our State.\n\nJust so everyone understands, it is not Medicare. It is Medicaid.  Medicaid is the program that is simply known as welfare healthcare,  which helps people most in need: persons in nursing homes, the  disabled, kids from low-income families, and pregnant…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…beginning during 2025,       for any individual taxpayer whose net worth exceeds       $1,000,000,000; and\n\n(2) reduce coverage for individuals enrolled under the       Medicaid program under title XIX of the Social Security Act,       shift the responsibility for funding such program or for       coverage under such program to States, or include a net…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]