[{"senator": "Doris Matsui", "party": "Democrat", "sentence": "…30 years.\n\nThe pace of innovation and demand for connectivity has increased  dramatically over the last few years. We need strong leadership and  expertise to help us meet this demand.\n\nNTIA advises on the rapid deployment of artificial intelligence and  manages the efficient uses of our airways. NTIA is also charged with  carrying out the bipartisan…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…much electricity as 100 million  homes in our country.\n\nOn the supply side, well, Trump is cutting off our cheapest and  quickest-to-deploy sources of energy that can meet this demand. Trump's  sham energy emergency pushes fossil fuels as the solution, but those  fossil fuels are polluting, they are pricey, and they are getting  pushed abroad to the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…minority-owned, and  veteran-owned small businesses totaled almost $670 million in 2023, a  25.7 percent increase from 2022.\n\nYet, we must do more to ensure the program continues to meet demand.  The Investing in Main Street Act of 2025 introduced by my colleagues,  Representatives Chu, Finstad, and McIver, will strengthen and grow the  SBIC program by allowing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…struggling themselves.\n\nIn Ohio, we have seen just how urgent this crisis has become. We have  only about half of the mental health behavioral workforce that we need  to meet the demand. In fact, there is just one psychiatrist for every  6,000 Ohioans. That is not just a workforce problem. That is a public  health emergency.\n\nThe SUPPORT for Patients…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…landscape looked very different. We were  importing significant amounts of oil, much of it from our political  adversaries. Oil prices were rising, and U.S. energy could not meet  demand.\n\nYet, even in that context, in those challenging years, for decades  and across both political parties, Congress recognized the  irreplaceable, ecological, and cultural…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…could be struggling yourself.\n\nIn Ohio, we have seen just how urgent this crisis has become, where  we have only about half the behavioral health workforce we need to meet  the demand. In fact, there is just one psychiatrist for every 6,000  Ohioans. That is not just a workforce problem. It is a public health  emergency, a safety issue, and a challenge…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690847/mental-health-solutions"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…cost up to $900 billion.\n\nSecond, these subsidies are driving instability in our power grid.  Right now two-thirds of the country is at risk of not having enough  power to meet demand. That is not a few years from now. That is not a  near, long-term problem. That is today. Keep in mind, the power needed  for AI is also growing exponentially, further creating…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…American  households while providing necessary energy.\n\nWe have challenges now. The demand is going to increase precipitously  in the years to come. How do we make sure we meet that demand? How do  we make sure we have not just the generation sources in place but also  the transmission systems that work together to make sure that we are  working against…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reinvigorating  America's beautiful clean coal industry.\n\nThe CRA will immediately reinstate future coal leasing and open  access to 37.8 billion short tons of coal, enough to meet U.S. demand  for the next 73 years.\n\nIn addition, passing Representative Downing's CRA will unleash  Montana's coal industry and generate millions of dollars in revenue for  the Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…yielding.\n\nMr. Speaker, I rise in support of my bill, the GRID Power Act.\n\nThis legislation is critical to ensure our Nation has the  dispatchable baseload power needed to meet historic demand growth and  guarantee that the lights turn on when our constituents flip the  switch.\n\nPJM, the largest grid operator in the Nation and sole grid operator  for my home…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…urgently       needs large-scale job creation, as its population of 1.4       billion is expected to grow to 2.5 billion by 2050. Mining       alone is not positioned to meet this demand.\n\nBy contrast, AGOA has supported the expansion of more       labor-intensive industries, such as textile manufacturing and       agriculture. Namibia illustrates this…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…regulations were  designed to effectively force fossil fuel-powered powerplants to  close--a dangerous goal at a time when we are already running low on  the electricity we need to meet demand. And preventing these Biden-era  rules from going into effect removes a significant threat to our energy  supply.\n\nFarmers, ranchers, and other landowners can also breathe…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…``housing plan'' means a plan       to, with respect to an area within the jurisdiction of an       eligible entity--\n\n(A) increase the amount of available housing to meet the       demand for such housing and any projected increase in the       demand for such housing;\n\n(B) increase the affordability of housing;\n\n(C) increase the accessibility of housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…also help the advancement of the Alaska LNG pipeline project.\n\nGlobal demand for energy is expected to double by 2050, and our  domestic energy production must rise to meet that demand. With the rise  of data centers and AI fueling this growth, it is more important than  ever that we produce energy here at home rather than ceding energy  dominance to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…homes can exceed $1 million.\n\nFor once, both sides of the aisle agree. The root cause of this  crisis lies in the supply side. Put simply, we do not have enough homes  to meet the demand.\n\nSo what should we do?\n\nThrowing money at a problem rarely fixes it. What Americans deserve  are concrete, commonsense regulatory reforms that make it easier to  build…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…does not just power Montana and Wyoming,  however, but our Nation at large. The Miles City plan strips away  access to 37.8 billion short tons of coal, which is enough to meet U.S.  demand for the next 73 years.\n\nThe consequences are vast, including higher energy costs for American  families, the loss of $46 million annually in Montana State revenue  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Thune", "party": "Republican", "sentence": "…unleashing American energy. While Democrats may not  like to admit it, the United States is rapidly heading toward an energy  crisis where we simply don't have the supply to meet the demand.\n\nThe Washington Post noted last March:\n\nVast swaths of the United States are at risk of running       short of power as electricity-hungry data centers and clean-…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…innovation and industry actions, methane emissions fell by       42 percent between 2015 and 2023 according to the EPA, even       as production increased by 51 percent to meet demand.\n\nOperators have taken significant voluntary steps to       identify and implement cleaner engineering technology       solutions within their operations and facility designs.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…last  year, and it is one of the most reliable and affordable forms of energy  that we have. It is imperative that we increase domestic production in  order to meet our ever-increasing demand.\n\nMy home State of Wyoming is responsible for about 40 percent of the  Nation's coal, producing 191 million tons of coal and shipping 171  million tons to 26 different…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…What does more energy mean? It means lower prices for consumers and  manufacturers and producers. Electricity demand is projected to double  by the year 2050. We cannot meet this demand if we lock up our valuable  energy resources, but that is what the Democrats wanted us to do. That  was the purity plan that they had the last 4 years.\n\nHigh energy prices…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}]