[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Whether it is the horrific assassination of Charlie Kirk at a college  campus in Utah or the tragic assassination of former speaker of the  Minnesota House of Representatives Melissa Hortman and her husband in  their home, it is tragic; it is unacceptable. And we would be foolish  not to take notice.\n\nThe House acted on a bipartisan basis to provide new funding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…partisan  basis, instead of uniting Congress in this tragedy with one of the many  bipartisan options to condemn political violence in Kirk's murder as we  did with the late Melissa Hortman. Instead, the majority proceeded with  a resolution that brings great pain to the millions of Americans who  endured segregation, Jim Crow, and the legacy of bigotry today.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Congress stands together to oppose this attack on our  democracy, Minnesotans continue to mourn the unbearable loss of one of  our Nation's finest public servants.\n\nI first Melissa Hortman in 1998 when we knocked doors together during  her first campaign for public office. Back then, I was a member of the  Minnesota House of Representatives and Melissa was…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…prayers go to the family, and everyone  impacted across the State.\n\nI know that the events of June 14 were shocking and heartbreaking.  Minnesota State House Speaker Emerita Melissa Hortman and her husband,  Mark Hortman, were assassinated. Minnesota State Senator John Hoffman  and his wife, Yvette, were critically injured.\n\nI offer my love on behalf of this…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today alongside my colleagues from  the State of Minnesota to honor the lives of Melissa and Mark Hortman,  who were shot and killed in an unspeakable act of political violence  last week.\n\nMinnesota House Speaker Emerita Melissa Hortman was truly the best of  us. She…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692786/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…for his wife Erika and for his children who must now make their  way without him.\n\nAnd his death comes on the heels of the devastating assassination of  Speaker Emerita Melissa Hortman and her husband Mark Hortman of  Minnesota, victims of premeditated political violence. This should  shock the conscience of every American, and it should cause all of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Res. 519  introduced by Congresswoman Kelly Morrison and the Minnesota  delegation.\n\nI join my colleagues in condemning the attack that took the lives of  Speaker Emerita Melissa Hortman and her husband, Mark, and wounded  Senator John Hoffman and his wife, Yvette.\n\nLet me say this loud and clear as so many have said today. There is  no place in our democracy…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692861/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "Mr. KRISHNAMOORTHI. Mr. Speaker, I rise today with a heavy heart and  growing concern for the safety of our democracy.\n\nOn June 14, in Minnesota, Speaker Emerita Melissa Hortman and her  husband, Mark, were gunned down in their home. That same night, State  Senator John Hoffman and his wife, Yvette, were shot and wounded in a  separate attack.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692857/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Attorney's Office that had been installed by  the Trump administration on my recommendation who did an incredible job  through the horrific assassination of former Speaker Melissa Hortman  and her husband and also was there at the side for the families when  those little children were gunned down through stained glass windows at  Annunciation Church--those…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Senator Hoffman and his wife's full  recovery.\n\nThen the gunman attacked another Democratic State legislator with  over  20 years of service, Minnesota Speaker Emerita Melissa Hortman, and her  husband Mark. She and her husband leave behind two children.\n\nThese killings are not only horrifying for Minnesota but a tragedy  for America. This heinous act…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…okay.  We don't need to agree with someone's politics to say that their murder  is a tragedy. The assassination of Charles Kirk, the murders of  Minnesota House Speaker Melissa Hortman and her husband, and the  countless children lost to school shootings, are not partisan issues.  These are human tragedies.\n\nViolence against any American is violence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…want to see a way forward.  We all need to start with ourselves.\n\nThis morning, I sat, and I lit a candle. I thought about the anguish  and suffering of Representative Melissa Hortman's two children as they  try to cope with the assassination of their mom and dad.\n\nThen I sat, and I thought of the pain and the torment of Charlie  Kirk's family as they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695814/bringing-compassion-to-our-nation"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, last night, law enforcement apprehended  the man suspected in the assassination of Minnesota State  Representative Melissa Hortman and her husband and the shootings of  State Senator John Hoffman and his wife.\n\nWe in the Senate thank our law enforcement for their remarkable work  in bringing the attacker…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692586/minnesota-lawmakers-shootings"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…of  H. Res. 519.\n\nWhat happened in my State of Minnesota was a painful reminder of the  growing threats that public servants face simply for doing their jobs.\n\nSpeaker Melissa Hortman was a friend, mentor, and fierce advocate who  dedicated her life to public service. The assassination of Melissa and  her husband, Mark, and the harm done to Senator…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692855/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Democratic or Republican  challenge. It is an American challenge.\n\nI welcome the suggestion of Sophie and Colin Hortman, children of  slain Minnesota State House Speaker Melissa Hortman and her husband,  Mark. In their children's words: ``If you would like to honor the  memory of Mark and Melissa, please consider the following: Plant a  tree. Visit a…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692983/lowering-the-temperature"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…early morning hours of June 14, many of us woke up to the  horrifying news of a targeted political attack that took the lives of  former Minnesota Speaker of the House Melissa Hortman and her husband,  Mark, and which left State Senator John Hoffman and his wife, Yvette,  hospitalized with multiple gunshot wounds.\n\nIn the hours and the days following,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Hoffman and shot and critically injured him and his       wife, Yvette Hoffman;\n\nWhereas the gunman then entered the home of Minnesota State       House Speaker Emerita Melissa Hortman and assassinated her       and her husband Mark Hortman;\n\nWhereas the gunman had documents that listed dozens of       lawmakers targeted for assassination;\n\nWhereas the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Mr. EMMER. Mr. Speaker, I rise today on behalf of all Minnesotans to  honor the lives and legacies of former Minnesota Speaker of the House  Melissa Hortman and her husband, Mark, who were viciously murdered in  their home on June 14.\n\nWe also continue to pray for Minnesota State Senator John Hoffman and  his wife, Yvette,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692785/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…support of H. Res. 519.\n\nThe events of June 14 were truly horrifying. Those events shocked  Minnesota, and they shocked the country.\n\nWe mourn the loss of Minnesota Speaker Melissa Hortman and her  husband, Mark. We pray for the swift recovery of my friend, Senator  John Hoffman, and his wife, Yvette. I was honored to serve with both of  them in the Minnesota…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…fortunately not home, and the other who was perhaps saved by a timely  law enforcement intervention.\n\nHe later arrived at the home of Minnesota State House Speaker Emerita  Melissa Hortman and assassinated her and her husband, Mark Hortman.\n\nLaw enforcement then led a 2-day manhunt before capturing the killer  and finding a list of more than 45 lawmakers…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and denounce all forms of political violence.\n\nEarlier this month, a deranged gunman shocked the State of Minnesota  and this entire Nation by murdering Speaker Emerita Melissa Hortman and  her husband, Mark, and attempting to kill State Senator John Hoffman  and his wife, Yvette.\n\nI am absolutely devastated by this terrifying act of violence. While…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692860/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}]