[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Stansbury).\n\nMr. Speaker, I, once again, urge our colleagues to oppose this bill.  D.C. has a right and its residents have a right to govern themselves  and elect mayors and council members that choose to pass laws to  support the District. Congress should not be undermining local laws.\n\nMr. Speaker, Republicans want to make it easier to lock up poor  defendants…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…promoting an indoctrination  agenda authorized by President Trump.\n\nI would like to take a moment to first thank all educators, school  staff, family volunteers, and all community members who tirelessly work  to equip our students for the future. We owe you a debt of gratitude  and so much more than that. We need to recommit to strengthening our  public schools…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…In October, we had a shadow hearing in Chicago, Illinois, in the  gentlewoman's home State. I really appreciate all the work she did to  help us facilitate that. We had 18 Members of Congress from all over  the country come to that shadow hearing, and it was the largest act of  congressional immigration oversight since Donald Trump took office.\n\nWhat…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Mr. Speaker, on May 30, Severna Park and Maryland's  Third Congressional District lost one of our youngest members of our  community, Hugh Nie. Hugh was not even 18 months old when he died of  sudden, unexplained death in childhood, or SUDC.\n\nHugh's parents, Eddie and Jessica, who are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695280/recognizing-the-life-of-hugh-nie"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…it is worth  curing diseases, then let's have it. I invite my colleagues to explain  to their constituents why they are fighting cancer or Alzheimer's.\n\nMr. Speaker, I urge Members to reject those devastating cuts and  stand up for the well-being of the American people.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690846/national-institutes-of-health"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Commission of Fine  Arts District of Columbia Residency Act. This bill would require that a  majority of the members of the Commission of Fine Arts (CFA) be  District of Columbia residents.\n\nUnder federal law and presidential executive orders (EOs), the CFA  has review authority for federal…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694733/introduction-of-the-commission-of-fine-arts-district-of-columbia-residency-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…or what the dynamic was, but about an hour  ago, everybody just said: Nah, I don't care how close we are. We are  just going to do this because we are going to start to lose Members. We  are going to start to lose momentum. The weekend is hard. Maybe we are  going to get yelled at from the left; you are going to get yelled at  from the right; and we can't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in a bipartisan way to do that. I urge my colleagues to support  the bill, and I yield back the balance of my time.\n\nMr. HARRIS of North Carolina.\n\nMr. Speaker, I thank the members of the Committee on the Judiciary  for unanimously supporting this bill in markup. I am grateful for my  colleagues who have all risen to speak today and to the ranking member…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and his administration are threatening to invade other foreign  countries and have failed the most basic constitutional duty of seeking  the consent of Congress and advising Members of Congress.\n\nToday, we forced a vote on this floor, forcing all of my colleagues  to ensure that we vote to save the Affordable Care Act so millions of  Americans could have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…nurtured her company from the ground-up in a male-dominated field. Her  contributions to our community will live on for years to come in her  children, friends. and the many members of our community she touched  throughout her life.\n\nBorn on October 10, 1962, Sepi spent the first 15 years of her life  in Tehran, Iran, where she was raised in a household…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689506/recognizing-the-life-and-legacy-of-sepi-saidi"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…additional lawmakers targeted for assassination or for violence,  including Congressman Krishnamoorthi who, of course, is a member of our  Oversight Committee.\n\nWe have seen how our Members of Congress are facing more and more  threats, but we cannot and will not be silent. It is important that we  continue to push back against hate, fear, division, and misinformation…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…NORTON. Mr. Speaker, today, I introduce the District of Columbia  Zoning Commission Home Rule Act. This bill would give the District of  Columbia the authority to appoint all members of the D.C. Zoning  Commission (Commission). Currently, the membership of the Commission  consists of two federal officials the (the Architect of the Capitol  (AOC) and the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…transparency and       accountability measures to address these systemic problems.       This new process has been in place for more than two years       and has been a success. Members are still entitled to union       representation throughout the process and MPD policy still       requires disciplinary cases to commence timely within 90       days, although…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…effort. Their  persistence is why we are passing this bill into law today.\n\nAgain, I thank my Republican colleagues for working on this piece of  legislation with me and other members of the committee.\n\nI am proud of my community. I am grateful for their trust. Once  again, they proved something that we all know back home: Don't mess  with rural New Mexicans.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Natural  Resources Committee. Currently, the National Park Service offers free  national park and Federal recreation land passes to certain groups,  including U.S. military members and veterans. This legislation builds  on this framework by waiving entrance, standard amenity, and day-use  fees at over 2,000 Federal recreation sites for law enforcement…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…leadership continuously put innocent  American lives at risk as nearly 400 individuals whose names appeared  on the terrorist watch list attempted to enter the country and gang  members from MS-13 and Tren de Aragua invaded the interior of the U.S.\n\nSome of these monsters took the lives of innocent Americans, like  Laken Riley and Jocelyn Nungaray. While…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…greater than or equal       to six months, or an employee of a federal government agency       liaison office housed within Senate space. Interns, clerks,       unpaid fellows, members of the media, and other non-      government employees that provide services to the Senate are       not covered under this term.\n\n2.6 Fitness facilities means the U.S. Senate…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690978/us-senate-health-and-fitness-facilities-regulations"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Ms. EDWARDS. The Chair is now honored to invite the Speaker of the  House,   Mike Johnson of Louisiana, to address all Members.\n\nMs. EDWARDS. I thank the Speaker so much for giving your time out of  your incredibly busy schedule. You are always really generous with your  time for the former Members.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…a thriving region rich in culture, industry, and opportunity. Over  the centuries, this county has been home to hardworking farmers,  entrepreneurs, educators, and service members--all of whom have played  a role in shaping its legacy.\n\nWe remember the early settlers who shaped life in this land, facing  hardships with unwavering determination. We honor…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…times of pressure defines  our credibility around the globe.\n\nIf we are serious about countering the CCP, we have to pass this  piece of legislation.\n\nMadam Speaker, I urge all Members to vote for H.R. 1512, and I yield  back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…This bill, as amended, would take important steps to improve VA  healthcare.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, I encourage all Members to support this  legislation, and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise with an incredibly heavy heart to  honor the life of my friend, Congressman Doug LaMalfa.\n\nDoug was one of the most effective Members of this Chamber. He was  deeply passionate about issues that affected his constituents in  northern California.\n\nAs most of the Members of this Chamber know, we all have little…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698729/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…communities worldwide to advance a  common good.\n\nThey have proven time and time again that when a community unites,  anything is possible.\n\nMr. Speaker, I thank the staff; the board members; the partner  agencies; and countless volunteers for their compassion, leadership,  and hard work  which have made our region a better place to live, work, and raise a  family.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691973/recognizing-united-way-of-the-bradford-area"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Speaker, I have a letter here from the National  Automatic Merchandising Association--vending machines, as most of us  would know it--that it would be affecting their vending members. Most  are small businesses. Ninety-plus percent of their operators have  revenues of less than $10 million a year.\n\nMr. GUTHRIE.   It is difficult for small businesses to…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…your Committee with respect to the bill does not       waive any jurisdiction over the subject matter contained       therein.\n\nI am pleased to support your request to name members of the       Committee on Agriculture to any conference committee to       consider such provisions. I will ensure that our exchange of       letters is included in the Congressional…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…weapons.\n\nMadam Chair, this has been defeated before, but before we didn't have  the good news and the support of every neighbor and our President the  way we do today.\n\nI ask all Members to vote against this, not because they can't make a  point that Lebanon is a country that has been influenced but because  they can't make a point that the LAF is anything…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693681/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in fostering an inclusive and welcoming environment  for all members, especially in her contributions to the Chamber's 60th  Anniversary Celebration.\n\nOutside of the Chamber, Susan is an Assistant Treasurer of the A.  Marlyn Moyer, Jr. Scholarship…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…reason why President Trump finally had the guts--yes,  I will call them guts--to call in the National Guard to take on the  crime presence that exists in Washington, D.C.\n\nMembers of Congress have had their cars stolen. We have had Members  of Congress who were assaulted. We have had staff members of this body  who were killed. People who come to this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…responsibility and  rein in wasteful spending to which Washington has become so addicted.\n\nMr. Speaker, I look forward to working with my House colleagues,  Chairman Arrington, and the Members of this body to accomplish the  President's goals by way of this reconciliation measure.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689915/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…of the committee and  to publish those rules in the Congressional Record not later than March  1 of the first year of each Congress. On February 27, 2025, a majority  of the members of the Committee on Homeland Security and Governmental  Affairs' Subcommittee on Border Management, Federal Workforce, and  Regulatory Affairs adopted subcommittee rules of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688269/us-senate-subcommittee-on-border-management-federal-workforce-and-regulatory-affairs-rules-of-procedure"}]