[{"senator": "Al Green", "party": "Democrat", "sentence": "…impeachment. I understand the process. I want you  to know that it is imminent. A vote takes place with this grand jury  that I called to your attention, which would be the Members of  Congress. We need but only a majority of the Members of Congress to  vote in favor of impeachment, and a President can be removed from  office. An authoritarian President can…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…for millions of veterans to get the  services they need.\n\nIt is simply wrong. Our veterans deserve better. Debbie and her  family deserve better, and we need Republican Members of Congress who  control this body to stand up for our veterans and our public servants  and stop this madness.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687961/debbie-va-employee"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…paralyzed by fear of angering the super-PACs that  bankroll campaigns.\n\nThat fear is the point. Dark money doesn't just influence policy. It  changes behavior. It makes Members of Congress think twice before doing  the right thing because they know one vote could trigger a massive  smear campaign.\n\nThe losers aren't Democrats or Republicans. The losers…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699235/restoring-election-integrity"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…to counter  illicit cross-border tunnels and hold the bad actors accountable.\n\nThis information will help us, Congress, address the issue at the  border and let us, as Members of Congress, better respond to the  challenges.\n\nMr. Speaker, I believe this bill is an important step in the right  direction. Receiving information from the Department of Homeland…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688706/subterranean-border-defense-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…owners, and seniors in Louisiana and across our country,  helping them afford coverage in a time when the cost of living  continues to climb. This is something that we, as Members of Congress,  should do. Without these extensions, their premiums will skyrocket.\n\nHealthcare is not a luxury. It is a fundamental human right.\n\nMr. Speaker, I stand with Leader…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698377/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…for detention  facilities with the highest death rate in decades and that fail to meet  the basic medical needs of detainees. No wonder they refuse to allow  access to Members of Congress.\n\nTo support one more cent for an agency with such disregard for the  rule of law and basic human decency would be a moral outrage.\n\nMr. Speaker, vote ``no'' on this…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699350/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…States.  D.C. residents deserve to have their history and American citizenship  recognized.\n\nThere is existing evidence that the D.C. seal should have been  depicted. The Members of Congress room in the Thomas Jefferson  Building, which is not open to the public, depicts the D.C. seal with  the depiction of state seals on its ceiling. This precedent reinforces…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…outdoor economy, thousands of jobs, and  a way of life that has been passed down for generations.\n\nIt is an area that Presidents, reaching back to Teddy Roosevelt, and  Members of Congress on both sides of the aisle have long recognized in  terms of its value, and we have protected it as part of our American  heritage.\n\nYet, the Boundary Waters have been…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…elected officials are truly working for them. We  can't allow that doubt to grow. We have the power to help fix it.\n\nThat is why I have long supported legislation to ban Members of  Congress from trading individual stocks, and I am encouraged that we  are working together in a bipartisan way to get this done.\n\nMr. Speaker, I thank Representative Magaziner,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691224/stock-trading-ban-for-members-of-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…sexual violence in conflict is not something that requires  international cooperation, then there would be no need for the Office  of the Special Representative. But Members of Congress and their staff  who have met with the extraordinarily knowledgeable and dedicated  occupants of that position over the years would strongly disagree.\n\nIf you believe…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the stablecoin market grow tenfold, over the next 3 years, to a $2  trillion market.\n\nI am going to vote no on this legislation when it comes up this week.  We prohibit Members of Congress from activity in crypto currency. The  same should be true for the Presidency. Why are we having two different  standards? I think the answer is obvious.\n\nThat means,…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be facing  going to prison, but the President is with impunity, saving what  happened yesterday, with impunity making threats against judges, making  threats against Members of Congress.\n\nMr. Speaker, for those who say, well, that is just Congress and they  are just judges, let me tell you how it impacts your life.\n\nIf you go before one of the judges…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…raped  and abused underage girls or saw underage girls being paraded, are all  hidden. They are all redacted.\n\nIt is a little bit of a farce. They are inviting all the Members of  Congress to go see the Department of Justice's ``unredacted files,''  but they have got all redacted files from the FBI.\n\nIt is not the fault of the Justice Department attorneys.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…guaranteed to all of us in the  Constitution. That is what separates us from autocratic regimes around  the world.\n\nThe Trump administration is now going after judges, Members of  Congress, political opponents, students, law firms, reporters,  Governors, and now the leader of a powerful labor union.\n\nThis is about abusing power to silence dissent. This…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692154/supporting-david-huerta"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Republican Majority in the  House of Representatives decided that they know better than the  residents of the District of Columbia what their local government  needs.\n\nAll Members of Congress are sent here by our constituents to  represent their interests, and to vote on matters of federal  importance. We aren't sent here to rule on specific local ordinances…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692632/opposition-to-hr-hr-and-hr-2096"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to combat supposed wokeness, whatever that is, Democrats  simply want to add another bill for consideration, one that actually  helps workers and is cosponsored by 214 Members of Congress, including  several Republicans.\n\nThe PRO Act was one of the first bills I got to cosponsor in  committee and in Congress when I joined in 2021. That was back when the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Oversight Committee, there  was nothing new about the President's former relationship with Epstein  and certainly nothing scandalous. We did find two sitting Democrat  Members of Congress had communication with Epstein.\n\nFirst, it has been highly reported and debated about Congresswoman  Stacey Plaskett texting during an Oversight Committee hearing with…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697128/irrefutable-evidence"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…here and now. They want to try to distract the American  people with other issues.\n\nMr. Speaker, let's deal with the issues at hand. Let's focus on  those, do our job as Members of Congress, and get on with our business  today.\n\nI am going to take a little time to address the importance of the No  Rogue Rulings Act and why the American people are demanding…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…fertilizer industries is fair and that markets are transparent to our  farmers. That is a very important consideration, at this very time, as  the Trump administration and we Members of Congress look to provide aid  to farmers.\n\nThis is a top concern that I hear from many family farmers. My  farmers are concerned that Federal dollars meant to help the farmers…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697521/farmers"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…other Member in Congress.\n\nFurther, Emily worked across the State and across the aisle to earn  bipartisan support and helped our team be in the top 10 most bipartisan  Members of Congress.\n\nThroughout her tenure, Emily has been a true plankholder from day  one. Whether she was operating in a role as communications director,  scheduler, or, ultimately,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688336/recognizing-emily-tuttle-millard"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…director.\n\nFrom taking incredible videos and photos and designing eye-catching  graphics to teaching other Hill staffers how they can best produce  great content for Members of Congress, Michael's inspiring creativity  and work ethic have been a major contribution not only to my team but  to the entire Republican Conference as a whole.\n\nAs every Republican…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691928/good-bye-michael-comer"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise with my colleagues, in fact, the  freshmen Members of Congress, to reach far beyond party lines, beyond  State borders, and even beyond our planet. It affects every American,  shaping our economy, our security, and our future. I…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…analogous to a  tumor to be excised or a disease to be vanquished.\n\nI appeal to my colleagues: Don't ignore or trivialize the battered  victim in the womb. Unborn babies need Members of Congress to be their  friends and advocates, not powerful adversaries.\n\nAbortion violence must be replaced with compassion and empathy for  women and respect for the weakest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…impugns and  denigrates the 77 million Americans who voted for President Trump.\n\nTo my friends watching at home who support bitcoin and  cryptocurrency: Make no mistake. Members of Congress who vote against  the rule today are voting against the most important legislation for  the cryptocurrency industry in history.\n\nI beseech my colleagues who appreciate,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…minibus package is $14.3 million in earmarks for  special interest projects across the country. At a time when our  national debt is skyrocketing well past $38 trillion, Members of  Congress should be focused on reining in wasteful spending and funding  the essential functions of our government, not divisive handouts to  NGOs.\n\nParticularly concerning are…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…our Nation's  borrowing, is only a couple of days of borrowing. How do I help people  understand the perspective of the scale and the fact that everything  that we as Members of Congress vote on is borrowed?\n\nIf you told me today that I have to balance the budget, I can do it.  Every part of government has to be shut down--no Park Service, no  Congress,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…this statement regarding Representative Stauber's Minnesota       Mining Legislation:\n\n``The Laborers' International Union of North America       (LIUNA) urges Members of Congress to support H.J. Res. 140, a       Congressional Review Act resolution that would restore our       ability to responsibly develop critical minerals that are       needed…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…is telling the truth. But  I do know this: I don't think anybody wants to see anybody hungry in  America.\n\nThe only people that I can ascertain who are being paid are Members  of Congress. I am not being paid. I said I wasn't going to take a  salary during the shutdown. Some of my colleagues are, and I am not  judging anybody. My purpose is not to judge…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…functionally requires a couple of trillion  dollars of reduction in spending every year--think about that, with  where we are going growth-wise.\n\nHow many of you see Members of Congress come behind these microphones  and say that we should work on this, let's get to $2 trillion a year.  That is actually how screwed up these numbers are.\n\nWhen you get…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…creation of a  memorial to the Adams family in Washington, D.C. In 2019, Congress  further authorized the Adams Memorial Commission, a bipartisan panel  comprised of Members of Congress and Presidential appointees, tasked  with spearheading planning, raising private funds, and educating the  public on the Adams family legacy of patriotism and civic…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}]