[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…debate, and I reserve  the balance of my time.\n\nMr. BOYLE of Pennsylvania. Mr. Chair, I yield 1\\1/2\\ minutes to the  gentleman from New Jersey (Mr. Pallone), the ranking member of the  Energy and Commerce Committee.\n\nMr. BOYLE of Pennsylvania.  Craig), the ranking member of the  Agriculture Committee.\n\nMrs. WATSON COLEMAN. Mr. Speaker, I thank my colleague…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…have healthcare coverage through the Affordable Care Act because of  Speaker Pelosi. She is also Italian American.\n\nMs. DeLAURO.  Kaptur), the distinguished ranking member of the Energy and  Water Development and Related Agencies Subcommittee.\n\nMs. DeLAURO.  McCollum), the distinguished ranking member of the  Defense Subcommittee.\n\nMs. DeLAURO.  DelBene).…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…vote ``no.'' I reserve  the balance of my time.\n\nMr. CLYBURN. Mr. Chair, I yield 2 minutes to the gentleman from New  Jersey (Mr. Pallone), the distinguished ranking member of the Energy  and Commerce Committee.\n\nMr. CLYBURN. Mr. Chair, I have one additional speaker.\n\nMr. CLYBURN. Mr. Chair, I yield 1 minute to the gentlewoman from New  York (Ms. Gillen).…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…in response to a query by--\n\nI will step away from the article for a second--by my friend and  longtime New Jerseyan Representative Frank Pallone--he is the ranking  member of the Energy and Commerce Committee--and Brendan Boyle, a  Democrat, of Pennsylvania, the ranking member of the Budget Committee.  They asked the question.\n\nThat leaves Republicans…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…will do something  else.\n\nMr. PALLONE. Mr. Speaker, once again, I yield such time as she may  consume to the gentlewoman from Florida (Ms. Castor), who is our  ranking member of the Energy Subcommittee.\n\nMr. PALLONE.  Matsui), who is the ranking member of  our Subcommittee on Communications and Technology.\n\nMr. Speaker, I have heard my colleagues on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…better to try to reduce  prices.\n\nMr. Speaker, I encourage my colleagues to vote ``no,'' and I reserve  the balance of my time.\n\nMr. PALLONE.  Castor), who is the ranking member of the Energy  Subcommittee.\n\nMr. PALLONE. Mr. Speaker, may I inquire as to how much time is  remaining.\n\nMr. PALLONE.  Elfreth).\n\nMr. PALLONE. Mr. Speaker, I will mention to my colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…We want to save Americans money. We are the good  actors, not the bad actors.\n\nMadam Speaker, I yield 3 minutes to the gentlewoman from Virginia  (Ms. McClellan), a member of the Energy and Commerce Committee.\n\nMr. PALLONE. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, I will call out some of the problems that I see on the  Republican…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bills.\n\nThis bill does none of that. It simply gives a fast pass to Big Oil  and Gas, and I urge my colleagues to oppose the bill.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, the Energy and Commerce Committee has jurisdiction over  a number of issues, including energy, but we also have jurisdiction  over the FCC.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…spending levels for specific projects that they are bound by  law to carry out.\n\nThat is exactly what this bill does.\n\nMs. DeLAURO.  Kaptur), the distinguished ranking member of the Energy and  Water Development Subcommittee.\n\nMs. DeLAURO.  Pingree), the distinguished ranking member of the Interior,  Environment, and Related Agencies Subcommittee.\n\nMs.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…protects the pay of our Federal wildland firefighters.  It rejects nearly $1 billion in Trump cuts to Tribal programs for  school and safety and self-governance.\n\nAs ranking member of Energy and Water, I worked hard to make sure  these bills definitively rejected Trump's damaging proposals and made  major investments that are absolutely critical both to my…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…is cynical, dangerous, and deeply irresponsible.  Congress should be trying to protect Americans, not trying to make them  sick.\n\nMr. PALLONE.  Castor), the ranking member of the Energy Subcommittee.\n\nMr. PALLONE.  Schrier).\n\nMr. PALLONE.  Matsui), the ranking member of our Communications and  Technology Subcommittee.\n\nMr. Speaker, I would like to talk…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…this committee is so critical to the economic success of our Nation  and the safety of our communities.\n\nThis focus and interest are also what led me to choose to be a member  of the Energy and Water Development and Related Agencies Subcommittee  and the Commerce, Justice, Science, and Related Agencies Subcommittee.  I am so pleased today that a reasonable…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…of that out the door by allowing FERC, which has  no expertise in these areas, to just say ``no,'' and FERC doesn't even  want to do it. They told us.\n\nAs the ranking member of the Energy Subcommittee, Ms. Castor, said-- they literally told us at the committee--that they didn't want to do  this and didn't have the capacity to do it.\n\nWe have made so much…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…President, I am here to give, I guess, an  explanation and update to my colleagues about the status of permitting  reform.\n\nI think, as you know, the chair and ranking member of the Energy and  Natural Resources Committee and the chair and ranking member of the  Environment and Public Works Committee were working on a permitting  reform bill until very…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bills for American families.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill, and I  reserve the balance of my time.\n\nMr. PALLONE.  Castor), the ranking member of our Energy Subcommittee.\n\nMr. PALLONE.  Frankel).\n\nMs. LOIS FRANKEL of Florida. Mr. Speaker, my, my, my. I rise today,  amazed that with the healthcare crisis unfolding, the Republican…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and Commerce, the chairman of the Subcommittee on Energy.\n\nMr. GUTHRIE. Madam Speaker, I yield 4 minutes to the gentleman from  Colorado (Mr. Evans), a very important member of the Energy and  Commerce Committee.\n\nMr. GUTHRIE. Madam Speaker, I have no further speakers, and I am  prepared to close.\n\nMr. GUTHRIE. Madam Speaker, I yield myself the balance…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…requirement for substance use disorder recovery  and mental health.\n\nMr. Chair, I yield 2 minutes to the gentlewoman from Florida (Mrs.  Cammack), my great friend and a member of the Energy and Commerce  Committee.\n\nMr. GUTHRIE. Mr. Chair, I will remind you that we spend about almost  $700 billion in Medicaid. When this bill goes into effect, 10 years…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Business Committee, or their designees.\n\nOne hour of debate will also be provided for H.R. 2483 and shall be  equally divided and controlled by the chair and ranking member of the  Energy and Commerce Committee, or their designees.\n\nThe rule provides a motion to recommit for all four bills.\n\nMr. Speaker, my colleagues are here to deliver on the Trump…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…America is paying for gasoline?\n\nWe are here to address it, and we are addressing it by a bill  authored by my good friend, the chairman of the Energy Subcommittee, a  member of the Energy and Commerce Committee, and a leader in this  arena.\n\nIt is frustrating that we lost 42 days because our side of the aisle  wanted to open the government and wanted…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…benefit of my constituents and the benefit of all Americans by  advancing this important legislation and putting energy policy in this  country back on track.\n\nAs a member of the Energy and Commerce Committee, I was proud to work  to advance this legislation to the House floor, and I look forward to  seeing it passed through Congress on the way to being…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…grant review process by  requiring the Federal Communications Commission to vet applicants for  broadband funding based on experience, capability, and performance.\n\nAs a member of the Energy and Commerce Committee, this is a smart,  bipartisan, commonsense piece of legislation, and I know my  constituents back home agree.\n\nThat is why today I will be voting…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690152/rural-broadband-protection-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…3617.\n\nMr. Speaker, I rise in support of H.R. 3617, the Securing America's  Critical Minerals Supply Act, introduced by Representative  John James,  my colleague and member of the Energy and Commerce Committee from  Michigan's 10th Congressional District.\n\nMr. Speaker, this legislation enhances the Department of Energy's  ability to assess, to identify,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}]