[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…his retirement, Nick  served as a distinguished partner at Harter Secrest & Emery, where he  combined his legal acumen with a deep-seated sense of justice.\n\nA dedicated member of the Board of Governors for the Jewish  Federation, Nick has played a pivotal role in strengthening Jewish life  and fostering a culture of generosity and community-mindedness.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691612/recognizing-nick-robfogel"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Gelman, and many more.\n\nI would be especially remiss not to recognize my friends Bill and  Bobbie Kilberg. Bill is president of the mid-Atlantic region of the  AFHU and a member of the board of governors, among many other stops in  his legal and business career. Bobbie is president and CEO emerita of  the Northern Virginia Technology Council, an entity that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Ms. WATERS. Mr. Speaker, I rise today in support of Lisa Cook. She is  a member of the Board of Governors of the Federal Reserve. I rise to  support her because there is an attempt to fire her if she does not  retire or resign.\n\nThis attempt that has been made…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694804/in-defense-of-lisa-cook"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…has also dedicated his  time as an Executive-in-Residence for George Mason University's  Recreation Management Program, Chairman of the Board of Visit Fairfax,  and a member of the Board for The Community Foundation for Northern  Virginia.\n\nMr. Speaker, Paul Gilbert's decades of vision, leadership, and  dedication to our parks system will benefit our…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…early in life at Nichols Chapel AME Church, where  his musical talents flourished. His passion for music led him to serve  as Minister of Music at the church and as a member of the Board of  Trustees.\n\nNone of Cliff's achievements would have been possible without the  love and support of his family, including his late wife of 50 years,  Sadie Jean Nix…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…on  the Healthcare Leadership Council as the associations 2024 to 2025  Chairman of the Board and sits on the Foreign Policy Association Board  of Directors, and is a member of the Board of Directors for Mars, Inc.\n\nI hope that he and his wife Christa, and their children Gavin, Caidyn  and Alsten, will have many wonderful years ahead of them traveling…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}, {"senator": "John Carter", "party": "Republican", "sentence": "…his community. He has served on the Cedar  Park City Council, the Cedar Park Tourism and Advisory Board, and the  Planning and Zoning Committee. Additionally, he is a member of the  Board of Directors for the Williamson County Appraisal Board, where he  also chaired the Bond Oversight Committee. Driven by a passion for  service, Commander Lux was a founding…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689344/saluting-the-service-of-commander-jon-lux"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Committee on       Appropriations of the House of Representatives.\n\n``(G) 6 individuals designated by the President.\n\n``(2) Timing of appointments of members.--\n\n``(A) If any member of the Board described in paragraph       (1)(C) is not appointed by the date that is 180 days after       the date on which the first session of each Congress       convenes, the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…United Disabilities Services,  a nonprofit that helps disabled individuals, veterans, and seniors live  more independent and fulfilling lives. He first served as a board  member and board president for ten years in two separate stints and  joined the organization as their Chief Operating Officer in 2008.  Following the departure of Gerry Meck, Bill became…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690790/congratulating-bill-kepner-on-his-retirement"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…go on to serve so faithfully.\n\nMr. Greer's influence can be seen through his involvement with  numerous civic and community organizations. He has served as a founding  member of the Board of Directors for the Cullman Parks & Recreation  Foundation, contributed to the Cullman Rotary Club, and supported  Wallace State Community College through the Future…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…End Alzheimer's Southwest  Indiana.\n\nMr. Farabaugh is a member of the Automobile Dealers Association of  Indiana, where he has served as President and currently as a member of  the Board of Directors.\n\nMr. Farabaugh was nominated for this award by Marty Murphy, Executive  Vice President of the Automobile Dealers Association of Indiana. I  congratulate…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…well with Team Bice. Her attitude,  spirit, and wit will be truly missed, especially at Monday morning  coffee.\n\nThis past weekend was the 126th Army-Navy game. As a member of the  Board of Visitors at West Point, this is not easy to say, but for  Simona, I will: Congrats. Go Navy.\n\nMr. Speaker, she will be truly missed.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}]