[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, I rise today to encourage every Member of  this Chamber to support this legislation honoring one of Santa Barbara  County's own, Brigadier General Frederick R. Lopez.\n\nMy bill would name the South Patterson Avenue post…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…especially important for U.S.  Senators. Sadly, we didn't see that this weekend. I wish I didn't have  to say this, but I was deeply disappointed and sickened to see a Member  of this Chamber use the tragedy in Minnesota to take cheap, political  shots at the other side on social media and risk escalating a perilous  moment. What the senior Senator from…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…immigration  enforcement, and they are demanding--they are demanding--that we do  something about it.\n\nAmericans have every right to be enraged. I am outraged, and every  Member of this Chamber should also be enraged. This is certainly not  the country that I grew up in, and this is certainly not the country  that we can leave to the next generation.\n\nIn this…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…letter gave rise  to a joint resolution of disapproval which became law?\n\nMr. PADILLA. I thank the Presiding Officer.\n\nMr. PADILLA. Mr. President, I wonder if any other Member of this  Chamber grew up like I did where on a pretty regular basis, we would be  sent home from grade school because of the intensity and dangers of  smog that settled over the San…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…alongside my Congressional Labor Caucus co-chairs and our over 120  members to counter what is arguably the largest act of union busting in  American history.\n\nI urge every Member of this Chamber to join the Congressional Labor  Caucus in supporting this crucial legislation. Let's stand with Federal  workers in restoring their union rights against these unprecedented…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697986/protect-americas-workforce-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is outrageous that Secretary Noem let this happen and then lied  about the incident after the fact. Neither the Senate, nor any member  of government, can tolerate a Member of this Chamber being treated in  this way. Secretary Noem has proven herself to be derelict in her  responsibilities.", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692588/alex-padilla"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Speaker, I rise to recognize my former chief of  staff, Michael Reed, who will leave the House after many years of  service.\n\nFrom 2019 to 2021, he served my office. Every Member of this Chamber  would be lucky to have Michael serving them. He is a mentor to any  staff who work under him. He is a lover of the institution and the  rules that guide us, and he…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689175/michael-reed-dedicated-public-servant"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congressional  District to lower costs, to keep them safe, and to make sure that they  had affordable, accessible healthcare coverage.\n\nMr. Speaker, I encourage every single Member of this Chamber to do  those things, not only for the people in my district but for the people  all across America who are asking and needing Congress to act.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, within 12 hours, this very Chamber is going  to witness a joint address to Congress. I will take my time and my  privilege as a duly elected Member of this Chamber to share some of the  sentiments about the state of the Union that is emerging very clearly  and loudly from Michigan and on behalf of my constituents.\n\nFirst and foremost,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…country to steal from  the American people, you ought to be deported; and if you have somehow  gained American citizenship, you should be stripped of it. Every single  Member of this Chamber should support this legislation.\n\nThe era of rampant fraud is over. Under President Trump, we are going  to continue to put the American people first.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…checking voter ID when individuals go to  vote. It is a commonsense proposal.\n\nThe American people will get to see where their Member stands, and I  encourage every Member of this Chamber to vote ``yes'' on the SAVE  America Act.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…line-by-line  process. Over the next few months, we will continue this work and  efforts through regular order. This Article I advancement is an  accomplishment that every Member of this Chamber can be proud of  regardless of party. Yet some still need to decide what they stand for  today.\n\nTo my colleagues on the other side of the aisle, do they want the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…year 2026.\n\nThe House acted expeditiously to pass these bills, marking historic  progress for our appropriations process and the return to regular order  that every Member of this Chamber wants to see.\n\nI share the frustrations of many that the Senate altered our deal at  the last minute. However, our obligation is not to these emotions. It  is to the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…never take for granted, the liberties we enjoy today,  recognizing that these freedoms have been hard-won by the honor,  commitment, and sacrifice of our Veterans. Each Member in this chamber  and every citizen in these United States should be humbled by the  courage of our brave Veterans who voluntarily faced danger and  adversity to preserve our country…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…dictators, authoritarians, and strongmen around the world who will  watch this video and be encouraged and think this is the way to silence  their critics.\n\nI can't image a Member of this Chamber who knows Alex Padilla, who  has had the blessing of sitting with him in moments when he is asked  questions or engaged in discourse, who thinks of him as anything…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…innovate on a sensible  timeline is a different approach than the inflexible, top-down mandate  that became accustom over the past 4 years.\n\nThe good news is, every Member of this Chamber now has the  opportunity to right this wrong and reinstate the rule in place before  that, which allowed for reclassification of these sources.\n\nThe former rule, which…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…spending in the African development program. We should all  be able to support eliminating $1.7 billion for radical gender projects  in the Economic Support Fund. Every Member of this Chamber should be  able to support a rescission of $2.5 billion in the development of  assistance programs, which bankrolled corrupt leaders in foreign  countries.\n\nMr. Speaker,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…sides of the aisle will also appreciate and enjoy serving with  him, as well.\n\nMatt, let me quickly interject here. This institution is built on  debate, and as every Member in this Chamber can tell you, we don't  always agree on things. Matt, let me give you your first chance at  providing a rebuttal. As the father of a Naval Academy graduate, we  have…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697494/welcoming-the-honorable-matt-van-epps-to-the-house-of-representatives"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…partner of choice to enable economic and business development by  partnering with businesses, schools, communities, and individuals in  Central Pennsylvania.''\n\nAs a proud member of the chamber, I recognize its vital role in  driving regional economic growth, fostering job creation, and  supporting businesses of all sizes as they innovate and invest in  America's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694122/recognizing-central-pennsylvania-chamber-of-commerce"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…more baseload, your price is going to  go up. We have to grow baseload in this country. The only way to reduce  energy prices is competition and more energy.\n\nEvery Member in this Chamber and the American people have witnessed  the drastic consequence of this antidomestic energy policy championed  by the previous administration, which led to record-high…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}]