[{"senator": "Al Green", "party": "Democrat", "sentence": "…Let him know that there are some lines that he can't cross. Let him  know that he can't come in our House and call Members of the Democratic  Party lunatics or call a Member of the Senate Pocahontas. Let him know  that there are boundaries. You can still get elected.\n\nHe uses the word ``lunatic'' here, and I am going to read it again.\n\n``This radical…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…day the program is shut down, the  further behind our innovation economy falls.\n\nThe fate of this program lies in the hands of six negotiators: the  chair and ranking member of the Senate Small Business Committee, the  chair and ranking member of the House Small Business Committee, and the  chair and ranking member of the House Science  Committee. Five…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…compassion and the care you have for Oregonians, whom you have been  serving so well for so long. It has really been, just for me, a  wonderful opportunity to be a new Member of the Senate, along with  Senator Schiff, who I know feels the same way to be working with  somebody like the Senator from Oregon, who is just honest and true and  totally grounded…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…through its mismanaged trade war or deliberate  weakening of U.S. standing overseas, the administration is facilitating  China's global rise. That is why, as the ranking member of the Senate  Foreign Relations Committee, I am committed to working with my  colleagues on both sides of the aisle to preserve the vital programs  that we need to keep our country…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Senate  rules; but in 2022, when we did so, Republicans opposed it, and they  defended the filibuster and the 60-vote threshold as sacred.\n\nToday, as the ranking member of the Senate Rules Committee, I want to  make sure everyone understands exactly what Republicans are trying to  do here, now.\n\nThe Clean Air Act passed this body under regular order…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the terrorism and the potential disease that can cross the borders of  Sudan can come to the United States, and we have seen that too often in  the past.\n\nAs ranking member of the Senate Foreign Relations Committee, I am  committed to working with my colleagues on both sides of the aisle here  in Congress as well as folks in the Trump administration…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…subcommittee  overseeing funding for this space.\n\nI rise today, with my colleagues, out of grave concern for the future  of our democracy.\n\nI currently serve as the ranking member of the Senate Rules and  Administration Committee. I also, as many of you know, am the former  secretary of state for the State of California. So I have seen  firsthand, not just…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…and cost-reducing policies, President Trump has  decided to take a whack at American small business and families with  billions and billions in new costs.\n\nAnd as a Member of the Senate, I cannot sit by quietly while our  President makes Americans suffer simply because their needs do not  match his priorities.\n\nI was hopeful that President Trump would…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Mr. President, I strongly support this resolution.\n\nI do want to say thank you to Senator Kaine.\n\nSenator Kaine, I think I speak for you and I think I speak for every  Member of the Senate: Senator from Illinois, you are wonderful.\n\nIt is so amazing what she did.\n\nAs an enlisted person in combat, the injuries you suffered, the  devotion that you have to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…colleagues, introduced  the Rotorcraft Operations Transparency and Oversight Reform--or ROTOR-- Act. After several weeks negotiating a bipartisan agreement with the  ranking member of the Senate Commerce Committee, Maria Cantwell, the  committee passed the ROTOR Act unanimously.\n\nHere is what the ROTOR Act does:\n\nNo. 1, it tightens the rules for military aircraft…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…it is more important than ever  that we invest in our servicemembers, protect defense spectrum, drive  innovation, and strengthen our missile defense systems.\n\nAs a member of the Senate Armed Services Committee, I am proud to  report that this year's National Defense  Authorization Act meets this moment. It includes key provisions I  secured to modernize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the members       of the Board a Member of Congress to serve as the Chair of       the Board.\n\n``(B) Rotation.--A Member of the House of Representatives       and a Member of the Senate shall alternately be selected as       the Chair of the Board.\n\n``(C) Term.--An individual may not serve as Chairperson of       the Board for consecutive terms.\n\n``(4)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…election, it makes good on.\n\nI will say first that it is, I think, important to every Member of  the Republican Conference in the House and, I believe, every Republican  Member in the Senate, as well, to extend those tax cuts, drive an  economy that is working for Americans, and drive additional growth in  the economy.\n\nThat is what came out of the House,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689909/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…their attempt for more       wilderness areas in Arkansas.\n\nThe ACC firmly believed that their break would come when       Arkansas' senior senator, and distinguished member of the       Senate Energy and Natural Resources Committee, Dale Bumpers       (D-AR), would introduce a bill--as he had promised 18 months       previously in 1981. But, again, the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the       Committee.\n\n9.5. Whenever the Select Committee on Intelligence makes       classified material available to any other committee of the       Senate or to any member of the Senate not a member of the       Committee, such material shall be accompanied by a verbal or       written notice to the recipients advising of their       responsibility…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…and I passed the  Build Now Act unanimously out of the Banking Committee. Every Democrat  and every Republican voted for it.\n\nThen it came to the Senate floor. Every Member of the Senate--every  Democrat, every Republican--said: We like it. We will take a dozen of  these.\n\nThey liked it so much--my colleagues liked it so much that they made  it a part…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…and strengthen the national defense.\n\nEveryone in this Senate played a role. I want to thank all 99 of my  colleagues. First among them, I thank Jack Reed, the ranking member of  the Senate Armed Services Committee, who has been a steadfast partner.  I also express my gratitude to the other distinguished members of the  committee from both sides of the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…down the government. He himself has  recently suggested a shutdown. He said: It is preferable to accepting  bipartisan solutions.\n\nSenator Cory Booker, who is another member of the Senate Democrat  leadership, went even further. When asked about a short stopgap measure  that we are talking about now to keep government open so we can proceed  with additional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…American people,  particularly among the soldiers, that we ought to continue to pay the  soldiers and continue to pay the workers.\n\nI am, perhaps, the most conservative Member of the Senate. I vote to  cut spending on everything--I think we spend way too much--but I am not  for cutting the salaries of people who have a contract and who are  doing their…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]