[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, I thank Ranking Member Velazquez for this  opportunity to speak. I thank Chairman Williams for working with me to  introduce this bill.\n\nMr. Speaker, I urge my colleagues to support this effort to  prioritize…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…every other  American with their own entrepreneurial dream, and I reserve the  balance of my time.\n\nMr. Speaker, I thank my colleagues, Chairman Williams and Ranking  Member Velazquez, for this incredible work and, as Mr. Stauber said,  allowing us to work together in this way.\n\nMr. Speaker, I thank Mr. Stauber for his incredible work in this area…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Patronis, for his partnership in co- leading this important piece of legislation with me. Of course, this  bill would not be possible without the leadership of Ranking Member  Velazquez and Chair Williams.\n\nMadam Speaker, I urge my colleagues to support this bill.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699186/504-program-risk-oversight-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Member, Committee on Small Business,      House of Representatives, Washington, DC.\n\nDear Speaker Johnson, Chairman Williams, Minority Leader       Jeffries and Ranking Member Velazquez: As a representative of       America's 34 million small businesses, Small Business       Majority writes to express our opposition to H.R. 2931, the       Save SBA from…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…role in the United States' leadership in these areas.\n\nI thank my colleagues for their collaboration on this critical  legislation. I thank Chairman Williams and Ranking Member Velazquez for  their support. I urge my colleagues to vote ``yes'' on this  legislation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…with disabilities in this country to  have their just due and to support me in this legislation moving  forward. Finally, Mr. Speaker, I thank Chair Williams and Ranking  Member Velazquez for their efforts in moving this bill forward.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691779/thinkdifferently-about-disability-employment-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "I rise today in support of H.R. 4495, the SBA Fraud Enforcement  Extension Act. This bill builds off the work done by Ranking Member  Velazquez in a previous Congress. That bill extended the statute of  limitations for investigating fraud in the PPP and EIDL programs.\n\nAll of the major pandemic relief programs,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697226/sba-fraud-enforcement-extension-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…better understand how international economies impact our Nation's  small businesses.\n\nI am proud to be a co-lead on this bill, and I thank Chairman  Williams and Ranking Member Velazquez for working together to advance  this bill to the floor, as well as my colleagues Congressman Van Drew  from New Jersey and Congresswoman Goodlander from New Hampshire,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687956/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, I rise in support of H.R. 788.\n\nFirst of all, I thank Chairman Williams and Ranking Member Velazquez  for their bipartisan work. As a serial entrepreneur in the technology  innovation sector, I couldn't be happier to stand here and support this  bill along with my amazing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…in communities across the country.\n\nI thank Representatives Finstad, McIver, and Garbarino for their  partnership in this legislation and Chairman Williams and Ranking  Member Velazquez for their strong support.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on this bill and  for the Senate to expeditiously take it up so we can unlock more of the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I thank my amazing Ranking Member Velazquez  for yielding.\n\nMr. Speaker, I rise today in strong opposition to H.R. 2966, a bill  that does not serve our small business community, despite its name.\n\nAt a time when…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…when they need advocates here in Congress and  throughout the executive branch.\n\nI am very proud to be a part of this legislation, and I thank Mr.  Chairman and Ranking Member Velazquez for keeping the Small Business  Committee one of the most bipartisan committees in Congress.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…that will provide robust support for veterans'  small business development and help veterans achieve their  entrepreneurial goals.\n\nI thank Chairman Williams and Ranking Member Velazquez for their  support of this legislation and moving it forward. Certainly, I thank  the lead sponsors, Representatives Alford and Davids, for their  gracious support of…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687889/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Hampshire (Mr. Pappas), and the gentleman from  Florida (Mr. Bean) for their partnership on this important, bipartisan  legislation. I also thank Chairman Williams and Ranking Member  Velazquez for their support of this bill.\n\nI urge my colleagues to vote ``yes'' on this legislation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…AI  for Main Street Act.\n\nI thank Chairman Williams for his leadership. I also thank my  colleagues on the other side of the aisle. Foremost, I recognize both  Ranking Member Velazquez for her leadership and Congresswoman Hillary  Scholten for working with me to bring this important bill forward.\n\nA lot of people are talking about AI these days. Will…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…American innovation, the Small  Business Innovation Research, SBIR, and the Small Business Technology  Transfer, STTR, programs, for 1 year.\n\nI thank my colleagues, Ranking Member Velazquez and Chairman Babin  and Ranking Member Lofgren of the Committee on Science, Space, and  Technology for cosponsoring this bipartisan legislation.\n\nSince the 1980s, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…should be. It is high time we address this issue  and empower women in business by ensuring the system works for them,  not against them.\n\nMr. Speaker, I thank Ranking Member Velazquez, my fellow New Yorker,  for partnering with me on this important piece of legislation. It is  time we stop allowing fraudsters to steal opportunities meant for  legitimate…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691799/wosb-accountability-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…1-year  extension of SBIR and STTR programs and encourage all Members to vote  ``yes'' on this bill.\n\nI look very much forward to working with Chairman Williams, Ranking  Member Velazquez, Chairwoman Ernst, Ranking Member Markey, and Ranking  Member Lofgren to get a full reauthorization completed and through  Congress as soon as possible.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695451/extension-of-sbir-and-sttr-authority"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…blocking it.\n\nMr. Speaker, today is a fly-in day for the House of Representatives.  This conversation between Chairman Williams, Mr. McGarvey, and the  leadership of Ranking Member Velazquez won't get the headlines because  this apparently doesn't sell to the news media.\n\nWe in this country, as Democrats and Republicans, have more in common  than we do differences,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691757/entrepreneurs-with-disabilities-reporting-act-of-2025"}]