[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…traditionally done this with the U.S. Coast Guard, sometimes  in conjunction with the U.S. Navy. We are in a partnership. They do  what we would call law enforcement. And members of the Coast Guard come  aboard Navy ships. We interdict drugs that are coming through the  Caribbean or, more often, on the pacific side, on the western side of  Mexico, up into…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…firsthand law enforcement officer, I have seen the harmful effects that  happens to these victims.\n\nI am pleased that the bill before us strengthens protections for  members of the Coast Guard from sexual assault, provides support to  victims, and increases transparency within the service about the manner  in which such cases are handled.\n\nMadam Speaker,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…fentanyl, overdoses.\n\n(b) Availability.--The updated policy required under       subsection (a) shall require naloxone or other similar       medication be available for members of the Coast Guard--\n\n(1) on all Coast Guard installations; and\n\n(2) in each operational environment.\n\n(c) Participation in Tracking System.--Not later than 1       year after the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Coast Guard. Sec. 242. Modifications to career flexibility program. Sec. 243. Direct hire authority for certain personnel. Sec. 244. Command sponsorship for dependents of members of Coast Guard                assigned to Unalaska, Alaska. Sec. 245. Authorization for maternity uniform allowance for officers. Sec. 246. Consolidation of authorities for college…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]