[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…double? Who is  behind all this?\n\nI said: Unfortunately, there is a political difference here. I won't  go into details. It will sound too partisan. But there are some Members  of the Senate, who, frankly, know you are going to have to pay twice as  much and really don't want to see changes made--let it go forward.\n\nI think that is unfair to her. I could…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…whatever your views are on  whatever issue, I would caution that this is a gate we need to close  shut because if the Executive branch of government can start telling  the Members of the Senate what codels they can and  cannot go on with State Department support and facilitation, we have  got a real problem on our hands.\n\nHere is my badge from the event, which…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…unusual manner, and I want to be clear and explain  that. But I just want to tell you what John Lewis said. It is a quote  so many people know. He really spoke not to Members of the Senate or  the Congress; he was really speaking to Americans. He said:\n\nGet in good trouble, necessary trouble, and help redeem the       soul of America.\n\nJohn Lewis died…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…our job, and it is our responsibility. And  one of the enormous threats to our democracy right now is the  capitulation of too many Members of the House and too many Members of  the Senate of powers that are vested in this body, under the  Constitution, in ceding those authorities to the Chief Executive.\n\nWhy is that wrong? It is wrong because there is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…having declared war, a President who has  declared that he visited with corporate America before taking kinetic  activity in Venezuela, where do we stand?\n\nWell, the Members of the Senate, 50 of them, stood with this  resolution. I would stand with them. I stand with them now, 50 of them  who stood for this resolution.\n\nMr. Speaker, 50 Members were antithetical…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…celebrating our 200th anniversary. That is so long ago, 49 years  ago. And Senator Hatfield had a saying about appropriators, and that  was that appropriators--that is, those Members of the Senate who served  on the spending committee--they were first appropriators, and then they  were Republicans or Democrats. That is how strongly they felt about  their shared…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…exclusive authority to remove  the Librarian of Congress and the GPO Director. Specifically, their  removal would only occur by an affirmative vote of three-fifths of the  Members of the Senate and House, and clarify that the executive branch  has no role in these decisions. (This is already the case for the  Comptroller General.)\n\nI ask for my colleagues'…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Pence. For several hours, American  democracy hung by a thread.\n\nThose people came into this Chamber. They desecrated this Chamber.  They went through the desks of the Members of the Senate here. They  hung from the walls of this Chamber. They did the same thing to the  House of Representatives. They were looking for House and Senate  Members that they…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…attack by Proud Boys, Oath  Keepers, and other violent extremists who stormed the Capitol, drove  Members of the House of Representatives out of our Chamber, drove  Members of the Senate out of their Chamber, and attempted to overthrow  a Presidential election.\n\nNow, the new administration has seen fit to pardon more than 1,500  rioters and violent…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…surely would not stand by and see them lose what  little they do have.\n\nMedicaid is for people who don't have the kind of healthcare that 435  Members of Congress and 100 Members of the Senate have, but they do  have some healthcare.\n\nIt has been approved by legislation that the Energy and Commerce  Committee would cut $880 billion from their budget. The…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I thank Senator Welch and Senator  Marshall and my colleagues who are here today and all the members of  the Senate Agriculture Committee for their bipartisan work on this  legislation.\n\nThis legislation rightfully provides more options for parents,  students, and teachers, which…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697063/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…President, I rise today to ask my colleagues to pass  my Keep SNAP and WIC Funded Act of 2025, which has the backing of the  entire Democratic caucus--the Democratic Members of this Senate.\n\nNow, we all know access to food is a human right. It is that simple.  And we are all fortunate enough to live in the United States of  America, a nation that is rich;…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…has conducted himself in office such that persons are now  threatening Members of the judiciary, threatening Members of the House  of Representatives, and threatening Members of the Senate.\n\nDonald John Trump, by his conduct, merits impeachment, trial, and  conviction in the Senate of the United States of America and should  never hold any office of public…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697871/and-still-i-rise"}, {"senator": "James Risch", "party": "Republican", "sentence": "…director.\n\n(2) Any member of the committee should feel free to call       upon the staff at any time for assistance in connection with       committee business. Members of the Senate not members of the       committee who call upon the staff for assistance from time to       time should be given assistance subject to the overriding       responsibility…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…men  and women in blue who actually stand on that thin blue line even when  they are abandoned.\n\nAll of those who have answered the call deserve Members of this body,  Members of the Senate, elected leaders across the country to risk even  an ounce of what those men and women are willing to risk. They must  risk the election certificate upon which they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…shall ensure that such       notice is provided and shall maintain a written record       identifying the particular information transmitted and the       committee or members of the Senate receiving such       information.\n\n9.6. Access to classified information supplied to the       Committee shall be limited to those Committee staff members       with…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…our  intelligence services or as an astronaut and a pilot in combat--for  recording a video reminding members of our military that they can  refuse an illegal order; Members of the Senate and House investigated  for seditious behavior, which our President claims is punishable by  death.\n\nMany of my colleagues have said: Pay no attention to what the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…floor of the Senate demanding action for the American people,  such as passing the SAVE America Act, then you can force the vote,  unless a Member wishes to speak.\n\nIf Members in the Senate wish to speak against passing a commonsense  piece of legislation that polls at 80 percent, then let them do it.\n\nLet Democrats go to the floor of the Senate. Let them…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…programs and management, with Superfund  issues, and, especially, for State and Tribal assistance grant  programs.\n\nOverall, we addressed the priorities of dozens of Members of the  Senate, whether it was programmatic requests for more parochial  matters, like stream gages on the Ohio River, to the distribution of  revenues from development off the gulf…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…violating grand  jury secrecy rules when I obtained 197 of Jack Smith's subpoenas--wide- ranging subpoenas--that violated the privacy of a lot of people,  including a lot of Members of the Senate and Congress.\n\nSenator Johnson and I then made these subpoenas public--almost 2,000  pages of information. That information exposed that Jack Smith, the  prosecutor,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "John Thune", "party": "Republican", "sentence": "…we  passed the full-year bill on Friday.\n\nBefore I close, I want to extend my gratitude to Appropriations  Committee Chair Collins and Vice Chair Murray and all the members of  the Senate Appropriations Committee for their tireless work this year.\n\nAppropriations work is demanding, and I appreciate all they have done  to make it possible for us to pass…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…outstanding chairman of the full  committee. He has let the cardinals do their work. He has worked with  Members in the minority and the majority. He has worked with Members of  the Senate and the House. Mr. Speaker, I also thank Ranking Member  Marcy Kaptur and our colleagues across the Capitol.\n\nThis is a strong bipartisan bill. It addresses America's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]