[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…bills up for consideration are on  their way, so should I speak slowly, or should we go into recess?  Either way, we are not delaying the House.\n\nMr. Speaker, I urge Members to support H.R. 1190, the Expanding  Access to Capital for Rural Job Creators Act. It is a simple but  important step to directing the SEC's small business advocate to  include…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…concerns of the Committee on Financial Services Democrats.\n\nAs such, I am pleased to recommend to my colleagues to vote ``yes''  on this bill.\n\nMr. Speaker, I urge all Members to support H.R. 3352, the Helping  Angels Lead Our Startups Act, or HALOS Act, sponsored by Mr. Lawler.\n\nThis legislation will help startups have easier access to the funding  they…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…water to 50,000 people in southeastern Colorado.\n\nIt is unconscionable.\n\nNow, I am speaking to my Democratic colleagues. To be clear, it is  important in this moment for Members to support this override and  ensure that this promise that was made to the people of southeastern  Colorado is not impaired and is not abrogated by the President's  retaliation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…was the epitome of a public servant and will be deeply  missed. It is our job now to continue this fight in his memory.\n\nMr. LYNCH. Mr. Speaker, in closing, I urge all Members to support  this bill, and I yield back the balance of my time.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…communities.\n\nI commend Dr. Morrison, Mr. Downing, Mr. Pappas, and Mr. Bean for  their work on this bill.\n\nMs. VELAZQUEZ.  Morrison).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge Members to support this bill, and  I yield back the balance of my time.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…others for their cooperation in crafting this critical legislation. I  look forward to our continued collaboration as this legislation moves  forward, and I urge all Members to support this bill.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Congress  and not against Congress' efforts to strengthen America's ability to  compete with China like this bill that aims to do exactly that.\n\nMr. Speaker, I urge all Members to support this legislation, and I  yield back the balance of my time.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Workforce Act restores a  balanced, targeted framework that respects national security, while  reaffirming the rights of those who serve us.\n\nMr. Speaker, I urge all Members to support this legislation and  restore these protections for over 1 million Federal workers. Again,  this particular legislation is about no political loyalty test having  to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…of American  innovation and manufacturing which is helping pioneer the grid of the  future and create high-skilled domestic jobs in the process.\n\nMr. Chairman, I urge Members to support my amendment, and I reserve  the balance of my time.\n\nMr. MIN. Mr. Chair, I yield back the balance of my time.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Chairman Williams; his staff  director, Lauren Holmes; and all the floor staff for seeing this bill  through today. It is greatly appreciated.\n\nMadam Speaker, I urge Members to support this bill, and I reserve the  balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I commend Ms. Scholten and Mr. Downing  for their dedication to our Nation's innovative…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Representative Hoyle and the rest of the Natural Resources Committee  for allowing this measure to pass through committee and to come to the  floor.\n\nMr. Speaker, I ask that all Members support this legislation on  economic development, expediting the permitting process, and ensuring  that the lands in our community are decided by the residents who use  them.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…all  the committee's requirements for consideration.\n\nMs. SIMON. Mr. Speaker, I have no speakers. I reserve the balance of  my time.\n\nMs. SIMON. Mr. Speaker, I urge all Members to support this bill, and  I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…empower.\n\nWe expect that contracting officers will have more confidence working  with WOSBs, knowing that the SBA has already verified them.\n\nMr. Speaker, I urge all Members to support this bill.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691797/wosb-accountability-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…program was not  enacted into law. I am glad to be working across the aisle again to  make sure territories receive full access to SBA services.\n\nMadam Speaker, I urge Members to support this important bill, and I  reserve the balance of my time.\n\nMs. VELAZQUEZ. Madam Speaker, I urge my colleagues to support this  legislation, and I yield back the balance…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699175/northern-mariana-islands-small-business-access-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…I yield such time as she may consume to the  gentlewoman from Virginia (Mrs. Kiggans), the sponsor of this bill.\n\nMr. BOST. Madam Speaker, once again, I encourage all Members to  support this legislation.\n\nMadam Speaker, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…for his  leadership on this bill on behalf of our veterans. I urge my colleagues  to support H.R. 586, as amended.\n\nMr. BOST.\n\nMr. BOST. Mr. Speaker, I encourage all Members to support this bill,  and I yield back the balance of my time.\n\nMr. BOST. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689625/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has a temporary  extension with reforms. There are three bills that have numerous  bipartisan coauthors, but instead of supporting any of those, he has  directed his Members to only support an uncompromising measure that has  zero bipartisan cosponsors. That has already been rejected by the  Senate and so has no chance of becoming law.\n\nThis whole issue…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…better by ensuring the program continues longer, while  giving Congress the opportunity to revisit these programs.\n\nMr. BOST. Mr. Speaker, once again, I encourage all Members to support  this legislation.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Chairman Rogers for their steady leadership throughout this process,  and I thank the subcommittee staff for their hard work on this  legislation.\n\nMr. Speaker, I urge all Members to support this bill. Our time is  now.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…substance of the bill today, I  would like to clear up any confusion about any remarks I made in the  Rules Committee last night.\n\nLet me be crystal clear. I encourage all Members to support the rule  before us today. My comments last night were lacking in context.  Democrats made the argument throughout the hearing that this process is  somehow another vote…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…yield such time as he may consume to the  gentleman from Michigan (Mr. Barrett), who is the sponsor of this bill.\n\nMr. BOST. Madam Speaker, once again, I encourage all Members to  support this legislation.\n\nMadam Speaker, I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…our ability to project power across the oceans and in the air and to  ensure that America's defense remains second to none, now and for  generations to come. I urge all Members to support a vote in favor of  this bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Hopefully, we will  continue working together, as we still have a lot of things to get  done. This bill is a very good bill.\n\nMr. Speaker, I, once again, encourage all Members to support this  legislation, and I yield back the balance of my time.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699210/veterans-law-judge-experience-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…unnecessary delays.\n\nMr. Speaker, I urge all my colleagues to support H.R. 1912, and I  reserve the balance of my time.\n\nMr. BERGMAN. Mr. Speaker, once again, I encourage all Members to  support this legislation and send our colleague, Mr. Connolly, our best  wishes and prayers.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…a bipartisan  offset related to older veterans and pensions, and I urge all of my  colleagues to support H.R. 695, as amended.\n\nMr. BOST. Mr. Speaker, I encourage all Members to support this  legislation, and I yield back the balance of my time.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688213/medal-of-honor-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…I appreciate the request. This is why we have these  types of hearings, and that is why we have this legislation here today.\n\nMr. Speaker, once again, I encourage all Members to support this  legislation, and I yield back the balance of my time.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…taxpayers'  investment in these programs.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, in closing, I, once again, encourage all  Members to support this legislation, and I yield back the balance of my  time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695445/veterans-readiness-and-employment-program-integrity-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…permanent.\n\nThese provisions will help to put Congress back on track toward  fiscal responsibility and prevent further abuses of this funding  mechanism.\n\nI thank all Members who support this legislation, and I am looking  forward to seeing its progress through this body.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…have earned.\n\nMr. Speaker, I urge all my colleagues to support H.R.\n\nMr. BOST. Mr. Speaker, I have no more speakers.\n\nMr. BOST. Mr. Speaker, once again, I encourage all Members to support  this legislation, and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}]