[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…development, helped them compete for  natural resources, and connected local leaders to maximize growth.\n\nCongratulations to Robert DeJournett, Misty Beasley, and the entire  membership of the Black Chamber of Commerce of Summit County on a  successful first year and being named the 13th Congressional District  champion of the week.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699951/recognizing-black-chamber-of-commerce-of-summit-county"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…World Bank.  Our leadership in these institutions provides us with a strong voice to  improve global economic stability, decrease poverty, and boost  prosperity.\n\nThrough our membership, we advocate for high standards, push for  transparency, and drive economic reforms that benefit not only  developing nations but our own national security, too. It is wrong,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Field Representative, where he coordinated grievance procedures,  negotiated collective bargaining agreements, and advocated for safer  job conditions on behalf of the local membership. These roles prepared  him well for his election as Business Manager of Laborers Local 264 in  February 2010, a position he held for over a decade.\n\nAs Business Manager,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…expedient and proper for that purpose, and for acquiring and  maintaining and club house and grounds.''\n\nThe pioneering women who founded the Town & County Club at a time  when membership at most private clubs was exclusive to men created an  organization worthy of its storied 100-year history. It is my honor to  celebrate the Town & County Club of Hartford,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691102/recognizing-the-100th-anniversary-of-the-town-county-club"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…historic mistake that was made by  both parties to let China into the World Trade Organization without  having an understanding that they should obey the requirements of good  membership in the WTO and not manipulate their currencies. That is not  what President Bush was about.\n\nThen, it went up, of course, during President Obama, down during the  first Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…line of  dynamic Calvary pastors who played a role in social justice efforts in  the city of White Plains and in Westchester County.\n\nNinety years young and still growing in membership and in love, we  salute Calvary Baptist Church for its important role in the life of our  community.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697280/calvary-baptist-church"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…story to tell.\n\nWhy am I so thankful that my parents made what I believe was a tough  personal decision, but, of course, the right decision? It is because of  what that union membership actually meant to my journey and my younger  brother's journey.\n\nIn 1973, my younger brother was born with a serious heart condition.  He is okay right now. He is doing well.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…mentor, and friend, Representative Bonnie Watson Coleman. We both are  here because of the path that leaders like Shirley Chisholm blazed  before us.\n\nWith the highest ever membership to the Congressional Black Caucus,  62 members strong, we have never been stronger. We represent the dreams  of our ancestors, and those dreams are in danger by this  administration's…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…clear as day.\n\nYes, there are tax breaks on tips and overtime but only for 3 years.  This is at the same time that billionaires and those who can afford a  $1 million annual membership to Mar-a-Lago got tax breaks that are  permanent. Why is help for working families temporary but handouts for  the privileged permanent?\n\nWe won't be deceived. Communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695037/temporary-benefits-for-working-families"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Academy of  Nursing, the National Academies of Practice and the New York Academy of  Medicine.\n\nThe American Association of Nurse Practitioner is the largest  professional membership organization for nurse practitioners,  representing the interest of the over 431,000 licensed nurse  practitioners in the United States who are delivering care in nearly…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…passed away in September at the age of 86.\n\nMr. Bartlett was born in 1939 in Rye, attended North Carolina Central  University, graduated with a degree in accounting, and membership  during college of the Alpha Kappa Chapter of the Kappa Alpha Psi  fraternity. Mr. Bartlett turned his degree into a career as a Treasury  agent and as an auditor for the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…for generations.\n\nUnder the leadership of pastors, including Reverends Howard S. Ryan,  G.P. Hertweck, Gerald Ogg, Sammy Hayes, and Arnold Brown, the church  grew in both membership and outreach. Expanding facilities,  establishing new ministries, and adopting the name Bethel Temple  Assembly of God reflected its evolving mission and growing  congregation.…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…is not  happening with Congress, and Donald Trump and his minions have become  emboldened to attack the courts.\n\nI have attempted to bring light to these issues through my membership  on the House Committee on Oversight and Government Reform, as well as  part of the rapid response team that our leadership has set up.\n\nFor example, I have sent letters…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…U.S.C. 1182(a));\n\n(ii) has not ordered, incited, assisted, or otherwise       participated in the persecution of any person on account of       race, religion, nationality, membership in a particular       social group, or political opinion; and\n\n(iii) has not been convicted of--\n\n(I) any offense under Federal or State law, other than a       State offense…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…of 2025, sponsored by Representative Kim from  California and cosponsored by Representative Green of Texas.\n\nH.R. 910 requires the United States to advocate for Taiwan's  membership and participation in the International Monetary Fund, also  known as the IMF.\n\nTaiwan is currently seeking to join the IMF, and I believe we should  support this effort.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…across the region,  including by the Tampa Bay Business Journal, which named it one of the  largest chambers in the Tampa Bay area. The Chamber represents a broad  and diverse membership spanning vital sectors such as professional  services, construction and trades, real estate, healthcare, finance,  education, retail, hospitality, transportation, manufacturing,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…contingency plans and       coordination mechanisms to improve the response of critical       supply chains and critical industries to supply chain shocks.\n\n(c) Working Group Membership.--The Working Group shall       include a representative from each Federal agency that relies       on the analysis of the Industry and Analysis business unit,       including--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…or other distributed ledger       technology, applications built on blockchain technology or       other distributed ledger technology, tokens, and       tokenization, the membership of which shall include--\n\n(A) the Secretary;\n\n(B) representatives of Federal agencies (as determined       necessary by the Secretary); and\n\n(C) nongovernmental stakeholders…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…enthusiasm, strength,  and resilience. Through Robin's expertise, the Rocklin chamber was  guided through a period of growth and prosperity. She helped the  chamber expand its membership, started important community programs,  forged strong partnerships that support Rocklin's local businesses and  economy, and built a legacy that will continue to shape the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…that is operating on the date of       the enactment of this Act under a charter for the purpose of       addressing the issues described in paragraph (1) and, if the       membership of such committee does not comply with subsection       (b), modify such membership to comply with such subsection.\n\n(b) Membership.--\n\n(1) Appointment.--The members of the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…is       secured by a first or subordinate lien on residential real       property (including individual units of condominiums and       housing cooperatives) or stock or membership in a cooperative       ownership housing corporation designed principally for the       occupancy of between 1 and 4 families that is--\n\n``(A) insured by the Federal Housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Commander, 1st Vice Commander, and  Finance Officer.\n\nHe is also Secretary for the VFW Post 6464, President of the Howell  Veterans Society, American Legion Department of Michigan Membership  Committee Member, and a Post 141 Past Commanders Committee Member.\n\nTo put it simply, Bobby Brite is a pillar in the veteran community-- offering support, building friendships,…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690118/recognizing-bobby-brite"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…became a highlight of the Tahoe Basin. In 1938, the organization  officially became the Tahoe Yacht Club, the name it proudly holds  today.\n\nOver the following decades, membership grew exponentially to around  600. The organization later established the Trans-Tahoe Race, the  organization's largest sailing event, which soon became internationally…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Taiwan to access resources  that promote financial resilience and deter China's economic coercion.\n\nIt has been the longstanding U.S. policy toward Taiwan to support its  membership in international organizations where statehood is not a  prerequisite. We must continue to advocate for Taiwan's voice to be  heard where membership is not possible. This…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…period at the end       the following: ``, as well as information relating to any       prior or ongoing attempts by the People's Republic of China       to undermine Taiwan's membership or observer status in all       organizations described in section (4)(1) and Taiwan's ties       and relationships with other countries in accordance with       subsection…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Speaker, it comes as no surprise that in 2024, Doug was  unanimously elected to serve as the chairman of the Congressional  Western Caucus, one of the largest congressional membership groups on  Capitol Hill, focusing on rural policy and issues that affect the West  and beyond.\n\nDoug left an indelible mark on this institution and the people whom  he got…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…happens that I support the right of workers to organize. I joined  a union from 1962 to 1971. I was a member of the International  Association of Machinists. I am proud of my membership in that union  and the years I spent on the assembly line at Waterloo Register in  Cedar Falls, IA. It happens that my job was putting screw holes in  furnace registers.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693111/project-labor-agreements"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…celebrates its 120th  anniversary.\n\nIn 1905, the chamber was founded as the Milton Board of Trade. Over  the last 120 years, the chamber has grown and expanded its reach and  membership into Columbia, Montour, Northumberland, Snyder, and Union  Counties, and 120 years later, the mission of  the chamber remains the same as when it was founded: ``To be the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694122/recognizing-central-pennsylvania-chamber-of-commerce"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…consolidate rules for the use of the fitness  facilities, including the Senators' gym, staff gym, and athletic  courts. The updated regulations define eligible staff for membership  purposes and reflect current operational practices.\n\nSenate Health and Fitness Facilities Regulations   [Adopted by the Committee on Rules and Administration on May 6, 2025,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690978/us-senate-health-and-fitness-facilities-regulations"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…``committee'') pursuant to section 565 of title 5,       United States Code, to negotiate proposed regulations to       implement the requirements described in subsection (a).\n\n(B) Membership.--If the Administrator elects to establish a       committee under this subsection, the committee shall be       composed of--\n\n(i) representatives of--\n\n(I) the FAA;\n\n(II)…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}]