[{"senator": "John Larson", "party": "Democrat", "sentence": "…at a local       movie theater, parading down Main Street with her family and       friends after the Allies were victorious in the Second World       War, never missing a Memorial Day parade where she would       always point out her brother Ernie's Boy Scout troop or her       long-time Sherwood Circle neighbor, Frank, behind the wheel       of an…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 2306, legislation introduced  by the gentleman from Michigan (Mr. Moolenaar).\n\nThis bill would extend the authority for the Adams Memorial  Commission and authorize a prominent location for the eventual memorial  to commemorate the legacy and contributions of John Adams and the  entire Adams family, including…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…humanitarian, and advocate, Nabaraj KC has earned  recognition on local and national levels. As President of the College  Point Civic and Taxpayers Association and the Dil Kumari KC Memorial  Foundation, he has led initiatives that raised more than $3 million  worth of food, personal protective equipment, and other important  resources to communities in need during…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…help  ensure that our veterans and their families can keep pace with the cost  of living.\n\nAs a cosponsor of this legislation and a member of the Disability  Assistance and Memorial Affairs Subcommittee, I am pleased that we are  able to come together on a bipartisan basis to pass this bill that will  do just that.\n\nMr. Speaker, I want to end by thanking…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696761/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…in New  Hampshire. Projects include: the Interstate 93 expansion from Salem to  Manchester, the largest undertaken by the NHDOT; the Sarah Mildred Long  Bridge project; the Memorial Bridge Project; and many other projects  that have and will continue to improve transportation in New Hampshire.  Bill's service extends beyond his commissioner title, with…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Jenkins was also a quiet but steady force in the struggle for  civil rights, supporting carpools during the bus boycott, aiding  desegregation of the lunchroom at Phoebe Putney Memorial Hospital and  practicing ordinary acts of courage that yielded extraordinary change.\n\nHe loved the land--raising chickens and hogs and living the words of  Psalm 128:2, eating…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "I rise in support of H. Con. Res. 9, which authorizes the use of the  Capitol Grounds for the 44th Annual National Peace Officers' Memorial  Service on May 15, 2025. I thank the gentleman  from Pennsylvania (Mr. Perry) for his leadership as the subcommittee  chair.\n\nThis incredibly important event, which is hosted…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…hospitalized and some deal with PTSD  until today.\n\nOn March 2022, a year following that, this Congress passed a law  directing the Architect of the Capitol to place a permanent memorial to  honor every one of those officers who had violence perpetrated against  them. Mr. Speaker, 5 years after that tragic day, the plaque is here in  the Capitol but the Speaker…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…It is what veterans want, and  it is what serves them best.\n\nMr. TAKANO.  Morrison), my good friend who serves on our Health  Subcommittee and our Disability Assistance and Memorial Affairs  Subcommittee.\n\nMr. Speaker, I urge my colleagues, once again, to vote ``yes'' on  H.R. 3854, Modernizing All Veterans and Survivors Claims Processing  Act, as amended.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…downtown Orlando. At the  time, it was the deadliest mass shooting in U.S. history.\n\nI was proud to work on both sides of the aisle in June 2019 to  introduce the National Pulse Memorial. In June 2020, it passed the  House but did not pass the Senate. Finally, in June 2021, it was  introduced, passed into law, and signed by President Biden.\n\nWe know that the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Remagen  Bridge in Germany, which was the turning point of the war.\n\nFinally, I honor Roger Durbin, a veteran of our Army who gave me the  idea to create the World War II Memorial here where now over 100  million people have visited to honor our heroes and our heroines.\n\nSlava Ukraini.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…a high school freshman, he has come out on  top at the national level, and I could not be more proud.\n\nMr. Speaker, I also had the honor of first meeting Aarit at Jackson  Memorial Middle School when he served as the Speaker of the Little  Congress. Aarit is a shining example of why Ohio's 13th Congressional  District is known as the birthplace of champions.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Mr. MRVAN. Mr. Speaker, recently I was privileged to join members of  the United Steelworkers Local 1010 in Hammond, Indiana, to commemorate  Workers Memorial Day.\n\nDuring the proceedings, I shared how when the steel and manufacturing  industries of northwest Indiana were beginning more than a century ago,  the workers labored in…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691010/federal-workplace-protections"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Veterans who qualify for burial benefits have a choice about their  final resting place, including burial in a national cemetery. The  national cemetery in Hawaii is the National Memorial Cemetery of the  Pacific, often referred to as ``Punchbowl.''\n\nFew national cemeteries can compete with the natural beauty and calm  of the National Memorial Cemetery of the…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "I rise in strong support of Representative Dingell's H.R. 2290, the  World War II Women's Memorial Location Act.\n\nThis legislation, as we have heard, would ensure that the service and  sacrifices of millions of American women are forever honored on The  National Mall and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…BENTZ. Mr. Speaker, I rise today to recognize the Korean and  Vietnam War veterans from Oregon's Second Congressional District who,  are visiting their memorials and the WWII Memorial, because of the  efforts of the Honor Flight of Southern Oregon. Whenever I have the  opportunity to meet these heroes, I am reminded of the words of  President Abraham Lincoln:…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…their loved ones deserve more than a single day of  remembrance. They deserve a permanent place of honor. That is why I  have introduced legislation to designate the POW/MIA Memorial Museum at  Cecil Field in northeast Florida, just outside of Jacksonville, as a  national landmark.\n\nMr. Speaker, on this day, with grateful hearts, we, the people,  reaffirm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…today.\n\nRepublicans' big, beautiful bill was passed out of our Budget  Committee just under 3 months ago and is already well on its way to  being approved by this body by Memorial Day.\n\nThe legislation that committees are marking up this week and next is  going  to usher in the new golden age of America by prioritizing a  revolutionary, conservative…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…missionaries, broadcasting the Gospel, and transforming  lives.\n\nMay God continue to bless First Baptist Church of Roanoke for  generations to come.                                 Memorial Day\n\nMr. CLINE. Mr. Speaker, on this Memorial Day, we do more than  remember. We honor the men and women who gave everything for this  Nation. We remember the fallen, those…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…following officers or those       serving in an acting capacity:\n\n``(aa) The Under Secretary for Benefits, the Under       Secretary for Health, or the Under Secretary for Memorial       Affairs.\n\n``(bb) The Assistant Secretary for Human Resources and       Administration.\n\n``(cc) The Director of the Office of Management or the       Chief Financial…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…up every day to step on that thin  blue line to defend and protect us.\n\nIn 1962, President John F. Kennedy signed a proclamation which  designated May 15 as Peace Officer Memorial Day, and the week in which  that date falls as Police Week.\n\nYesterday, my staff and I got the opportunity to welcome police  officers from New Braunfels, Texas, and hear…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Sheriff's deputies in  one moment: Deputy Ralph ``Butch'' Waller, Deputy Ignacio ``Dan'' Diaz,  and Deputy Luis Paez. They were three motorcycle officers, all killed.\n\nAt their memorial service to honor them, President Trump, myself, and  a few of our friends, Eric and Dan, we were having a conversation that  there is no medal which is awarded posthumously…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…been requested to announce at other big events  at Springstead, such as senior nights, their annual cheer competition  and during the final matches of the historic Corey Hill Memorial  Wrestling Tournament. As an Athletic Director, Coach Kupcik shares that  having a consistent announcer locked in is always a plus. It's one less  thing to worry about. But…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…to honor and recognize the 35th  anniversary of the Gulf War and liberation of Kuwait.\n\nEach year, a ceremony to commemorate this anniversary is held at the  Arizona Heroes Memorial in Oro Valley.\n\nWhile I cannot join in person this year, I would like to take this  time to honor those who served in our armed forces in the Gulf War and  fought to bring…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700137/recognizing-the-35th-anniversary-of-the-gulf-war-and-liberation-of-kuwait"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker's rostrum on  the House Floor. Two hundred years ago, Daniel Webster addressed a few  hundred Revolutionary War veterans and spectators at the Battle of  Bunker Hill was memorial groundbreaking. In his oration, he said, ``Let  us develop the resources of our land, call forth its powers, build up  its institutions, promote all its great interests, and…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with honor and  distinction. They not only served with valor but also took it upon  themselves to ensure their sacrifice would never be forgotten.\n\nThe Vietnam Veterans War Memorial in Washington, D.C., was built  entirely through private donations, a testament to their dedication to  one another and to the 2.7 million servicemembers who served in  Vietnam.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689330/national-vietnam-war-veterans-day"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Chinese       Communist Party is also subjecting them to forced       sterilization. The CCP's persecution of the Uyghurs has grown       so severe that the U.S. Holocaust Memorial Museum has       recently announced that ``there are reasonable grounds to       believe that China is responsible for crimes against       humanity.''\n\nAccording to the report:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…served as managing partner until  2008.\n\nToday, I am pleased to join the Borough of Mountainside in honoring  John Post as he serves as a Co-Grand Marshal of the Mountainside  Memorial Day Parade. His life is a testament to the core principles  that define our Nation: service, commitment, and integrity.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691600/recognizing-john-post"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…realized that we are going to hear  that over the next hour.\n\nThe thing that my team and I were reflecting on earlier today, and  all I wanted to share as we kick off this memorial to an amazing man,  was that, as vice chair, I get to, every week, host an evening of floor  time for my colleagues on a myriad of topics. Doug LaMalfa was here  every single…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Capitol following his       time as a member of the congressional press galleries;\n\n[Whereas Douglass delivered the keynote speech at the       unveiling of the Emancipation Memorial in Washington's       Lincoln Park;\n\n[Whereas, in 2007, Douglass was recognized by placing a       plaque and painting of him in his honor in the House Press       Gallery;…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}]