[{"senator": "Judy Chu", "party": "Democrat", "sentence": "…experiencing symptoms consistent with a pregnancy complication.\n\nIn another documented case, a patient was falsely told that abortion  would cause infertility and severe mental illness, information that  directly contradicted established medical evidence.\n\nSeveral patients reported being reassured that severe pain or  bleeding was normal, only to later…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…health crises.  These moments can be unpredictable, even volatile, for all those  involved.\n\nThe reality is that 1 in 10 police calls involve a person struggling  with mental illness. Too often these encounters end in unnecessary  harm.\n\nOur bill will provide much-needed Federal support to train officers  in crisis response techniques. It will advance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689347/help-our-country-become-a-safer-healthier-place-for-all"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…impacts are real. For instance, a 29-year-old woman was diagnosed  with HIV during her pregnancy. She is a mom of two young kids, 7 and 1  years old. She has struggled with mental illness, depression, and  cognitive delay. Because she lacks daily adherence support for her  lifesaving Valley fever medication, she has been hospitalized three  times due to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…worried their daughters and granddaughters  will lose their Medicaid coverage for mental health care and treatment.  God bless every American family that has a child with mental illness or  a relative with mental illness. You are saints caring for them.\n\nA wife called worried her husband going through chemo for cancer  treatment would lose his Medicaid…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the budget bill that  they passed a couple of weeks ago affect only the able-bodied, that it  doesn't affect people with substance use disorders or those struggling  with mental illness because they are exempt from the work requirements  or the paperwork, if you will, that is in this bill, which CBO says is  going to result in 16 million people losing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…leadership and advocacy for accessible mental  health services in Minnesota.\n\nDuring her 24 years of service as the executive director for the  National Alliance on Mental Health Illness Minnesota, she helped pass  over two dozen landmark laws that reshaped education, healthcare,  housing, and criminal justice to better serve people living with mental…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…big  investment in the kind of services that can help interrupt violence.\n\nA lot of my Republican friends said: You know, we don't believe it is  the guns. We think it is mental illness.\n\nWell, I don't agree, but this is how you put together a compromise.  So we passed the Bipartisan Safer Communities Act, which included a  landmark $14 billion investment,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I rise today to highlight the growing  mental health care crisis in rural America.\n\nNearly one in five adults live with a mental illness, yet rural  communities lack the providers, facilities, and resources to meet their  needs. In my own district, an entire county has only one child and  adolescent psychiatrist.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696908/rural-mental-healthcare"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…behavioral health crisis,  and giving our healthcare professionals the resources they truly need  to adequately recognize and address the challenges those who live with  mental illness must grapple with each and every day.\n\nIt also means ensuring that parity is fully enforced.\n\nAt the Federal level, the Paul Wellstone and Pete Domenici Mental  Health…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, today, I rise to talk about an issue that  touches every community in this country, mental health.\n\nMore than one in five adults in the United States lives with a mental  illness. These are our friends, neighbors, coworkers, and family  members. For many of us, the issue is deeply personal.\n\nWhether one lives in a big city or a small town, almost…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…he has shown a skill and achievement in dealing with  real-world congregational problems: substance abuse issues, conflict  resolution, homelessness, HIV and AIDS, and mental illness.\n\nComplementing his pastoral service, he serves as director of housing  operations for the Westchester County Department of Social Services. He  has been recognized with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…with disabilities and mental  illnesses.\n\nFor the past 24 years, Ms. Abderholden has served as Executive  Director of the Minnesota chapter of the National Alliance on Mental  Illness.\n\nUnder her leadership, our state has become more compassionate, more  informed, and more responsive to the needs of those facing mental  health challenges.\n\nShe played…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…It is underlined multiple times.\n\nHere is another scrap of paper on which somebody writes their heart  out:\n\nDear Senator Booker, when I got out of the Navy, I had       mental illness. I needed psychiatric medicine to stop going       in and out of the hospital. Because of Medicaid, I have       medicine that has kept me out of the hospital for 18 years.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Administrator to an       Assistant Secretary of Mental Health and Substance Use,       directly reporting to the Secretary. Within another agency,       SAMHSA--and a focus on mental illness and addiction--will not       have the same direct impact on HHS proposals and will not be       elevated as a resource and partner for other components of       HHS. SAMHSA…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Health Service Administration's State and Tribal Opioid Response  Grants can be used for test strips, and requires that Administration to  identify and address serious mental illness.\n\nThis bill is part of President Trump's and the Congressional  Republicans' promise to stop the flow of fentanyl by securing our  borders and then combat the crisis caused…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…important,  the ability to deliver modern mental health care in a space designed  for healing and recovery.\n\nIn Alaska, we face real challenges. People dealing with serious  mental illness are being served in locations that  were not designed for clinical care. That is unacceptable. They deserve  better--safe, dignified, purpose-built treatment environments…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…suffer. Americans get hurt, and the American Dream dies.\n\nThe suspect that I talked about with the brutal stabbing in North  Carolina was 34 years old with a history of mental illness and a long  rap sheet: multiple convictions for armed robbery, felony larceny,  breaking and entering; more than 5 years in prison; and 14 criminal  cases.\n\nHis own family…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…castration is healthcare and there  is nothing more dehumanizing than going after the trannies out there.\n\nOne recently shot two young schoolchildren in Minnesota. It is a  mental illness, and it needs to stop. We can stop it in our military  right now.\n\nIn last year's NDAA, we took the important step of banning TRICARE  from covering medical interventions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]