[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…people. Protect families and  reject this shameful budget resolution. In the words of a righteous  faith leader whose place of worship Donald Trump recently attended:  Have mercy.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…ago, is the result of an  illegal Israeli settler beating a 55-year-old woman who was harvesting  olives on her family's ancestral lands, beating her with that club  without mercy, without restraint. Her name is Afaf Abu Alia. She is a  mother, and she is a victim of violence. This just happened days ago.\n\nBy the way, October marks the start of the olive…", "date": "2025-10-23", "source_url": "https://justfacts.votesmart.org/public-statement/1696395/gaza-cease-fire"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…communities with food assistance, refugee  resettlement, youth mentorship, and much more. They open their doors  not only to worship but to serve as an example of compassion and mercy  that is inseparable from their Muslim faith.\n\nMuslim Virginians also add to the cultural richness of our  Commonwealth through art, music, literature, and food. They bring…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…food and health insurance and  electricity. All the stuff you need, he is creating a shortage of. Why?  Because when there are shortages, people have to petition the King for  mercy, and that is what is going on right now.\n\nIf you are close to him, if you can get dinner with him at Mar-a- Lago, you can get relief. There is enough money in the system for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to the ministry in 1988, was active in churches in New Jersey and New  York, and is now approaching his fourth decade.\n\nHe holds master's degrees from Fordham University and Mercy  University, and he has shown a skill and achievement in dealing with  real-world congregational problems: substance abuse issues, conflict  resolution, homelessness, HIV and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…president exercises the authority to grant clemency for D.C.  crimes, though presidents rarely do so. D.C. residents deserve a say in  whether their fellow residents deserve mercy. In the 117th Congress,  the House Committee on Oversight and Reform passed this bill as part of  the District of Columbia Home Rule Expansion Act of 2022 (H.R. 8861).\n\nWhile…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696036/introduction-of-the-district-of-columbia-clemency-home-rule-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…utility bills, we need to get back on track with the  transition to clean energy.\n\nIt is cheaper. It is safer. It is generated entirely here at home  instead of being at the mercy of global price shocks like oil and gas  just inherently are. Instead, this legislation would make us more  reliant on fossil fuels and more entangled with the price effects…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…After World War II, the United States decided that the St. Louis was  a valuable lesson. We started leading the nations of the world in  accepting refugees. It was an act of mercy, a humanitarian response to  the reality that these people were facing. And we were proudly leading  that effort for decades, until very recently.\n\nUnder this President, the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of bipartisan efforts here in this U.S.  Congress. I am talking about the World Food Programme, about UNICEF,  about the Integrated Food Security Phase Classification, about Mercy  Corps, about Doctors Without Borders. All of these organizations have  documented the devastating starvation. So this is not a question of  whether there is starvation or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Center of the Sisters of       the Good Shepherd; Nuns Against Gun Violence; Safe Havens       Interfaith Partnership Against Domestic Violence and Elder       Abused; Sisters of Mercy of the Americas Justice Team; Ujima:       The National Center on Violence Against Women in the Black       Community; United Church of Christ.\n\nMr. THOMPSON of California.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Center of the Sisters of       the Good Shepherd; Nuns Against Gun Violence; Safe Havens       Interfaith Partnership Against Domestic Violence and Elder       Abuse; Sisters of Mercy of the Americas Justice Team; Ujima:       The National Center on Violence Against Women in the Black       Community; United Church of Christ.\n\nMrs. McBATH. Mr. Speaker, Democrats…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…pain;      it was God stepping into it,      bearing the weight, wearing the stain.      Good looked like a manger,      not a throne dressed in gold.      Good looked like mercy      when the world had grown cold.      Good had dirt on His hands,      tears in His eyes,      a cross on His shoulders,      Love choosing sacrifice.      He is good not…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…must not forget  the people behind these budgetary numbers. As such, I will highlight  one Massachusetts family today. I will be reading a poem entitled,  ``The Mathematics of Mercy.'' It was written by Betsy Johnson. Betsy is  an autism educator with the ARC of Massachusetts and a mother of two  young adult children with autism and other intellectual…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…my community include ones like Dulles South Food Pantry,  Haymarket Regional Food Pantry, Mobile Hope, Northern Virginia Food  Rescue, Creating Foundations for Hope, House of Mercy Food Pantry, and,  of course, Loudoun Hunger Relief. They did so much: fresh produce,  sweet treats, pantry essentials, and even Thanksgiving meals coming up  next week.\n\nSome…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696984/recognizing-food-pantries"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Columbia. These bills would severely erode DC's already       limited control over its criminal justice system and leave       individuals and organizations in DC at the mercy of this       administration as they continue implementing an authoritarian       agenda. These bills would roll back evidence-based criminal       justice reforms passed by…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…region. The hard work and spirit shown by staff have  improved the health and quality of life for countless patients.\n\nFounded in 1950, Mercer Health, known then as Our Lady of Mercy  Hospital, was established to provide care to the citizens in Coldwater,  Ohio and surrounding area. Seeing a need for a hospital, concerned  citizens banded together to open…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…life  of meaning and service. She graduated from Woodrow Wilson High School  and went on to become a registered nurse, earning degrees from  Philadelphia University and Gwynedd Mercy University. But while her  education equipped her with knowledge, it was her heart that made her a  healer.\n\nFor 56 years, Diane has been the devoted wife of Ronald ``Ron''…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…including and most especially Bud Lomell,  ``had faith that what they were doing was right, faith that they fought  for all humanity, faith that a just God would grant them mercy on this  beachhead or on the next.'' They were ``the men who took the cliffs.''  They were ``the champions who helped free a continent.'' They were  ``the heroes who helped…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Madam Speaker, as a mercy to the poor staff here, I  am not going to use the whole half an hour. I am just going to try to  run through a couple of concepts.\n\nI did a little tripping up of some details…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Committee on Ways and Means. It is an important policy reform that will  reinforce fair treatment of taxpayers at the IRS.\n\nMr. Speaker, American taxpayers should not be at the mercy of rogue  IRS agents who are handing out fines without reasonable due process. At  the very least, agents ought to have actual prior approval before  issuing a penalty and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…only until  10:00. The bad news is I am going to use every second of it. Let's race  through this because originally, I think I was going to go almost an  hour. Maybe this is mercy.\n\nI want to walk through just a couple of concepts here. One, we are  going to talk about one of my intense frustrations. I have talked about  this for a decade or more. Please,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…been the pastor for many, many years. John committed his life to Christ  in his childhood and ultimately decided to pursue a career in the  ministry.\n\nHe is a proud graduate of Mercy University and Southwestern Baptist  Theological Seminary, where he earned his master of divinity degree and  his doctor of ministry.\n\nHis leadership has extended beyond the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691358/welcoming-dr-john-cross"}]