[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…commerce cannot come at the expense of the environment.\n\nThis bill includes provisions that begin addressing the mariner  shortage by updating mariner requirements, updating the merchant  mariner credentialing exam, and expanding the pool of eligible  mariners.\n\nFinally and importantly, the bill includes numerous provisions to  address sexual assault and sexual…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…prevent these crimes,  protect victims, and hold perpetrators accountable.\n\nMoreover, I am proud that this bill includes several provisions that  I sponsored regarding U.S. merchant mariners. This bill tackles long  outdated methods for processing mariner credentials by investing in and  revamping the Coast Guard's process.\n\nThis bill also improves merchant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today to join my colleague Congressman  Jim Moylan of Guam, in highlighting the urgent need to modernize U.S.  maritime policy through our Merchant Marine Allies Partnership Act,  which we have introduced to realign federal incentives in our domestic  shipping industry away from adversaries, such as the People's Republic…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Ranking Member Larsen, and  also Coast Guard and Maritime Transportation Subcommittee Chair Ezell,  who cosponsored this important legislation.\n\nMy bill strengthens the American merchant marine by guaranteeing that  100 percent of U.S. cargo generated by the Department of Transportation  will be transported on U.S.-flagged ships. It is that simple.\n\nThis bill…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…retire.\n\nIn line with President Trump's efforts to rebuild America's maritime  capacity, this bill strengthens America's maritime base, including  provisions that streamline the merchant mariner credentialing process  and laying the groundwork for the responsible deployment of new  technologies at sea.\n\nThrough this legislation, the United States Coast Guard…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Station St.                Thomas. Sec. 283. Report on East Rockaway inlet navigation.                     TITLE III--SHIPPING AND NAVIGATION                  Subtitle A--Merchant Mariner Credentials  Sec. 301. Merchant mariner credentialing. Sec. 302. Nonoperating individual.                         Subtitle B--Vessel Safety  Sec. 311. Grossly negligent…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate Bryony Shipe of Ford City, Pennsylvania. Bryony  recently accepted a fully qualified appointment to the U.S. Merchant  Marine Academy in Kings Point, New York.\n\nShe is the daughter of Amanda and Lucas Shipe and the granddaughter  of Kathie and Dave Olinger, as well as Patty and Larry Shipe.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate my constituent,  Jack Gray, upon his acceptance to the United States Merchant Marine  Academy.\n\nAs a future midshipman, he will be joining the ranks of the world's  most elite naval force, guided by the motto: ``Acta Non Verba''\n\nThe service and sacrifice…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692770/congratulating-jack-gray"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…prominently in the name or such       person or its affiliated company.'' While this exclusion       seems to cover transactions between consumers and merchants       using a merchant's own payment software, the proposal later       states the exemption for merchants would not apply, ``if a       merchant or online marketplace's digital consumer application…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the wake of the attack on Pearl Harbor, while most teenagers were  still in high school, Dick Burbine chose service. At just 16 years old,  he enlisted in the United States Merchant Marine, trained at Gallops  Island in Boston Harbor, and soon found himself at sea, supporting  Allied operations in both the Atlantic and Pacific theaters.\n\nOne of the most…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…to the  United States Military Academy, six midshipmen to the United States  Naval Academy, eight cadets to the U.S. Air Force Academy, one  midshipman to the United States Merchant Marine Academy, one candidate  to the United States Military Academy Civil Preparatory School, three  candidates to the Naval Academy Preparatory School, one candidate to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…globe. By  modern standards, sea piracy may seem like an age-old problem, but the  reality is it is very brutal. Sea piracy is a violent crime that  endangers the lives of merchant sailors, disrupts global trade, and can  cause massive economic losses.\n\nAmerica has long stood strong against sea piracy. However, in recent  years, piracy has been on the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…efforts to boost recruiting and retention  while supporting President Trump's vision to strengthen the domestic  maritime base and boost the pool of qualified United States merchant  mariners who can mobilize during times of crisis to operate sealift  assets.\n\nThe legislation also gives the service an important voice by  establishing a Coast Guard service…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…people do that, but in the rural area I represent, they are still used  frequently particularly by my senior citizens. Mr. Speaker, if you use  a draft or a check to pay a merchant for something and that check comes  back from the bank marked insufficient funds, then under Virginia law,  you have created a presumption that the individual is attempting…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…alongside his three brothers: Frank,  who fought in the Pacific with the Army; John, who took part in the  invasion of Northern France; and Augie, who manned guns on a Navy  merchant ship in the Pacific. Their shared service reflects the  extraordinary sense of duty and sacrifice that defined their  generation.\n\nAfter the war, which he served through 1945,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Associated Press; Mehta, Aaron:       Breaking Defense; Meiritz, Annett: Handelsblatt; Mejia,       Jairo: EFE News Services; Melgar, Luis: Washington Post.\n\nMencia, Alexa: Axios; Merchant, Nomaan: Associated Press;       Merica, Daniel: Washington Post; Merino, Maydeen: Washington       Examiner; Meyer, Joshua: USA Today; Meyer, Theodoric:       Washington…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}]