[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…parks and outdoor  spaces, as the efforts of the individuals and organizations recognized  tonight reflects. These are truly selfless actions done for the benefit  of all and merit our highest praise.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District Court for the District of Columbia, the Mayor and       Council of the District of Columbia, and the D.C. Bar, the       JNC is a hallmark of bipartisan commitment to merit-based       judicial selection, and has produced one of the nation's most       well-respected local court systems.\n\nThe JNC's mission is straightforward: to recommend to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Metropolitan  Chiefs presented him with the prestigious Russell E. Sanders Lifetime  Achievement Award, and the Federation of European Fire Officers honored  him with the Cross of Merit award. In 2022, he was named Colorado State  Fire Chief of the Year for his outstanding service. Chief Lombardi's  career has an incredible legacy in our state.\n\nOn behalf…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694720/recognizing-chief-don-lombardi"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…his voice,       something that will bring any mother to her knees. He felt as       though a piece of his soul was destroyed. He immediately       filed an appeal with the Merit Systems Protection Board. Four       months later, he has heard nothing.\n\nFor these four months, my once cheerful, talkative son has       become withdrawn, sad and       rightfully…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Israelis have done merits the killing of Palestinian babies to the  extent that they have been killed.\n\nPalestinian babies, Palestinians cannot have done anything that would  merit Israelis killing their babies to the same extent that they have.  Israelis have to understand that Palestinian babies have lives that  have to be respected to the same extent…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…replace many of these jobs with loyalists, even  setting up loyalty tests. They are driving a brain drain in our Federal  Government by choosing loyalty to the President over merit and  competence, creating less efficiency and more waste, fraud, and abuse,  and opportunities for corruption.\n\nEssentially, we have to stop this. Make no mistake, I will fight…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…patriotism and dedication to  our Nation. Mr. Reza was selected as this year's Boots on the Ground  Alliance's Veteran of the Year, an honor his life and service  absolutely merit.\n\nBorn and raised in Whittier, Mauro was inspired by his uncle, a  Korean War veteran, to continue his family's proud tradition of  military service. Answering the call of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Senate. That is called regular order.\n\nThey were signed by the President and awarded--first of all, they  were vetted inside these departments and awarded, then, based on merit  back in March of 2024. In essence, they were legal, following standard  procedure, and were regulated by Federal agencies with receivables  awarded and contracts signed.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…unconscionable when families are still grieving, and the  airspace congestion has not improved.\n\nI also remain concerned by the Trump administration's actions to  weaken the merit-based civil service across the Federal Government,  including at the Department of Defense. One such action was a recently  issued executive order that misuses national security…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…promote the progress of science; to advance the national health,  prosperity, and welfare; and to secure the national defense.\n\nUnderpinning this has been its commitment to a merit-based and peer- reviewed grant process that has ensured that good science is  consistently prioritized and free from political interference.\n\nThe NSF has had an exemplary 75…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…rhetoric. They were  dismantling policies designed to correct historical inequities and  promote a more just and inclusive society.\n\nThese efforts, cloaked in the language of ``merit'' and ``individual  responsibility,'' are, in fact, a thinly veiled attempt to perpetuate a  system that continues to privilege a select few while marginalizing the  very communities…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…constitutional authority to admit the Commonwealth into       the Union. Apart from the fact that the legal objections to       admission of the Commonwealth as a State are without merit,       it is also unlikely that the courts will ever consider those       objections. As Mr. Dinh has observed, the decision whether to       admit a state into the Union is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Civilian of the Year Award, the De  Fleury Medal for engineering excellence, the Department of Army  Civilian Award for Humanitarian Service, a Presidential Certificate of  Merit for lifesaving while on official duty, the Department of Defense  Environmental Engineer of the Year Award, and the State of New Jersey's  highest Heroism Award. He has recently…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Sewickley Valley community's history and  heritage.\n\nMrs. Cole passed away in 2016 at the age of 92, leaving behind a  family and community proud of her contributions. I think those merit  recognition, and what better way to memorialize Mrs. Cole and her work  than by putting her name on the post office in the community she loved  and chronicled. That history…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…constitutional authority to admit the Commonwealth into       the Union. Apart from the fact that the legal objections to       admission of the Commonwealth as a State are without merit,       it is also unlikely that the courts will ever consider those       objections. As Mr. Dinh has observed, the decision whether to       admit a state into the Union is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…from our main goal, which, of course, is winning and fighting our  Nation's wars and, even better, deterring, so we don't have to fight  them in the first place.\n\nDEI is gone. Merit is back. Standards are high. Our servicemen and - women will, once again, be the most highly trained, ready fighting  force the world has ever known.\n\nIn the last year, recruitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695131/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Wilmington, Ohio, and  has earned the Eagle Scout Award, the highest possible achievement in  the Boy Scout community.\n\nTo earn an Eagle Scout Award, Carter had to obtain 21 merit badges  showcasing the skills he learned as a Scout and his commitment to the  community. Thanks to the invaluable lessons taught to Scouts, Carter  has become an expert in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for supporting law enforcement, for  improving military recruitment, for protecting free speech, for having  our workers actually show up to work, for hiring people based on merit,  for opening new power plants, for living in peace, for the signing of  the Abraham Accords, and for returning manufacturing to America.\n\nNot a single person stood. That is…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "John Carter", "party": "Republican", "sentence": "…officers from over ten  nations, including Russia, Turkey, and Norway.\n\nCOL Patterson's distinguished military service earned him numerous  accolades, including the Legion of Merit with oak leaf cluster, the  Army Commendation Medal with oak leaf cluster, and the Meritorious  Service Medal with four oak leaf clusters. He is also a recipient of  the prestigious…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in private markets.\n\nWealth alone should not be the sole determinant as to who can invest  in these markets. My friend from Nebraska, Representative Flood's bill,  provides a merit-based alternative by the establishment of an exam that  allows individuals to qualify as accredited investors by demonstrating  their understanding of investments and private…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…look forward to seeing further successes in  his future.\n\nGarrett has many accomplishments in his time of service, including  being awarded the Purple Heart Medal, Legion of Merit, Bronze Star  Medal and many more. But it's clear his most beautiful life  accomplishments have been marrying his wife, Lorna, and becoming a dad  to Tucker.\n\nI hope Garrett…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "John Carter", "party": "Republican", "sentence": "…served her last  assignment at Fort Cavazos. Her extraordinary service has been  recognized with more than 20 military medals, awards, and  commendations, including the Legion of Merit and Bronze Star.\n\nCSM Wilson's service on and off duty reflects the true meaning of  ``Soldier for Life''. After retirement, she worked as an elementary  school teacher in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689348/saluting-the-service-of-command-sergeant-major-angela-wilson"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Desert Storm and the global war on  terrorism. Over his 36 years of service, he has earned numerous awards,  including the Army's Distinguished Service Medal, the Legion of Merit,  and the Combat Infantryman Badge. He is also a Ranger-qualified  soldier, holding the prestigious Ranger Tab.\n\nGeneral Rasch's leadership and mentorship will be missed by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, as chairman of the House Merit Caucus, I am  proud to recognize a Utah educator who embodies excellence, Ms. Lacey  Anderson.\n\nLacey is a special education teacher who refused to accept low  expectations…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691347/recognizing-lacey-anderson"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…firing such employees, above and beyond steps required in law and  regulation.\n\nFor example, unions can bring removals before private arbitrators  instead of appealing to the Merit Systems Protection Board.\n\nThe Trump administration is exercising its electoral mandate to  address this problem.\n\nFor instance, the President has embarked on an ambitious…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…graduation rate of 95.2 percent.\n\nMiami-Dade also received the prestigious 2024 Cognia School/Systems  of Distinction award, and the district earned 59 Magnet Schools of  Excellence Merit awards, and 32 Magnet Schools of Distinction awards.\n\nMiami-Dade County Public Schools continue to lead the Nation with a  total of 51 National Academy Foundation distinguished…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…engagement, performance, and productivity;\n\n``(iv) fostering a work environment characterized by       fairness, respect, equal opportunity, and attention paid to       the merit of the work of employees;\n\n``(v) effectively managing employees with unacceptable       performance, including training to understand the       disciplinary options and procedures…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…We are honoring  promises, Mr. Speaker.\n\nFinally, we have brought transparency and common sense back to our  institutions, dismantling DEI mandates, and restoring fairness, merit,  and basic common sense. We have begun to make America healthy again by  examining finally what is in our food supply, empowering patients,  expanding health savings accounts,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…establishment of a memorandum of understanding,       or other appropriate interagency agreement. Such memorandum       or agreement shall require the use of a competitive, merit-      reviewed process, which considers applications from Federal       agencies, National Laboratories, institutions of higher       education, nonprofit institutions, and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…(5) The number of alleged violations for which the       Committee staff conducted a preliminary inquiry and the       Committee dismissed the matter for lack of substantial merit       or because it was inadvertent, technical or otherwise of a de       minimis nature: 18.\n\n(6) The number of alleged violations for which the       Committee staff conducted…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}]