[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…bad faith, but in reality, there was no  departure--absolutely no departure--from established Department of  Justice and judicial practice.\n\nI am not opposed to debating the merits of this matter and  determining whether there needs to be forward-looking changes. In fact,  I would support some of those forward-looking changes. But that is not  what is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…historian.\n\nIt's all part of a larger state goal: to ensure that the       burning of the Gaspee is never forgotten again. Historians       who have studied the event said that it merits more mention,       particularly in textbooks.\n\n``The thing about the Gaspee that is important was that the       king took notice,'' said Abbass, who has written about other…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…across the aisle are throwing  this number around, this 94 years, even though it has nothing to do  with the final rule. They are not interested in a good-faith debate on  the merits of these standards. If they were, as I said, we would have  had hearings on this resolution so Members could better understand the  details.\n\nThe truth is that the actual payback…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…amendment to the Clean Air Act to change the law  and end the waiver process. No one has proposed this because it would  require hearings and markups and convincing people of the merits of  upending more than 50 years of Clean Air Act precedent, which has been  the most successful public health law in history.\n\nInstead, we are here today debating a shortcut,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690480/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…when war is on the  line.\n\nI share my colleague Senator Kaine's concerns in having read the  opinion of the Office of Legal Counsel. Regardless of what people view  of the merits of that opinion, what we are talking about here is a  wholly other matter. What we are talking about here is potential war  with Venezuela. What we are talking about here is…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Constitution.\n\nIt is absolutely wrong that any U.S. Senator, for attempting to ask a  question, be treated in this fashion.\n\nI double down on the call of Leader Schumer. This merits a full  bipartisan investigation--bipartisan because all of us are Members of  the legislative branch. All of us have taken an oath to the  Constitution, and all of us should…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…favorite hunting spots, their favorite hiking trails and biking routes,  ATV trails, and fishing streams are in these protected roadless areas.\n\nWhen the Nation debated the merits of the roadless rule 24 years ago,  the Forest Service held 600 public meetings around the country. These  were attended by tens of thousands of Americans. I should know, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…JAYAPAL. During markup and at the Committee on Rules, I submitted  an amendment to ensure that immigration judges have the discretion to  decide if a DUI conviction actually merits deportation for green card  holders and others here lawfully.\n\nIt would have allowed judges to merely consider mitigating factors,  such as if anyone was harmed or the length…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…narrow, targeted, and respects Tribal  sovereignty.\n\nAfter reviewing the President's statement regarding his veto, it is  very clear that this decision was not limited to the merits of the bill  or to any particular policy. Instead, his statement criticizes the  Tribe for actions taken to protect the Everglades, their homelands,  from environmental risks.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…of precedent known as the Chevron  deference, which required courts to defer to reasonable agency  interpretations of ambiguous statutes.\n\nWhile we may not all agree on the merits of this decision, there is  bipartisan consensus that unless we want the courts deciding every  single open policy question, then we, Congress, have to draft laws that  are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…will  be back here on the floor debating a veto for a project in Arkansas or  in Texas or in Ohio.\n\nThe House has an opportunity, in my view, to do the right thing on  the merits and to support this important legislation that Ms. Boebert  has introduced and that she has fought for with our colleagues in the  Senate, Senator Bennet and Senator Hickenlooper.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…who has taken a very bold  stand. This is a colleague who has engaged in a form of protestation  that will not always be received initially with the kind of respect  that it merits.\n\nYet, as I have said before, dear friends, when you engage in  protestation, when you protest and you ``get in the way,'' as the  Honorable John Lewis put it--when you protest…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…now  threatening Members of the judiciary, threatening Members of the House  of Representatives, and threatening Members of the Senate.\n\nDonald John Trump, by his conduct, merits impeachment, trial, and  conviction in the Senate of the United States of America and should  never hold any office of public trust ever again.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697871/and-still-i-rise"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…for a  company, they look at it, they look at all the divisions, they figure  out their direction. They maybe cut a division; they maybe make changes  to it. They look at the merits of certain employees; they move some  employees to different divisions. And they figure out, thoughtfully,  what is the right way and what is the best way for their company.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…American public will  have the final word and will be the final judge.\n\nI am honored to tell you who the players are in this coverup. One  person is, quite frankly, a person who merits a lot of accolades. He is  a person who ought to be acknowledged for the courage that he has  demonstrated. He is a person who brought this to the attention of the  public.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…due to illness, natural disaster, or being given  incorrect information, the court often has no ability to offer relief  to that taxpayer. Cases can be dismissed before the merits are even  heard, putting taxpayers at risk for losing their claim when they are  not at fault for missing the deadline. That is not a just result. This  bill ensures the court…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…The American people understand that there will be opposition to a lot  of pieces of legislation, but they also, justifiably, expect us to  consider and pass bills on their merits. As to this category of bills  that are important to some, unknown to most, and controversial to no  one, well, they expect us to get those passed in a timely fashion.\n\nI am…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…is so tied to trade through the  movement of precursor chemicals, the President has utilized trade  policy to spur progress.\n\nWhile today's resolution is meant to debate the merits of the  emergency created by the flow of fentanyl, our colleagues on the other  side of the aisle will use this as a venue to debate trade policy. I  have been watching.\n\nI…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…law.\n\nSkipping that process allows a bill to jump ahead of others that have  followed the rules and respected the committee system.\n\nSo my objection today is not based on the merits of the underlying  policy. It is based on the process. But the process is important to  getting the policy right. That is why we don't skip it. That is why, in  the absence…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…direct investment by companies or other       entities owned, directed, supported, or influenced by the       Chinese Communist Party is a threat to U.S. security and       merits an aggressive policy framework to protect U.S.       interests, jobs, intellectual property, and security.       SEC. 3. FOREIGN DIRECT INVESTMENT REVIEW.\n\n(a) Review.--The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…regulatory codes. For context, there are an  estimated 300,000 Federal regulations that carry criminal offenses that  could put an American citizen in prison.\n\nWe can debate the merits, and we would debate the merits no doubt  among the Members of this body, of any particular statute that  criminalizes a certain act or any particular regulation that comes…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…laws across the country. What  my Democratic friends want to do, Mr. Speaker, is allow noncitizens to  vote across the country.\n\nThe arguments that are being made fail on the merits when you  recognize that, in fact, the law, Mr. Speaker, today, allows  noncitizens who simply resided in the Nation's Capital for 30 days to  be eligible to vote. Again, individuals…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…while bringing  in about $4.7 trillion. That is $2 trillion more being spent than what  is coming in. A deficit of this magnitude should be concerning enough  even on its own merits. But to add insult to injury, Congress passed a  budget just 5 months ago which set a spending cap of almost $6 trillion  for the year. So 5 months ago, Congress did actually…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…selflessly and courageously dedicate their  lives to keeping America safe and sound. They uphold our public safety  and devote themselves to the pursuit of justice. Their devotion merits  our admiration, and we are deeply indebted to them.\n\nWe especially honor the fallen heroes who made the ultimate sacrifice  in the line of duty. This year, we are honoring…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…appropriately in  doing so. That is his right, and that is his prerogative as a Member of  Congress, as it is for any citizen.\n\nThis resolution does not have anything to do with the merits of his  view. This resolution simply states that one should not use violence in  order to advance that view. I would hope that this should be a  principle we should be able…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…that we must break.\n\nThe habit involves raising an objection. One of the things you did  not hear from my friend and colleague from Oregon is a single  objection, not on the merits, not on any legitimate procedural ground  to any of the bills that I just mentioned--not a single one. No, these  bills are drawing an objection today, not allowed to pass…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…140 federally  recognized Tribes from across the country that have stated the  integrity of this process must be preserved, and I agree. Recognition  should be earned on the merits, not granted through politics.\n\nMr. Speaker, I urge my colleagues to oppose this provision and uphold  the process put in place by Congress decades ago to ensure fairness and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "John Thune", "party": "Republican", "sentence": "…already returned to their bases  in the United States or on U.S. Navy ships in international waters. But  with President Trump, Democrats are incapable of deciding on the  merits. They reflexively oppose anything he does or says, even when it  contradicts or is in tension with their own prior opinions.\n\nWhatever the outcome of this process, I trust…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]