[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Across  the way, Saudis, not exactly the best friends of climate solutions.\n\nSo that was the environment that I went down to, and what I wanted to  do was convey four messages.\n\nMessage one was: Donald Trump on climate does not represent the  United States of America. He just doesn't. He represents the big donors  who gathered at Mar-a-Lago, whom he asked…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…households and  neighborhoods around a central community center. The site actually  played a decisive role during World War II in intercepting enemy  communications, including the message that helped pave the way for the  D-Day invasion of Normandy.\n\nIt is fitting that a place that helped secure freedom will now serve  those who fought to preserve it. The center…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…readiness, was the  real barrier. You see, they were Black, for anyone who might not know  that, and by flying with one of them as her pilot, Roosevelt sent an  unmistakable message that standing with Black servicemembers was an act  of patriotism and putting country over hate.\n\nThat leads me to someone who lived much of her life until she died in  my…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…services, Bible study, Sunday  school, and external outreach to assist the needy of the community.  Pastor Trollinger and the team of ministers work tirelessly to bring a  message of love and service to all. He is the latest in a long line of  dynamic Calvary pastors who played a role in social justice efforts in  the city of White Plains and in Westchester…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697280/calvary-baptist-church"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…bipartisan, bicameral  congressional leaders and include written materials relating to the  anniversary, representations of notable legislative and institutional  milestones, and a message from this Congress to our future colleagues  in the 244th Congress. I did say last year that I hope to be there at  the opening. I am not sure that is possible, but I will…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of this that the President would say such a thing.\n\nThe Chief Justice of the Supreme Court took issue with the President.  The Chief Justice took issue with him. He sent a message indicating  that we don't impeach judges because we differ with them; we appeal.\n\nHe is defying the orders of Federal courts and the Supreme Court of  the United States of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…future. I am censured but I am not silenced.\n\nI am, at this moment, bringing to the attention of everyone the  countdown to impeachment. The countdown begins tonight with a message  that I have for my colleagues, for the press, for the public, and for  all who are interested in this topic. This message will be sent to  persons. It will be published.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…becomes meaningless.\n\nI choose to stand on the grounds laid by the Founders and Framers of  the Constitution. I stand today to announce that at the conclusion of  this 1-minute message, I will bring Articles of Impeachment to the  attention of the House of Representatives.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692849/we-are-at-the-crossroads-of-democracy-and-autocracy"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…It is horrifying, immoral, and un-American.\n\nUnlike many of my Republican colleagues, I have participated in  multiple townhalls this year to hear from my constituents. One message  that I hear consistently is that people are scared. These are good,  honest, hardworking Americans who in one way or another have been  forced to rely on Medicaid, Medicare,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…has worked closely with small business owners in  immigrant communities, I have seen the resilience and determination  they bring to our economy.\n\nThis bill sends the wrong message and sets the wrong priorities. We  should be making it easier for small businesses to access the tools  they need to thrive. That means focusing on the actual issues that…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…the Senate floor, living his 591st day  of captivity in a Hamas dungeon under Gaza.\n\nHis brother Ilay told me recently that another hostage, recently  freed, brought him a message from Evyatar that Evyatar misses most of  all playing music with his family. Instead, Evyatar has been starved  and kept in chains with a bag over his head. He and his best…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691457/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…American society lacked.\n\nIt was in the Korean war that African Americans first served shoulder  to shoulder with soldiers of all races and backgrounds for the first  time. A message resounded throughout the Nation: If people of different  races could serve as comrades in combat abroad, they could live as  neighbors at home.\n\nThe quest for racial equality…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to say to a President: If you don't behave, if you don't  cease and desist with what you are doing, then you can be removed from  office.\n\nI trust that this will become the message that the President will  receive. However, knowing what I know about him, I doubt that he will  receive the message as intended. I think that it will cause him to  become…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…to flee to, no mighty republic that stands if American  democracy fails.\n\nI want to commend my partner from Oregon for taking this  exceptionally important stand. This is a message, particularly for all  of America, and it is high time it be made on the Senate floor, and I  commend my colleague.\n\nMr. WYDEN. I know you have to ask permission. I just want…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I rise today because I got this message from  an Oregonian named Donna. She says: ``Please fight to protect Federal  employee retirement benefits. They should not be slashed. Federal  employees are currently putting…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691729/federal-employees"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…PERRY. The United States cannot continue to stand idly by. We  must use our authority. We must use our position as leaders in the  world to curb these practices and send a clear message to everybody  that not only will we not tolerate this assault on human dignity, on  humanity itself, but that no country, no people should.\n\nMr. Speaker, I urge a vote in…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of Alaska to purchase Alaskan LNG, and both Japan  and South Korea are deeply interested in pursuing American energy from  Alaska as well as other Pacific Rim nations.\n\nThe message we heard at each stop was universal and resounding:  Without certainty in the timeline and our permitting system, these  countries won't be able to buy our energy.\n\nMake no…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…husband as well as the father of  her children.\n\nMr. Speaker, I am inspired by Charlie Kirk and his example and the  fact that his life now transcends not only his life and his message,  but he stands for something more important now, which is freedom of  speech, a constitutional privilege that our Nation will fight  vigorously to protect.\n\nI join with my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695808/what-i-learned-from-charlie-kirk"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…leasing of federal coal,       leaving skilled workers questioning the sustainability of the       current economic environment. Passing the CRA resolution       sends a clear message to families, small businesses, and       energy partners that Montana is open for responsible       development. I urge the Senate to support S.J. Res. 61 so we       can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Budd). The Chair lays before the Senate a  communication from the Secretary of the Senate regarding a message from  the President received during the adjournment of the Senate.\n\nThe senior assistant legislative clerk read as follows:\n\nDear Mr. President: On Friday, March 28, 2025,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689336/communication-from-the-secretary-of-the-senate"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Mr. Speaker, more recently, it has been publicly reported that ads  placed by Democratic-aligned groups had to be taken down because of the  same inaccuracies. What was their message?\n\nTheir message was that Republicans voted to cut Medicaid and give tax  cuts to billionaires. That sounds exactly like what we are hearing on  the floor. It wouldn't be able…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…work on this legislation and commitment to standing with the  people of Burma.\n\nI urge my colleagues on both sides of the aisle to support this bill  and help send a clear message that the United States will not allow  international financing that empowers brutal dictatorship or tyranny in  Burma.\n\nMr. DAVIDSON. Mr. Speaker, I include in the Record…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…own people is indefensible.\n\nI commend President Trump for imposing economic pressure on those who  continue to support and sustain that regime. These measures send a  clear message: The United States will not ignore the suffering of the  Iranian people, and the exploitation of the Iranian people must end.\n\nThe newly imposed 25-percent tariffs on countries…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…weekend.\n\nDespite the AI model's serious flaws, the big tech giant said in a  statement that it is going to continue to work to make Gemma available  to their developers.\n\nAnd the message on this is clear: You need to shut it down. You need  to shut it down completely. You need to shut the Gemini system down  completely.\n\nThe American public deserves to know…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Colorado, without the influx of CCP dollars, enhancing  students' global knowledge and growing our Nation's vital national  security workforce.\n\nCongress needs to send a clear message to the CCP that we will not  allow foreign powers to erode national security, steal intellectual  property, or threaten our immigrant population.\n\nThis Congress, I have partnered…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…to be here, he was here,  but he was here whether we asked him or not. Most times, he was the  only one.\n\nYet tonight, when I asked my colleagues if they wanted to share a  message on Doug, the reverse: It is a packed house.\n\nThat is all I wanted to share, to think about the legacy that he has  left and the importance that he has to so many of our colleagues.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, I rise today in recognition of my bill, the  Safeguarding American Property Act.\n\nIn the 119th Congress, House Republicans have sent a clear message to  criminal illegal aliens: If you break our laws, you go home.\n\nEarlier this year, we passed the Laken Riley Act. My Safeguarding  American Property Act builds on the good…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689825/safeguarding-property"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…out this historic and heroic effort, House Democrats are once  again putting politics before protecting the American people.\n\nMr. Speaker, this hypocrisy is evident in the message coming from  congressional Democrats. Earlier this month, Chuck Schumer stated that  President Trump ``seems content to drag our country . . . into an  endless war with no…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…institution, and for the people who sent us here.  Checking our emotion, checking our energy, and checking our rhetoric  and prioritizing decency between each other sends the message not only  to our colleagues but to the rest of the country and the rest of the  world that we are working for the people and not against each other.\n\nWith those brief comments,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…bad habit of funding studies without ever building  the systems needed to implement the results. We cannot afford to repeat  that cycle here.\n\nThis amendment sends a clear message to the VA: Don't just study.  Prepare. Prepare to implement new therapies and newfound ways to  improve the lives of veterans now, not 5 or 10 years from now.\n\nThat means…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]