[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…with the Trump administration. In less than 1 year,  the Trump administration has demanded U.S. companies like Intel, U.S.  Steel, MP Materials, Lithium Americas, and Trilogy Metals to hand over  stock to the U.S. Government. These are capitalist companies who are  doing business that they claim this government supports. Trump is also  considering forcing…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…aisle have long recognized in  terms of its value, and we have protected it as part of our American  heritage.\n\nYet, the Boundary Waters have been under threat for years. Twin  Metals, owned by Antofagasta, a Chilean mining company with close ties  to China, has been lobbying for years to set up a mine just outside the  wilderness area, along the banks of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Copper sulfide mining is the most toxic industry in America, and it  is particularly ill-suited to water-rich environments because it  acidifies the water. It leaches heavy metals like arsenic, lead, and  mercury into that water, which is part of the reason it has never been  done in Minnesota before. Remember, Mr. Speaker, we are the Land of  10,000…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…would be advanced by mining in this watershed.\n\nHow do we know this? We know this because Antofagasta, as has been  pointed out, is a Chilean mining company who owns Twin Metals. It is  lobbying to undo the current mineral withdrawal and restore their  leases to extract the copper. Here is what Antofagasta does with the  extracted copper, and we can't…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…nuclear. We need  the President's help to modernize Ohio's Nuclear North with a new grid.  Our industrial corridor produces heavy truck and car platforms, steel,  strategic metals, cryogenic hydrogen, biofuels, renewable fuels,  natural gas, advanced solar, and nuclear power. I would like the  President to take as much money as he just spent in the Gulf…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…production. This  President has taken a 10 percent stake in Intel, a 15 percent stake in  MP Materials, a 10 percent stake in Lithium Americas, and a 10 percent  stake in Trilogy Metals, and we have a golden share in U.S. Steel-- state control of the means of production.\n\nMr. HIMES. If the definition of socialism is political control over  the means of production,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…devices--all rely on trade with Canada  to remain profitable. These industries source key production imports  from Canada, including aerospace parts, critical minerals and metals,  basic chemicals, and petroleum and coal products. In return, we export  billions of dollars of goods to Canada.\n\nWe are talking about hundreds of thousands of people across…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…to  remove some of these arbitrary added taxes on the American people and  lower the cost of living. That is why your shoes, your clothes, and,  yes, electric equipment and metals are costing more right now. It is  costing everybody way too much more.\n\nHere is what they did here in the House of Representatives. They  actually said: We are not going to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…directly employs 1,400 people at Canadian-owned  businesses. Slap-shot tariff policy and volatile trade policy have put  those jobs at risk.\n\nOur manufacturers who rely on metals, equipment, and machinery are  watching the costs rise. Just yesterday, in a hearing in the  Agriculture Committee that I serve on, farmers were talking about their  increased…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…epitome of evil on Earth is shocking. The very fundamental purpose of  this Nation is liberty. That is why we are here. This isn't some game,  and it is not about strategic metals or very precious items that are  underground somewhere. It is about something much more precious-- liberty.\n\nTo see that happen at the U.N. yesterday, I thought, what have…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…true renaissance of space exploration where the future  is literally being built today.\n\nI don't know what is next. There are stories about mining asteroids  for rare-earth metals to support global industries; large commercial  space stations that can replace the ISS and host research; permanent  human habitation on the Moon laying the foundation for…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…overturn the mining       ban in northern Minnesota, which contains the world's largest       known undeveloped deposits of copper, nickel, cobalt and       platinum group metals, in addition to significant helium       resources.\n\nThe International Union of Operating Engineers (IUOE) is       one of North America's leading construction unions,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…just need to be getting them out of the  ground here, creating American jobs while doing that, creating more  American jobs and more wealth while we refine those ores into metals  and then manufacturing from that.\n\nThat is what our vision is. We want to see Americans use American  resources to promote American security and American economic growth.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "Mr. ZINKE. Mr. Speaker, as a former Secretary, I don't think anyone  in this body has spent more time on Twin Metals reviewing the science  than I have, so I think we should separate the hype from the science  and the bull from fact.\n\nFirst of all, why are we here and why is it important…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John James", "party": "Republican", "sentence": "…comes into focus. Michigan's  geology is rich with opportunity. The Upper Peninsula, in particular,  holds significant deposits of copper, nickel, cobalt, and platinum  group metals, minerals essential for defense technologies and next- generation energy systems. For more than a century, the Upper Peninsula  helped power America's industrial rise. Today,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…45. See North Dakota RMP, at 15-20, 96-98.\n\n46. B-336217, Aug. 6, 2024; B-334045, July 5, 2023.\n\n47. B-329926, Sept. 10, 2018.\n\n48. United States Department of Labor v. Kast Metals Corp.,       744 F.2d 1145, 1153 (5th Cir. 1984).\n\n49.See, e.g., B-329065, Nov. 15, 2017; B-238859, Oct. 23,       2017; B-275178, July 3, 1997.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…organizations collectively       work to advance.\n\nNortheast Minnesota is home to the world's largest known       undeveloped deposits of copper, nickel, cobalt, platinum       group metals and more. The area contains 95 percent of       domestic nickel resources, almost 90 percent of domestic       cobalt and about a third of our nation's copper. Industries…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Pueblo Reservoir to  39 communities in southeastern Colorado, many of which are dependent on  groundwater supplies that contain unacceptable levels of naturally- occurring heavy metals and radionuclides. According to the Southeastern  Colorado Water Conservancy District, 18 of those communities are  currently failing to meet Federal drinking water standards…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…2018.\n\n47. B-335629, July 8, 2024.\n\n48. B-274505, Sept. 16, 1996.\n\n49. B-238859, Oct. 23, 2017.\n\n50. B-329926, Sept. 10, 2018.\n\n51. United States Department of Labor v. Kast Metals Corp.,       744 F.2d 1145, 1153 (5th Cir. 1984).\n\n52. See, e.g., B-329065, Nov. 15, 2017; B-238859, Oct. 23,       2017; B-275178, July 3,1997.\n\n53. Miles City RMPA, at 2-1.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…time.\n\nIf you look at what happened when Hurricane Ian devastated south  Florida, there were over 25 runaway fires because of EVs that had  gotten flooded with saltwater. Heavy metals bridge the batteries and  short them out. You can do nothing but park them and watch them burn.\n\nThese devices are fantastic technology, but they are not battle- tested for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I rise today to recognize a significant  milestone in America's push for critical mineral independence.\n\nLast week, I joined Talon Metals to celebrate the new Beulah Minerals  Processing Facility, which will process high-grade nickel and copper,  just like this, from Talon's high-tech, environmentally friendly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691909/north-dakotas-greatest-resource"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…estimated natural gas and  oil resources than any other State in the country.\n\nWe have nearly every critical mineral on the critical minerals list  in Alaska. We have base metals, precious metals, and of course we have  rare earths in abundance. We have incredible timber resources, and we  produce about 60 percent of America's seafood. Alaska is a crucial…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689194/work-highlights-of-western-caucus"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…It is home to one-third of  our country's copper reserves, 95 percent of our nickel reserves, 88  percent of our cobalt reserves, and 75 percent of our other platinum  group metals.\n\nPublic Land Order 7917 locked up the Duluth Complex and ended this  opportunity that we had. This PLO withdrew 225,504 acres--that is  nearly a quarter of a million acres--in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…2023. According to internal calculations, AGOA       beneficiary countries also hold 70 percent of the       world's manganese, 89 percent of the world's platinum group       metals, 54 percent of cobalt, 23 percent of graphite, and 10       percent of copper. Much of this resource wealth remains       untapped, underscoring the vast potential for deepening…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…been  described as cold, gray eyesores, others are literally deathtraps. The  drinking water in many sat stagnant for so long that it turned into a  deadly potion of toxic metals and biohazards.\n\nRenovations and upgrades to make the horrifying offices habitable  again would cost the taxpayers--and prepare, unfortunately, for a jump  scare--$370 billion.…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}]