[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Minnesota Duluth, is the only U.S. Academic Research Fleet vessel  operating in the Great Lakes. It provides critical research that  informs science-based decisions to protect Michigan's gift to the  country, our Great Lakes. These vessels represent a global network of  essential research platforms that advance our understanding of the  world's marine and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691439/accelerating-networking-cyberinfrastructure-and-hardware-for-oceanic-research-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…on Rural Development,  Energy, and Supply Chains, I am proud to co-lead this bipartisan  legislation with the gentleman from New York (Mr. LaLota) and the  gentleman from Michigan (Mr. Thanedar).\n\nThis bill would require the Department of Energy and the Small  Business Administration to enter into a memorandum of understanding  that would improve collaboration…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…since President Trump imposed twenty-five percent  tariffs on Canada. In retaliation, Ontario imposed a twenty-five  percent surcharge on electricity exported to Minnesota, Michigan, and  New York. This will directly impact Minnesotans' energy bills.  Minnesotans and consumers across this country will feel the impact of  Trump's tariffs at the grocery…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, I rise today to honor the counselors,  outreach workers, and credible messengers who save lives as community  violence interrupters in Michigan and across the Nation.\n\nThese programs, supported by the Community Violence Intervention  funding, deescalate conflicts, mediate retaliation, and connect people  to essential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695493/community-violence-intervention-funding"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…time and my  privilege as a duly elected Member of this Chamber to share some of the  sentiments about the state of the Union that is emerging very clearly  and loudly from Michigan and on behalf of my constituents.\n\nFirst and foremost, tariffs that are coming down today on Canada are  wreaking havoc on autoworkers, our auto industry, and, frankly, the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Fulton County Dairy Association milkshake, a farm- fresh cheeseburger, and got to meet hundreds from across the vast  northwestern Ohio region I represent and beyond, even Michigan.\n\nThe Fulton County Fair welcomed a record 180,000 visitors over the  opening weekend.\n\nLast but truly not least, I spent time speaking with the dedicated  director of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694992/fulton-county-fair"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…with stage IV ovarian cancer.\n\nIt was like a grenade went off in our lives. It is something I would  not wish upon my worst enemy.\n\nI took a leave of absence. I came home to Michigan. And at the same  time that she was fighting for her life to get tests and emergency  surgery, it was the same moment that we were fighting the insurance  company so that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…today, and I encourage my colleagues to support  its final passage.\n\nMrs. DINGELL. Mr. Speaker, I will note that I have no further  requests for time. I thank my colleague from Michigan (Mr. Tiffany) for  supporting this bill.\n\nI invite all of my colleagues to join me fishing on the Great Lakes.  It might be good therapy for this institution.\n\nMr. Speaker,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693994/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…During World War II, women went to work in  record numbers. Yet, they are all too often the untold story of the  home front.\n\nAt Ford Motor Company's Willow Run bomber plant in Michigan, just as  an example, women made up almost half of the workforce that turned out  one complete B-24 Liberator bomber every 55 minutes. Many women worked  in jobs that no one…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…overly reliant on competitive countries for  access.\n\nA byproduct of these industrial processes are certainly greenhouse  gas emissions. There is a State representative from Michigan, State  Representative Kelly Breen of Novi, who has, on occasion, spoken to me  at length about the materials used in our roads. We know right now that  the byproduct of the…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…was to soften the ongoing damage of  an unsteady economy.\n\nFrom our region of northwest Ohio all the way to Illinois, New  Jersey, New York, Louisiana, New Mexico, Maryland, Michigan, Hawaii-- the list is long--please listen to the stories of real U.S. companies,  workers, and communities that are being devastated by job losses and  broken promises. Meanwhile,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…communications director, where she led the team during the COVID-19  pandemic and its aftermath.\n\nAfter four years with Congresswoman Castor, Rikki was called back  home to Michigan to be chief of staff for my district office. As chief,  Rikki helped build the office from the ground up, leading the team  through my first term. There, Rikki established…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…trade school. They should not be worried  about someone catfishing them and using intimate images of them to  either coerce money from them or push them to self-harm.\n\nFrom Michigan, to Kentucky, to Ohio, and Georgia, these schemes range  across the country. These sextortion operations are expanding, and we  must do what we can to help law enforcement…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…friends, our  neighbors, our loved ones. Many of these deaths involve accidental  discharge of a firearm, often by a child, including several tragic  incidents in southeast Michigan.\n\nJust last month, Mr. Speaker, in Oakland County, a 9-year-old was  seriously injured after he was accidentally shot. First responders  found the boy bleeding from the head…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…decades of public service.\n\nMr. Varney earned his Master of Science degree in Criminology from  Fresno State and his Bachelor of Science degree in Resource Development  from Michigan State University.\n\nHe went on to serve with the Dallas Police Department and the  Lansing, Michigan, Police Department before becoming Police Chief and  then City Administrator…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…complex geopolitical dynamics.\n\nI thank Chairman Babin for working with me to bring this important  bipartisan legislation to the floor quickly. I also thank my colleague  from Michigan, Congresswoman Stevens, for co-leading this bill with me.\n\nI am proud that my very first bill to pass the House will protect  crucial research done here in the United States…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…a decline in account ownership among low- income households.''\n\nMr. Speaker, I happen to know that because I have represented some of  the poorest counties in the State of Michigan in my time in Congress.  This is a valuable tool those on the lower end of the economic rung  use.\n\nAfter the November election and President Trump won, regulators got  the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Asia, and making the United States stronger.\n\nRecently, T1 signed a partnership with Corning, a historic American  company, to supply solar wafers, linking the innovation of Michigan and  Texas in a powerful new supply chain that will support upwards of 6,000  jobs. T1 delivers domestic energy and energy dominance.\n\nThis investment in American energy will…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize the Harbor Beach  High School football team for winning the Michigan Division 8 State  championship last week.\n\nThe Harbor Beach Pirates took home their second State championship in  football. Never trailing in the game, they won 31-20 at Ford…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697371/recognizing-harbor-beach-football-team"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…authorities for State and local law enforcement agencies using language  that was based on legislation that I worked on in a bipartisan way with  the senior Senator from Michigan.\n\nWe should all look forward, but I want you to know that I look  forward to working further with my colleagues this year to support  police in a bipartisan way. We are very…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "John James", "party": "Republican", "sentence": "…including things like natural gas and  coal.\n\nThese are the types of things that happen in the real world, and  common sense applies in other areas outside of California. In Michigan,  we are not afraid of the future, but we demand to be a part of it.  America called on us during two World Wars and a global pandemic, and  my legislation ensures Michigan…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…the very best of our service members and the  values they uphold. It is my privilege to recognize her as our February  2026 Veteran of the Month.\n\nA native of Port Huron, Michigan, Petty Officer Gramer enlisted in  the United States Navy in 1999. She completed basic training at Great  Lakes, Illinois, and went on to attend Anti-Submarine Warfare Training…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…of Radioman Petty  Officer 3rd Class Natale ``Nate'' Scarpelli, a proud veteran of the  United States Navy and our distinguished Veteran of the Month for  October 2025 from Michigan's 9th Congressional District. His courage,  dedication, and sacrifice during World War II reflect the very best of  the American spirit.\n\nRadioman Scarpelli answered his country's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "John James", "party": "Republican", "sentence": "…vulnerabilities.\n\nIf we are serious about an all-of-the-above energy strategy, then we  must secure the minerals that make those technologies possible.\n\nMr. Speaker, this is where Michigan comes into focus. Michigan's  geology is rich with opportunity. The Upper Peninsula, in particular,  holds significant deposits of copper, nickel, cobalt, and platinum  group…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Ohio. Mr. Speaker, I thank my distinguished colleague  from the State of Michigan for yielding. He certainly is a class act.\n\nI am proud to join my friend Representative Rulli in supporting this  effort to protect our children and national security from…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Lakes are more than just a  natural resource. They are a source of pride for our State, a  cornerstone of our identity, and a home to our world-class fisheries.\n\nFrom Lake Michigan to Lake Erie, generations of anglers have cast  their lines into these great waters, and families like mine have taken  their children and grandchildren to make their first…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693993/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Valerie Prehoda  for being inducted into the Michigan Tech Presidential Council of  Alumnae. This well-deserved honor reflects her steadfast dedication to  her fellow Servicemembers, the communities throughout the Upper  Peninsula,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Virginia,  Minnesota; Steve Janaszak from White Bear Lake, Minnesota; Mark Johnson  from Madison, Wisconsin; Rob McClanahan from St. Paul, Minnesota; Ken  Morrow from Flint, Michigan; Jack O'Callahan from Charlestown,  Massachusetts; the late Mark Pavelich from Eveleth, Minnesota; Mike  Ramsey from Minneapolis, Minnesota; Buzz Schneider from Babbitt,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690280/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…Army outside of war time.\n\nDanny Melton of Riverview who served in the U.S. Marine       Corps outside of war time.\n\nMaryAnn Rowe of Sun City Center who served in the Michigan       Army National Guard during the Iraq War.\n\nRichard Steinestel of Valrico who served in the U.S. Navy       during the Vietnam War.\n\nRoland Tiso, Jr. of Valrico who served…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…most. That is where people are struggling the  most to pay their energy bills.\n\nMr. Speaker, I would like to speak in support of H.R. 3617,  introduced by the gentleman from Michigan (Mr. James), my friend and  colleague. If the United States hasn't learned anything else from the  war in Ukraine, it should be this, this is a fundamental principle: No…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}]