[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…which is the chaos and confusion that this  administration has created and the real fear  that Americans have about this country being dragged into another  quagmire in the Middle East.\n\nThe bottom line is that this administration is acting insane. The  President yesterday said there was going to be a cease-fire forever  between Israel and Iran. They are…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…All-Holiness is a champion for interfaith dialogue and a  steadfast advocate for interfaith understanding. He builds meaningful  relationships with Muslim and Jewish leaders in the Middle East,  Europe, and beyond. He consistently speaks for peace and emphasizes  that religious freedom and tolerance are essential to global stability,  even as he faces persecution…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…planned will result in additional maintenance costs, as  well as unforeseen accidents, as we just saw with the USS Harry  Truman's high operational tempo while deployed in the Middle East. It  is unfortunate that the Department of Defense has failed to provide the  Appropriations Committee with a full account of operational costs in  SOUTHCOM and a projection…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I rise today to oppose war in Iran or any  wars of choice in the Middle East.\n\nWe need to be investing in good-paying jobs at home, healthcare at  home, and childcare at home, not billions of dollars in missiles  targeted at the Middle East that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692976/americans-of-all-parties-do-not-want-more-war"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…would do everything I could to  stop us from getting into an unnecessary war. I happen to believe that  the United States engaging in a war against Iran--a third war in the  Middle East since 2001--would be a catastrophic blunder for this  country.\n\nI think there are some in this body who have a different point of  view than I on this point, but I think…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…President reported for duty, lost their lives, lost their  limbs, or are suffering today with PTSD. Trillions of taxpayer dollars  have been spent and wasted. Yet, in the Middle East, the flashpoint now  is Iran, and we came within an eyelash of getting dragged into yet  another war where the goal was regime change.\n\nI want to acknowledge the professionalism…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…elevating the people will elevate the land and bring peace to  everyone in the region.\n\nYesterday, Rabbi Ulman and Ahmed al-Ahmed showed that this spirit  extends far beyond the Middle East. Their shared humanity and embrace  of each other reflects our hope for the future, a future in which  people see the dignity and grace in one another and have the strength…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Bartholomew has dedicated himself to fostering inter-religious  dialogue, advancing initiatives to promote understanding and tolerance  amongst Christians, Jews, and Muslims in the Middle East.\n\nIn addition to his commitment to religious tolerance and freedom,  Ecumenical Patriarch Bartholomew has been a champion for ecological  justice and the protection of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695587/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…independent Palestinian state, the  protection of due process and the rule of law has central importance.  Equal access to justice is essential for lasting peace in the Middle  East. Today, I voice a concern shared by many of my colleagues: the  incarceration, prosecution, and punishment of Palestinian children in  the Israeli military justice system.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…debate in this Chamber. There was no vote in this Chamber. The  President made a unilateral decision that risked bringing the United  States into another extended war in the Middle East.\n\nThat is not how our Founders designed our Nation through the  architecture of the Constitution. In fact, each Member here swore an  oath to uphold that Constitution that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…professors who are critical of Trump and his policies.  Effectively, the President of the United States got to pick the person  who will oversee the Columbia Department of Middle East, South Asian  and African Studies as well as the Center for Palestine Studies. That  is extraordinary. That is not what happens in a healthy democracy--the  leader of the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…ethically, and morally responsible for everything that happened.\n\nWhen will my colleagues finally break from the cultish obedience to  Donald Trump, who is now over in the Middle East on what looks like a  business trip for him and his family? They are all raking in not just  hundreds of millions of dollars but billions of dollars with their  business…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…payment of $31 million was reportedly directed to flow into entities  connected to the family of Steve Witkoff, Trump's golf buddy who had  been named U.S. Special Envoy to the Middle East.\n\nHere we are, 1 year into Donald Trump's second term, and Trump has  amassed more than $1.5 billion from his crypto ventures like World  Liberty Financial. Trump is profiting…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…is a joint venture between the Trump family,  his sons, and Steve Witkoff and his family. You may recall, Mr.  Speaker, that Steve Witkoff is Trump's Special Envoy to the Middle  East, where Abu Dhabi is located.\n\nNothing in this bill prevents the clear conflicts of interest and  violations of ethics laws by President Trump.\n\nThe worst aspect of this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, earlier today, we received reports that  Iran has targeted U.S. military bases and U.S. servicemembers in the  Middle East, putting the lives of thousands of Americans at immediate  risk. I join Americans in praying for their safety.\n\nThis afternoon, I asked the Trump administration to immediately…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…it to reload  submarines. In fact, it is one of the few military bases where we can  actually reload submarines. We use Diego Garcia to respond to tensions  throughout the Middle East, throughout Africa, and throughout Asia.  Recently, we relocated several B-2 bombers to respond to Iran's  aggression toward demonstrators.\n\nThere aren't words in English…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…he transitioned to staff roles, including serving as the Pol- Mil officer at U.S. European Command in Stuttgart, Germany. There, he  played a key role in operations in the Middle East, focusing on Israel,  Lebanon, and Syria.\n\nHe returned to the cockpit in 1999, joining the VF-14 Tophatters as  executive officer, where I knew him, and, later, commanding…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…homeland by protecting this  homeland that has been ignored for so long. He has brought hope to so  many others around the globe, the people of Venezuela, people across  the Middle East, people across Europe, people in place after place  because of his actions.\n\nHe is the peace President. He has proven it over and over again. He  has never been the President…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…scholarships in Burma; cut $8 million to promote LGBTQ in Africa; cut  $10 million for male circumcision in Mozambique; cut $20 million for  the Arab ``Sesame Street'' in the Middle East; and we cut $600 million  from National Public Radio. Free enterprise in America is alive and  well.\n\nPresident Donald Trump is the President of peace, ending eight wars…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Training  School in San Diego, California, where she trained as a Sonar  Technician.\n\nHer first duty station was in Yokosuka, Japan. While her ship was  operating in the Middle East, the terrorist attacks of September 11,  2001, occurred. In the days that followed, her ship launched some of  the first Tomahawk cruise missiles into Afghanistan in support…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Banner Health Systems boards from       1990-2005. Being on these boards sparked his love of travel,       taking trips to the British Isles, Scandinavia, Europe, the       Middle East, and Australia. He led many bus tours throughout       the U.S. and tour groups 19 times to Israel, Jordan, and       Egypt. Two trips to the Passion Play Performance in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…around the  world, we must remain vigilant about the ongoing threats posed by some  of our long-term adversaries.\n\nIran has a well-established record of destabilizing the Middle East  and threatening its neighbors.\n\nThe Government of Iran is manufacturing weapons, including drones,  acquiring conventional weapons through malign actors, and supporting…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…conventional weapons systems from the Russian Federation and       other malign actors, and is funneling weapons and financial       support to its terrorist proxies throughout the Middle East,       threatening allies and partners of the United States, such as       Israel.       SEC. 3. STATEMENT OF POLICY.\n\nIt is the policy of the United States to fully implement…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…free elections; a market  economy; separation of religion and state; gender, religious, and  ethnic equality; foreign policy based on peaceful coexistence; peace in  the Middle East; and a nonnuclear Republic of Iran. It also condemns  the Iranian regime's terrorism, regional proxy war, and internal  oppression.\n\nOver 4,000 parliamentarians worldwide,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…servicemembers a better  grip on slippery terrain.\n\nOver the next 23 years, Diana and her volunteers sent an estimated  10,000 packages to American troops serving all over the Middle East and  beyond. As a result, Diana and her family-style operation found their  way into southern Ohio's history books as service leaders with a  purpose.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "James Risch", "party": "Republican", "sentence": "…foreign policy and national security objectives of a major       non-NATO ally that has been an important force for political       stability and economic progress in the Middle East.\n\n(vi) Sensitivity of Technology: The Sensitivity of       Technology Statement contained in the original notification       applies to items reported here.\n\nThe highest…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…with  men, to live in a society where religion is important but is not a tool  for oppression.\n\nWe care about these issues because they create peace and security in  the Middle East. Ultimately, that leads to peace and security here in  the United States.\n\nIt is my honor to speak here today to support the gentleman and his  resolution. We must do everything…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…women came from Casper, Cheyenne, and Riverton,  serving our Nation. They are doing an outstanding job in their work and  supporting missions in Europe, in Asia, and in the Middle East. They  are a long way from home--eight time zones away from Wyoming--away from  family, away from friends, away for the holidays.\n\nAnd I go every year, wherever I can find…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…American citizen.\n\nWe are sitting here in the U.S. Senate and not even saying a word of  the fact that there is a U.S. citizen being held hostage by a terrorist  group in the Middle East. That is outrageous. That should be at the top  of the agenda. Why have civilians been killed in Gaza? Because they  hide weapons in hospitals, in schools, in homes.\n\nHamas…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690859/gaza"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…incentives for illicit maritime drug       trafficking on a global scale, including in the Eastern       Pacific Ocean, the Indo-Pacific region, the Caribbean, and       the Middle East.\n\n(c) Briefing.--Not later than 1 year after the date of       enactment of this Act, the Commandant shall brief the       Committee on Commerce, Science, and Transportation,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]