[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Delta Sigma Theta Sorority,       Incorporated for a century of distinguished service and       meaningful impact, and extend heartfelt congratulations on       this historic milestone.\n\nBe it further resolved, this resolution honors the enduring       legacy of the Greater Cleveland Alumnae Chapter and its       commitment to uplifting, empowering, and…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…let it serve as a testament to what  can be accomplished when local government, public servants, and  community members come together with a shared vision. This is a great  milestone in our community.\n\nI look forward to many more years of growth, service, and celebration  at Silverado Ranch.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691298/recognizing-the-one-year-anniversary-of-the-silverado-ranch-community-center-in-clark-county-nevada"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I rise today to celebrate an  extraordinary milestone in the democratization of public information,  as the Internet Archive marks their one-trillionth web page archived.\n\nFounded by digital librarian and MIT alumnus Brewster…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696412/recognizing-the-internet-archives-one-trillionth-web-page"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…that embodies the industrious spirit,  deep-rooted history, and resilient communities of Northwest Ohio.  Today, I am privileged to join in commemorating an extraordinary  milestone in our shared story--the 175th anniversary of Fulton County.\n\nWhereas, on April 1, 1850, the State of Ohio officially       established Fulton County, carved from portions…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…scientific workforce?\n\nThe recent departure of the NSF Director Sethuraman Panchanathan,  known to all of us as ``Dr. Panch,'' from the NSF was a really notable  negative milestone for this administration's actions.\n\nIt is a significant loss when we lose such dedicated and talented  public servants. They are leaving the Federal Government workforce…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Mr. LEE of Nevada. Mr. Speaker, I rise today to recognize and  celebrate a milestone moment for the Jewish community in southern  Nevada--the groundbreaking of the permanent home of Chabad Southwest  Las Vegas, which will take place on September 13, 2025.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695341/recognizing-the-groundbreaking-of-chabad-southwest-las-vegas"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Philippine armed forces has  advanced the strategic goals of a free and open Indo-Pacific and  strengthened the bonds between our two great nations.\n\nLet us honor this important milestone not just as a celebration of  the past but also as a reaffirmation of our shared future. I look  forward to many more years of partnership and shared commitment to  peace…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…lives of those  who sacrificed everything for freedom: The United States Army veterans  and the veterans of the former Republic of Vietnam. As we commemorate  this solemn milestone, let us reaffirm our commitment to the values  that matter most: democracy, human rights, and our unshakeable will to  be free.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…workforce development initiatives.\n\nThis year marks the 40th anniversary of the plant's operation and the  100th anniversary of Entergy serving the state of Louisiana. This  milestone honors the legacy and achievements of its employees and the  plant's significant role in Louisiana's energy future.\n\nI congratulate Entergy's Waterford 3 Steam Electric Station,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…organized countless community events, supported  patriotic observances, and provided a strong voice for those who have  worn the uniform of our Nation.\n\nMr. Speaker, this milestone is an opportunity to celebrate a proud  legacy and to honor those who have selflessly given back to our country  and community.\n\nI commend American Legion Post 667 for fifty…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…leadership in hosting this Special Order  hour.\n\nThis past November, we celebrated the 50th anniversary of the  Individuals with Disabilities Education Act, an incredible milestone  that serves as a reminder of the promise we make to our Nation's  children that every student, no matter who they are or how they learn,  deserves equal access to a quality…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…testament to a century of  grace, wisdom, endurance and love. That said, on behalf of the 7th  District of Illinois, I congratulate and commend Mrs. Pough on this  incredible milestone.\n\nBorn in rural Mississippi in 1926, Mrs. Pough migrated alongside her  husband from the south to Chicago's West Side neighborhood of ``K- Town'', where together they built…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, this week marked a stunning  milestone: 100 days of chaos, cruelty, and lawlessness under the Trump  administration. We see it in our economy, in our homes, and in our  relationships abroad.\n\nJust 100 days ago,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…in various capacities, including Alexandria  City Public Schools, the Campagna Center, and the Alexandria  Recreational Department. Her decision to pursue ordination is a  milestone, not only for her, but for the entire church, and the broader  community as we continue to embrace and celebrate women in leadership  roles.\n\nWe thank Reverend Carr for her…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…ask my colleagues to join me in commending First  Baptist Church of Merrifield for its efforts to better the Northern  Virginia region. Achieving 155 years of ministry is a milestone worth  celebrating. It is a privilege to work alongside this great  congregation in the community, and I wish them continued success  through faith, family, and service.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today to recognize a remarkable  milestone for a cornerstone of faith and service in south Mississippi.\n\nThis year marks the 35th anniversary of Abundant Life Evangelistic  Church in Biloxi, Mississippi. For more…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…improvement projects, education initiatives, and  nonprofit programs.\n\nMr. Speaker, with a distinguished legacy of leadership, I  congratulate the entire DeGol family on this milestone anniversary and  offer best wishes for continued success.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…past  14 years. She enjoys playing dominoes and exercising. Helen is a woman  of faith and loves her family deeply.\n\nMr. Speaker, please join me in recognizing Helen on this milestone  and wishing her a very happy 100th birthday.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692887/recognizing-the-100th-birthday-of-helen-dramer-jarrell"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Office of the Sergeant at Arms, Office of  Inspector General, and the Office of the Chief Administrative Officer  of the U.S. House of Representatives who have reached the milestone of  25 years of service.\n\nThe House's most important asset is its remarkable and steadfast  employees, whose work is essential to keeping its operations running  efficiently…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Speaker, on this anniversary of V-J Day,  I rise to recognize Mary Fine.\n\nMary Fine turned 100 years old this past March 12. I rise today to  honor not only this incredible milestone in her life but her service to  our country.\n\nMs. Fine was a member of the Women's Army Corps and served our  country during America's most difficult tests of the Second…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…requirements;\n\n(5) modern business process management systems that track       Federal agency workflows and produce vendor neutral,       interoperable event, task, and other milestone data that can       be shared with other Federal agency systems can reduce costs       and improve performance for Federal agencies responsible for       environmental reviews…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…business. It  is a privilege to celebrate someone who brings enthusiasm, good humor,  endless support, and hard work to everything she does. We celebrate  Susan on this incredible milestone and thank her for 45 years of  remarkable commitment to our community.", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the JCC  continues to help families thrive and neighbors connect.\n\nIt is with great pride that I recognize the Jewish Community Center  of Greater Buffalo on this important milestone and urge all residents  of New York's 23rd District to join me in honoring the JCC's enduring  legacy of service and its continued contributions to our community.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…1801. This 225th anniversary is a time to celebrate the  spirit of determination and resiliency that still guides the community  today.\n\nStrong's incorporation was but one milestone on a long journey of  progress. For thousands of years, the abundant forests and waters of  the region were the hunting grounds of the Native American Tribes. The  very first…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…courage, duty, and selflessness embodying the very best of  New Jersey's first responders. As June 14th approaches, the community  comes together to reflect on this special milestone and honor the  dedication of the men and women who have spent decades working to keep  West Amwell safe.\n\nAs the West Amwell Volunteer Fire Department celebrates 75 years…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690621/recognizing-the-west-amwell-volunteer-fire-department-on-their-75th-anniversary"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…countless projects supporting local  schools, awarding scholarships, and promoting youth leadership.\n\nTheir commitment to bettering our community is unwavering, and to  mark this milestone, the club has launched a project to construct new,  modern facilities at Shawmut Park.\n\nWith the growing popularity of Fall Fest and other local events, the  current facilities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…knowing her.\n\nHer example of love, service, and vitality is truly inspiring, and  her community is lucky to call her their own.\n\nI congratulate Joanna on this extraordinary milestone and wish her a  happy 100th birthday.      Congratulating Makennah Craft on Fourth Ohio State Wrestling Title\n\nMr. TAYLOR. Mr. Speaker, I rise today to recognize the undefeated…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Mr. FLEISCHMANN. Mr. Speaker, I rise today to recognize a remarkable  milestone in the history of Hoskins Drug Store & Soda Fountain, a  cherished community institution in Clinton, TN. For nearly a century,  Hoskins Drugstore has been a cornerstone of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…through more affordable housing.                    Celebrating 100 Years of Bryan Health\n\nMr. FLOOD. Mr. Speaker, today, I rise to recognize and celebrate a  truly remarkable milestone for the city of Lincoln and the entire State  of Nebraska, the 100th Anniversary of Bryan Health.\n\nSince first opening its doors in 1925, Bryan Health has grown from a  hospital…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…congratulate the Manchester Squires on an extraordinary  achievement: winning the Class 2A basketball State championship this  past weekend.\n\nThis victory marks a historic milestone because it was the first  boys' basketball State championship title in the school's history.\n\nThe journey to a championship is never easy. It requires months, if  not years,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}]