[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Despite this breathtaking departure from more than two centuries of  law and practice, we still know almost nothing about these strikes,  some taking place as far as 2,700 miles away. It may be that there were  narcotics traffickers on board some or all of these vessels. It may  also be that some of these boats were being used for human trafficking  and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…companion to my  bipartisan legislation, the Save Our Seas 2.0 Amendments Act.\n\nMarine debris does not stay in one place. A plastic bottle tossed  inland can end up hundreds of miles away, wrapped around a propeller,  tangled in fishing gear, or broken down into microplastics that end up  in the food we eat. Across the country, communities see the damage…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…hospitals close, the community loses not only healthcare  but jobs, restaurants, banks, and hope. When Southwest Georgia Regional  Hospital closed, the nearest ER became 40 miles away, a life or death  distance.\n\nRural healthcare is not just about hospitals and doctors. Clean  drinking water, wastewater upgrades, and broadband are necessary for  health…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696850/national-rural-healthcare-week"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…political theater, and it  is costing people their lives.\n\nOn January 7, an ICE agent murdered Renee Good, an unarmed U.S.  citizen, in Minneapolis. Two weeks later, just miles away, Alex Pretti  was shot and killed by Federal agents. In both cases, the  administration lied about what happened, smeared the victims, and  blocked independent investigations.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Office Buildings now, everywhere there are poster replicas of  that plaque being put up.\n\nNow they want to pass a resolution deploring violence that took place  thousands of miles away from here, and it is just a resolution, a  hortatory resolution. They can't even get bipartisan support because of  course they have to set it up on a polemical, partisan…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…grew, there was one glaring gap in its  services. People living in rural areas would need to venture to the  nearest Post Office to access their mail, which could be located miles  away. While Americans living in more populous locations had access to  free home delivery for decades, rural Americans were still walking for  miles to retrieve their post at…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the rate at which these  veterans must be referred to community providers or endure lengthy  travel to access services at VA medical facilities thousands and  thousands of miles away from home.\n\nVeterans deserve access to the care and benefits they have earned,  regardless of where they live. I urge my colleagues to support H.R.  3400, the TRAVEL Act.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…let them. Of course, the President could step  in in any kind of national emergency and prevent that.\n\nThere is discussion that the Chinese will buy a farm near, a couple  miles away from the main entrance to a military base, but, of course,  they could also park a car next to the military base. They can be in an  Airbnb next to the military base. They…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…immigrants?\n\nLiam had just gotten home from preschool with a Spider-Man backpack  and his bunny stocking cap. He and his father were held in a facility  in Texas, more than 1,000 miles away from their home, for over a week  until a Federal judge ordered that they be released.\n\nDangerous criminal. Keeping our streets safe.\n\nOver a 2-month period last year, according…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…where electric bills are going down. Blue means the prices are  going down. And what is measured here is how far away you are from a  data center.\n\nSo here is 0 to about 25 miles away from a data center. So if you  live between 0 and 25 miles from a data center, if you are in the range  of the electric utility that has to serve that data center when it…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Oppenheimer's worst  fear is becoming a reality. Hundreds of our nuclear warheads are  literally ready to launch on missiles that can obliterate targets that  are thousands of miles away in a mere 30 minutes. And we also, as the  Presiding Officer knows, have hundreds of nuclear bombs in this country  and others.\n\nNow Vladimir Putin is recklessly threatening…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…rape.\n\nThis Republican bill makes children's lives worse. Unlike in other  States, when kids in D.C. are treated as adults, the Bureau of Prisons  ships them hundreds of miles away from their family and loved ones to  places like South Dakota or Texas. This makes rehabilitation harder and  increases the likelihood of recidivism.\n\nDon't just take my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…they haven't  accomplished it yet.\n\nAs a member of the Congressional Black Caucus, I am reminded that I  am not in this fight alone. They were always there with me, 3,000 miles  away, never leaving me alone. We are a community of leaders, Mr.  Speaker, united in our goal to shape a more equitable, prosperous, and  just society.\n\nMr. Speaker, this Black…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687899/black-history-month"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…Christians, including 3 children, who are  detained in Panama. These people sought safety and refuge in the United  States. Instead, they were rounded up, flown thousands of miles away,  and imprisoned in detention camps in brutal conditions. They are afraid  for their lives as they wait to be sent back to their home countries to  face deadly consequences…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…whom have more than 20 years  of experience in the field. Evergreen's rural geography presents unique  challenges in emergency situations, as the local hospital is located  miles away from most residents. EFR's quick responses consistently make  a real difference when other help isn't always readily available, and  we are grateful for their lifesaving…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694726/recognizing-evergreen-firerescue"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…made.  This is hurting their economy. It doesn't make sense, and it is kind of  a bad example of having that distant landlord with an alternative  agenda that lives many miles away managing the land where you live. I  thank her for her efforts on behalf of her constituents and on all  Americans who enjoy outdoor recreation.\n\nMr. Speaker, I am prepared…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…often starting over time and time again. They say  good-bye to friends more times than they can remember.\n\nThey celebrate birthdays and holidays with one parent thousands of  miles away. They carry worry, pride, hope, and responsibility,  sometimes all at once.\n\nThis month, we pause to recognize that while our servicemembers  protect our freedoms, their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…investigation uncovered that the CCP's harassment and  forced transfer of Uyghur workers is more pervasive than previously  thought, with individuals relocated over 2,000 miles away from the  Uyghur region.\n\nMeanwhile, Uyghur human rights advocates and family members of  detainees are intimidated and harassed by the CCP's transnational  repression and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694801/uyghur-policy-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are not as valuable as they were 30  years ago. That should be obvious from what happened over the weekend  when Ukraine used drones to wipe out some aircraft thousands of miles  away in the Soviet Union, showing that the nature of warfare is  changing rapidly. Our defense budget should change rapidly with it.\n\nMr. Hegseth has said we are going to use…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…they could  find a better use for those dollars than paying an additional tax to  bureaucrats who want to regulate every detail of how they do business  from hundreds of miles away.\n\nThis week, House Republicans will take a commonsense step forward by  protecting consumers and small businesses alike from these costs. The  Small Business Regulatory Reduction…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…be available to those families. In fact, there are  some communities in Alaska where Vietnam-era veterans who are eligible  in this program have to select land hundreds of miles away from their  own community.\n\nWe are trying to unlock the State of Alaska, Mr. Speaker. It is my  colleagues on the other side of the aisle in this Chamber that have  repeatedly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]