[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the Founders  gave Congress, not the President, the power to declare war. Congress  later passed the War Powers Resolution of 1973, which allows Presidents  to engage in military action for up to 60 days without a vote of  Congress, but Donald Trump's reckless threats to take over peaceful  nations means that he cannot be trusted with this unchecked power.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…the public from talking about his domestic failures. Donald  Trump, as I said, campaigned on getting out of foreign entanglements.  But let's just review. He has launched military action in nine  different localities across the world: seven countries, two seas.\n\nWe went back and looked. That is the single greatest number of  countries with military action…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Defense from which he diverted funds to pay for this  operation. He did not reply.\n\nFor example, I have been told military housing has been shorted to  spend billions on military action. Secretary Hegseth then had a second  thought. He said: Call my office. I asked him directly with whom in his  office should I speak, and he replied: Anyone. Mr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…the American people.\n\nCongress, unfortunately, has not stood up to his despotic actions.\n\nHe is not listening to Congress or to the American people. He has  threatened military action against Greenland, Colombia, Cuba, Mexico,  and Panama; and he has threatened to keep sidestepping Congress if you  will let him.\n\nAt a time when Americans are struggling…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…incoherent and legally questionable. We warned that the massive  military buildup was not about narcotics trafficking. We warned that  this campaign was always directed at military action against Venezuela.\n\nAt every turn, this body had the opportunity to exercise oversight  and demand accountability, and at every turn, we failed to do so. Now  we must…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…essentially declared war on Chicago, one of the  largest cities in the country that he leads, with a meme from a Vietnam  war movie about the loss of all humanity when military action is  unchecked by ethics or the laws of war. And this week, he made good on  his threats, forcing hundreds of National Guardsmen into our city,  against the will of the…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Greenland to protect it  from an American invasion. Canada has signaled that such an invasion  would activate Article 5, meaning our allies would be obligated to take  military action against us. Record-setting protests are taking place in  Greenland and in Denmark because they have no interest in being taken  over by Trump.\n\nInstead of deescalating,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…inspectors general who work to eliminate  government waste and fraud and abuse.\n\nNo. 15, threatened to hold California wildlife aid hostage.\n\nNo. 16, threatened to use military action against Greenland to take  it by force and violate its sovereignty.\n\nNo. 17, illegally fired two National Labor Relations Board officials.\n\nNo. 18, banned transgender…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…have enough money for healthcare, for  housing, for so many other things, and we want to give money to  Venezuela? How is that ``America first?''\n\nTrump threatened further military action if the current government  doesn't cooperate with the United States. The administration is trying  to concoct an argument that we are not engaged in hostilities, but that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…continue unchecked, we  will have surrendered Congress's most solemn constitutional duty. We  will have set the precedent that the President--any President--may  initiate military action at will, without oversight, without  transparency, and without the consent of the governed.\n\nWe have seen this pattern before. Over the past several years, this  administration…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to the Caribbean. It is part of the largest military buildup  in our hemisphere that we have seen in decades.\n\nAccording to press reports, Donald Trump is considering military  action on Venezuelan territory. But it also sounds like nobody really  knows what the plan is because, like so many other things with Donald  Trump, he keeps changing his mind.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…he claimed that Afrikaners are being persecuted.\n\nNotice a few months later, he also claimed that Nigerians were being  persecuted if they were Christians, and he used military action against  Nigeria, but he wouldn't open up a path for Nigerians to come to the  United States.\n\nHe asserts that Afrikaners are being persecuted against, and so we  will…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…when in but his first year in office, the President  used military power in Iran, Nigeria, Syria, Yemen, and most  significantly, in Venezuela.\n\nAfter months of escalating military action against boats in the  Southern Caribbean, after amassing a massive military armada on the  doorstep of a foreign nation, the administration dispatched American  servicemembers…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the 2001 AUMF that was passed following the  terrorist attacks September 11, 2001. I have long supported a repeal of  the 2001 AUMF because it was intended to authorize military action  against Al-Qaeda in Afghanistan, a mission that has long since ended.  The legal authorities provided in the 2001 AUMF are now being twisted  by the Trump administration…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that we took on when we took the oath of  office to become a U.S. Senator. That is our responsibility.\n\nThis should pass overwhelmingly to tell the President: no more  military action in Venezuela unless Congress provides an authorization  for the use of military force.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…up all the time about: What if we are being attacked? What  if it is an emergency? Can the President act without Congress?\n\nOf course, he can. No one has disputed that. Military action in  defense from another military attack has always been the prerogative of  the President.\n\nPeople say: Well, this had to be a secret.\n\nWell, guess what. It was no secret…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…World War II.  Republicans claim we don't have money to keep healthcare costs down,  yet they are going to keep spending billions of taxpayer dollars for  Trump's reckless military action in Venezuela and everywhere else he  decides to invade or bomb.\n\nTrump and Kristi Noem have militarized our streets. Masked men in  full military gear roam the streets…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…piece of legislation and urge its immediate  passage. It is long overdue for the Trump administration to share the  information it has with Congress that justifies its military action  against alleged Tren de Aragua members.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…but  I do thank my friend from North Carolina for introducing it and  recognizing that we should have a basic understanding of any  organization that we are going to take military action against.\n\nMr. Speaker, I urge my colleagues to support H.R. 4070. This  legislation is an important first step in combating an FTO, foreign  terrorist organization, that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…available. This number represents a tragic national public  health crisis.\n\nThe intention of this resolution may be to stop the attacks on the  drug boats, but by refusing military action against presidentially  designated terrorist organizations, you shut the door for action  against other dangerous groups, including Mexican cartels or Islamic  terrorist…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698245/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the United States. And we  have picked away at it and picked away at it, and it simply has not  been effective.\n\nWhat Donald Trump decided to do was to take appropriate military  action against an invasion. That invasion comes from those terrorists.  They invade the United States of America with boats loaded with this  poison. It is distributed around…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…They also claim the act to remove Maduro was unconstitutional, which  ignores Article II and decades of bipartisan precedent where Presidents  have undertaken limited military action without a declaration of war.\n\nClinton acted in Kosovo. Obama acted in Libya. Most similarly, George  H.W. Bush captured drug-trafficker Manuel Noriega back in 1990. No…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the jurisdiction of the United States.\n\n``(D) Defense readiness.--Defend United States national       interests in the maritime domain against hostile acts through       military action, and maintain a state of readiness to assist       in the defense of the United States, including when       functioning as a specialized service in the Navy pursuant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…criminal. Talk about Trump  derangement syndrome.\n\nIt is funny; I don't remember Democrats trying to tie the President's  hands when Democrat Presidents took far more extensive military action  that involved thousands of troops or airstrikes over weeks and months  in Libya, Bosnia, Serbia, and Haiti. Most recently, in 2024, they  locked arms and voted to turn…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…article 29 of the Charter of the Organization of  American States, of which the United States is a member, it says that  the countries of the Western Hemisphere may take military action  against a threat that endangers the peace of the Americas.\n\nThe Maduro regime has destroyed the peace of the whole Western  Hemisphere. If not, ask anyone who lives in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…representatives of the people, have the right to       decide this important question.\n\nIt is without question that Congress neither deliberated nor  authorized the recent offensive military action against Iran.\n\nEach of us has taken an oath to uphold the Constitution. Deferring  the decision as to when, where, and why the country goes to war to any  President is…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…conflict in the world today and that it was the West that incited a  Ukrainian coup in 2014 and further unrest in Eastern Ukraine in 2022,  which necessitated Russian military action to liberate the people of  Crimea and Eastern Ukraine. Putin says that the war would have ended  long ago, in March 2022, had it not been for the West's supplying  Ukraine…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…only is a taking by force or coercion or other related method  not only an option but perhaps a priority. And that, as a priority for  the United States to take Greenland, military action is an option. And  that, to me, is profoundly, profoundly troubling.\n\nI think most of us want to be able to just not only quiet that but  make clear that is not only not…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}]