[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…as much as $7  billion in D.C. to be routinely under threat by floodwaters. This  includes private homes and businesses, the National Mall, federal  buildings and three military bases. The Anacostia and Potomac rivers,  which surround D.C., are tidally influenced. In addition, the Maryland  and Virginia coastal zones each include the tidal Potomac River,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…managing the Armed Forces, and who has  prioritized support for bigotry and weird cultural war obsessions like  changing the pictures on the Pentagon's website and renaming military  bases after Confederate icons.\n\nWhen this bill is combined with the money spent by Republicans in the  One Big Beautiful Bill Act, the United States is on track to spend over…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, earlier today, we received reports that  Iran has targeted U.S. military bases and U.S. servicemembers in the  Middle East, putting the lives of thousands of Americans at immediate  risk. I join Americans in praying for their safety.\n\nThis afternoon,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…could begin to mine the Strait of Hormuz, a tactic meant to       pin American warships in the Persian Gulf. Commanders put       American troops on high alert at military bases throughout       the region, including in the United Arab Emirates, Jordan and       Saudi Arabia. The United States has more than 40,000 troops       deployed in the Middle…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…plan clear: weaponize our  troops against the people and use our military installations to advance  their immigration agenda.\n\nAs plans to house undocumented immigrants on military bases continue,  base leadership must be informed about everyone that is coming onto the  base and if their treatment and detention meets well-established  Federal standards.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695107/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Congressional district, the National  Domestic Violence Hotline is the only national hotline that operates  24/7, responding to all those in the U.S., its territories and military  bases across the globe via phone, chat and text. These services are  free and confidential.\n\nAuthorized by the Violence Against Women Act of 1994 and funded  through the Family…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Fort Bragg, but yet you take down the name of  Jackie Robinson. And you are not done with improper ideology? Then you  resurrect the names of so many others. There are six military bases  that have some of these Confederate generals on there, but then you  take down the names of Medgar Evers and Harriet Tubman? That is  shameful and hypocritical.\n\nDiversity…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Senator from--I am going to argue this, and the  President will challenge me on this, but I am going to say Virginia is  the most pro-military State in the United States. Our military bases,  our veteran population, our reservists, our Guard, our military  families, our DOD civilians--our map is a map of American military  history: Yorktown, Appomattox, the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the Chinese Communist Party. But wait, Mr.  Speaker, there is more. Disturbingly, the same investigation found that  the CCP specifically targets schools around 20 U.S. military bases.\n\nChina is not the only country making sizeable investments in K-12  classrooms across the country. The Qatar Foundation allocated $30.6  million to various schools around…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…Patriotic Americans understand that the American flag is to be  revered.\n\nAnybody who has served understands the sacrifice that has been made  to keep Old Glory flying.\n\nOn military bases, it is truly sacred. It is the symbolic altar of  the Nation.\n\nDuring morning and evening colors, all work ceases as troops salute  her raising and lowering. In battle,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…vocational  rehabilitation and employment training.\n\nNearly $20 billion is for the Department of Defense military  construction program. This amount funds nearly 300 projects at military  bases around the world.\n\nMr. CARTER of Texas. It includes $2 billion to improve and maintain  housing for servicemembers and their families. It provides requested  resources…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to work.\n\nThis is not only a quality-of-life issue for Californians and a  cautionary tale for the rest of the country. It is a national security  risk, as well. Forty military bases depend on these dwindling West  Coast refineries. As California strangles production, we must  increasingly rely on foreign imports from our enemies.\n\nH.R. 3109 requires…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…143 schools across 34 States  with Chinese ties, with at least 7 still active as of this publication.\n\nThe report also found that many of these schools are located near  military bases.\n\nMy Democrat colleagues are correct that the known number of Confucius  classrooms has declined after attention from media and advocacy groups  increased, including from…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…respect they deserve.\n\nLikewise, the Laborers Union, who built and maintained the  infrastructure this country runs on; and the IBEW, who work in  dangerous conditions at military bases and power plants, depend on  these rights to ensure proper training and enforce a safety protocol  that prevents accidents and saves lives.\n\nMr. Speaker, I am proud to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697977/protect-americas-workforce-act"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…deficiencies in military barracks  identified by GAO and others, the bill includes a $75 million increase.  There is also a $75 million increase for child development centers on  military bases to improve the quality of life of many military  families.\n\nIn closing, I thank my colleague Judge Carter for crafting a bill  that keeps our promises to the veterans and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…core. We stand for freedom of speech,  expression, and religion. They stand for none of our values. Confucius  classrooms are propaganda, and they are often set up near our military  bases, just to give it another layer.\n\nThere are CCP and Chinese affiliations in 143 schools throughout this  country. Honorable Speaker, I was shocked myself to realize that…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…am absolutely elated. I am trying  to get on it. It basically says: Look, let's do a debt and deficit  commission, like we did BRAC many, many years ago to close excess  military bases, and let's go for 3 percent of GDP growth.\n\nMadam Speaker, there is a problem with that number. Just our interest  coverage is over 3 percent of our economy. So we are…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…goes well beyond the pump.\n\nAs California fuel production declines, it jeopardizes our national  security and undermines our military readiness, as multiple strategic  military bases rely on California fuel. With threats from our foreign  adversaries, like China, only continuing to grow, we cannot risk  leaving our defenses weakened.\n\nThe REFINER Act…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…important issue from my district and to offer an  amendment that would solve the problem.\n\nMr. Speaker, I represent a vast district in southern California.  Among the five military bases that I represent is the Marine Corps Air  Ground Combat Center in Twentynine Palms. This is a critically  important national asset where large-scale training operations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Ocean. One of those islands is an  island called Diego Garcia, on which the United States and our friends  in Great Britain have one of the most--if not the most--important  military bases in the world. It is jointly administered by both the  U.S. and the UK--though, truth be told, most of the firepower is  provided by the United States of America.\n\nWe use…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…20 press release revealed BioMADE received $87 million in  Federal dollars under the Biden-Harris administration to produce lab- grown meat to reduce carbon emissions on military bases. In March 2023,  BioMADE received an additional $450 million for the ManTech program.\n\nLet me name a few of these projects that taxpayer dollars benefited.\n\nOne is called…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…exposing  nearly two decades of CCP efforts to influence thousands of children.  At one point, more than 500 schools hosted Confucius classrooms, many  located on U.S. military bases. That is no coincidence. Those programs  are a deliberate attempt to undermine American values and compromise  our security.\n\nThat is why I proudly support H.R. 1069, the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…creates clear Federal authority and escalating  penalties to counter repeated or hostile intrusions. A slap on the  wrist is not enough when foreign actors surveil U.S. military bases.  Protecting our installations equals protecting readiness, our troops,  and national security.\n\nI urge my colleagues to support this commonsense measure to send a  clear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]