[{"senator": "Deborah Ross", "party": "Democrat", "sentence": "…its  survival  against Russia's brutal assault. For 3 years, America has supported the  Ukrainian people in their brave fight for freedom.\n\nMr. Speaker, Trump is halting military aid, blocking intelligence  sharing, and betraying a democratic ally. This risks our national  security and emboldens dictators around the globe.\n\nHistory will judge us for…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688655/america-still-supports-ukraine"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…community.\n\nI am not a pacifist. Every year, I work on the Armed Services  Committee to help write a defense bill and try to get it passed. I whip  votes on the floor for military aid packages to allies. There are bad  folks in the world. The United States needs to defend itself, and it  needs to work with allies to help them defend themselves. But our…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…concession after concession out of Ukraine, even its mineral  wealth. At times, the Trump administration has effectively held  Ukraine's economic future ransom for more military aid.\n\nThis includes the dastardly moment when President Trump suddenly  withheld U.S. support and intelligence sharing that Ukraine relies on  to defend itself from Russia's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, tonight, I voted against sending  more military aid to Israel. I voted against it because I saw it as I  currently see it, as a vote against collective punishment, a vote  against ethnic cleansing, and a vote against genocide…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693670/no-more-military-aid-to-israel"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Ukraine has support from the American people. That is the purpose of  these resolutions. That support strengthens his position.\n\nWe are not saying a specific amount of military aid should be  provided or a specific negotiating position should be dictated for  anyone. But only that--and I read from my resolution--we reaffirm the  support of the United…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…their criminal terror organizations in South America,  generating revenue through narcotrafficking.\n\nRussia, a longtime ally of the regime, still provides Venezuela with  military aid while also facing the challenges of waging war in Ukraine.  In fact, Venezuela opened a factory last summer to manufacture Russian  Kalashnikov rifle munitions.\n\nChina,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…national  security interests. If Ukraine falls, then you can assume that Moldova,  Georgia, and others will also fall. Russia will also threaten the  Baltic countries. Our military aid is necessary and cost effective. If  we lose here, it will cost a lot more.\n\nI remind us that the Russians are bombing cities every single day,  kidnapping kids, and murdering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]