[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…Valorous Unit Award. He is most proud, however, of  his Combat Infantry Badge, which he received for his bravery in ground  combat as an infantryman in Vietnam.\n\nAfter his military career ended, Peter returned to Iowa, where he  worked for the Iowa Department of Natural Resources for more than three  decades, including many years as Director of Air Quality.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Colorado, on the occasion of her retirement  following 36 years of service to the United States Army and the  Colorado National Guard.\n\nMajor General Clellan began her military career in 1989, when she was  commissioned as a Military Police Officer. Over the next three decades,  she would shape readiness and emergency response both at home and  abroad…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…general, Gregg       didn't just climb the ranks, he fundamentally redefined what       was possible.\n\nIn the unforgiving landscape of 1940's America, Gregg's       early military career could have been defined by the       limitations others sought to impose. During the Vietnam War,       his innovative supply chain systems didn't just move       materials--they…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the 1st Marine Expeditionary  Force.\n\nHe earned numerous honors, including the Navy Distinguished Service  Medal and Bronze Star with a Combat V, marking a distinguished military  career.\n\nIn addition to his military achievements, Brigadier General Lopez  worked in aerospace and defense, served on national security boards,  and remained actively engaged…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697743/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…2025 Veteran of the Year for Virginia's Fourth Congressional District.\n\nWith over 38 years of service between Active Duty and the Reserves,  Colonel Butler has devoted his military career and beyond to improving  the lives of our servicemembers, advancing medical research, and giving  back to his community.\n\nColonel Butler completed two overseas deployments,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…104-year-old veteran from northwest Indiana whose service is an  inspiration to us all.\n\nIn 1941, Oscar enlisted in the United States Army. Over the course of  his heroic military career, he served in World War I, the Korean war,  and the Vietnam war.\n\nToday, Oscar is a proud member of the Greater Gary AMVETS Squadron  Post 6 where he can frequently be…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Council, Ms. Jane Strain, a surviving spouse and an Army veteran  herself. She said: Surviving spouses and families who cared for  children, moved many times during a military career, compromised their  own careers, and maintained their homelife while the servicemember was  deployed have earned and deserve attention when the spouse has passed.  Placing…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Corps on November 7, 2017, completing recruit training at  Marine Corps Recruit Depot Parris Island, followed by infantry training  at the School of Infantry.\n\nDuring his military career, Domenico served as an Infantry Rifleman  and later as a Small Unmanned Aircraft System Operator. He was assigned  to 1st Battalion, 8th Marines, Bravo Company, where…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…marked by service, leadership, and deep  devotion to his family and community. In 1952, he enlisted in the  Florida Army National Guard, beginning a distinguished 33-year military  career that saw him rise from Private to Lieutenant Colonel. As  Battalion Commander of the 53rd Infantry Brigade in Coral Gables, he  was instrumental in maintaining communication…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…After receiving his Bachelor of Science in Education from Texas A&M  University, Lt. Col. Matthews served with distinction in the United  States Army for over 24 years. His military career included service in  over 30 countries, and a particularly harrowing tour in Vietnam from  1967 to 1968 with the 11th Armored Cavalry Regiment (Blackhorse), where  he…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…excellence.\n\nA native of Troy, North Carolina, Commander Russell is a graduate of  East Carolina University, where he earned a degree in the science of  biology. He began his military career by enlisting in the United States  Navy in 2005 and has since held numerous assignments, including on the  USS Maryland (SSBN-738), USS John C. Stennis (CVN 74), and successfully…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…proud veteran of the  United States Marine Corps and our distinguished Veteran of the Month  for August 2025 from Michigan's 9th Congressional District. His  exceptional military career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American service.\n\nTimothy Babcock answered the call to serve his country after his…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…During his tenure, he enlisted more than 1,000 applicants into  their respective branches of service, shaping the future of America's  Armed Forces.\n\nOver the course of his military career, Captain Retzlaff completed  numerous schools, including the Armor Basic Officer Leader Course, the  Army Reconnaissance Course, Air Assault School, the Advanced  Situational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…within the continental United  States. He later became a platform instructor, training airmen entering  the airborne reconnaissance career field. During his distinguished  military career, Tom was awarded the Meritorious Service Medal, eight  Air Medals, two Meritorious Achievement Medals, the Combat Readiness  Medal, and numerous other decorations. Later…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…proud veteran of the United  States Marine Corps and our distinguished Veteran of the Month for July  2025 from Michigan's 9th Congressional District. His exceptional  military career and steadfast commitment to duty, excellence, and  patriotism embody the very best of American service.\n\nRichard Loughran answered the call to serve his country at the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…First, I will ask we consider Dale Marks to be an Assistant Secretary  of Defense.\n\nMr. Marks is a former fighter pilot and combat-wounded veteran. After  his distinguished military career, he continued service in a civilian  capacity, where he rose through the ranks of Senior Executive Service.  He is currently serving as Executive Director of the 96th…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…cabinet. Governor DeWine  announced General Harris's retirement and nomination to be the next  director of the Ohio Department of Veterans Affairs.\n\nGeneral Harris began his military career in 1981 when he enlisted in  the Ohio Army National Guard. He was assigned to the 107th Armored  Cavalry Regiment located in Worthington, Ohio where he was part of  their…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691689/special-recognition-of-major-general-john-c-harris-jr-upon-his-retirement-as-adjutant-general-of-the-ohio-national-guard"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…States Marine Corps as an infantry officer in 1987. Mac  remained on active duty for eight years and continued his reserve duty  through 2012. During his distinguished military career Mac was also a  Reconnaissance Officer and deployed to the Middle East in support of  Operation Desert Shield, Desert Storm, and in support of the Global War  on Terror.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…expertise, earning an MBA from The Ohio State University  and completing a Senior Service Fellowship at the University of Texas  Institute for Advanced Technology.\n\nHis military career spanned critical roles in both combat arms  leadership and defense acquisition. At the Pentagon, he served as  Executive Officer to the Deputy for Systems Management and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…call to serve when he joined the  United States Air Force in 1981, where he trained and served as a  Nuclear Weapons Specialist. Over the course of an honorable 22-year  military career, he rose to the rank of Senior Master Sergeant,  exemplifying leadership, integrity, and an unwavering commitment to the  security of our country. He retired from active…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…King, a proud veteran of the  United States Army and our distinguished Veteran of the Month for  September 2025 from Michigan's 9th Congressional District. His  exceptional military career and steadfast commitment to duty,  excellence, and patriotism embody the very best of American service.\n\nMaster Sergeant King is a native of Houston, Texas, who answered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695000/recognizing-united-states-army-master-sergeant-tommy-j-king-as-september-2025-veteran-of-the-month"}]