[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the wake of the deadly air collision  between a commercial airplane and a U.S. Army helicopter near Ronald  Reagan Washington National Airport, DCA, specifically that military  aircraft in the area broadcast their location to other aircraft using  the most effective collision avoidance technology available. It also  allows the military to waive their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…religious  persecution.\n\nEarlier this month, the Trump administration deported roughly 300  men, women, and children seeking refuge in the United States to Panama  on U.S. military aircraft, locking them in hotel rooms without access  to basic rights or counsel.\n\nThis includes asylum seekers from Iran, China, and other countries  known to persecute religious…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…be time for all of us to just take a deep breath  and go: Wait a minute. What is happening here?\n\nThere are extrajudicial killings going on in the middle of an ocean.  Military aircraft are used for deportation. Secretary Hegseth and the  President are eroding our military readiness while advancing their  ambitions.\n\nAt a moment when this administration…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…also builds on the ROTOR Act's momentum and tackles many of the  issues the ROTOR Act does not address. For instance, the ROTOR Act's  ADS-B In mandate doesn't apply to military aircraft since the FAA  Administration equipage requirements don't apply to military aircraft.  The ALERT Act does.\n\nThe House Committee on Transportation and Infrastructure purposely…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…allow the Department of Defense to, once again, sell excess  aircraft and aircraft parts for wildfire suppression.\n\nThis will help facilitate the acquisition of excess military aircraft  for the aerial wildfire suppression fleet.\n\nThis lifesaving authority protects our aerial firefighters and brings  in revenue from military aircraft that are not needed.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691858/aerial-firefighting-enhancement-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…facility at their Cummins Engine plant.\n\nI toured Rolls Royce and their massive aircraft engine design and  manufacturing facility, where they are at the leading edge of military  aircraft production for our national defense.\n\nI also visited with SABIC, a company in Bartholomew County that is  part of a global plastics industry.\n\nAt each of these companies…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…of the Senate Commerce Committee, Maria Cantwell, the  committee passed the ROTOR Act unanimously.\n\nHere is what the ROTOR Act does:\n\nNo. 1, it tightens the rules for military aircraft so air traffic  control and other pilots have a better idea of nearby planes and  helicopters.\n\nNo. 2, it requires all aircraft, civilian and military, to equip and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698320/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…aviation.\n\nWe are doing that right now.\n\nThe ROTOR Act closes the loopholes that have been described by my  colleagues and strengthens ADS-B requirements for commercial and  military aircraft, among many other things.\n\nIt requires safety reviews of DCA, and it requires better  coordination between the FAA and DOD. I commend the FAA Administrator  for his commitment,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…with a maximum certificated takeoff weight of less       than 12,500 pounds when operating under part 91 of title 14,       Code of Federal Regulations, and qualifying military aircraft       as specified by the Administrator in consultation with the       Secretary of Defense, the Administrator shall establish       performance requirements for…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…speed, and  direction of aircraft over unencrypted, open channels. Websites like  FlightAware then post that information for all the world to see.\n\nSince 2018, certain military aircraft have been exempt from  broadcasting that information pursuant to a memorandum of agreement  between the FAA and the Pentagon. The ROTOR Act overrides that MOA with  the…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700107/rotorcraft-operations-transparency-and-oversight-reform-act"}]