[{"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…jump  from $383 to nearly $1,000.\n\nMeanwhile, Trump and Republicans can find money for a fancy ballroom.  They can give tax breaks to billionaires. They even included millions  of dollars in cash payments in this bill for eight Republican Senators.  If anyone else in government gave themselves millions in taxpayer  money, they would go to prison. For…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696719/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…him.\n\nHonduras has become a bastion of the global drug trade. This former  President Hernandez orchestrated a vast trafficking conspiracy that  prosecutors said raked in millions of dollars for cartels while making  Honduras one of Central America's poorest, most violent, and most  corrupt countries.\n\nSo they prosecuted him and found him guilty of being…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…We also noticed that the DOGE effort of Elon Musk, who apparently  fortunately has returned most of his attention to his private  businesses, not only illegally cut millions of dollars from U.S.  Department of Agriculture activities but would deprive the Department  of Agriculture with the expertise necessary to carry out this bill, and  of  course,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…arrested for child abuse, sexual  assault, indecent exposure, drunk driving causing injuries, domestic  violence, and assaults while off-duty. D.C. also had to provide  millions of dollars in backpay to those officers it was forced to  rehire. D.C. also had to pay millions of dollars to resolve police  officer misconduct lawsuits.\n\nBefore the 2023 D.C.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…are seeing in this country. We  are watching as a United States President is selling the United States  out from under the American people. He is offering pardons for millions  of dollars to his friends and letting dangerous individuals back on to  the streets. These are individuals who have committed white-collar  crimes all for the very cheap sum of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…shuttering hospitals across the  country, and starving 12 million families, including millions of  children.\n\nThese billionaires are the same individuals who proudly gave millions  of dollars to President Trump's campaign. They literally bought votes  during the last election and even sponsored Stalinist military parades  to celebrate the President's birthday.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…overburdened Bureau of Prisons facilities in our  country at a huge cost to American taxpayers--more than $150, and in  many cases $200 a day, which comes to hundreds of millions of dollars  when you multiply it by the people that would be affected--before they  can be removed from the country.\n\nThat is the odd part of this bill, that we have people who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…development assistance that our allies and  partners use to build schools, help farmers grow food, fund clean water  projects, and combat poverty. They want to cut hundreds of millions of  dollars in funding for Ukraine and our allies at the border of Russia.  They want to completely eliminate Federal funding for public TV and  radio, which are trusted sources…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…cost fossil fuel plants, so consumer costs go up. But that  additional money that consumers have to pay goes to the fossil fuel  industry, which gave him hundreds of millions of dollars to be elected,  and this is payback for them.\n\nOnly Trump is no fool. Why pay it back himself or ask his political  supporters to pay it back when he can go to electric…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…would negotiate  for discounts, most Americans knew the names, maybe even knew the  jingle: Ozempic, Trelegy, Ibrance, Otezla.\n\nSound familiar?\n\nPharma spends hundreds of millions of dollars each year so you are  supposed to ``ask your doctor'' about these drugs.\n\nThe result, Medicare spent $22 billion last year alone on these four  heavily advertised medications--$22…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…away with more  than $350 million.\n\nNow, his family firm, World Liberty Financial, has launched its own  stablecoin, once again netting the President's family tens of millions  of dollars.\n\nThe administration is rolling back enforcement and reshaping policy  to give these business interests a leg up.\n\nThese are such clear-cut conflicts of interest, yet…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693830/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…strong support of H.R. 6019.\n\nLast week's bill to fund the government included a provision, added  quietly in the dead of night, that facilitates the transfer of millions  of taxpayer dollars from the United States Treasury to the personal  bank accounts of eight Republican Senators, and not just any Senators.  They were Senators who may have had knowledge…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…in cahoots with a bunch of people. It  includes a provision that will line the pockets of eight Senators that  we know of by allowing them to sue the government for millions of  dollars if the Department of Justice subpoenas their phone records or  seeks a lawful nondisclosure order.\n\nWhile families in my district are stretching every single dollar…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…not going to  stop making progress, and we are not going to stop building affordable  housing and critical infrastructure in our communities.\n\nIt also includes tens of millions of dollars I worked hard to secure  for affordable housing projects in communities across Washington State.\n\nMake no mistake, there is way more we need to do to tackle the  affordable…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Ohioans. That is not just a workforce problem. That is a public  health emergency.\n\nThe SUPPORT for Patients and Communities Reauthorization Act would  authorize hundreds of millions of dollars and much-needed Federal  funding to address this crisis. It also includes my bipartisan  legislation, the Mental Health Improvement Act, which provides tens of  millions…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…today, we are advancing President Trump's  executive orders on unleashing American energy and reinvigorating  America's coal industry. We are also restoring hundreds of millions of  dollars in future revenue for Wyoming's K-12 public education system  and protecting more than 4,000 high-paying jobs in rural Wyoming.\n\nIn conjunction with the pro-energy policies…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…country to further climate change lunacy.\n\nIf this RMPA is allowed to continue, it would risk 4,122 jobs in  rural Wyoming, $1.9 billion in labor output through 2048, and millions  of dollars in State revenue used to fund public K-12 education.\n\nThis seemingly localized decision has national repercussions, as  well. In 2024, Wyoming produced 191 million tons…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…essential services.\n\nWhile initial interest in the NPR-A was tepid, new oil finds closer  to the NPR-A boundaries led to a number of successful lease sales  generating millions of dollars in Federal revenues. Among the most  successful was the 2016 lease sale, which came following the discovery  of the Willow field. The Bureau of Land Management, BLM,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…true for  China, whose strategy is to gain a foothold in America's educational  system to steal personal data and to manipulate the material children  are being taught.\n\nMillions of dollars of Chinese funds have flowed into America's K-12  classrooms where students are subject to Chinese Communist Party  propaganda under the guise of Chinese language and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…ancestry--and  this nonprofit went to a bunch of providers who supposedly were going  to provide housing, and they told the welfare authorities in Minnesota  that they needed millions of dollars to house people who were homeless.\n\nOnce again, the program started out small. When they started it in  2020--these crooks started it in 2020--they said ``We only need…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "John Rose", "party": "Republican", "sentence": "…actions of the last administration. It enabled them to seek  $500,000, per occurrence, for having their phone data seized by the  Biden FBI.\n\nThis could have resulted in millions of tax dollars lining the  pockets of a select group of United States Senators. It is no doubt  that they were the architects of this provision. That is not  accountability. That…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…Des Moines and across the State of Iowa.\n\nUnder his leadership, Principal donated generously to United Way and  the annual Principal charity golf classic which raised millions of  dollars for Iowa youth. The Principal Foundation awards grants to  worthy causes including disaster recovery, affordable housing, and  small business development.\n\nDan has always…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…are overcharged for insurance because their ZIP Code  inaccurately places them in a higher risk area.\n\nThink of the local government already stretched thin that loses  millions of dollars in vital sales tax revenue because transactions are  mistakenly attributed to neighboring jurisdictions.\n\nThese challenges are not unique to Colorado. Across the Nation,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…energy developers have faced an outdated and  unpredictable permitting process that has delayed and even canceled  critical infrastructure projects, costing taxpayers millions of  dollars, and weakening American energy security.\n\nRight now, if you want to build a pipeline or a power transmission  line between the U.S. and Canada or the U.S. and Mexico,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…OCTOBER 3, 2025 ------------------------------------------------------------------------                                           By fiscal year, millions of                                                    dollars--                                      -----------------------------------                                          2026      2026-2030   2026-2035…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…21, 2025 ------------------------------------------------------------------------                                             By fiscal year, millions of                                                      dollars--                                          -------------------------------                                             2025    2025-2030  2025-2035…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…15, 2025 ------------------------------------------------------------------------                                           By fiscal year, millions of                                                    dollars--                                      -----------------------------------                                          2025      2025-2030   2025-2035…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…localities back home. We make sure to get their  input on how their Federal tax money is spent.\n\nIn the funding bills that we passed thus far, I am proud to have  secured millions of dollars in critical investments for the State of  Nebraska. One of my top priorities was securing critical funds for  Offutt Air Force Base in the Defense appropriations bill.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…25, 2025 ------------------------------------------------------------------------                                           By fiscal year, millions of                                                    dollars--                                      -----------------------------------                                          2025      2025-2030   2025-2035…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…as he put it, it is a corrupt culture of waste, fraud, and abuse.  So when the Acting Chairman and CEO of an entity that is getting all  this public funding--all these millions of dollars--says defund it  because we have a problem here--meanwhile, the DOGE office at the  Department of War, today, echoed that and agreed with his assessment-- please, colleagues,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}]