[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Congress established a fund in 2021  for schools and libraries to loan Wi-Fi hotspots to students and  educators. The program was an enormous success, ensuring nearly 18  million students at over 10,000 schools and libraries could get online.  In Connecticut, that Federal support, in addition to State funding, was  wildly successful to our closing the homework…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…if Trump, Musk, and McMahon have  their way and try to turn the Department of Education into something  that kids read about in our history books. There are 26 million K  through 12 students from low-income neighborhoods who could see their  schools lose Federal funding, lay off teachers, or even close. There  are 9.8 million students at our rural schools…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…It affirmed that a disability does  not diminish a child's worth and that access to education is a civil  right, not a privilege reserved for a few.\n\nToday, more than 7 million students across the country rely on IDEA  for individualized education plans, services, and due process  protections. These are real students whose ability to learn,  communicate,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…who rely on the services it provides. That  includes the U.S. Department of Education, which does critical work to  ensure our country's more than 50 million--50 million--public school  students can get a quality education.\n\nInstead of trying to strengthen the Department of Education's support  for our Nation's public schools, Trump and his allies are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Federal student aid program.\n\nParents are concerned about disruptions to programs and services that  ensure that the 7.5 million children with disabilities and the 49  million students enrolled in K-12 public education will still get the  education they deserve.\n\nMy legislation, the Department of Education Protection Act, would  shield the Department…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…lasting impact at the state level. As President of the Association of  California School Administrators (ACSA), she represented more than  18,000 administrators serving six million students. She continues her  advocacy as Past President, mentoring new superintendents through  ACSA's professional development academies. In 2019, she was named  Senate District…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…not. And we are still  reeling from the effect that period of time had upon young people in  our Nation.\n\nThe program, as it was implemented, however, helped nearly 18 million  students at 10,000 schools and libraries connect to the internet. I am  very proud of that. It was a big difference in the lives of those kids.  But that funding ran out, leaving…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Education Statistics.\n\nWe know that more than 51,000 public schools serve concentrated  populations of students from low-income families and receive title I  funds. Almost 7.5 million students with disabilities receive a free,  appropriate public education because of IDEA.\n\nI encourage my colleagues on both sides of the aisle to speak with  your local and State…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Federal student loan  program.\n\nMany parents are concerned about disruptions to programs and services  that ensure that the 7.5 million children with disabilities and 49  million students enrolled in K-12 public education get the education  they deserve.\n\nPresident Donald Trump and his administration do not have the  authority to dismantle the Department…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…lives of millions of Americans.  The disabled children's right to an education would not only be  recognized, but it would be funded and enforced nationwide.\n\nToday, 7.5 million students rely on IDEA funding, and that is nearly  one in seven students whose specialized education is funded in part by  the Department of Education.\n\nEvery school district in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Department that support data collection, learning tools, and programs  to increase test scores.\n\nMrs. McMahon does not have the experience required to support the  more than 62 million students in their elementary to postsecondary  education across the country. Mrs. McMahon has no experience teaching  or working in a school. Her experience does not lend her the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…creativity and the development of the  skills needed for an ever-changing knowledge economy.\n\nWe politicize and neglect public schools at our peril. They educate  nearly 50 million students--our future. It is time that we treat public  education as the priority it must be if we want a brighter future for  our children and our grandchildren and our country.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…are vital to all communities, including the one  I represent.\n\nNearly one in five students in New Jersey is served under IDEA.  Without this support, almost a quarter-million students would be denied  an adequate education.\n\nMy district, New Jersey's 10th Congressional District, receives $98  million in title I and special education grants. How will…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698940/protecting-education-for-children-with-disabilities"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…sheriff's  department came out and arrested the students for praying--praying--on  their school campus before class started.\n\nThe result of that was that the next September, a million students  showed up to pray--a million, documented. From almost every State in  America, teenagers showed up at their high school or their middle  school campus just to be able…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…published. It was a meta-analysis that actually  looked at 23 preexisting studies of TFA's impact across 24 years.  Included in that were 63,134 teachers who taught 5 million students.\n\nWhat did this comprehensive meta-analysis find? TFA teachers have had  a consistent and significant impact on students' academic achievements.  On average, students…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "John James", "party": "Republican", "sentence": "…generations. Since its inception, it has empowered families,  equipped teachers, and given children the opportunity to learn, grow,  and succeed.\n\nToday, IDEA protects nearly 8 million students, roughly 15 percent of  all public school children in this country. It requires our schools to  identify and support students who need services, including children  experiencing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…encourage  charitable donations toward scholarships that help families cover K-12  expenses, tuition, books, supplies, and more.\n\nThis bill is expected to benefit over 2 million students nationwide,  opening the door to better opportunities whether in public, private,  religious, or homeschool settings.\n\nUnfortunately, forward-thinking solutions like this…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…America by providing tax credits that  can then be used to allow students to attend a school of their choice.  We believe this could enable meaningful school choice for 2 million  students across the country.\n\nI am also continuing to advocate for the High-Quality Charter Schools  Act, a bill I have introduced that would enable a similar measure of  school…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]