[{"senator": "Gabe Amo", "party": "Democrat", "sentence": "Speaker, 17 million Americans will lose their health insurance.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "The bill before us does nothing for the 15 million Americans who are  about to lose their health insurance, the 1 million children who are  about to become uninsured, the hundreds of hospitals that are closing  or on the verge of closing, or the 24 million people who are staring  down premiums they simply cannot afford.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Speaker, 14 million Americans will lose their healthcare, and  safety net hospitals will be in danger of closing.", "title": "Medicaid and Social Security Cuts", "date": "2025-05-20"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Almost 14 million Americans will lose healthcare coverage if this  plan is successful.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "It means that 4 million Americans could lose  their coverage entirely.", "title": "Cloture Motion", "date": null}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Speaker, 16 million Americans will  lose their healthcare.", "title": "Cuts to Healthcare and Food Assistance", "date": "2025-06-04"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "I would like to think it would matter to Republicans that 14 million  Americans will lose their healthcare.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "Seventeen million Americans will lose their healthcare with this  bill, not undocumented people, not the disgusting term ``illegal,'' but  17 million Americans will have their healthcare cut from this bill.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "They claim that people aren't going to lose their healthcare, but the  independent CBO says that up to 14 million Americans may lose their  healthcare.", "title": "Tax Cuts", "date": "2025-05-21"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Seventeen million Americans will lose their health insurance.", "title": "One Big Beautiful Bill Act", "date": "2025-07-08"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "Over 4.5 million  Americans will lose their care, including many in New Jersey.", "title": "Government Funding", "date": null}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "At midnight and 30  days, at least 5 million Americans could lose access to their health  insurance, and 22 million Americans who benefit from enhanced premium  tax credits under the Affordable Care Act--as they began open  enrollment 1 month ago--started to see their health insurance premiums  spike.", "title": "Medical Bills Are Too High", "date": "2025-12-01"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Speaker, 13.7 million Americans will lose their healthcare, and  millions of families will see their food assistance taken away.", "title": "Republican Budget Bill", "date": "2025-05-20"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "But Medicaid covers 70 to 80 million Americans, and the new  wrinkle is that this proposal doesn't just cut healthcare for tens of  millions of Americans; estimates are that it could be 30 million  Americans that lose healthcare under the Republican proposal.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "If these tax  credits were taken away, families will pay up to 90 percent more for  their healthcare, and 5 million Americans could lose their healthcare  altogether.", "title": "Privileges of the Floor", "date": "2025-03-31"}]