[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…ICE $75 billion through the  2025 reconciliation bill.\n\nThey paid for the slush fund by cutting healthcare and nutrition  assistance while giving tax cuts to rich millionaires and billionaires.  This Chamber has decided to continue funding for ICE without any  accountability whatsoever.\n\nAs we begin negotiating to fund DHS for the rest of the year, the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…This is just one of many examples of who will be harmed by  unreliable and onerous work requirements.\n\nMr. Speaker, I think it is absolutely morally wrong that millionaires  and billionaires will be given $4 billion plus $4 trillion.\n\nWhat is being done for families like this?\n\nCruelty is not an answer.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691458/medicaid-and-snap"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…busy firing thousands of New Mexicans, the Republican  majority is preparing today a budget that offers American taxpayer  dollars to give massive tax breaks for millionaires and billionaires. I  hope that my colleagues can justify eliminating a $40,000 Federal job  at a national park for wildfire prevention so that a millionaire can  take another summer…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Americans.\n\nThere will be table scraps in the Republican bill for middle-class  consumers and families, but the bulk of the tax cuts are going to the  very, very wealthy--millionaires and billionaires; frankly, people who  have done tremendously well in this country over the past several  decades, who are not in need of more.\n\nAnd so you were very right to point…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…healthcare benefits and food assistance and cut critical Federal  investments in our local communities, our democracy, the environment,  and our national security, all so millionaires and billionaires can get  an extra buck. It is horrifying, immoral, and un-American.\n\nUnlike many of my Republican colleagues, I have participated in  multiple townhalls this year…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…now stealing from Medicaid, from the  healthcare of every family that needs it. They are very proud of the  tax breaks by the trillions that they are giving to millionaires and  billionaires in our country.\n\nBut when it comes to just making sure people in our country, this  Christmas, don't see a dramatic spike in the price of healthcare for  them and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…rule  of law, fairness, caring about the little guy, caring about giving  people something when they need it, but not giving something to people  who have too much--millionaires and billionaires.\n\nJust think, Mr. Speaker, of the harm the rescissions bill did to  public broadcasting--NPR and PBS--legacies of President Johnson's Great  Society that help our…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…richest country on Earth for God's sake. Not a single kid  in this country should go to bed hungry, not a single damn one,  especially not when Republicans are giving millionaires and  billionaires a big, fat tax break.\n\nMr. Speaker, what is wrong with my Republican colleagues? In this  bill, they provide a $2 billion tax break for gun silencers, but they…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…problem remodeling the  White House bathrooms with marble and gold, throwing a ``Great Gatsby''  Halloween party for the richest friends, and passing tax cuts for  millionaires and billionaires or inviting Senate Republicans down for  breakfast as Americans, many of them, struggle to pay for their own  breakfast.\n\nIt is time for this administration to…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…costs  for Americans. Unfortunately, this budget does not do that.\n\nMy Republican friends have decided that providing billions of dollars  in tax breaks for a few millionaires and billionaires is worth ordinary  Americans bearing, as Elon Musk put it last year, some temporary  hardship. That hardship brought about by this budget will come in many  forms…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…that we need to raise taxes on people who are  making over a million dollars, not give them $82,000 a year in tax  breaks.\n\nBy the way, the tax breaks for those millionaires and billionaires  are permanent over 10 years. The tax breaks the Democrats support for  working-class families, like no tax on tips, they only want them for 4  years. Democrats…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…people.''\n\nHouse Republicans demonstrate no dependence on nor sympathy with the  American people.\n\nMadam Chair, I urge my colleagues to reject this handout to  millionaires and billionaires and work on a budget that instead  advances the interests of American families.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…of money and  who try to avoid taxation? The little guy has to pick up the tab. Mr.  Chair, that cut will cost the American people dearly by making it  easier for millionaires, billionaires, and corporations to avoid paying  the taxes they owe under existing law.\n\nNevertheless, this bill is better than it would have otherwise been.  IRS data indicates…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…colleagues in voicing our  unwavering commitment to protecting the vital programs that Americans  rely on, prioritizing the working families that I represent over  millionaires and billionaires.\n\nLast night, I stood with every single Democrat in this House to vote  against a devastating budget advanced by House Republicans to enrich  the ultrawealthy at…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…for disabled Americans, the cutting  of support for our senior citizens.\n\nThis monumental moment, the biggest transfer of wealth from working  people in America to millionaires and billionaires; this moment that  should be dominating our attention and our focus; this imminent bill  that is being debated and discussed here in the Senate right now that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…on, and  border communities shouldering a burden Washington created are who the  one big, beautiful bill is going to help.\n\nWho are these people? These aren't the millionaires and billionaires.  These are everyday Americans. Despite what we hear from the Democrats  and the media over and over again, this bill isn't tax cuts for the  rich. It is not about…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…will have to drive hours more when their Medicaid cuts destroy our  world healthcare system. Why? So Republicans can hand out tax cuts to  billionaires.\n\nDo the millionaires and billionaires you are protecting really need  more? They already have so much. They will drown and bury the veteran,  the pregnant mother, the disabled worker with paperwork…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…the other side of the aisle wants  to do.\n\nIf these tax cuts are allowed to expire, which a ``no'' vote today  would ensure, if the tax rates expire, it is not millionaires and the  billionaires they keep talking about; it is 95 percent of all families  in America who would see their taxes go up.\n\nUnless a person makes $70,000 a year and thinks they are…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…won't feel relief from this provision. We don't feel what doesn't  happen.\n\nDemocrats are counting on this fact while stoking class resentments  over tax breaks for millionaires and billionaires, but millionaires and  billionaires don't work for tips. They don't get paid overtime. They  don't rely on Social Security. Working families do, and for the first…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…education that best fits their needs, and expanded  health savings accounts so American families can control their own  healthcare. That doesn't sound like benefits to millionaires and  billionaires. It sounds like benefits to hardworking American families.\n\nAlso, I note that the subsidies that the gentleman from Massachusetts  so wants to support, the American…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…62 percent of all taxpayers will be subject to higher  taxes.\n\nNow, we actually have our friends on the left basically saying: You  are going to give away to the millionaires and billionaires. It is not  the distributional effect of 2017.\n\nAs a matter of fact, one of the great trivia points--and I actually  had some fun with this one because it comes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Committee. We will continue to pass  this legislation and deliver real relief for working families in this  country. We have listened to a lot of rhetoric about millionaires and  billionaires. It sounds like Bernie Sanders is in the Chamber, but  really this is about the working people of this country.\n\nIf we do nothing and the tax cuts expire in this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…income. Send these subsidies to  millionaires. You hear the Senator from New Hampshire--I am sorry--the  Senator from Vermont down here talking about tax cuts for millionaires  and billionaires. They want to send subsidies for healthcare for  millionaires and billionaires. He could make that much money this year.  Keep sending them the subsidies.\n\nNow,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…competitive America, and we are not going to be taken  advantage of by other countries anymore.\n\nAgain, more and more class warfare, Mr. Speaker. We hear the term  ``millionaires and billionaires'' thrown around. Yet, every single one  of them voted against all the tax benefits that would have helped the  middle class and will continue to help the middle…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…legislation is for those working families, those small business owners,  and those farmers who are doing everything they can just to get by. It  is not for the millionaires and the billionaires.\n\nHow many waitresses who are tipped are billionaires? How many  billionaires work hourly jobs and overtime? None do so.\n\nMr. SMITH of Missouri. Wow, Mr. Speaker,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…the American people know it is  not beautiful. It is only beautiful, Mr. Speaker, if you are a  billionaire and you have benefited from those tax cuts for the  millionaires, the billionaires, and the biggest corporations.\n\nRemember, Mr. Speaker, that Democrats wanted to make permanent, and  offered amendments, so that we could continue tax cuts for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}]