[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…It is a  necessity.\n\nThe facts are clear. Republicans paid for their trillion-dollar tax  giveaway for the wealthy by cutting healthcare, plain and simple.\n\nOver 10 million people will lose their Medicaid, and now millions  more could lose their health coverage because they can't afford their  premiums.\n\nMr. Speaker, 22 million people, including 400,000…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…devastating. Expiration of the tax credits will  result in health premiums increasing by an average of 114 percent for  individuals who rely on the marketplace, forcing 4.2 million people to  lose their health insurance.\n\nI hear the fear in the voices of my constituents, Republicans and  Democrats, and Americans across the country who talk about healthcare…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…and dismissive of their  needs.\n\nOne in five Medicaid enrollees has a disability. Two-thirds of  Medicaid enrollees do not receive SSI benefits.\n\nMr. Speaker, 10.3 million people would lose Medicaid coverage in the  next 10 years if the budget reconciliation bill of the Republicans  passes because of its punitive work requirements. Most of these people…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…of my district, every corner of  the great Hoosier State, and every corner of our country will be  impacted by these very cruel budget cuts.\n\nUnder this budget, 14 million people will lose healthcare. Millions  will lose SNAP benefits. Those aren't just numbers. These are people  like Arica, Carol Ann, and Bethany.\n\nI implore my colleagues to remember…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691462/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…health insurance  premiums double or even triple and, for some, spike beyond their  ability to pay when enhanced premium tax credits expire in 22 days. An  estimated 5 million people will lose their health insurance because  they can't afford these new premiums. The Congressional Black Caucus  has told stories of people concerned that they will be among…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…going to give $600 billion less to hospitals  across this country.\n\nThat is going to mean, according to the independent Congressional  Budget Office, that almost 8.6 million people will lose their  insurance. It is going to mean that many hospitals won't be able to  offer services in physical therapy and mental health counseling. It is  going to mean,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bill. They had said it was 13.5 million, but now, because of the  changes before the bill went from the Energy and Commerce Committee to  the floor, it is now 16 million people who will lose their health  insurance, primarily because of all this red tape.\n\nTaking health coverage from 16 million Americans is entirely  unacceptable, and there is no amount…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…devastated; lives will be lost.\n\n``Congress must reject these cuts and instead focus on strengthening  the safety net that protects us all. Otherwise, at least 13.7 million  people will lose healthcare coverage.''\n\nRepublican attacks on healthcare impact real people, including little  children. My guest at the President's State of the Union Address to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…on Medicaid  for basic services like birth control and cancer screenings. In fact,  the Congressional Budget Office warns that this bill would cause at  least 13.7 million people to lose coverage.\n\nMr. Speaker, 42 percent of my constituents depend on Medicaid, and 60  percent of children in the district depend on Medicaid. Republicans are  choosing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691437/trumps-one-big-ugly-bill"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…endless red tape and import the worst parts  of the private healthcare system, confusing paperwork and needless  bureaucracy, into the Medicaid program.\n\nIn total, 16 million people could lose coverage. Millions more could  lose access to care in their community. In Delaware, that will mean  40,000 of our neighbors--working families, children, seniors in…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…one State--Alabama--would lose their  healthcare if this cut went through.\n\nIn Arkansas, 25 percent of families are on the Arkansas Medicaid  Program. A quarter of a million people would lose their health  insurance.\n\nIn Florida, 17 percent of the State is on Medicaid, and 1.3 million  Floridians could lose their healthcare because of these Medicaid cuts.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…He just did. He said  there was a cease-fire that would last forever. There wasn't.\n\nHe said his bill won't kick people off of Medicaid, and it will.  Sixteen million people are about to lose their healthcare, and it is  going to adversely impact rural areas even more so because of what he  is doing.\n\nMr. Speaker, do you know what he has been doing…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…stake. Even the Trump administration's own experts at CMS, the  Centers for Medicaid and Medicare Services, say that implementation of  this rule could lead up to 1.8 million people to lose health insurance  just this year, 2026. That would be devastating.\n\nOn top of the premium increases that people have seen because the  Affordable Care Act extended…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…amendment was introduced to ensure that people who get their  insurance through the ACA will not see their premiums increase this  year, which is expected to cause 5 million people to lose coverage.\n\nMr. Speaker, Republicans voted down that amendment.\n\nRepresentative Kelly Morrison had an amendment that strikes the  defunding of Planned Parenthood, which…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…coming for Medicaid through this dangerous reconciliation bill.\n\nCongress' nonpartisan scorekeeper, the Congressional Budget Office,  just confirmed the truth: 5.5 million people would lose their Medicaid  coverage if Republicans cut the Federal match for expansion States; 3.3  million more would lose coverage if they cap Federal Medicaid spending  in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…truth-telling, and it is important  to delve deeper into what they have said about this so the American  people can know what the truth is.\n\nCBO estimates that 10 million people will lose coverage due to the  One Big Beautiful Bill. Now, again, that estimate without context seems  pretty serious, but we have to ask, who are these 10 million people?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}]