[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…know that, in fact,  there is a commercial purpose that pervades this entire legislation. It  is all about opening up a huge, new market to sell tasers, including to  millions of people who nobody should want to have them.\n\nI have repeatedly supported and will continue to support legislation  to give law enforcement every tool and training they need…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…What is the impact of refusing to extend this program that makes  health insurance more affordable? I am afraid it is obvious. During the  2026 open enrollment period, millions of people decided to drop their  health insurance coverage. Others are being forced to make impossible  choices between food, car payments, and housing costs. If we fail to  immediately…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…all  rejected by the Republicans, one of which would have made it possible  to provide documentation of citizenship through online means, to  register online. There are millions of people in this country who  cannot physically get to a polling place. There are men and women in  our service branches who are stationed abroad who cannot physically get  back…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689407/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…disability, they don't care.\n\nIf your wife has breast cancer, you have big bills to pay because  they want to take away healthcare, whether it is Medicaid to tens of  millions of people, half a trillion dollars for Medicare for seniors  and people with disabilities, and millions of dollars added to the cost  for families to access the Affordable Care…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696718/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…unilaterally obstruct the swearing in of a duly elected Member of  Congress for political reasons.\n\nOur democracy only works when everyone has a voice. This includes the  millions of people across the country who have experienced violence and  exploitation, including Liz Stein and Jessica Michaels, both survivors  of Jeffrey Epstein's abuse. They are here…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans are fortunate to  have a rich musical heritage. Throughout the United States, you can  find countless venues where talented musicians perform. These venues  attract millions of people from around the country and the world who  want to see their favorite artists or visit the place where famous  musicians have launched their careers, all of which contribute…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…health insurance, when they do  nothing to extend the Affordable Care Act tax credits that millions of  Americans are depending on, at a time when they are happy to throw  millions of people off of Medicaid coverage, they decide to change the  subject in order to vilify and demonize a small minority.\n\nThat is a time-honored tactic in the authoritarian playbook,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…to do the same. I say this as someone who represents a  community in the State of Florida, the largest Affordable Care Act  marketplace in the entire country. We have millions of people in the  State of Florida that will be impacted by this, and I encourage  everyone to vote ``yes.''                              Renee Nicole Good\n\nMr. FROST. Mr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…loopholes for plans that will escape any  regulatory oversight.\n\nFurther, Mr. Speaker, this plan does nothing to extend the ACA  enhanced tax credits which are set to expire. Millions of people will  see their premiums skyrocket, and millions more won't be able to afford  any insurance at all. If we bring up the bipartisan bill, then we could  avoid that result.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…destructive rescissions  bill.\n\nThe proposed $8 billion cut to global aid programs is not only a  shortsighted betrayal of American leadership, but it is going to result  in millions of people getting sick and losing their lives.\n\nIf we continue to retreat from helping countries around the world as  this administration is doing, our adversaries like China will…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Meanwhile, Donald Trump and Republicans are charging ahead with plans  to go forward with their tax bill, which features more bailouts for  billionaires, paid for by kicking millions of people off their health  insurance and gutting programs that kids and families rely on to stay  safe and healthy.\n\nDonald Trump, meanwhile, puts higher taxes on groceries, clothes,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…In the midst of this affordability crisis, seeing this, Democrats  said we have got to fight to make sure we extend Affordable Care Act  tax credits so that tens of millions of people--working-class folks,  middle-class folks, people in rural America, working-class America,  small-town America, the heartland of America, Black and Brown  communities…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…many people with disabilities were hit hard and fast by  the loss of services.\n\nI implore every one of my colleagues: Do not be complicit in  destabilizing the lives of millions of people, including Rachael's son  who will have their healthcare ripped away.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691440/gop-tax-scam-hurts-women-and-families"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…student loan borrowers rely  on to have affordable repayment plans on their student loans.\n\nGrocery prices are up. Utilities are up. Healthcare is about to jump  for millions of people, and now some student loan borrowers will have  to find money to pay their student loans. The math simply won't work  for millions of Americans and for these students…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Venezuela prior to the Christmas break. Everybody in my  State knows that this has nothing to do with their interests.\n\nLives are going to be lost in this country when millions of people  lose their insurance in the coming weeks. There are kids who are going  hungry, who are being fed lunch and dinner but not breakfast or just  dinner and not  lunch and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…public safety in our  Nation's Capital. For far too long, Washington, D.C., a city meant to  embody freedom and prosperity, has been overwhelmed by violent crime.  As millions of people visit D.C. every year, it is imperative that our  Nation's Capital is safe for all residents and visitors. Yet, in recent  years, this simply has not been the case.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…watershed. Since their  inceptions after World War II, the rivers they manage have grown in  importance as our populations have grown and water usage has increased.\n\nMillions of people rely on these rivers for water and wastewater  needs, including my constituents in Pennsylvania's Eighth Congressional  District.\n\nThese commissions also play a role…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…those with criminal records. Beyond that,  different Presidents have chosen to exercise that discretion in  different ways.\n\nFor example, President Obama chose to deport millions of people  during his time in office. It is ultimately a matter of how the  President chooses to carry out that policy.\n\nHere is the important point for purposes of today's debate.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Sharia Free America Caucus, which I am proud to have joined.\n\nAcross the world, ideologically driven Islamic movements have  destabilized entire regions; displaced tens of millions of people; and  fueled terrorism, repression, and violence.\n\nWhere civil law is subordinated to Islamic authority, freedom,  prosperity, and security collapse. Sharia law is not…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699120/sharia-free-america-caucus"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Speaker, September is National  Suicide Prevention Month, and I rise today during National Suicide  Prevention Week to raise awareness and promote hope.\n\nSuicide affects millions of people every year, yet too many struggle  in silence. Suicidal thoughts can affect anyone, regardless of age. It  is among the leading causes of death in the United States.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695065/promoting-hope-during-national-suicide-prevention-week"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of housing, and we can do it if American citizens are the ones  who are able to get access. You can get it also if you don't flood the  country with literally tens of millions of people that are illegally  here or through an abused legal immigration system.\n\nCongressional stock trading: I have got to be honest, my colleagues  on both sides of the aisle,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…concerned, we allow another over 400,000 people  into this country on student visas.\n\nIt is incredibly easy to get into this country. Rather, it is not  always easy, but millions of people come into this country legally and  are able to do so. We do not have to have sympathy for people who came  here illegally.\n\nI think it is important that we educate the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…organizations, or the 250 organizations that our friends at the Center  for Immigration Studies put out, demonstrating the network that was  responsible for dumping millions of people into our communities,  including violent gang members from around the world that resulted in  the death of Americans, Americans like Jocelyn Nungaray, Americans like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…every other nation and more  generous than all nations combined.\n\nHowever, what no one ever envisioned was tens of thousands, daily or  weekly, in the amount of tens of millions of people pouring into our  country illegally with no interest in being American but being in  America.\n\nNow what do we do about it?\n\nWe have a President who has vowed to solve…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of Healthcare Tax Credits\n\nMr. KILEY of California. Mr. Speaker, I rise today to urge prompt  action on a matter that could make life a lot more difficult for  millions and millions of people in this country, and that is the  expiration of tax credits that could lead to a massive increase in  healthcare costs.\n\nWe are talking about 22 million Americans…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…fraught with tens of billions of dollars of fraud.  Tens of thousands of Social Security numbers from dead people have been  used to siphon money away from this program.\n\nMillions of people, according to CBO, are ineligibly on the program,  and the answer from the Democrats is to perpetuate this fraud bag,  which is a completely egregious and reckless thing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698366/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Valley and communities further  south.\n\nCalifornia's Central Valley is one of the most prolific agricultural  regions in the world, growing hundreds of crops that feed millions of  people. However, this region faces continual water uncertainty due to  drought and ESA-related regulations.\n\nThe Central Valley Project, or CVP, transports water from wetter…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…not being xenophobic. We are  not saying we are going to let nobody in this country, but obviously we  have to have some restrictions or we would wind up with tens of  millions more people in the country.\n\nHowever, despite our generosity in letting more people here, we have  significant areas of the country governed by elected people who will do  all they…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…needs to stay shut down and that the American people need to  suffer even more than they have already made them suffer.\n\nWe heard from Democrats repeatedly about the millions of people they  believe are going to be affected when their own temporary COVID credits  sunset at the end of this year--their own temporary COVID credits.\n\nDid we hear anything…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…illegally.  We know that there are voter rolls with massive numbers of people who  are illegally present in the United States. We know that the previous  administration let in millions of people into the United States,  wrongfully and illegally under parole and asylum, blatantly abusing the  law to put people in the United States that have no basis for being…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}]