[{"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…American  people.\n\nThe Republican big, bad betrayal bill is unpopular everywhere in the  country no matter how you spin it because Americans know that kicking  17 million Americans off of healthcare just so you can give a $7  trillion tax break to the wealthiest billionaire donors and giant  corporations is outrageous, and the American people want us to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…is 11. They know that letting these tax credits expire will hurt the  people that they represent as well.\n\nCongressional Republicans set the stage to price 4 million Americans  out of healthcare plans that they need. Democrats are fighting to bring  your costs down. If you take away the credits that millions of  Americans depend on to afford coverage,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698811/breaking-the-gridlock-act"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…the  American people because this bill represents, in the text of this bill,  the largest and greatest loss of healthcare in American history.\n\nSeventeen million Americans will lose their healthcare with this  bill, not undocumented people, not the disgusting term ``illegal,'' but  17 million Americans will have their healthcare cut from this bill.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693223/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…purpose.\n\nThose hikes in healthcare premiums are not isolated, Mr. Speaker.  They come on the heels of the One Big Beautiful Bill Act that slashed  more than 10 million Americans out of healthcare through the Medicaid  program, cut over a trillion dollars in Medicare, and a half-trillion  dollar liability in the Medicare fund. Hospitals will close, patients…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…my decade in Congress.\n\nThis is not what our Founders intended--far from it. While the  process stinks, the substance is even worse. The bill still kicks 17  million Americans off their healthcare and makes record cuts to  Medicaid, record cuts to the Affordable Care Act, and record cuts to  Medicare.\n\nThat is not all. It kicks off 4\\1/2\\ million from…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…credits, Republicans are simply hurting their own constituents, hurting  the people who trusted them, and hurting the people who voted for them.\n\nMore than 20 million Americans will see their healthcare costs  explode on January 1. Instead of a fix, we get a stupid, pathetic,  last-minute bill designed to let Republicans cover their ass before  they flee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…joining every Democrat in the House and Senate in voting  against this travesty.\n\nMy colleagues across the aisle who support this bill are voting to  cut 17 million Americans off from their healthcare--including 173,000  Minnesotans.\n\nWhat will happen when those Americans delay preventive care and  treatments they can't afford because they have no health…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…in Congress have unleashed a shameful crisis of cruelty  and corruption on the American people.\n\nFirst, they slash Medicaid by a trillion dollars, kicked 15 million  Americans off of healthcare, set up the playboard for rural hospitals  to shutter, all so that they could give $7 trillion in permanent tax  breaks to their billionaire buddies.\n\nThen they…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696690/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…jeopardy, particularly Medicaid. Medicaid is  healthcare. It is healthcare for kids. It is healthcare for many low- income seniors. It is healthcare for 80 to 90 million Americans. It is  healthcare for folks who must live in nursing homes. They are at that  stage in life where what keeps them alive and allows their kids to  visit are Medicaid paid-for nursing…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Act, which my Republican colleagues passed in June. It is a  healthcare monstrosity, which cut $1 trillion from Medicaid, cut out  premium subsidies for 22 million Americans for their healthcare  exchange plans, and now will suffocate the growth of our Nation's  caring professions.\n\nIf you doubt my words, then maybe you will listen to the president…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…there.\n\nWell, what is really happening out there is that we are in a  healthcare crisis, and that is because the big beautiful betrayal of a  bill will kick 15 million Americans off their healthcare, force  hospitals, health clinics, and nursing homes to close. This is already  happening with the premium notices, with what they are already seeing.  It is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…member for  yielding.\n\nMr. Speaker, if you are a Republican with misgivings about the  massive debt that this bill creates or if you are worried about  stripping 17 million Americans of healthcare access, I tell you that  now is your moment.\n\n``A coward dies a thousand times before his death, but the valiant  taste of death but once.'' That is a quote from…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693187/one-big-beautiful-bill-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…children under the age of 19 and 40,000 seniors  over the age of 65 in my district are at risk because of the policies  coming from this administration. Nearly 8 million Americans get  healthcare through Medicaid and through CHIP, which is on the chopping  block.\n\nThis President wants to cut $5.6 billion from the Department of  Education. The House Republicans'…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Sunday night, the House Budget Committee, on which I serve as  ranking member, passed out, with only Republican votes, a draconian tax  bill that cuts almost 14 million Americans off their healthcare and  ensures a few million more lose their food assistance.\n\nYou might ask yourself why. The reason is, in order to help pay for  tax cuts for billionaires.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Thune", "party": "Republican", "sentence": "…insurance coverage in this country. So you have got, in  the individual marketplace, which is the blue here, almost 50 percent  of Americans--that is about 150 million Americans--who get their  healthcare coverage through their employer. So they are in the small  group plan, the large group plan, but it is something that, when they  get their job, they get…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}]