[{"senator": "Al Green", "party": "Democrat", "sentence": "…used his ax handle to threaten people of color. I saw  him with that ax handle when he wouldn't allow Black people into his  restaurant.\n\nI know who he is. I saw his cousin, Milton Friedman, Nobel laureate,  who, after the Brown v. Board of Education decision was rendered, he  went public and said let's use vouchers to maintain segregation. That  is another…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…behalf of       the Massachusetts Seventh every single day, which includes       majority of parts Boston, Cambridge, all of Somerville,       Randolph, Everett, Chelsea and Milton, can we please just       thank my staff?\n\nThen, of course, I wish to thank all of you and a partner       in good to the left of me. I thank Senator Markey for his       collaborative…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…has been totally focused on how you rip  that away and make people's lives more expensive.\n\nIt also means for the Gulf Coast we are still reeling from Hurricanes  Helene and Milton, just like other parts of the country, in Georgia and  North Carolina. We don't need Elon Musk creating turmoil and firing  civil servants and public servants who are helping…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…home safely. Nathan's commitment to public service extends  beyond Jefferson County--he also deployed to Sarasota County, Florida  to provide critical support during Hurricane Milton.\n\nNathan has led the way in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience. We are grateful for his leadership…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…bill savings over the next 30 years.\n\nThis also hits home in my community because many of the businesses  and many of my neighbors are rebuilding from Hurricanes Helene and  Milton. They were flooded out. They lost their appliances. Many  businesses went on the fritz. It would be particularly helpful to know  that they are going to save money over time…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…It means grandma and grandpa dying  earlier. It means more death and destruction from extreme weather  events, such as the Los Angeles wildfires and Hurricanes Helene and  Milton. By the way, those three events caused $500 billion worth of  damage--those three events, all related to climate change, all related  to the warming of the atmosphere.\n\nJust…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…``can't pollute for free'' rule.\n\nPollute for free, by the way, is wrong--not just morally but as a  matter of economics. You can go back to the most conservative  economist, Milton Friedman, and he will say: Yes, if your product  causes harm, if it pollutes, that is what economists call a negative  externality. And the cost of that negative externality…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Brody Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690146/recognizing-brody-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Ronnie Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Ashley Porter has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690135/recognizing-ashley-porter"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…GROUP; Grumbach, Garrett: NBC NEWS;       Guaracao, Anna: NBC NEWS; Guarnieri, Lindsay: GRAY       TELEVISION; Guastadisegni, Richard: WJLA-TV/NEWSCHANNEL 8;       Guevara, Milton: NATIONAL PUBLIC RADIO (NPR); Guevara, Paul:       UNIVISION; Guevara, SARAH: WJLA-TV/NEWSCHANNEL 8; Guevara,       Selina: NBC NEWS; Guez, Bertrand: SWISS BROADCASTING; Guild,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Kristina Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691077/recognizing-kristina-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. I rise today to recognize the outstanding  contributions that Casey ``KC'' Gabelli has made to our community in  the aftermath of Hurricane Milton. In addition to providing countless  hours of direct support to neighbors and flood victims, Casey helped  coordinate the collection and distribution of emergency supplies,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690275/recognizing-casey-kc-gabelli"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Glen Youngblood has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690716/recognizing-glen-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Harry White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Disaster preparedness Coordinator for the Knights for the Dioceses of  St. Petersburg which encompasses Pasco, Pinellas, Hillsborough, and  Hernando counties.\n\nAfter Hurricane Milton, David was assigned to accompany and work with  a Medical Crew from Ohio. Together, they treated over 400 patients  providing medical assistance to those in need. The team…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690173/recognizing-david-cruz"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Tyra Youngblood has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692457/recognizing-tyra-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Carol Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Eric Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Ruth Gavish has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}]