[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…is fundamentally un-American.\n\nAnd beyond people who are being targeted for protest, there are  thousands of students in this country that Trump is trying to push out  over minor issues: fishing citations, jaywalking, speeding tickets,  even charges that were dismissed. So far, some 1,800 foreign students  are having their visas revoked with little…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Waiver). The       Richardson Waiver further stated that APA's good cause       exception should be used sparingly, such as in emergencies       and for amendments covering minor technical matters. The       Richardson Waiver explained that the new policy implemented a       recommendation by the Administrative Conference of the United       States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…accomplishments range from grand gestures--like in  2011, when she raised the necessary funds to allow the annual Quincy  MLK breakfast to continue--to what may be seen as more minor acts of  kindness--such as helping an elderly neighbor keep their lights on or a  family receive groceries for the week. Kathy has always made sure that  no one goes without…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the requirements under subparagraph (C) of such       paragraph; and\n\n(C) demonstrates that--\n\n(i) the alien has a disability;\n\n(ii) the alien is a full-time caregiver of a minor child;       or\n\n(iii) the removal of the alien from the United States would       result in extreme hardship to the alien or the alien's       spouse, parent, or child who…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…convicted after January 6.\n\nAt least 13 individuals who have been pardoned by President Trump  have gone on to commit additional crimes, including sexual assault  against a minor and a fatal DUI.\n\nInstead of promoting accountability and rehabilitation, when  possible, in our justice system, shouldn't the President and the  majority look at these pardons…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698990/condemning-the-january-6-pardons"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…have been offered  from the Health and Human Services Office of Inspector General, another  inspector general that was fired by President Trump, Republicans  instead offer this minor bill that does little to address fraud, that  raises a myth concerning payments to the deceased, and perpetuates that  myth that Social Security should be, in the words of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…draw an equivalency between himself and Teddy  Roosevelt. That is a pretty--that is a stretch.\n\nBut Teddy Roosevelt was a Republican, a Republican who in the wake of  a pretty minor scandal, in 1904, when a couple of companies sent secret  checks to his campaign and to other Republican campaigns, came to  Congress and said: We have got to ban corporate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…explanation for their conduct.\n\nFinally, American workers should not be forced to compete on an  uneven playing field, where China sends manufactured products to  Africa, there are minor changes made there, and then this product is  sent here as an AGOA trade preference product. Our trade laws should be  clear and not put our workers at a disadvantage by forcing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698906/agoa-extension-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…the full Navy budget. Astonishingly, Mr. Speaker, the Senate  continuing resolution refused the Navy's request and Columbia program  has zero additional funding. This is not a minor bookkeeping concern.  The absence of a set aside, or anomaly, to fund construction of SSBN  828, will create serious risk of a halt work order to the production  schedule of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. matters.  Nevertheless, I will discuss it.\n\nI strongly oppose charging 14-year-olds as adults. However, whether  to amend D.C. law to reduce or increase the minimum age a minor can be  charged as an adult should be a decision for D.C. alone.\n\nIn a series of cases since 2005, the Supreme Court has recognized  that children are ``constitutionally different…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…consequences of some of these car chases. When you have to go  talk to that family and tell them why their loved ones died, you don't  want to have to say that it was over something minor like a stolen car.\n\nThe balance that the city struck was that it should be for an  imminent violent offense, high-level felony, something like that that  you really understand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…commenced not       later than the later of--\n\n``(A) 10 years after the cause of action arose; or\n\n``(B) 10 years after the victim reaches 18 years of age, if       the victim was a minor at the time of the alleged offense.\n\n``(2) There shall be no time limit for the filing of a       complaint commencing an action under this section relating to       an alleged…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bill before us today is the  Senate companion to H.R. 27, which we voted on here in the House on  February 6 of this year. The two bills are identical, other than a  couple of minor punctuation differences. This bill would go to the  President's desk, and he said he would sign it.\n\nHowever, since that vote in February here in the House, the Trump  administration…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…showing his birth certificate and Social Security card.\n\nA U.S. Army Purple Heart veteran who has lived in the U.S. for nearly  50 years was told to leave due to a 15-year-old minor drug conviction.\n\nIn Newark in January, ICE detained a veteran without a warrant,  disregarding his veteran ID card.\n\nA 10-year-old U.S. citizen with brain cancer was deported…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…would improve their ability to ensure institutional  compliance because people want to follow the law. They need the  guardrails, and they need the clarity of the law. So even minor  differences in definitions can have large consequences and can make  implementation difficult. So we have the chance, and this year we are  eager to make this one right and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…lands.\n\nS. 1142 is the Scarper Ridge Golden Gate National Recreation Area  Boundary Adjustment Act. This bill, sponsored by Senator Padilla,  passed last year and would make a minor boundary adjustment to the  Golden Gate National Recreation Area. It is entirely noncontroversial.\n\nS. 1016 is the Vicksburg National Military Park Boundary Modification  Act.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, pursuant to House Resolution 707, I call up  the bill (H.R. 5140) to lower the age at which a minor may be tried as  an adult for certain criminal offenses in the District of Columbia to  14 years of age, and ask for its immediate consideration.\n\nThe Clerk read the title…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…too.\n\nThis is just the worst of the worst from yesterday, just yesterday.\n\nIn Virginia, a 20-year-old citizen of Guatemala was convicted for  possessing obscene material of a minor and filming child porn.\n\nIn my home State of Texas, a criminal illegal alien from Mexico was  convicted for aggravated assault of a family member in Harris County.\n\nIn New…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Reclaiming my time, I would like to enter into a  colloquy with the gentleman from Mississippi (Mr. Kelly).\n\nIs the gentleman trying to tell the American people that it is only a  minor rule, as one of our colleagues said, it is only a minor rule if  it doesn't apply to you?\n\nI yield to the gentleman from Mississippi (Mr. Kelly) for a response.\n\nMr. GRIFFITH.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…many, many crimes.\n\nA criminal alien from Laos was also apprehended, with three prior  convictions for selling drugs, as well as convictions for assault and  contributing to a minor's delinquency. The criminal was issued a final  order of removal in 2009, but here we are.\n\nLikewise, law enforcement in Minnesota arrested a criminal illegal  alien from Mexico…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…regulatory overreach. American workers and businesses are  better.\n\nMr. KELLY of Mississippi. If it doesn't apply to you.\n\nMr. KELLY of Mississippi. Also, thousands of those minor rules add up  over time.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688532/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "John Carter", "party": "Republican", "sentence": "…and technical  expertise.\n\nAfter leaving the Navy, LT Frick pursued higher education at the  University of Texas at San Antonio, earning a degree in Criminal  Justice with a minor in Sociology. He continued his dedication to  public service by beginning his civilian career with the Texas  Department of Public Safety (DPS).\n\nAt DPS, LT Frick worked with…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689331/saluting-the-service-of-lieutenant-brian-m-frick"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…University of Notre Dame as  a member of the Fighting Irish's 1988 National Championship team. He  graduated in 1990 with a bachelor's degree in business administration  and a minor in international marketing. During the 1990 NFL Draft, Pat  was drafted in the second round by the Los Angeles Rams and part of the  1990 All-Rookie Team. He also played with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Liberty-Eylau districts before pursuing higher education at Texarkana  College, Texas A&M Commerce, and Texas A&M--Texarkana, where he earned  a Bachelor of Science in Business with a minor in computer science. In  1990, he married the love of his life, Lisa Singleton, with whom he has  shared many pets, memories, and accomplishments.\n\nAfter graduating, Gary began…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the map, consisting of approximately 2.5 acres of National       Forest System land located in the Apache-Sitgreaves National       Forests in Arizona.\n\n(2) Map.--\n\n(A) Minor errors.--The Secretary may correct minor errors       in the map.\n\n(B) Availability.--A copy of the map shall be on file and       available for public inspection in the appropriate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the Protect Children's Innocence Act, is led by the  gentlewoman from Georgia (Ms. Greene).\n\nThis bill prohibits genital and bodily mutilation and chemical  castration for a minor, which generally is anyone under the age of 18  years, while also preserving the exception for this care if there is a  legitimate medical need for certain procedures.\n\nAnother…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…depiction.--The term `intimate visual       depiction' has the meaning given such term in section 1309 of       the Consolidated Appropriations Act, 2022 (15 U.S.C. 6851).\n\n``(F) Minor.--The term `minor' means any individual under       the age of 18 years.\n\n``(2) Offense involving authentic intimate visual       depictions.--\n\n``(A) Involving adults.--Except…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Oregon.\n\n(2) Map.--\n\n(A) Definition.--In this section, the term ``map'' means       the map entitled ``The Dalles Conveyance Parcel A'' and dated       November 4, 2024.\n\n(B) Minor errors.--The Secretary may correct minor errors       in the map.\n\n(C) Availability of map.--A copy of the map shall be on       file and available for public inspection in…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…record and gang  ties. After he murdered Kayla, he left her on the floor, and he went to  Target with his half-brother to spend the $6 he stole from her. Then  because he was a minor, the Biden HHS proceeded to place him in a group  home with other children and enrolled him in a local public high school  without telling the high school that he was the prime…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "James Risch", "party": "Republican", "sentence": "…additional MDE items: two hundred eighty-eight (288) GBU-53/B       Small Diameter Bombs Increment II (SDB-II). The following       non-MDE items will also be included: major and minor       modifications; and other related elements of logistics and       program support. The estimated total value of the new items       is $124 million. The estimated non-MDE…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697685/arms-sales-notification"}]