[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "This relief will fund a crucial scale up of testing and a national strategy that allows us to begin to take steps to re-open our economy, provide critical funding for our health care workers and hospitals, and get more resources to our small businesses - including additional funding to address the needs of rural and minority owned businesses."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Women's Chamber of Commerce supports the Save America's Main Street Act because it will quickly and effectively assist small business owners - including women and minority owned firms - to have the cash they need to keep their doors open, communities functioning and families safe during this difficult time,\" said Margot Dorfman, CEO, U.S."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "We've added some new pots of funding for smaller communities, grants for mom and pop businesses as well as women and minority owned small businesses, but we need to do more to fix the underlying programs.\"\n\nSenator Reed is calling for Congress to accelerate work on the next comprehensive coronavirus rescue package."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Women's Chamber of Commerce supports the Save America's Main Street Act because it will quickly and effectively assist small business owners - including women and minority owned firms - to have the cash they need to keep their doors open, communities functioning and families safe during this difficult time,\" said Margot Dorfman, CEO, U.S."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "We know that minority owned businesses already face challenges in having equitable access to capital, pay higher interest rates and fees, and are less likely to be approved for loans."}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "Currently, the SEC small business advocate reports on small  businesses that are minority owned or women owned or in disaster- stricken areas."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "These local entities would in turn provide support to small businesses with less than20 employees and those located in low-income communities (defined as those eligible for theNew Markets Tax Credit), with a particular focus on businesses that are very small, minority owned, rural, or outside the mainstream banking system."}]