[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…consequential tool  Congress to has protect our Nation from a president or other public  official who has betrayed their oath, abused their power, and committed  high crimes and misdemeanors against the American people. Impeachment  necessitates a deliberate process of investigation and a thorough  documentation of crimes committed  against the American people.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…personalities may have you believe  and would have you believe, there is no requirement for the existence  of a constitutional crisis before impeaching for high crimes and  misdemeanors.\n\nBecause of the importance of this statement, I shall repeat it.  Contrary to what many status quo personalities would have us believe,  there is no requirement for the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…multiple times.\n\nA former GOP lawmaker in Arizona pled guilty to attempted election  fraud involving forged signatures.\n\nIn North Carolina, four people pled guilty on Monday to misdemeanors  for their roles in absentee ballot fraud in rural North Carolina during  the 2016 and 2018 elections to help Republican congressional  candidates.\n\nLet's not even get into…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…the  privileges of the House.\n\nThe form of the resolution is as follows:\n\nH. Res. 353: Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolution: Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolved, That Donald John Trump, President of the United…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…one person's.\n\nIt is important now for me to read a bit from H. Res. 939. It reads:  ``Impeaching Donald John Trump, President of the United States, for  high crimes and misdemeanors.''\n\nI have to pause a minute and say this. The President said just  recently that ``they will find a reason to impeach me.'' Mr. President,  we don't have to find a reason.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…clear that we can impeach, and we can impeach for  this type of behavior. It is not in these exact words. It uses language  that we are all familiar with: ``high crimes,'' ``misdemeanors,''  ``treason,'' or ``bribery.''\n\nYet, we have an authoritarian President who is defying the courts,  who does not respect the separation of powers. We have an authoritarian…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…understand why they would have engaged in the pursuit. This  bill would take that away and expand it open so that you could have  high-speed chases taking place with respect to misdemeanors.\n\nThis isn't a hypothetical for me. When I was the State's attorney in  Prince George's County, we actually had one of these. We had several,  but I will just pick one for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the  privileges of the House.\n\nThe form of the resolution is as follows:\n\nH. Res. 939. Impeaching Donald John Trump, President of the United  States, for high crimes and misdemeanors.\n\nResolved, That Donald John Trump, President of the United States, is  an abuser of presidential power who, if left in office, will continue  to promote the incitement…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…significant difference in crime rates between cities that  reformed their bail policies and those that did not.'' Similarly, after  Harris County, Texas ended cash bail for most misdemeanors, the result  was ``no corresponding increase in violent crime. After New Jersey  implemented bipartisan bail reforms, violent crime declined while the  jail population shrank…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…yesterday, voted to support  H. Res. 939, House Resolution 939. This resolution, H. Res. 939,  impeaching Donald John Trump, President of the United States, for high  crimes and misdemeanors.\n\nI rise to thank the 140 persons who supported this resolution.\n\nI rise to thank the 47 persons who did not oppose what we were doing  but chose to simply say: I will vote…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…reforms led to a 20 percent       reduction in violent crime while maintaining high court       appearance rates. In Harris County, Texas, ending cash bail       for most misdemeanors did not increase crime. A nationwide       study by the Brennan Center for Justice found the same       pattern across nearly two dozen jurisdictions: bail reform…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…border, often through cartel       organizations, by imposing the possibility of up to fifteen       years in prison for illegal aliens convicted of three or more       misdemeanors involving drugs or harm against others, or for       illegal aliens who attempt to reenter after being removed       three times. An illegal alien who commits a felony would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}]