[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…know the rules. We can't go  back. The FCC may not adopt a similar rule in the future. This is an  irreversible, self-inflicted wound. So I urge my colleagues to reject  this misguided, wrong-headed resolution. It would be a disgrace if we  deprive those students and their families of this vast resource, of  literally life-changing access to a really necessary…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Mr. Speaker, I thank the gentlewoman from California for  her leadership on this issue.\n\nI rise in strong opposition to H.R. 3633, the so-called CLARITY Act.  I believe this misguided legislation will have devastating impacts on  our financial stability, national security, and investor protection.\n\nWhile my Republican friends claim that this bill will…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693784/digital-asset-market-clarity-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…political violence defies American  values and democracy.\n\nUnfortunately, we have seen a disturbing increase in political  violence in recent years, seemingly, as part of a misguided and  sickening attempt to strike fear and intimidation in the hearts of the  American people and those who engage in public service.\n\nViolence and hate have no place in America.…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…protect our air, water, and human  health. The Trump administration is taking us backwards and hurting  hard-working families in the process.\n\nI firmly oppose the Trump EPA's misguided plan and will continue to  join Senator Whitehouse and my other colleagues in pushing back against  this administration's harmful agenda.\n\nOnce again, let me salute Senator…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…who go without health insurance may lack the healthcare that can  save costs of preventing more serious illness, and those costs  eventually are borne by all of us. So this misguided denial of the  certainty people need that healthcare insurance subsidies will be  extended beyond the end of the year really affects all of us. Premiums  are rising already…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans to bad actors  and scams. With the U.S. Department of Education's ability to provide  oversight in jeopardy, expanding program approvals for new programs now  is misguided.\n\nThe GI Bill is one of the most important tools we have to support the  long-term success and economic mobility of veterans. With that comes a  responsibility to ensure…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…testing again?\n\nFor these reasons, I introduced the RESTRAIN Act to prohibit the  resumption of explosive nuclear testing and prevent any funds from  going toward Trump's misguided policy.\n\nAmidst all this nuclear saber-rattling, the New START treaty that we  are here to talk about tonight, which is the last remaining arms  control agreement between…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…or $5,000 more per car just because of ill-suited  tariffs.\n\nSo I would hope that folks on both sides of the aisle will actually  stand up to ``America First.'' Reject this misguided tariff strategy.  Reject this demonization of Canada. Recognize that ``America First''  doesn't have to be ``America Alone.''\n\nThe only thing that could make my day actually…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…these decisions by his Secretary of Energy.\n\nAmerica can't look in the rearview mirror. We have to look forward to  America's new energy future, and the Department of Energy's misguided  decisions will really hurt American advanced manufacturing.\n\nOhio knows what it means to get left behind. We have seen the effects  of globalization. We have lived it. We…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691905/department-of-energy-project-cancelations"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…retirement savings.\n\nA small group of my Republican colleagues in the other body has moved  to vote to reclaim their congressional trade authorities in response to  the president's misguided tariff war on our friends in Canada, by  introducing legislation to reclaim Congress's authority in the face of  the president's recklessness. Mr. Speaker, it is time for…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…countless thousands of voters combined, the principle  that every voice counts equally in our political system withers. We  must, and we can, remedy the rot at the deeply misguided Citizens  United decision introduced into American politics.\n\nAs ranking member of the Committee on House Administration, the  committee with jurisdiction over campaign finance…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…value of the Medicaid program in northwest  Indiana and how it predominantly assists seniors, individuals with  disabilities, and children.\n\nIt is deeply regrettable that this misguided legislation will not  only strip away these healthcare benefits, but it also increases  private healthcare costs and reduces services for everyone.\n\nTake Jake, a high school…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691781/opposing-medicaid-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…extension  offers space within that relationship to lessen tensions.\n\nSecond, if not renewed, we risk the possibility that each side will  go beyond the treaty's limit in a misguided pursuit of geopolitical  advantage.\n\nThird, there is no nuclear strategic gain from deploying more  warheads on more delivery vehicles. Our massive, largely invulnerable…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…pension funds and 401(k) holdings. When is enough enough?\n\nWhen will the Republican majority stand up and tell him for once:  ``Mr. President, you are wrong. Your policy is misguided.''\n\nHe has imposed tariffs on Canada, Mexico, Japan, and the EU, our  friends. He has not imposed tariffs on Russia, arguing they are  negotiating with Ukraine, but he imposes…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689696/worldwide-tariffs"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…abortion advocates parading around Washington this week as countless  women suffer and die under extreme Republican abortion bans. Their  priorities are clear and profoundly misguided.\n\nI urge my colleagues to vote ``no.'' Mr. Speaker, I reserve the  balance of my time.\n\nMs. CHU. Mr. Speaker, I would like to point out that the previous  speaker said that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…in Washington, D.C.\n\nLast Congress in the 118th, I led a joint resolution of disapproval  alongside then-Senator JD Vance, now Vice President JD Vance, to repeal  this same misguided D.C. Council law. The resolution passed both the  House and the Senate with bipartisan majorities, yet President Joe  Biden foolishly vetoed our commonsense measure, underscoring…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with abundant resources, and not a  lot of people? That is the definition of rural America.\n\nThe previous administration was attacking rural America, and they  used these misguided resource management plans as their tool to do  that.\n\nMr. WESTERMAN. Mr. Speaker, as we wrap up today on this final RMP, I  include in the Record this GAO report that found…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…into the State that does the absolute worst when it comes to  jobs of any State in the country.\n\nSo why is that the case?\n\nIt is no mystery, Mr. Speaker. You can just look at misguided policy  after misguided policy which has served to discourage companies from  starting, discourage companies from adding jobs, discourage companies  from staying here, and…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Biden  administration allowed the fines to be paid to foreign governments and  elsewhere.\n\nSince my oversight shined the light on the Biden Justice Department's  failures and misguided approach, the Department of Justice inspector  general opened its own independent audit. And at my request, the  Government Accountability Office also agreed to review the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689937/national-crime-victims-rights-week"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…this body has voted down, on a  broad bipartisan basis, this amendment.\n\nThere is reason for that, Madam Chair. It has been voted down  repeatedly because, in fact, it is misguided, and it relies on facts  that simply aren't facts.\n\nI don't know about the author of this bill, where he got it, but I  can tell you this. I have stood in Lebanon with our…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693681/department-of-defense-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…tipped workers and  preserves opportunities for them to earn a good wage.\n\nThe bill creates a clear, commonsense definition of a tipped worker  and prevents future attempts by misguided activist judges and  bureaucrats seeking to implement policies that hurt workers' bottom  lines.\n\nThe Tipped Employee Protection Act also ensures workers earn at least  the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Subpart W and subject to fees, instead of under Subpart       C, consistent with other industries and congressional intent       around the netting provisions.\n\nRepealing this misguided rule is an important first step       towards providing industry with relief from one of the       previous Administration's anti-energy policies, and we       appreciate…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "John James", "party": "Republican", "sentence": "…pandemic.\n\nHe grew up in the Jim Crow South and moved to Michigan in search of  opportunity and for the American Dream. Tooth and nail, he fought  harmful regulations and misguided rules that would have prevented his  company from ever getting off the ground.\n\nMore than 50 years later, his son stands before the United States  House of Representatives…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise today in support of Chairman  Hill's resolution to overturn the CFPB's misguided overdraft rule.\n\nIn Wisconsin, community banks and credit unions are the backbone of  our local economies. They know their customers. They serve their  neighbors. They provide…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…having a distant and disinterested landlord with an agenda.\n\nThat is why I introduced H.J. Res. 60, a resolution that leverages  the Congressional Review Act to overturn this misguided rule. The  resolution is not just about restoring access to trails. It is about  standing up for the rights of my constituents, protecting local  economies, and preserving…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…straight into the ground. The CFPB  overstepped its regulatory authority in its pursuit of subjugating the  American economy in the name of consumer protection. This is another  misguided rule that we must render null and void.\n\nMr. Speaker, before I reserve, I want to take a moment to recognize  the good faith efforts of Speaker Johnson in helping maintain…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…reinvest in their families, communities, and businesses.\n\nThe House must swiftly exercise its constitutional responsibility to  oversee the District of Columbia and reject this misguided legislation  from going into effect.\n\nI urge my colleagues on both sides of the aisle to unite in support  of D.C. taxpayers and businesses and support this necessary resolution…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…in the Agriculture appropriations bill would have kept these  products out of the hands of children while preserving the hemp  industry for farmers.\n\nFor the sake of those misguided by my opponents on this issue, let me  clarify a few things: You will hear from some that this language would  have meant the total destruction of the hemp industry. Well,…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…of human nature. People respond to incentives and  rewards, which underscores the main problem with the ``once in, always  in'' rule. There is no incentive to invest.\n\nThis misguided regulation permanently classifies certain industrial  facilities as major sources, major sources of hazardous air pollutants  even after they have made significant investments…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Federal timber harvest revenue on  Federal land. Unfortunately, reduced timber revenue since the 1990s, as  a result of declining rates of timber harvesting, litigation, and  misguided environmental regulations, has drastically affected county  revenue, creating very real economic impacts in its wake.\n\nFranklin, Garland, Hot Spring, Howard, Johnson, Logan,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}]