[{"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Madam Speaker, I was necessarily absent and missed one  vote on the House Floor during the 5 p.m. vote series today. Had I been  present, I would have voted NAY on Roll Call No. 137.", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691486/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…beloved wife, Teresa, he was a father, stepfather, and proud  grandfather. His kindness, strength, humor, and work ethic touched all  of us.\n\nMr. Speaker, Gilbert will be missed.                        Sharing Sonia Talavera's Story\n\nMr. CORREA. Mr. Speaker, I rise today to express my deep concerns  over how healthcare costs are rising in our communities…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697343/recognizing-thanksgiving-food-drives"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "Ms. SANCHEZ. Mr. Speaker, I missed votes due to personal illness. Had  I been present, I would have voted NAY on Roll Call No. 317, No on Roll  Call No. 318, YEA on Roll Call No. 319, NAY on Roll Call No. 320,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697866/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I missed votes due to a personal matter. Had  I been present, I would have voted NAY on Roll Call No. 317, NO on Roll  Call No. 318, YEA on Roll Call No. 319, NAY on Roll Call No. 320,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697867/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Republicans decided to use some more precious floor time to  overturn a narrow and specific rule at the Glen Canyon National  Recreation Area. That is a disappointment, another missed opportunity,  and a testament to the priorities of this Republican majority. Mr.  Speaker, I again urge a ``no'' vote and yield back the balance of my  time.\n\nMr. HUFFMAN.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…States or eligible for any immigration benefits whatsoever. That  is an obvious point of political and moral consensus in our Chamber.\n\nHowever, I am afraid this is another missed opportunity for us to  work across the aisle in a bipartisan fashion because it departs  dramatically from the Judiciary Committee's traditional practice. This  bill is essentially…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…enter a prolonged government  shutdown. Workers across broad swaths of the Federal Government would  be furloughed, public services would be scaled back, paychecks would be  missed.\n\nMy Republican colleagues will only talk about those not getting  paychecks--and you can hear it already--instead of my Republican  colleagues having to defend the Department…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Mr. NADLER. Mr. Speaker, I missed votes due to a personal matter. Had  I been present, I would have voted YEA on Roll Call No. 335 and YEA on  Roll Call No. 336.                             personal explanation", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698157/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I missed Roll Call votes 130 through 131.  Had I been present, I would have voted NAY on Roll Call No. 130 and YEA  on Roll Call No. 131.                             PERSONAL EXPLANATION", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691370/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "Mr. SMITH of Washington. Mr. Speaker, I missed today's votes due to a  flight cancellation. Had I been present, I would have voted NAY on Roll  Call No. 213 and YEA on Roll Call No. 214.                             PERSONAL…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693970/improving-access-to-small-business-information-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "Ms. TITUS. Mr. Speaker, I was absent from the floor and missed the  roll call votes. Had I been present, I would have voted: YEA on Roll  Call No. 315 on the Motion to Suspend the Rules and Pass S. 356--The  Secure Rural Schools Reauthorization…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697672/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I was necessarily absent and missed three  votes on the House Floor during the 1:30 p.m. series today. Had I been  present, I would have voted NAY on Roll Call No. 134, NAY on Roll Call  No. 135, and YEA on Roll…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691441/accelerating-networking-cyberinfrastructure-and-hardware-for-oceanic-research-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…life to serving his  community and our Nation and stood for what was fair and just, as did  our former Presidents John and John Quincy Adams.\n\nCongressman Connolly is deeply missed, and the remaining members of  the commission greatly appreciate his work and the work of my  Massachusetts delegation colleagues, first Bill Delahunt, who we lost a  couple…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…eye-opening and heartbreaking for all of us.\n\nDaniel Rascon was stopped by agents and then had his car shot at by  them. They were attempting to kill him. Miraculously, they missed. His  car was full of bullet holes.\n\nI will never forget the fear and having to quickly duck my       head as the shots were fired at the passenger's side of the       car.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Retention Waterfall to help veterans impacted by the COVID-19 pandemic.  During this emergency, Congress and the VA rightfully allowed borrowers  to request forbearance and allowed missed payments to be added to the  end of the loan term.\n\n``Upon expiration of this pandemic program, VA used this authority to  end borrowers' ability to push missed payments to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…in a better future for all Americans. May her  memory be a blessing, especially for her husband, Stephen; her  children; and her beloved grandchildren.\n\nNita will be sorely missed.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689209/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…long life that he was given to accomplish so much more. His life of  courage, sacrifice, and compassion served as an inspiration to all who  knew him, and he is dearly, dearly missed.\n\nMy prayers and concerns and care are with his children Janet, Doug,  and Brian, his many grandchildren, great-grandchildren, and great- great-grandchildren--the entire Sharp…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, I missed the first roll call vote in  today's vote series due to an important meeting with constituents. Had  I been present, I would have voted YEA on Roll Call No. 58.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688516/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Garrison Keeslar drained a jumper with  11 seconds left in overtime, the Mocs' opponent, UC Irvine, launched a  Hail Mary pass to their player on the opposite baseline, who missed his  shot at the buzzer. This error delivered a well-deserved National  Championship to the UTC men's basketball team--the first ever in the  program's history.\n\nThe UTC Mocs…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690281/congratulating-the-nit-national-champions-the-utc-mocs"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Mr. Speaker, I missed a series of votes.\n\nHad I been present, I would have voted YEA on Roll Call No. 286, YEA  on Roll Call No. 287, and NAY on Roll Call No. 288.                             personal…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696776/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…his selfless, tireless, and dedicated service to  the Citizens of Jackson Township, York County, Pennsylvania. His  leadership, professionalism, and fidelity will be greatly missed, and  his service sets the standard for all to be judged.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…legacy, positioning the institution as an  indispensable force in countering authoritarianism and fostering  democratic renewal worldwide.\n\nHer leadership and commitment will be missed greatly at Freedom  House, as her mark of excellence will be recorded in the historical  annals and remembered by all who have witnessed her profound impact. On  behalf of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…with everyone.\n\nWhen the stakes are the highest, he always delivers results. I have  watched Arjun take on the toughest challenges and find solutions that  other people have missed. That is exactly what Social Security needs  right now in our Nation because for 90 years, Americans have relied on  Social Security--not just for income but for the independence…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697577/department-of-defense"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…committed to finding  the best path forward for the institution in service to its Members,  staff, and the taxpayer.\n\nI am fortunate to have worked with Derek and know he will be missed  by many House Members and staff. Derek has been a consummate steward of  the institution and a willing partner to everyone who wants the House  to work well for the American…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…sudden. It hurts. It leaves an  undeniable void. His legacy, one built on honor and commitment, will  live on in the hearts of those whom he had an impact on.\n\nBilly will be missed by his sister, Robin; his children, Skylar,  Caitlin, and Emery; three beautiful grandchildren; and scores of  friends and coworkers.\n\nBilly, first and foremost, was a man…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…of those senses of humor that you loved.\n\nDoug was a friend to all and someone you could always count on for  leadership, loyalty, and just a good laugh. He will be deeply missed in  the Halls of Congress.\n\nMy prayers are with his wife, Jill, his children, and all of his  family and loved ones during this incredibly difficult time.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698738/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "Mr. GRAVES. Madam Speaker, I missed a series of votes today. Had I  been present, I would have voted YEA on Roll Call No. 215 and YEA on  Roll Call No. 216.                             PERSONAL EXPLANATION", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694003/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…quotes, and NASCAR. They understood  his dislike of food waste, smartphones, and ketchup on hot dogs.\n\nDoug's sense of humor, collegial manner, and expertise will be sorely  missed. While he is no longer with us, Doug's significant contributions  to agricultural and rural policies will endure long after his passing.\n\nI will very much miss my friend and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698725/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, I have missed all of you. I don't know  if you missed me.\n\nWe are going to actually try something tonight, and some of what we  are going to do this evening is a little bit complex. It is…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "John Rose", "party": "Republican", "sentence": "…deserve answers, and they deserve to know how  such a monumental fraud was allowed to fester in the shadows for so  long. My amendment requires a report on how this fraud was missed, what  red flags were ignored, and what fixes are needed to prevent this from  ever happening again.\n\nThe House passed my amendment last Congress. Unfortunately, it was  not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]