[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…great State that I serve and that Ms. Boebert  serves, that Mr. Hurd serves, and my other colleagues in the Colorado  congressional delegation deserve.\n\nI think what is perhaps missing from this debate, and it is important  for us to level with the American people, is: Why are we here? Why,  despite all the reasons that this bill makes a whole lot of sense?…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…capabilities that  NASA brings to bear in developing technology to protect aviation safety  and the competitiveness of our aeronautics sector.\n\nThat is clearly an important missing aspect of the FAA--having the  best technology and the best understanding of how that technology  impacts aviation safety. So I support more partnerships here. I also  want…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…through  oppression, fraud, and violence. They left in control the same security  apparatus that violates people's rights. They preserved the same  corrupt cartel state.\n\nAm I missing something here? From what I can tell, the President put  our troops in harm's way without congressional consent, all so that he  could replace one dictator with another dictator.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…grateful for the leadership of  Congresswoman Ramirez, who has led with her own lived experiences and  her compassion. She leads with compassion, which I think is sometimes  missing here in this Chamber.\n\nMr. Speaker, Republicans are advancing, as we all know, a budget that  includes $880 billion in cuts to Medicaid to pay for tax breaks for  billionaires.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pull together the partners--the House, which has been out of session.  And I came from the House. I don't think I ever saw anything like this  where they literally have been missing in action for weeks. As a matter  of fact, for our August break, they left in July. This is  unprecedented, and we need them back at the table. They need to do the  work.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…fire 12 percent of Social  Security employees, close 26 offices, and slash phone services.  Commerce Secretary Howard Lutnick recently said his family wouldn't  complain about missing a Social Security check and that the only people  who would are fraudsters.\n\nWell, Mr. Lutnick's family might be able to afford to lose a payment  or two, but most Americans…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689232/seniors-need-social-security"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…available online has increased 900 percent--900 percent--since 2019.  Such videos have been viewed almost 4 billion times--4 billion.  According to the National Center for Missing and Exploited Children,  the number of AI-generated child sexual abuse images increased from  5,000 in 2023 to over 485,000 in the first 6 months of 2025.\n\nTragically, currently,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "Mr. STANTON. Mr. Speaker, I rise on the National Day of Awareness for  Missing and Murdered Indigenous Women and Girls to express my outrage  over more broken promises.\n\nIn my home State of Arizona, we are mourning the death of 14-year-old  Emily Pike,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…event.\n\nJulia Daniel, our chief of staff, retired from Active-Duty Marine  Corps service halfway through her time with JCCIC and came back onto  the team as a civilian without missing a beat. A veteran of six  inaugurations, her meticulous attention to detail improved all our  plans, and her calm professionalism and decisive leadership preserved  essential…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…total exceeds the $242 million       discussed here.                              Online Ad Spending\n\nDigital ads are another form of dark money spending that is       often missing from FEC data, and data from the largest online       platforms shows that hidden sources spent $315 million. Like       TV ads, online ads can avoid disclosure requirements…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…years  ago, and it is time that we move it into the 21st century.\n\nFor all of the people who have said that I should resign because I  can't do my job, they are completely missing the point. I am absolutely  capable of doing my job, but because I am a woman and because I chose  to have a baby, I have been prevented from doing so.\n\nMr. Speaker, I thank…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…to highlight the value of the Women's History Museum. Karen  Staser founded the museum in 1995 with the aim of addressing the  significant amount of women's history that was missing from our  Nation's Capital and museums, including the Smithsonian Institution.\n\nDuring the museum's startup years, the museum's first project was to  oversee the restoration…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…your  father was taken by ICE. In the precious days he spent with you, he  cared for you  with so much love and devotion. I am heartbroken that as the days drag  on you are missing out on his voice soothing you, his arms cradling you  back to sleep. There is no doubt he loves you deeply. His absence has  nothing to do with you.\n\nInstead, it is the work…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700186/state-of-our-union-is-traumatizing-our-children"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…individualized pathway to overcome employment  barriers caused by service-connected disabilities, but with wait times  weeks, or even months in some areas of the country, veterans risk  missing out on the program's benefits.\n\nRepresentative Dexter's bill would make it easier for veterans to  find employment while in the program and to graduate faster from the  program,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…his family. On December 5, tragedy  struck. The Gomez family woke up to the smell of smoke.\n\nOtoniel jumped out of a second-story window to escape the fire. Then,  without missing a beat, he grabbed ladders to help his wife and  children climb to safety.\n\nThanks to his bravery and quick thinking, the entire Gomez family,  including their dog, Lyka,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…say: People should have the choice. They should with their own  money.\n\nThe fact of the matter is, when we looked at some of the data of the  7 million prime-age males who are missing in America, we have a data  set that says about one-half of that population may be missing from the  labor force. They are missing from the American labor force not because…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…behavioral health care and resources for                personnel wellness. Sec. 603. Comptroller General study on Coast Guard efforts to reduce                prevalence of missing or incomplete medical records and                sharing of medical data with Department of Veterans                Affairs and other entities. Sec. 604. Comptroller General…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Just for the record, Mr. Speaker, he has never voted for me. He is not  a member of my political party, but we are still very good friends. I  think that is something that is missing in this country.\n\nWhen I was mayor of Knox County, I would always invite a bunch of  young people from the office to go down to Calhoun's, and we would all  eat a bunch of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…and moving  along, he took it upon himself to go to a local store, purchase a  proper lock, and install it himself, giving this resident the peace of  mind that she had been missing.\n\nThis story is just one example of the many behind-the-scenes ways  that our local law enforcement serves their communities every single  day. Officer Hobson's actions reflect…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…implications of how  many of our brothers and sisters are choosing to take retirement at age  62, when for years we have been looking at there are, like, 7 million  prime-age males missing from the labor force.\n\nThat was actually one of the controversies when we were trying to do  some of the reforms in Medicaid, saying that should we ask folks to at  least…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…on these tax credits.\n\nThat is why I believe that doing nothing is not an option, and I have  made no secret of the fact that I think the House of Representatives  has been missing in action in a lot of ways in recent months.\n\nThe House was literally not here for a period of almost 2 months. The  Speaker inexplicably canceled session for 6 consecutive…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…20 years. And this is  just the goal.\n\nThere have been a number of goals in the past, in the tortured 17- year history of this project, and they have blown right past them,  missing deadline after deadline with more cost overruns than we can  even keep track of.\n\nThen, finally, when you look at what his goal--which is very unlikely  to actually be reached--is,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…other one-half, the High-Quality Charter School Act, and  a tax provision contained therein, would triple the number of kids in  charter schools across the country remains missing still.\n\nI am encouraging my colleagues to ensure that we provide support for  charter school families in equal measure in a way that will expand  opportunity across the country.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691230/universal-school-choice"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…show that most beneficiaries  don't fully understand how their claiming decisions will affect their  monthly benefits. As a result, there are many seniors today who may be  missing out on substantial retirement income because of suboptimal  claiming decisions they made.\n\nMr. Speaker, that is where the Claiming Age Clarity Act comes in. My  bill would…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697234/claiming-age-clarity-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…conservative nonprofit groups to come together  to address such a problem. Yet, this isn't surprising. The number of  children born into families without a mother or father at home, missing  one, is very high. When I was a child, that number was around 4 percent  to 5 percent. It is now around 42 percent.\n\nThese groups have gotten together to call on President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…that could always find the positive  and the funny about whatever we were doing.\n\nWe are a body of 431 right now. At our best, we are a body of 435. It  is the one that we are missing that can make a difference, and that was  Doug. He will be missed for a very long time by all of us.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698722/9999"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Mr. CLINE. Mr. Speaker, on this Memorial Day, we do more than  remember. We honor the men and women who gave everything for this  Nation. We remember the fallen, those still missing in action, those  lost at sea, and the thousands who now rest beneath our flag, having  paid the ultimate price for our freedom.\n\nThese heroes answered the call to defend…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…international news organizations has       found that over the past decade, family members of Uyghurs       and other minority groups living outside of the PRC have gone       missing or been detained to force Uyghur expatriates to       return to the PRC or silence their dissent.\n\n(12) In 2017, Radio Free Asia's Uyghur Service was the       first media…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…story that I will tell in advance of this is simply this: I woke  up in Walter Reed Army Medical Center not too far from here a number of  years ago, and when I woke up, I was missing two legs and a finger. I  had been out of consciousness for a week plus.\n\nWhat I woke up to was being on a laundry list of medications. I had  an epidural. I had oral morphines…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692956/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…three dozen teens have taken their lives in recent cases,  with boys aged 14 to 17 hit hardest. Reports of these horrible crimes  are surging. NCMEC, the National Center for Missing and Exploited  Children, reports that financial sextortion cases jumped from over  13,800 in early 2024 to nearly 24,000 in early 2025. The FBI logged  nearly 55,000 sextortion…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698863/combating-online-predators-act"}]