[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…necessarily absent for rollcall  vote No. 635, the motion to invoke cloture on the nomination of Robert  Chamberlin to be United States District Judge for the Northern District  of Mississippi. Had I been present for this vote, I would have voted  no.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697647/vote-explanation"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…treasure that will be put at risk.\n\nNow, Donald Trump, buffeted by dozens of election losses all across  the country from Virginia to New York to New Jersey to California to  Mississippi and Georgia, sinking in the polls like a stone because of  his catastrophic unconstitutional tariffs and his complete destruction  of the healthcare system of the country,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698444/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the same. Maybe it is like you have two  Jack Ryans or, more commonly, it is done to Hispanic names, where they  say: Hey, there is the same name in Georgia as there is in Mississippi,  so we will purge this name.\n\nI mean, it is hostile purging, and people don't know that they are no  longer registered until they go to the polls to vote, and then it is…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…children. As a librarian, she was a strong advocate for reading,  initiating the Reading is Fundamental, RIF, program in 1973, delivering  books to children throughout Alabama, Mississippi, and Tennessee. It is  a program that still serves children in Selma and Dallas County and  Alabama's rural Black Belt today.\n\nNancy Sewell was a trailblazing civic leader.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I greatly respect the representation  made by my colleague and friend from Mississippi, the chairman of the  Armed Services Committee, and Senator Risch, our colleague, chairman of  the Foreign Relations Committee about timing.\n\nI want to talk about timing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…historically  been left behind.\n\nI know this is not just unique to Alabama. We see it in South  Carolina. We see it in Massachusetts, as my colleague just spoke about.  We see it in Mississippi, Georgia, and other places as well, where  Black residents face higher rates of those chronic, preventable  diseases and illnesses such as hypertension and diabetes. They…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I rise in support of the  resolution.\n\nI am proud to be an original cosponsor of the resolution, and I thank  my colleague from New York for having the moral…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698244/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I thank the gentleman from  Massachusetts (Mr. McGovern) for yielding time.\n\nMr. Speaker, Republicans are openly bragging about how the bill kicks  children…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693217/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, we are here in the dark of  night because President Trump has one goal: to pass massive tax cuts  for billionaires by cruelly stealing healthcare away from…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, like Hitler, Mussolini, and  Saddam Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I rise today to recognize  the Honorable Gene L. Dodaro upon the completion of his term as the  eighth Comptroller General of the United States. During his…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…an  accomplishment that cemented his legacy in the sport.\n\nDr. Butler was not just a fighter in the ring. He was also a fighter  for education and equality.\n\nGrowing up in Mississippi, he faced the harsh realities of poverty  and racism. His mother, determined to give her family a better future,  moved them to Grand Rapids, where Dr. Butler found his…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…were left untreated.\n\nIf Republicans truly cared about TANF oversight, they would have  spoken out when millions of TANF dollars were stolen from struggling  families in Mississippi to build a volleyball stadium and when the  Trump administration stepped in to shield the perpetrators from  accountability. Instead, they were silent.\n\nThe bottom line…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…elected to represent, they are going to stand to lose a great deal. The  States with the highest spikes in energy prices are going to be South  Carolina, Kentucky, Oklahoma, Mississippi, and Louisiana under this  bill. We are taking out the alternatives that could have helped them  moderate the prices in those States.\n\nAnd the States with the largest job…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…grace, wisdom, endurance and love. That said, on behalf of the 7th  District of Illinois, I congratulate and commend Mrs. Pough on this  incredible milestone.\n\nBorn in rural Mississippi in 1926, Mrs. Pough migrated alongside her  husband from the south to Chicago's West Side neighborhood of ``K- Town'', where together they built a strong foundation and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Madam Speaker, I rise today to recognize two exceptional  members of the United States Coast Guard from Port Security Unit 308 in  Gulfport, Mississippi.\n\nBoatswain's Mate First Class Bradley Walker has been awarded the  Commander Ray Evans Outstanding Coxswain Trophy, one of the highest  honors given to a Coast Guard boat…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690914/recognizing-bm1-bradley-walker-and-mk1-james-lang"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…as a champion for the city of Memphis. Personally, I will  remember Fred Smith as a man who loved his country and devoted his life  to the American Dream.\n\nBorn in Marks, Mississippi, and raised in Memphis, he was very proud  of his country. Fred Smith was a true patriot, serving honorably as a  captain in the United States Marine Corps in Vietnam. After…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…levees,  devastating communities, businesses, and the livelihoods connected to  those businesses. More than 15 million acres of farmland were  underwater. Barge traffic on the Mississippi and Missouri Rivers  stopped for 2 long months. A quarter of a million residents in Des  Moines went without running water for 11 days. At least 54,000 people  were evacuated.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…rise to recognize an extraordinary  public servant from Jones County, Mr. Paul Sheffield, whose career  reflects a lifetime of dedication to the safety and well-being of  Mississippi families.\n\nPaul began his public service in 1998 with the city of Laurel's  traffic maintenance division. By 2001, he was serving as a police  officer in the town of Sandersville…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Lifeteam, Macomb, Illinois;       Joseph Ketcham, Paramedic Supervisor, MedicWest, Las Vegas,       Nevada; PJ Lowe, Advanced EMT, American Medical Response,       Jackson; Mississippi; Matt Magiera, Paramedic, Medstar EMS,       Summerdale, Alabama; Beau McFarlin, Flight Paramedic, Air       Evac Lifeteam, Marion, Illinois; Alexander Megquier,       Paramedic,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "Mr. KELLY of Mississippi. Mr. Speaker, I thank the gentleman for  yielding to me.\n\nMr. Speaker, America is safer today. A narcoterrorist and an  illegitimate government leader, Nicolas Maduro, is…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…making this up--we found out that there are 2.8 million people on  Medicaid who are double-dipping in America. They are either signing up  for Medicaid in Louisiana and Mississippi double-dipping or signing up  for Medicaid in Louisiana and they are signing up for the Affordable  Care Act subsidies. That is called cheating.\n\nOur bill would put an end…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today to recognize a remarkable  milestone for a cornerstone of faith and service in south Mississippi.\n\nThis year marks the 35th anniversary of Abundant Life Evangelistic  Church in Biloxi, Mississippi. For more than three decades, this church  has been more than a house…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, on February 25, 1846, beleaguered  residents of Nauvoo, Illinois, began leaving their homes and farms  behind, crossing the frozen Mississippi River by ferry and wagon to  escape persecution. Only the sickest and poorest remained behind, and  even they were finally forced out by mob action. All crossed Iowa to…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…releasing the shackles off of energy production  so that we can provide the things that our country and our economy  need.\n\nThat is why I really appreciate the gentleman from Mississippi (Mr.  Ezell) for bringing this bill forward.\n\nMr. Speaker, our country is at a point where we need more energy and  every form of energy when we look at the demands for…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…danger, law enforcement and first  responders run toward it. They fight crime, protect the innocent, and  too often, make the ultimate sacrifice.\n\nDuring my time in Congress, Mississippi has lost too many heroes: In  June 2023, Madison Police Officer Randy Tyler was shot and killed while  responding to a hostage situation. In January 2024, George County…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…He should. And if the minority leader  wants to object, we will just grind it out all night and get it done.\n\nMr. SULLIVAN. Mr. President, I yield to my good friend from  Mississippi.\n\nMr. SULLIVAN. My good friend from Mississippi, the chairman of the  Armed Services Committee, by the way--a Senator who knows probably more  about the military than anyone…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. The following Senators are necessarily absent: the  Senator from Mississippi (Mrs. Hyde-Smith), the Senator from Louisiana  (Mr. Kennedy), and the Senator from Mississippi (Mr. Wicker).", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696454/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…recognize not only those fallen heroes, but also the families, friends,  and loved ones who share in their sacrifice and carry the weight of  their loss.\n\nIn my home State of Mississippi and across the country, law  enforcement officers serve on the frontlines with unwavering  dedication. Despite increasing challenges and adversity, they show up  every day--facing…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…show their support for, and say thank  you to our local law enforcement heroes.\n\nMr. Speaker, I urge my colleagues to support this resolution. I thank  the gentleman from Mississippi (Mr. Ezell), who served in law  enforcement as a sheriff, for his work in putting this together and  sponsoring the resolution.\n\nMr. JORDAN. Mr. Speaker, let's be clear:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}]