[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…decided that we should not put more machine  guns into the stream of commerce.\n\nWhat is still swept within it? Any explosive, incendiary, poison gas,  bomb, grenade, rocket, missile having explosive or incendiary charge of  more than \\1/4\\ ounce, mine, device, and so on.\n\nWhy would we open this up if that is not the intention of my  colleague? I take…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…fighting for their toxic  exposures to be seen and addressed.\n\nI am thinking especially about my constituents who were stationed at  Camp Lejeune or the intercontinental ballistic missile, ICBM,  community, who suffer from cancer rates above nationwide averages;  those who were exposed to radiation while working at the Nevada Test  and Training Range; and veterans…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and harm U.S.  interests, not only in the region but here at home and in other parts  of the world? How much damage could U.S. military action do to the  Iranian nuclear and missile programs, and for how long would it set  them back? And, most important, what was the risk that such a bombing  campaign could escalate into all-out war?\n\nDays passed, no…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…treaty--to help reduce the risk  of a nuclear war, whether due to a false alarm, error, or other  misperception. For example:\n\n* Creating joint early warning centers to monitor missile       launches;\n\n* De-targeting, so any accidental launch of a nuclear armed       missile lands in the ocean;\n\n* Removing all nuclear weapons from high-alert status;\n\n* Reducing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the Committee rejected an  amendment by the gentleman from California (Mr. Garamendi) to restrict  funding to create a new land-based nuclear delivery system, the  Sentinel missile, a $180 billion boondoggle he has called an endless  money pit.\n\nThe threat of nuclear war is an existential one. We have a moral  imperative to address it and address it…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…welfare, training,  climate, readiness, and professional development of over 1,000  personnel. Her leadership was instrumental in ensuring the effective  execution of critical missile warning and intelligence, surveillance,  and reconnaissance missions worldwide. Moreover, she played a vital  role in supporting the numerous wings, mission partners, and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…energy efficiency, removed.\n\nWhere did the money go? It went into nuclear weapons programs, the  Sentinel program. Over $200 billion will be spent replacing the  Minuteman III missile. Why? Why are we doing that? Why are we putting  more money into plutonium pit production? Why do we have a new useless  rocket that we want to put on a submarine? Why are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694925/energy-and-water-cuts"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…region, are the following military assets: Three Arleigh Burke-class  destroyers, the USS Gravely, Jason Dunham, and Sampson; the USS Lake  Erie, a Ticonderoga-class guided missile cruiser; the USS Newport News,  a nuclear attack submarine with torpedoes and Tomahawks; the USS Iwo  Jima, an amphibious assault ship equipped with a flight deck for F-35s,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Trump's most significant military priorities, called Golden Dome. In  Canada, they call it Continental Shield. They have a different name for  it, but it is the same thing; it is missile defense for North America.  And we are trying to get Canada to heavily invest, as they should, to  try to provide missile defense in North America. It is much harder to  convince…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…support that  they have earned.\n\nNew Mexico is home to a strong and proud veteran community with a  deep military tradition, spanning from Holloman Air Force Base to White  Sands Missile Range and from Kirtland Air Force Base to Cannon Air  Force Base.\n\nWe owe it to those who have served to ensure that they can access  healthcare, reliable transportation,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Israeli military  campaign in Gaza that has killed approximately 70,000 Palestinians, I  do not support. To be clear, I have always supported and continue to  support cooperative missile defense programs like Iron Dome because I  believe that no child--Israeli or Palestinian--deserves to have  missiles fall on their heads. However, this NDAA goes beyond support…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…not be safer.\n\nInstead of doing the hard work of diplomacy, we are being asked to  plow billions of taxpayer dollars into a dangerous fantasy: the so- called Golden Dome, a missile defense system. We will be safe. We will  build more bombs, and we will stop their bombs.\n\nWe are told the system would cost only $175 billion and it will  provide the perfect…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…make a big  difference.\n\nPresident John F. Kennedy, a Navy man and the only President ever  awarded the Purple Heart, understood exactly what to do when faced with  the Cuban Missile Crisis perpetrated by Communist Russia one-half  century ago. He blockaded the region.\n\nThis country has the strongest defense ever known to humankind. We  can protect ourselves…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…The President has made threats, endorsed insanely  expensive plans to expand our arsenal, pushed for the resumption of  explosive testing, and advocated for an impractical missile defense  system that will only encourage our adversaries to accelerate their own  weapons program.\n\nI am particularly horrified that the President may choose to ignore  the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Ohio. I  think he is wrong. I think we should exempt small businesses and let  them know that they are not going to be driven out of business by this  still-unplanned guided missile heading right toward every Main Street  in our country that is going to be destructive of the hard-earned  success those small businesses have had.\n\nMr. MARKEY. Mr. President,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…the gentleman brings up, Sweden canceled 12 of 13 offshore  projects on their side toward Russia because it would delay detection  by 1 minute. The time needed to detect a missile would go from 1 minute  to 2 minutes because of that interference.\n\nNow, we stand here, closest to the shore. We absolutely should make  certain that these windmills are not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…thousand Mine  Resistant Ambush Protected vehicles, a lifesaving action that protected  countless troops serving in Iraq and Afghanistan.\n\nDave's contributions to our Nation's missile defense capability are  equally extraordinary. As Product Manager for the Sentinel Radar System  following the September 11th attacks, he rapidly deployed teams to  support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…the Department  of Defense to begin evaluating pulse laser capabilities and to brief  Congress within 90 days on its feasibility against drone swarms in the  near term and missile threats in the medium term.\n\nDrone swarms and hypersonic weapons are advancing rapidly,  overwhelming traditional defenses. Kinetic interceptors are costly, and  continuous-wave…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695156/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Helicopters (remanufacture); twenty-two (22) T700-GE 70 1D       engines; thirty-six (36) remanufactured T700-GE 701D engines;       twenty-seven (27) AN/AAR-57 Counter Missile Warning Systems       (CMWS); eighteen (18) Embedded Global Position Systems with       Inertial Navigation (EGI) with Multi-Mode Receiver (MMR);       thirty-six (36) remanufactured…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…investments in the One Big Beautiful Bill Act, investments  that reaffirm President Trump's commitment to peace through strength.\n\nThis bill delivers $25 billion for the Golden Dome missile defense  system, our answer to hypersonic and NextGen threats from adversaries  like China and Iran.\n\nIt expands our naval fleet, restocks our munitions, modernizes our  nuclear…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Once again, they are misleading the American people. I invite you to  read it closely. They may allow our sailors to defend themselves if  these Houthi terrorists shoot a missile or a drone directly at their  ship, but it absolutely ties the President's hands if, for instance, we  have intelligence about a senior meeting of Houthi terrorist leaders.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "James Risch", "party": "Republican", "sentence": "…300,000 people  across various roles, like chip design, electronic automation, and  manufacturing. DRAM is also a vital asset to America's national  security. Every fighter jet, missile defense system, and intelligence  operation depends upon the reliable, secure, domestically produced  memory technology inspired by Dr. Dennard's original invention.\n\nAs we…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691716/recognizing-national-dram-day"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…support our warfighters.\n\nSince assuming command in July, Colonel Lewis has overseen more than  1,500 personnel, who perform critical work repairing and modernizing  the air and missile defense systems that allow the U.S. military to  remain the most technologically advanced and lethal fighting force in  the world.\n\nBeyond supporting our warfighters across…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…received a master's degree in management from Embry- Riddle University.\n\nWhen he retired from the military as a Colonel, Mark served as the  Director of Strategy for Raytheon Missile Systems in Tucson, Arizona.  In 2010, he and his family moved to Texas, where he became the Program  Director of Tactical Intelligence Systems for Raytheon. In this role,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "James Risch", "party": "Republican", "sentence": "…or M-Code\n\nOne (1) AIM-120 AMRAAM Instrumented Test Vehicle\n\nNon-Major Defense Equipment:\n\nThe following non-MDE items will also be included: AMRAAM       control sections, missile containers, and support equipment;       Common Munitions Built-in-Test Reprogramming Equipment       (CMBRE); ADU-891 adapter group test sets; KGV-135A encryption       devices;…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690571/arms-sales-notification"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…throughout the Middle East as  we speak--some on large, established bases, others on isolated  outposts. It is impossible to ensure all of these locations have  adequate air and missile defense capabilities.\n\nOur troop presence in the region is therefore a significant  liability, allowing Iran and its proxies an opportunity to target  Americans, which they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Law 104-172; 50       U.S.C. 1701 note) requires the imposition of sanctions with       respect to Iran's illicit weapons programs, conventional       weapons and ballistic missile development, and support for       terrorism, including Iran's Revolutionary Guards Corps.\n\n(2) The Government of Iran has acquired destabilizing       conventional weapons…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…true in property development is  also true in military procurement. There is no way around it. Take the  Golden Dome for example. Building anything close to a continental  missile defense shield will, by reasonable estimates, cost several  times more than was allocated this year in one-off reconciliation  spending, every year, for decades to come.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…non-MDE items       will be included: spare and repair parts; storage and aging;       surveillance firing; stockpile reliability; shared and       country-unique PATRIOT PAC-3 Missile Support Center support;       operator and maintenance support; test program set       development process support; publications and technical       documentation; personnel…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699127/arms-sales-notification"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Nebraska as well as nearby Colorado and  Montana. That Chinese gear was clustered near sensitive military  assets, including Nebraska's Offutt Air Force Base and our nuclear  missile silos.\n\nThen, just 4 years ago, U.S. intelligence officials sounded the  alarm. Their investigations found that Huawei could secretly access  mobile phone networks around…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}]