[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…think are hallmarks of the decline of a democracy and that ought  to be sounding a three-alarm fire for the American people. Let me begin  with a few of them.\n\nFirst is the misuse of the military at home and abroad. When a  President begins to use a military for unpurposeful purposes, when a  President deploys American forces in violation of the law…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…seeing him, as you know well in your home State, deploying  troops to intimidate Democrats. I listened to you late last night talk  about what is happening in Portland. The misuse of this kind of power  should be frightening to every single American. We need to stand up,  and we need to call it out, which is what you are doing today. Even  dictating…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Program by  holding all accredited, nonprofit land trusts participating in the  Program to the highest possible standards. In addition, it implements  safeguards to prevent misuse of the Program and allows the U.S. Forest  Service or State to reclaim easements if a land trust falls into  noncompliance with the Program.\n\nBy unlocking new opportunities…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…in sensitive areas for the cultural sites,  native wildlife, and other natural resources that the Park contains.\n\nH.J. Res 87, H.J. Res. 88, and H.J. Res. 89 all attempt to misuse the  Congressional Review Act (CRA) process to overturn decisions at the  Environmental Protection Agency (EPA) to reduce air pollution. Under  the Clean Air Act (CAA), California…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…especially around climate change, racial justice, and the rise  of misinformation. The goal was to equip students in communities with  tools to recognize and challenge the misuse of demographic data, data  increasingly weaponized to justify political extremism and division.\n\nDoes that sound familiar? You bet it does.\n\nSUNY campuses, the State University…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…wrote a letter to Secretary Noem  and Secretary Rubio, which I will share with my colleagues.\n\n``I write today to express my grave concern over the administration's  apparent misuse of obscure provisions in our Nation's immigration laws  to deport or detain indefinitely individuals without due process.  Independent of whether a noncitizen is guilty of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691184/letter-to-secretary-noem-and-secretary-rubio"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…shortly  after the government funding bill was released. The brazenness of this  corruption kind of takes your breath away. I immediately blew the  whistle about this awful misuse of taxpayer money and alerted the  press. Once the public learned of the heist, they were outraged and  Members of Congress couldn't distance themselves from it fast enough.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697046/unanimous-consent-requests"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…subject to Federal consumer  financial protection laws, but Consumer Financial Protection Bureau  supervision is a key tool to ensure that Big Tech follows the law and  does not misuse consumer data and that consumers are not being scammed,  defrauded, or unlawfully debanked.\n\nThis rule allows the Consumer Financial Protection Bureau to also  conduct routine…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…one piece of a broader fight. It is one I have been in  for years, and I will not stop fighting. We will end violence against  women, address coercive control, and stop the misuse of technology to  harm survivors.\n\nLet me be clear. This bill should already be law. It passed the  Senate unanimously. It was included in Congress' year-end package last…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…harm the brain, changing the way people see and  interact with the world.\n\nWe know that young people who experience trauma have a shorter life  expectancy, are more likely to misuse drugs, attempt suicide, commit  violence, or not graduate from high school. By providing Joliet  firefighters with the tools to help individuals facing trauma, these  first…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…equipment to them so they can do  the job of keeping order and maintaining our democracy--but, also, to  the military itself, which is demoralized and potentially degraded by  the misuse of these resources that are designed to support them in  countering adversaries abroad, and, of course, to the faith and trust  of Americans in the military, as they see it…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…the population at  large. Unfortunately, despite the VA's best efforts at vetting proposed  fiduciaries, bad actors do arise from time to time. When that happens,  theft or misuse of benefits can financially devastate veterans.\n\nOn top of the financial harm, the strain of being taken advantage of  can further eat away at the veteran's physical and mental…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…the American  people and safeguard their data. Instead, my colleagues across the  aisle have seemingly left the door open for DOGE and anyone else to  potentially access and misuse their constituents' personal information.\n\nIt is not just the recklessness that should concern everyone across  the country. It is the fact that the data being held by the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690782/protecting-sensitive-data-for-millions-of-americans"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…gentleman from New Jersey for  yielding.\n\nMr. Chair, SAMHSA's stated mission is to lead public health and  service delivery efforts that promote mental health, prevent substance  misuse, and provide treatments and supports to foster recovery while  ensuring access to better outcomes for all.\n\nIt is not an exaggeration to say that the public servants at SAMHSA…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…military for domestic law enforcement missions unless the  Insurrection Act of 1807 has been invoked, which President Trump has  not done. These unlawful deployments are a serious misuse of the  National Guard for political purposes by President Trump and they  should end.\n\nFinally, President Trump's Office of Management and Budget (OMB)  repeatedly violated…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…terrorism.\n\n(ii) An evaluation of domestic and international trends in       vehicular terrorism.\n\n(iii) An identification of potential future threats related       to the misuse of connected or autonomous vehicles, Advanced       Driver Assistance System (ADAS) -equipped vehicles, ride-      sharing services, and advancements in automotive       technologies,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, I rise today alongside four of my esteemed  colleagues to both highlight and condemn the misuse of taxpayer dollars  funneled to illegal immigrants.\n\nAn outrageous pattern of perverse and intentional incentives reveal  deliberate efforts to worsen the border crisis and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…model.\n\nI am on Ways and Means. This is something Energy and Commerce has in  their primary jurisdiction. They are working through it.\n\nIf you just stack up the cheating, the misuse--the vacuousness, the  absence of data to try to deal with the multiple enrollment population,  if you actually start to stack these things up, how dare you call those  cuts.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…to       the Secretary or the Inspector General of the department in       which the Coast Guard is operating, particularly in a case in       which there is an element of misuse of position or of       unauthorized personal benefit to the senior official, a       family member, or an associate.\n\n``(2) Senior leader of the coast guard.--The term `senior…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…Panetta from California.\n\nThe National Environmental Policy Act, or NEPA, was passed in 1970 to  look at the impacts of projects on the environment.\n\nAfter decades of abuse and misuse, NEPA has strayed far from its  original purpose. Now, it is a four-letter word, often weaponized to  bury infrastructure, housing, energy, and other critical projects under…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…this bill demonstrates our dedication to veteran  medical care, including funding for  mental health, telehealth services, homelessness programs, caregiver  programs, opioid misuse prevention and treatment, medical research,  healthcare tailored to our female veterans, rural healthcare  initiatives, and construction for new VA hospitals and veteran  cemeteries.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Effective Date.--The amendment made by subsection (a)       shall take effect 180 days after the date of enactment of       this Act.\n\nMr. Speaker, in recent years, the theft and misuse of Social Security  numbers has become a very serious problem in our country. In 2024  alone, there were over 3,000 reported data breaches, and over half of  them included…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…plants will  actually be watered for free.\n\nWhile DOGE keeps delivering more savings every day, Democrats are  more upset by the effort to stop wasteful spending than by the misuse  of tax dollars.\n\nMs. ERNST. As I always say, if you can't find waste in Washington,  you are not looking.\n\nMs. ERNST. I urge my colleagues to vote no on this amendment. We…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688898/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Homeland Security to confront the growing threat of vehicle-based  attacks. It mandates a comprehensive assessment of current and emerging  tactics, including the potential misuse of autonomous vehicles,  rideshare platforms, and connected vehicle technologies.\n\nFurther, the bill strengthens coordination between Federal, State,  and local governments…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696770/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…drafted. It is not going to lend itself to being used that  way.\n\nMr. Speaker, I do agree with the ranking member that all U.S. States  and territories already criminalize misuse of less-than-lethal devices  through existing assault and battery laws.\n\nMr. Speaker, 42 States have explicit statutory definitions for less- than-lethal devices. Of those…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…scope of the  Clean Water Act section 401 certifications to actual water quality  impacts and establishes timelines and procedural guardrails of State- level review to prevent misuse and delay.\n\nThe Reducing Regulatory Burdens Act removes the need for duplicative  National Pollutant Discharge Elimination System permits for pesticide  use if the pesticide…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…that       beneficiary.\n\n``(d) Oversight of Negligence.--(1) The Secretary shall       establish methods and timing with respect to determining       whether an instance of misuse by a fiduciary, of all or part       of an individual's benefit paid to such fiduciary, is the       result of negligence by the Secretary.\n\n``(2) The Secretary may not withhold…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…and look  forward to continuing to support the work of President Trump and the  DOGE team to identify and eliminate wasteful government spending.                       End Misuse of Emergency Spending\n\nMr. STUTZMAN. Mr. Speaker, speaking of spending, outside of wasteful  spending on international aid and public media, Congress has another  problem contributing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…one-twentieth  of what was spent for illegal aliens.\n\nWho did the Biden-Harris administration care about? It certainly  wasn't our men and women in uniform.\n\nUnfortunately, the extreme misuse of funds wasn't their only slight  to the American public. The Biden-Harris administration relaxed vetting  standards for those who claimed to sponsor alien children. DNA testing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…facts of what happened in Los  Angeles, the future of what will happen here in our country and in the  world will wait on your answer.\n\nWas this an overresponse? Was this a misuse of force? Was this a  disrespect of the very Senate itself? Is this a moment when, as our  Founders who wrote the Federalist Papers dreamed, my colleagues in the  Senate will…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}]