[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…Trump wanted to slash the maximum Pell grant by over $1,000,  and we said: Absolutely not.\n\nRight now, we are still learning new details about how Trump and his  DOGE flunkies misused Americans' Social Security information and did  untold damage to the Social Security Administration. Every American  should be outraged by the way this administration has…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…barred from       firing officers who had committed sexual and domestic       violence, who were arrested for assorted criminal activity,       or who gave false statements, misused their firearms, or       slept on the job. H.R. 2096 would also restore a 90-day       statute of limitations for claims against police officers       that, in the past, was…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…American people.\n\nIt is being managed, Mr. Speaker, in this GOP tax scam, this  disgusting abomination, this one big, ugly bill. The management of  taxpayer money is being misused and abused to hurt everyday Americans  in order to reward billionaires with massive tax breaks.\n\nThat is a dereliction of duty, the mismanagement of public money. It  is an…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…alarming misuses of the U.S. Armed Forces by President Trump. While in  office, the President has issued unlawful orders, directed unlawful  deployments, and has unlawfully misused Congressionally appropriated  funds. President Trump has chronically abused his executive authority  as Commander in Chief, and I do not believe that Members of Congress…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…financial harm, the strain of being taken advantage of  can further eat away at the veteran's physical and mental health. We  must empower the VA to more quickly return stolen or misused benefits  to veterans who are exploited by their fiduciary. This bill would do  just that.\n\nIt passed the House last Congress, and I encourage my colleagues to  support it…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…barred from firing officers       who had committed sexual and domestic violence, who were       arrested for assorted criminal activity, or who gave false       statements, misused their firearms, or slept on the job. H.R.       2096 would also restore a 90-day statute of limitations for       claims against police officers that, in the past, was…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of these resources that are designed to support them in  countering adversaries abroad, and, of course, to the faith and trust  of Americans in the military, as they see it misused.\n\nSo I want to ask my colleague from Oregon about perhaps his personal  experience as he watches this deployment of the National Guard in his  State. How are the people of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…manufacturers to comply with safety standards for rechargeable  lithium-ion batteries in micromobility devices, like electric bicycles  and scooters.\n\nFires caused by faulty or misused batteries are on the rise. Between  2019 and 2023, there were more than 400 fires, 300 injuries, and 12  deaths from fires caused by lithium-ion batteries in New York City…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…barred from firing officers       who had committed sexual and domestic violence, who were       arrested for assorted criminal activity, or who gave false       statements, misused their firearms, or slept on the job. H.R.       2096 would also restore a 90-day statute of limitations for       claims against police officers that, in the past, was…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…have stopped this project. It would not have  dismantled anything. It simply would have required transparency, basic  disclosure of how Social Security data has been used or misused by the  Trump regime in the creation of this centralized database.\n\nYet, despite the gravity of these concerns, Republicans voted to  block this reasonable inquiry from a…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…daughter's  Social Security number was compromised. Unfortunately, the story is all  too common for millions of Americans who have had their Social Security  numbers stolen or misused each year.\n\nBy taking swift action today, we can prevent a lifetime of financial  harm to American children across the country.\n\nMr. Speaker, I urge my colleagues to support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…how the board will collect and verify this       information; and\n\n(E) a description of what controls have been put into place       to ensure funds are not diverted to or misused by the Taliban       or other actors when the Fund begins making disbursements.       SEC. 5. APPROPRIATE CONGRESSIONAL COMMITTEES DEFINED.\n\nIn this Act, the term ``appropriate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692738/no-tax-dollars-for-terrorists-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…General.--The Commissioner of Social Security       shall establish and implement procedures to ensure that any       individual whose social security account number has been       misused (such as to fraudulently obtain benefits under title       II, VIII, or XVI of this Act, or in a manner that affects an       individual's records at the Social Security Administration,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…I move to suspend the rules and pass the  bill (H.R. 1912) to amend title 38, United States Code, to improve the  repayment by the Secretary of Veterans Affairs of benefits misused by a  fiduciary, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1912\n\nBe it enacted…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…act  decisively.\n\nMeanwhile, the administration is prioritizing stronger oversight of  U.S. foreign assistance to Haiti, an essential effort to ensure  taxpayer funds are not misused. By identifying and sanctioning corrupt  actors, this bill helps ensure that U.S. aid does not end up in the  hands of those fueling the instability. It reinforces the broader…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}]