[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…projectiles, and thermal runaway. This causes an explosive,       domino effect within the cells of a battery making it       especially challenging for first responders to mitigate using       traditional fire suppression methods. In addition to the       explosion and fire, these battery fires produce thick, highly       toxic smoke that endangers the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Speaker, this bill asks for a detailed study on these issues.  The bill would also require recommendations for additional actions to  strengthen international cooperation to mitigate risks and protect U.S.  interests.\n\nThe House previously passed this bill four times in the last three  Congresses, and I hope we can finally pass it into law.\n\nMadam Speaker,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…China hindered.\n\nThe compromise language recognizes the spirit of the bill--the need  to protect America's intellectual property and academic freedom--and  takes steps to mitigate the risk of going too far and denying critical  Homeland Security funding to U.S. universities for any relationship  with virtually any Chinese university.\n\nI do not support…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…coming. There  are 80,000 VA employees slated to be fired. The cuts to healthcare in  the reconciliation bill will impact veterans' families, which is why I  was hoping we could mitigate much of that through this bill.  Unfortunately, we have not, which is why I cannot support the bill.\n\nIn fact, Project 2025, which we discussed at length last year, one of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692955/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…President       Trump's Executive Order pausing foreign assistance.\n\nFrom Day One, implementing this waiver was my highest       priority. My team recognized it as the only way to mitigate       the harm caused by the sudden halt of over a thousand of our       programs preventing pandemics and suffering worldwide.\n\nI challenge the administration to provide…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…NOAA's Storm Prediction Center tracks severe weather and tornado  warnings. It is in Florida, where NOAA's National Hurricane Center  monitors incoming storms to save lives and mitigate property loss. It  is in Alaska, where scientists at NOAA's Fisheries Science Center work  to maintain healthy fish populations to support local fishermen.\n\nIt is in my home…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…organized Member briefings with the Treasury Secretary and banking  regulators. We encouraged Biden's regulators, led by former Secretary  Yellen, to use their emergency tools to mitigate the damage, which they  successfully did.\n\nWe worked with our former chairman, Mr. McHenry, and launched a  bipartisan investigation to conduct oversight and understand what…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Improvement  Act, promotes a more consistent and transparent process for a SIFI  designation by clarifying that FSOC should work with a firm and its  primary regulator to attempt to mitigate the risks of specific  activities before designating the company as a whole as systemically  important.\n\nRegulators are encouraged to use the full range of available tools…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…certain there will  always be enough of that spirit for every salutary purpose. And there  being constant danger of excess, the effort ought to be by force of  public opinion to mitigate and assuage it. A fire not to be quenched,  it demands a uniform vigilance to prevent its bursting into a flame,  lest instead of warming it should consume.\n\nIt is important,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…fire federal  employees and to dismantle the federal government, and I will continue  to fight those efforts using every tool at my disposal. However, it is  important to mitigate the harm where we can, which this bill would do.\n\nI urge my colleagues to support this bill.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693054/introduction-of-the-foreign-service-voluntary-early-retirement-authority-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…step in addressing the systemic       barriers that can keep pregnant and parenting students from       graduating.\n\nUnfortunately, the proposed bill would do little to       mitigate these harms and instead risks further stigmatizing       pregnant and parenting students. The proposed bill relies on       anti-abortion language and seeks to limit students'…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…profit sector, most notably serving as the Executive Director of El  Centro del Pueblo since 1980.\n\nAt El Centro del Pueblo, Ms. Figueroa-Villa has worked to address and  mitigate the impacts of gang violence in Los Angeles. Thanks to her  leadership, El Centro was transformed from an organization with a  budget deficit and two part-time employees to…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…chains, and for other purposes.\n\nMs. CANTWELL. Mr. President, I introduced the Promoting Resilient  Supply Chains Act, S. 257, with Senators Blackburn and Blunt Rochester  to mitigate or prevent disruptions of critical supply chains that could  have a devastating impact on the U.S. economy. The bill charges the  Department of Commerce's Assistant Secretary…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692997/promoting-resilient-supply-chains-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…by President Trump and Elon Musk.\n\nIn their own words, this researcher wrote:\n\nI was a biologist with USDA's Animal and Plant Health       Inspection Service. I worked to mitigate human-wildlife       conflict and protect American agriculture. As a Wildlife       Services biologist, I was also designated as an emergency       response official and was…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688173/fired-by-president-trump"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…becoming the new norm, it  is important, on this International Day Against Nuclear Tests, to  highlight the successful steps taken by the United States and  Kazakhstan to mitigate the dangers of nuclear weapons, institute global  nonproliferation regimes, and adhere to international norms around  nuclear testing.", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…(2).\n\n(2) Contents.--The Strategic Plan shall include, at a       minimum, a consideration of the following:\n\n(A) The threat assessment, with an emphasis on efforts to       mitigate the criminal threats from transnational criminal       organizations, including the threats identified in the threat       assessment in accordance with subsection (a)(2)(A).…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of what it is  today.\n\nWe are on the cusp of putting the bond market in charge of this  country, not us. It is a really dangerous game we are playing. One of  the ways we mitigate that is we tell the bond market: We are adults. We  are being serious. We understand we have a demographic. We have a  healthcare spending problem. We are going to take it…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…of H.R. 390, the ACERO Act, sponsored  by Representatives Fong and McClellan. This important, bipartisan  legislation will enhance our ability to respond to wildfires and  mitigate the destruction that they cause.\n\nEach year, wildfires burn millions of acres, threatening lives,  destroying homes, and causing billions of dollars in damage. Federal  agencies…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Federal strategy to  protect schools from acts of terror.\n\nThis bill closes this dangerous gap, requiring DHS to produce a  school security strategy that identifies and works to mitigate  vulnerabilities. In doing so, our schools will no longer be soft  targets.\n\nMr. Speaker, I urge all my colleagues to support this bill and to  protect our children.\n\nMr.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…from a party that regularly claims that they are  the party of children, families, and vulnerable communities.\n\nRepublicans and the Trump administration are working hard to mitigate  the worst parts of the shutdown. President Trump found the money to pay  our troops through the generosity of a patriotic American. Senate  Republicans voted for a bill to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…progress toward achieving compliance;\n\n(ii) the Administrator, in consultation with the Secretary       of Transportation, determines additional time is required to       mitigate a significant disruption to air transportation; and\n\n(iii) the Administrator determines the aircraft operator or       owner does not have any uncorrected violations of subchapters…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our country saw all too well the effects that  weak supply chains can have on businesses and the American people. It  is important that we, as a country, better prevent and mitigate  insecurities within our supply chains to better protect our economic  and national security.\n\nThis legislation is paramount to protecting such American security.  By mapping…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…and against our businesses.\n\nThe President's decision to pause the full reciprocal tariffs for 90  days, other than for China, was a prudent move in that respect. It  helped mitigate the impact. It discouraged retaliation but also  continued the serious negotiations by our trading partners to address  longstanding trading barriers faced by Americans in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690537/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…illegal use of       fentanyl and other controlled substances in the Coast Guard       during the 5-year period preceding the briefing;\n\n(iii) processes of the Coast Guard to mitigate substance       abuse in the Coast Guard, particularly with respect to       fentanyl; and\n\n(iv) the status of the memorandum of understanding required       under subsection…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Equipment  Act, which prohibits the Federal Communications Commission from  authorizing equipment from untrusted vendors.\n\nIt is imperative we move forward with these efforts to mitigate the  widespread availability of this equipment.\n\nMr. Speaker, I urge my colleagues to support H.R. 866, and I yield  back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690156/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…prevention,       reporting, and incident response plans at the Department; and\n\n``(2) serve as a central point of contact to direct       veterans to resources to prevent and mitigate fraud and       scams.\n\n``(b) Responsibilities.--The Veterans Scam and Fraud       Evasion Officer shall carry out the following       responsibilities:\n\n``(1) Providing comprehensive…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…perform like my  friend and colleague, Ms. Marjorie Taylor Greene, has done by  presenting this law. I am a proud original cosponsor. The President  needs this legislation to mitigate against the radical judges that will  try to stop him from releasing through Congress to the American people  the data from 2021, '22, '23, and '24 of what suspected illegal…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…there will always be enough of that spirit for every salutary purpose.  And there being constant danger of excess, the effort ought to be, by  force of public opinion, to mitigate and assuage it. A fire not to be  quenched, it demands a uniform vigilance to prevent its bursting into  flame, lest instead of warming it should consume.\n\n``It is important,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…earlier this year,  which passed the House with overwhelming bipartisan support. FOFA would  not only result in more stable funding for working families, but it  would also mitigate the devastation of wildfires in our wildland-urban  interfaces through the restoration of forest health and commonsense  management. I hope the Senate will act soon so we…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…sanctions, finance terrorism, or launder monetary       instruments, and threaten the national security of the United       States; and\n\n(B) a strategy for the United States to mitigate and       prevent the illicit use of digital assets and other related       emerging technologies.\n\n(2) Form of report; public availability.--\n\n(A) In general.--The report…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}]