[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…gigawatts of installed  solar capacity nationwide now exist. That is enough to power 45 million  homes, making solar an important and rapidly growing part of our  electricity mix.\n\nAs of 2024, the industry employed 280,000 Americans across thousands  of companies including a recent boom in domestic manufacturing jobs.  One of the greatest developments…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699172/congratulating-abigail-ross-hopper"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…where  the plant was needed to keep the lights on.\n\nRemember, Mr. Speaker, nobody was asking for this. The company that  owns and runs the plant wanted to close it and shift to a mix of energy  sources. The plant is losing money, and the administration is now  forcing the company to spend nearly $1 million a day to keep it open.\n\nWho will pay the cost of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…doctors to take care of them. Why? Because Medicaid is a big  revenue stream for really all hospitals but especially rural hospitals.  It can be up to about half of the payer mix.\n\nWhat is a payer mix? It just means you might get paid by private  insurance 30 percent, you might get paid by Medicaid 45 percent, you  might have a little VA, and you might…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…an attribute that applies to the  entire grid across the country. It is not a given that additional  dispatchable resources aid reliability themselves. You have to rely on  a mix of generation, different fuels, and wires to make sure everyone  can get the power they need all the time.\n\nWhen you put your finger on the scale of a certain power source and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…because of the President.\n\nThe staple items for this classic American holiday cost, on average,  7 percent more than last year.\n\nTake my favorite side, stuffing. A box of stuffing mix has soared by  double digits. The centerpiece of many tables, turkey, is up 7 percent.\n\nIt is not just Thanksgiving food. Grocery prices are up. Families of  four are spending…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697059/increasing-costs-of-thanksgiving"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…legislation introduced  by my colleague from Wisconsin (Mr. Tiffany).\n\nThis bill would authorize the conveyance of 14 acres of National  Forest System land to Tony's Wabeno Redi-Mix, LLC, a concrete company  based in northern Wisconsin.\n\nThe land is located in a national forest, and the Forest Service  determined that the land is suitable for conveyance…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…billion investment in Donald Trump's  business.\n\nAs you can imagine, once the word was out that the Trump  administration was for sale, other countries decided to get into the  mix. Donald Trump barely had taken a look at a luxury plane that the  country of Qatar owned--reportedly the most luxurious plane in the  world: gold plating, a spiral staircase…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…for 3 years.\n\nMy district is just over 17,000 square miles. It is mostly rural with  rural hospitals hanging on by a thread. Some of them have just 15  percent commercial payer mix. Without the Affordable Care Act  subsidies, we will have more uninsured people, and these hospitals  could go under.\n\nPrior to being in Congress, I worked at the United Way…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…headed.\n\nSo this is just economics 101: High demand plus low supply means  higher energy prices for everyone. That is what they are setting up if  we take wind and solar out of the mix, forcing families, on average, to  pay $150 more per month on their energy bills just in 5 years, and $260  per month more each month in 10 years because there won't be the…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…instead of addressing the  real crises facing American families.\n\nI want to paint a picture as to what happens to a young woman who  suspects that she may be pregnant. She has a mix of emotions. She may  have overwhelming fear and anxiety, especially if she has few  resources. She goes to what she thinks is a medical center or clinic,  and it is called…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…thank Ranking Member Pallone and Chairman  Latta for their leadership.\n\nI am from Washington State, and in the Pacific Northwest, hydropower  makes up the majority of our energy mix. That is why I am very proud to  lead this effort to enhance transparency and really help streamline the  non-Federal hydropower licensing process with my colleague from Idaho,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…vehicles by this summer. I support the  EV transition, but we are simply not there yet.\n\nFor model year 2026, ACC II States would require 35 percent of new  car sales to be a mix of electric or plug-in hybrid, yet the national  average is at about 10 percent. That requirement jumps to 68 percent by  2030 and 100 percent by 2035 for the ZEV mandate States.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…seen from this administration and its co-conspirators on the  Republican side of the aisle, Mr. Speaker, is cruelty, chaos, and  corruption. It has all been morphed into a toxic mix now contained in  Donald Trump's one big, ugly bill, an extraordinary assault on the  healthcare of the American people.\n\nI mentioned earlier, Mr. Speaker, that I would be taking…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…background in construction, housing development, and home sales. My own  family has been involved for over three generations in construction.  Now, my cousins have their ready-mix concrete company, and I have our  aggregate businesses and home development.\n\nI can tell you, Mr. Speaker, we have seen firsthand how government at  every level, local, State,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699804/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…discussion, and ideas  with the left, the right, particularly those of us on Ways and Means  Committee, Energy and Commerce Committee, those things, saying: Here is  what the mix should look like.\n\nMaybe we don't extend everything. Maybe we mix them up. Maybe we find  where there is leakage. Maybe we find where there is economic growth  opportunities.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…need for this position to be  filled immediately, and we are fortunate that President Trump nominated  a highly qualified individual for this role.\n\nDr. Casey Mulligan's unique mix of academic success and real-world  small business experience makes him the best candidate for the job. A  Harvard graduate, Dr. Mulligan received his Ph.D. in economics from…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Licensing Transparency Act, led by the gentleman from Idaho's First  District and the gentlewoman from Washington's Eighth District.\n\nHydropower is critical to our Nation's energy mix, supplying power to  approximately 30 million homes and businesses and accounting for 40  percent of the Nation's black start capacity.\n\nHowever, the average age of a hydropower…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…at Home initiative, including costs relating to staffing,       equipment, food, prescriptions, and other services, as       determined by the Secretary;\n\n``(iv) the quantity, mix, and intensity of services (such       as in-person visits and virtual contacts with patients and       the intensity of such services) furnished in inpatient       settings…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…would be willing to accept us. We have the power to project some  capability in Greenland, and we haven't necessarily put a 75-year  alliance in NATO and dissolving it in the mix. That is the smart,  sustainable way to achieve the President's goal of securing the Arctic.\n\nThe not smart, unachievable way is whoever told the President that  this was a…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…experiences. The  Savannah Historic District offers preserved architecture and museums  for history enthusiasts. Broughton Street offers a wide range of  shopping options, featuring a mix of small, local shops and larger  commercial retailers.\n\nIf visitors prefer a more relaxing experience, Tybee Island is just  15 minutes away. On Tybee Island, vacationers can…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…nonsensical regulations,  including the new fuel standard that was just recently imposed by the  Air Resources Board, as well as a slew of other regulations relating to  the fuel mix and other factors, as well as having the highest gas tax  of any State in the country.\n\nBy the way, you would think that, since we have the highest tax, we  must have great…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…including an analytical       study comparing the operational effectiveness, costs, and       risks to determine the best suited aircraft to meet mission       needs.\n\n(3) A fleet mix analysis to identify the necessary number       of helicopters to meet the mission needs of the Coast Guard       across all districts.\n\n(c) Limitation of Aircraft Expenses.--No…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Act''.       SEC. 2. CONVEYANCE OF CERTAIN NATIONAL FOREST SYSTEM LAND IN                     THE CHEQUAMEGON-NICOLET NATIONAL FOREST TO                     TONY'S WABENO REDI-MIX, LLC.\n\n(a) Conveyance Required.--If, during the 180-day period       beginning on the date of Federal approval of the appraisal       under subsection (d), Tony's Wabeno Redi-Mix,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and  dispatchable resources, such as natural gas, hydropower, coal, and  nuclear, are sufficiently considered as part of any 10-year plan.\n\nThere is a road for a diverse energy mix that includes renewables and  storage, but we know that not all electrons are the same.\n\nThis is the exact message that the Committee on Energy and Commerce  has heard in hearings…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…the defense  facilities in my district, and also across the globe, that they are  near saltwater.\n\nWe have all seen the horrible fires that occur when saltwater and  batteries mix. They are horrific, runaway fires. In the Joe Biden  Department of Defense, I can only imagine a scenario where a natural  disaster causes critical installations, just like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Coordination for Pipeline Reviews Act. This legislation  will bring much-needed reforms to the Federal permitting process.\n\nNatural gas has become the foundation of America's energy mix,  accounting for almost 40 percent of our total energy production and 43  percent of electricity generation.\n\nThe shale revolution has ushered in a new era of American energy…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the context of  criminals being let out prematurely, not giving them the ability to  actually come to a place where they can again interact with society. We  can talk about the mix with mind-altering drugs. We can talk about the  misdiagnoses. We can talk about all of the things that we can and  should do better. I know that my friend from Louisiana, a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…our  State's gas tax, the highest in the Nation. I ask him to revisit  onerous regulations like cap-and-trade and to revisit all of the other  regulations involving the fuel mix and all of the other things that  have demonstrably increased the price of gas in our State.\n\nMr. Speaker, Californians are ready for common sense. They are ready  for some…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}]