[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…for being here. I also thank my colleagues and my dear  friends, Majority Leader Scalise and Majority Whip Emmer, for being  here.\n\nMr. Speaker, I rise today with, obviously, mixed emotions and  reluctant conviction. There is a true story I have told many times over  the past 60 years. It is about a young man--myself--who was a student  at the University…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…acknowledge that  abolishing the Department of Education is a mistake, to actually oppose  those actions publicly. Our schools need stability and support, not  disarray and mixed messages.\n\nMr. Speaker, again, I oppose the bill, and I reserve the balance of  my time.\n\nMr. Speaker, if there was real evidence of influence, I think we  would have heard…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…ticket.\n\nDo you know what the sad part is, Mr. Speaker? Three of his sons are  marines in the U.S. Marine Corps.\n\nThe President needs to know that he is deporting individuals of mixed  households whose children are in the U.S. military.\n\nI am not quite sure--actually, I am certain that is not what the  President wanted to happen. That is what our oversight…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…students, and community members back to circumstances where       their safety cannot be guaranteed.\n\nIn addition, TPS termination would have catastrophic       consequences for mixed-status families; households where       parents hold TPS, but their children are U.S. citizens. The       termination of their parents' protected status would force       parents…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…constituents whose health and well- being is on the line.\n\nSince this bill passed, of course, some Republicans are trying to  walk back their vote--buyer's remorse. They had mixed feelings at the  time, perhaps. They are supporting tweets like repealing the Medicaid  provider taxes or boosting rural hospital funds because they see that  those rural hospitals…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…attack on this Capitol.\n\nI want to focus on two men who were here that day. One was Nathan  Tate. He was a police officer who had grown up in Prince George's  County. He had mixed feelings about what the police do because he had  had some bad experiences in his childhood and in his neighborhood, but  he decided he could make a difference.\n\nHe felt called…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…all-girls school a few  years after joining the LHSAA.\n\nThe LIALO became a defunct organization in 1969. Its members joined  the LHSAA. Almost every high school in the LHSAA has a mixed  enrollment.\n\nTeam Roster Included: Virgil Alexis, Michael Ben, Winston       Burns, Ken Cobette, Gary Craddock, Oyd Craddock, Charles       Cross, Donald Davis, Kurt Davis,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…new documentation requirements around age and citizenship,  it slows down the loan process and risks excluding legitimate  applicants, particularly those from immigrant and mixed-status  communities who already face steep challenges.\n\nLet's be honest about what this bill really does. It uses small  business policy as a vehicle for immigration politics.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…and then robust and healthy debate plays out  on this floor for good reason and Members decide where they want to  land, but that is always when we have seen a result that was mixed,  where there were people who voted against the bill. No one voted  against this bill.\n\nThis bill is entirely noncontroversial, and it is so narrowly focused  that it makes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…have  been breaking the law with impunity.\n\nA couple of people asked me earlier how I felt about what is going on  in this lovers' quarrel. I am, like, you know what? You get mixed up  with messy people, you get a messy outcome. It is very clear that that  is exactly what is going on.\n\nI think we have all been hearing the rumors here in Washington, the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…enforcement.\n\nNext is $2 million for some sort of national listening session for,  as I understand it, criminal defendants.\n\nThen we have $695,000 for a parallel convergent mixed-methods case  study. I don't even know what that means, a parallel convergent mixed- methods case study research designed to assess the efficacy of police  departments' LGBTQ…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…President, actually, I am going to ask unanimous  consent that we go ahead and confirm General Caine as Chairman of the  Joint Chiefs of Staff, but I must say that I do so with mixed feelings.\n\nOn the one hand, we need a Chairman of the Joint Chiefs of Staff  immediately, and there is overwhelming support on the Democratic side  and Republican side for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…last Congress. It has the support of major industry  associations, including the Portland Cement Association, the National  Asphalt Pavement Association, and the National Ready Mixed Concrete  Association. It also has the endorsement of those groups affected by  downstream impacts, like the U.S. Tire Manufacturers Association and  Citizens for Responsible…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…nuclear deal the President withdrew from his first term.  They even proposed Iran could keep enriching uranium, until the  President, rightly, correctly, quashed that idea.\n\nThese mixed messages emboldened Iran and its proxies. After all, why  give up if administration officials saw the Middle East as little more  than a distraction or if they seem as fearful…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Jennifer Homendy, took the  unprecedented step of publicly stating that the National Defense  Authorization Act does not adequately address the safety concerns  surrounding the mixed airspace at DCA.\n\nAnd while the NDAA is critical to bolstering our defense  capabilities, I have major concerns with the portion of the bill that  is being fixed by the efforts…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…BUILDING GRANT PROGRAM.\n\n(a) In General.--The Secretary may establish a pilot       program to award grants to eligible entities to review       designs of covered structures of mixed-income housing and       designate such reviewed designs to be included in pattern       books for use in the jurisdiction of the eligible entity.\n\n(b) Restriction.--Amounts…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent--actually, in 8 budget years, 30 percent of  every dollar we take in, in tax receipts will just cover interest.\n\nI didn't bring the chart. Maybe I should have because they have been  mixed up. If we had a 1 percent increase from what we expect baseline  interest rates to be, Mr. Speaker, would you dare in your head guess  that, in 2034-2035, 30 percent of all…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…these men as martyrs,  as they should. Just as these men refused to abandon their faith, their  faith has never abandoned them. One of the martyrs' widows said: Their  blood mixed together, and as a result, we the widows are united.\n\nThese men weren't just believers. They were immovable. Their story  should remind every American what real religious freedom…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688172/meaning-of-religious-freedom"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to make this permanent.\n\nIllicit drugs have poured across the border, made it onto the  streets, and affected our communities, every one of our communities.  They are often mixed with other illicit drugs, and users are  often unaware of the presence and potent effects, which makes the  danger even harder to stop.\n\nPeople hear stories on a regular basis…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…detecting, localizing, and neutralizing surface, near- surface, moored, and bottom mines, helping our sailors stay safe around  the world.\n\nThe Navy has emphasized the need for a mixed naval fleet in the past,  consisting of both blue water and littoral combat ships that act as  fast-moving surface warfare vessels.\n\nThey continue to undergo upgrades to improve…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…paying for.\n\nWith regard to childcare, I have heard a childcare provider say that  she preferred to get the vouchers--and I don't know if this is always  true; I have heard a mixed bag--but get vouchers from somebody from the  government because those were always paid.\n\nChildcare is very expensive today. If you agree to take care of a  child, maybe sometimes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…manufacturing of  heating and air-conditioning products.\n\nI also visited Alliance, TX, which is actually in Tarrant County or  Fort Worth, which is now a massive, master-planned, mixed-use  development in North Texas. Alliance is home to a number of important  businesses, residential neighborhoods, and a thriving island inland  port that boosts our country's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}]