[{"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, 5 years ago, Donald Trump incited a  vicious MAGA mob to storm the U.S. Capitol with one goal: to overturn  the results of the 2020 Presidential election.\n\nFortunately, Trump and his gang of violent extremists failed in their…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…a real difference in  people's lives. Democracy is, in short, the best way to solve problems  without violence, with the votes of citizens instead of the voices of a  violent mob.\n\nLook no further back than over the course of this last year, and you  will see why democracy matters. Despite promising to bring down costs,  the President has instead made…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Mr. ESPAILLAT. Mr. Speaker, both Democrats and Republicans should be  forever grateful to the police officers who protected this Capitol as  an angry, racist, violent mob came in. We will forever remember the 140  officers who were injured and the five officers who lost their lives as  a result, including Brian Sicknick, a Capitol Police Officer;…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691171/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Americans. Here is why: It is not just--when this happened, I  was in the Gallery in the House. I was 30 feet from where the shot was  fired. I was standing there witnessing the mob trying to break down the  doors that the President enters to give the State of the Union Address  and saw the glass and heard the glass shatter.\n\nEven as that was happening,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…put up the  plaque to honor the officers who defended us against the rampage of  January 6.\n\nThe gentleman from North Carolina, I think, tried to change the  subject as if one mob rampage justifies another. I am against all mob  violence. I am against all mob rampages. I don't feel like I have to  speak out against one of them. If I can't speak out against…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…bloody as what took place on January 6, 2021,  with the various extremist groups that came and led the attack on the  Chamber and then gave bloody instructions to the rest of the mob about  how to treat police officers in their effort to go and ``hang Mike  Pence.'' That was the chant. I can still hear in my mind, ringing off  the walls of the Capitol: ``Hang…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…responded to the attack on the U.S.  Capitol on January 6, 2021.\n\nMany of my colleagues and I were trapped right up there in the House  gallery that day as an insurrectionist mob converged on the Capitol.  Officers from the Capitol Police, Metropolitan Police Department, and  numerous other departments risked their lives to protect us and our  democracy.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Mr. Speaker, today I rise in recognition of the 5th  anniversary of a day that shook our Nation--the violent assault on the  United States Capitol. On January 6, 2021, an armed mob stormed the  people's house in an assault on our democracy, the rule of law, and the  peaceful transfer of power.\n\nOn January 6, 2021, insurrectionists targeted Congress and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, do not let anyone rewrite the history of  what happened on January 6, 2021. A mob tried to overturn a free and  fair election and deny the American people of our God-given right to  choose our own leaders. They attacked police officers with pipes,  rocks,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698553/january-6-attack"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Madam President, on January 6, 2021, a solemn  constitutional proceeding was disrupted when a mob of thugs, egged on  by President Trump, attacked and trashed the U.S. Capitol in an attempt  to overturn a free and fair election.\n\nThe grimmest results of the insurrection…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…remembrance in our  Nation's Capital. It was on this day 5 years ago when this Chamber, the  people's House of the United States of America, was viciously attacked  by a violent mob.\n\nNo tweet, no post, no spin, no disgusting lie-filled website is going  to change the facts of the history of what happened on that day.\n\nI rise today to honor the men and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698536/a-somber-day-of-remembrance"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…day, but he heard about the riots at the Capitol, and  he came down to join the fight with his brothers and sisters in blue  and was nearly killed? He begged for his life to the mob, saying he had  four daughters of his own. He had a heart attack. Will we not honor  Michael Fanone?\n\nWill we honor Officer Harry Dunn who fought for hours and hours,  enduring…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…remained unfulfilled by this administration.\n\nOn day one, President Trump said he would put America first and lower  costs. Instead, he pardoned violent insurrectionists, a mob that  attacked this Capitol to overthrow a fair and free election. It was an  attack that resulted in the deaths of five law enforcement officers.\n\nWe were promised America…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…should have any kind of MAGA influence.\n\nAnyone with two eyes and half a brain can see what this probe is--a  brazen attempt to cannibalize the Fed's influence. It is monetary mob- boss thuggery.\n\nIf you are an American worried about costs--housing costs, car loan  costs, any interest rate costs--what Donald Trump is doing should alarm  you. If you are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…it. When lawmakers are shot  in their own homes, when a Governor's mansion is set ablaze, when the  spouse of a Speaker of the House is nearly beaten to death, when a  violent mob storms the U.S. Capitol, and when a gunman tries to  assassinate the President of the United States, it is not enough to  just condemn these acts and move on. We need to recognize…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…The cop who was struck in the neck and critically wounded while  racing to respond.\n\nI care about the pastor and his flock in St. Paul whose church was  invaded by a screaming mob during Sunday service last month because  they believed one of the pastors was a field director for ICE. The mob  cursed, threatened, and terrorized not just the pastor but…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…personnel--50 American hostages--were held  for 444 days by these nutjobs. They were subjected to intense physical  and psychological torture throughout their captivity, such as mob  executions, beatings, solitary confinement, and very bad living  conditions. This is what they did when they took over. They came after  us, held our people hostage, and treated…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…their  duty to protect the public and enforce the law.\n\nRemember how all this started: ICE agents attempted to execute court- ordered warrants on criminal illegal aliens. When a mob intervened, ICE  called for local law enforcement. The mayor reportedly stopped them  from responding, and the Governor did nothing. Now, we saw during the  George Floyd riots…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…behind, crossing the frozen Mississippi River by ferry and wagon to  escape persecution. Only the sickest and poorest remained behind, and  even they were finally forced out by mob action. All crossed Iowa to  Nebraska, just north of Omaha, their winter quarters on the Missouri  River.\n\nWhy do I bring up these sad memories from long ago?\n\nUtah still celebrates…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…a slew of  burdensome rules, prohibitions, restrictions, and other ticky-tacky  attempts to micromanage everyday life for Americans. It also includes  ensuring that the woke mob and their radical environmental NGOs can no  longer call the shots at these Federal agencies at the expense of our  manufacturers, our domestic energy producers, and good-paying…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…should have been agreed to immediately to keep this government open.  Senate Democrats blocked that 14 times, prolonging this shutdown just  to score points to their woke, angry mob.\n\nThis measure before us today is the same bipartisan framework they  could have passed 40 days ago. The only thing that has changed is the  political calendar.\n\nMr. Speaker,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…ought  to know better.\n\nIn fact, just 2 weeks ago, while ICE was serving a court-ordered  warrant in Carpinteria, a sitting Member of this House doxed an ICE  agent to a violent mob. That mob then took off after the agent and  physically attacked him with rocks, injuring him seriously enough to  require treatment in a hospital emergency room.\n\nThis has…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}]