[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…again today. I will take a moment to  thank my dear friend, the gentlewoman from Oklahoma (Mrs. Bice), who  chairs the Committee of House Administration's Subcommittee on  Modernization and Innovation. I thank her for all of her hard work. It  is always a delight to work with her.\n\nI am sorry, Mr. Speaker, I didn't bring a physical copy of the  Annotated…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…mental health.\n\nAlso, since a yearlong CR would not account for inflation, thousands  of DOD programs would see cuts. That includes programs that deal with  nuclear triad modernization, shipbuilding and ship  maintenance, munitions production and replenishment, and U.S.  priorities in the Indo-Pacific.\n\nUltimately, a yearlong CR would force too much uncertainty…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…challenge. It is a bipartisan bill, and it directs $10  million of already-appropriated money to the National Science  Foundation for a grant program that will support the modernization of  mathematical and statistical modeling for education across this Nation.\n\nAs a former educator myself and an engineer by education and  profession, I know personally…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…instead of  merely tracking them. This bill begins to tackle that.\n\nThis isn't a magic wand to fix and modernize all of VA, but it is a  start. I am confident that with modernization efforts like this  legislation, as well as my colleagues' efforts in other areas, we can  make a concerted effort to give our veterans the best care and  experience they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Standards Reauthorization Act of 2025  strengthens the United States Department of Agriculture's ability to  improve grain grading technologies through flexibilities to pursue  modernization. Using new technologies to improve grain grading is an  opportunity to make the process more accurate, efficient, and  consistent.\n\nAdditionally, the bill reauthorizes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…first founded the Department when he was President of the United States  in the 1970s. Ohio's nuclear industrialized north is being positioned  to grow through fundamental modernization. That can't come soon enough  for me. We have got to replace our 50-year-old nuclear power plants  across this country.\n\nOur objective must be to make America energy independent…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…sure  that we continue the E-7A aircraft which is needed so badly,  particularly in the Pacific.\n\nMadam Chair, this bill also addresses the risks and costs of military  modernization. It extends the review, the assessment, and the reporting  to Congress on the F-35 program by the Government Accountability  Office, which is incredibly important. We have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695154/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and inadequate equipment,  from icebreakers to offshore patrol cutters to heavy weather boats to  MH-60 helicopters and C-130 aircrafts are all important.\n\nBut beyond the modernization, there are other things. It includes in  Base Seattle, the homeport to our Nation's current icebreakers, the  future heavy icebreaker fleet, and the needs for the Arctic…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…America more  expensive as prices rise.\n\nTo tackle the cost-of-living crisis and affordability head-on, this  bill provides an additional $375 million for electric grid  modernization to help reduce prices to target the primary driver of  skyrocketing utility bills and ensure every American has access to  reliable, affordable power.\n\nThis bill provides…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Mr. Speaker, we can never ignore the fact that behind the conference  room discussions about the utility of nuclear weapons, behind the  corporate lobbying for nuclear modernization spending, this is a story  of human suffering.\n\nThe Nobel Committee awarded the 2024 Nobel Peace Prize to the  organization Nihon Hidankyo for its efforts to achieve a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…national security  risk. No new programs are possible, and procurement is excessively  expensive because it cannot function over multiple years without  effective system-wide modernization. Any military leader will say that  the worst thing going for it right now, at a time when it has to adjust  to the PRC and Russia across a variety of focuses, is that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…regulations. Let me say that again: 60 workplace regulations. It will  affect conditions in farms, factories, construction sites, and mines.\n\nThese changes are being framed as modernization. In reality, they put  workers at greater risk and undermine decades of hard-won labor  protections.\n\nAmong the most far-reaching proposals is the narrowing of OSHA's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the  Transformation to Competitive Integrated Employment Act, which was  recently reintroduced by Congressmen  Bobby Scott and Pete Sessions.\n\nThis bill is a long, overdue modernization of the Fair Labor  Standards  Act of 1938. In it, section 14(c) permitted people with disabilities to  be paid less than Federal minimum wage with little hope of advancement.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Veterans Affairs' correspondence for  our Nation's heroes. I am proud to lead this bill with Chairman  Tom  Barrett, who I serve with on the House Veterans' Affairs Technology  Modernization Subcommittee.\n\nEvery day, my office hears from veterans who are struggling to get  the benefits that they earned because of overcomplicated documents and  bureaucratic…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689679/clear-communication-for-veterans-claims-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Infrastructure Project  Assistance Program, also known as the Mega Program. Funding under these  transportation programs is essential to implement the planned expansion  and modernization of Union Station in the District of Columbia, known  as the Washington Union Station Expansion Project (USEP). Senator Chris  Van Hollen has introduced this bill in the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…raise for American troops and  border security investments to counter drug trafficking.\n\nThey would be voting against investments for critical ships and  aircraft, against modernization of America's nuclear triad, against  missile warning systems and technology, and against next-generation  U.S. weapons systems.\n\nThey would be voting against increased…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the strong legislative progress of H.R.       2189, the Law Enforcement Innovate to De-Escalate Act, and       H.R. 4242, the Innovate Less Lethal to De-Escalate Tax       Modernization Act. H.R. 2189 has received significant       bipartisan support and was marked up and approved by the       House Judiciary Committee with favorable guidance on November…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…its first full-time, paid fire chief position in 2012.\n\nAnd who better to take on that role than Glenn Forsyth?\n\nSince then, he has guided the department through growth,  modernization, and challenges--building a unified team of career and  volunteer firefighters, all committed to protecting the people of  Newtown.\n\nChief Forsyth has given his entire…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691839/recognizing-chief-glenn-forsyths-50-years-of-service-with-the-newtown-fire-association"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…activities. This would be cut by almost $9 billion, roughly 50 percent,  causing, in my view, irreparable harm to our Nation's nuclear deterrent  by halting critical weapons and modernization programs.\n\nThis amendment would also reduce naval reactors by over $1 billion,  again, almost a 50 percent reduction of the account, creating cascading  impacts to America's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…navigational aids, and       cockpit of its Mid-Life Update (MLU) Block 15 F-16 aircraft       fleet along with additional logistics support. Included in       the aircraft modernization were eight (8) LN-260 Global       Positioning System (GPS) and nineteen (19) Multifunctional       Information Distribution System Joint Tactical Radio Systems       (MIDS…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689947/arms-sales-notification"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…U.S. Army and was promoted to the rank of four-star general. In  that role, he has served as the Army's second highest ranking officer,  helping to oversee the readiness, modernization, and the strategic  direction of our Nation's land forces.\n\nBut beyond rank and assignments, those who have served under him will  tell you that General Mingus' greatest…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…carrying out the House  agenda during our time in the majority and has overseen major  legislative wins, touching everything from tax reform to energy policy  to crypto modernization.\n\nBen has been a trusted adviser and a critical team player. His  departure will be felt by everyone on Capitol Hill, but I know he will  excel in his next chapter.\n\nI…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690848/recognizing-ben-napier"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…provides for consideration of H.R.  4016, the Department of Defense Appropriations Act of 2026.\n\nH.R. 4016 provides the critical funding necessary to ensure the  readiness, modernization, and global strength of the United States  Armed Forces. This bill reflects Congress' enduring commitment to our  national defense and to the brave men and women who dutifully…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…this section, including any identified       challenges and recommendations for additional legislative       action.       SEC. 3. PERSONNEL SHIFT MANAGEMENT AND SYSTEM MODERNIZATION.\n\n(a) Evaluation of the Personnel Tracking System.--Not later       than 180 days after the date of enactment of this Act, the       Director of the Federal Protective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talk  about how hard this is, how difficult it is, when the Democrats are  saying how dare we talk about these benefits, help us. Where is the  creativity? Where is the modernization? Where is the use of technology  to disrupt the cost but  make it better, faster, and cheaper? Help us.\n\nThat doesn't give us the dopamine hits and the hope to win back…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Local. Sec. 603. Supervisory Modifications for Appropriate Risk-based Testing. Sec. 604. Tailored Regulatory Updates for Supervisory Testing. Sec. 605. Credit Union Board Modernization. Sec. 606. Systemic Risk Authority Transparency.  Sec. 607. Least cost exception. Sec. 608. Failing Bank Acquisition Fairness. Sec. 609. Advancing the Mentor-Protege Program…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…2025, as amended. H.R. 4491......................  SBA IT              None..............  None.............  ....................                                   Modernization                                   Reporting Act. H.R. 4495......................  SBA Fraud           Reduce by at Least  Increase by Less   ....................…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Representative Barrett's bill would ensure that VA sends veterans and  survivors understandable notice letters so they can make informed  decisions about their claims. Further, this modernization bill is  supported by the administration.\n\nMr. Speaker, I thank our veterans service organizations for their  support of this commonsense bill. I urge all of my colleagues…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…as follows:\n\n``(xiii) implement an information technology or operational       technology, including either or both of such systems using       artificial intelligence, modernization cybersecurity review       process that ensures alignment between information       technology, operational technology, and artificial       intelligence cybersecurity…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…improve  water quality nationwide. This is a very good thing. We all share the  goal of achieving clean water. However, 50 years after its passage, the  Clean Water Act needs modernization. It is just as simple as that.\n\nThis bill makes commonsense reforms, such as clarifying the section  401 process to stop it from being weaponized; codifying longstanding,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}]