[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…the community  have a support system and caregivers have services to rely on. I'm  proud to have worked with Ann since I first came to Congress in 2019.  She even helped to moderate and participate in one of my town halls.  Her passion for this work and drive to support our seniors is  inspirational. I know I will continue to seek her guidance, especially…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689623/congratulating-ann-bailey-on-her-retirement-from-darts"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…care, especially in areas where medical services are  limited or unaffordable. Offering accessible, preventive, and routine  care, they serve as a vital lifeline for low and moderate-income  families who might otherwise go without essential health services. As  president and CEO of Bi-State PCA, Tess has been instrumental in  leveraging her clinical background,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…done.\n\nI am joined tonight by a number of Members who represent, I think,  the full ideological diversity of the House of Representatives--both  sides, liberal, conservative, moderate, people who understand that the  American people expect better of this body.\n\nMr. Speaker, I am going to yield to some of my partners in this  effort, Members who have had…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…energy prices are going to be South  Carolina, Kentucky, Oklahoma, Mississippi, and Louisiana under this  bill. We are taking out the alternatives that could have helped them  moderate the prices in those States.\n\nAnd the States with the largest job losses: Texas, Florida, Indiana,  and Georgia. So this isn't a red State or a blue State issue; this is  creating…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…House  Republicans are spending their time doing publicly. However, privately,  behind closed doors, according to reports, Republican leadership is  meeting with vulnerable, moderate Republicans to try to sell them on  trading devastating cuts to Medicaid for tax cuts for billionaires.\n\nUnder their plan, they have to cut $880 billion from Medicaid and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Rebate program. This is a $4.5 billion  program created by Democrats as part of the Inflation Reduction Act to  lower the upfront costs of appliance upgrades for low- and moderate- income families. The families get a rebate. It helps families better  afford appliances for their homes. With this bill, House Republicans  are eliminating the funding for…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…marked the destiny of nations. But if I may even  flatter myself that they may be productive of some partial benefit,  some occasional good, that they may now and then recur to moderate the  fury of party spirit, to warn against the mischiefs of foreign  intrigue, to guard against the impostures of pretended patriotism--this  hope will be a full recompense…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to congratulate the  County on receiving the prestigious Audrey Nelson Award, a national  honor that recognizes exemplary achievement in serving communities and  low- and moderate-income residents through the innovative use of  Community Development Block Grant (CDBG) and HOME Investment  Partnership funds.\n\nThe Audrey Nelson Award is bestowed annually…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…of the  American Dream.\n\nMr. Speaker, I love the fact that this legislation focuses on  overregulation of manufactured housing, an outstanding solution for  many low- and moderate-income individuals who just can't get there in  terms of a downpayment or just can't get there in terms of the monthly  payment. Manufactured housing, especially in rural…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…mistakes. This moment is not  ideological. It is about who fights for the people and who fights for  the elites.\n\nI believe first and foremost that if you are using labels like  ``moderate'' or ``progressive,'' you are missing the entire point. I  gave former President Biden hell for failing to secure our border. I  think that is a nonpartisan issue. That doesn't…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Land Management stop to consider the $46 million in lost revenue to  the State of Montana, money that helps pay for K-12 education.\n\nMake no mistake, this amendment was not a moderate, science-based  decision. This was the heavy hand of Big Government crushing an entire  industry in the name of a radical Green New Deal agenda. It was the  inevitable result…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…amount of these, and not having future  Presidents find themselves deterred from executing what they believe is  best in a timely fashion, that we come together and vote this moderate  and, quite frankly, modest piece of legislation. It won't stop all  national injunctions, but it will define more narrowly when they can be  done. I hope we would do that.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…marked the destiny of nations. But if I may even  flatter myself that they may be productive of some partial benefit,  some occasional good, that they may now and then recur to moderate the  fury of party spirit, to warn against the mischiefs of foreign  intrigue, to guard against the impostures of pretended patriotism--this  hope will be a full recompense…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…taught in this capacity for a few years and then, once  again, decided to obtain an additional credential in special education  so she could support students with mild to moderate learning  disabilities.\n\nMiss Angell also provides students with a special opportunity by  being qualified to teach dual enrollment classes through a partnership  with a local…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "French Hill", "party": "Republican", "sentence": "…measure housing goals and targets;\n\n(iv) a range of affordability for rental units, with a       prioritization of units attainable to extremely low-, low-,       and moderate-income residents;\n\n(v) a range of affordability for homeownership;\n\n(vi) accountability measures;\n\n(vii) the long-term cost to residents and businesses if       more housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…extends to expression not only of verbal  communication but also in art, writing, the media, and action. Certain  forms of expression are forbidden by sharia. Non-Muslims and moderate  Muslims who openly criticize Islam, Muhammad, or the Koran face severe  punishment. Remember Salman Rushdie, who was stabbed under a fatwa just  for writing about Muhammad.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…higher income, we are paying a  higher percentage of the Federal income tax. What we also did was we  functionally took half of our brothers and sisters who make much more  moderate wages and pulled them off the tax system. They are still  paying payroll tax, which is Social Security, Medicare, unemployment,  and disability, paying into those as sort…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…``blue skies'' as well.  She completed the agency's stringent 3-day VITA (Volunteer Income Tax  Assistance) training in December and became IRS certified to assist  low-to-moderate income families throughout tax filing season. Donna  volunteers her time as a tax preparer, working one on one with  families, at 3 of 5 Hernando preparation sites, equaling…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}]