[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…up for those who have sacrificed for all of us.\n\nAs we head into Memorial Day weekend, we must recognize the  responsibility that we have as elected officials, not just on Monday  but every day of the year, to honor those who have given their last  full measure of devotion by fulfilling our commitment to all of those  who have served our country.\n\nOur…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691492/protecting-american-maritime-research"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…tariffs, particularly on Canada, although we  heard today that he announced a number of others.\n\nI have been hearing from a lot of small businesses in New Hampshire.  But on Monday, I visited a bakery in Derry, NH, that may have to go out  of business due to what President Trump is proposing on tariffs on  Canada.\n\nThe owner of Chatila's Bakery moved…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…because of the chaos  and confusion that continues at the Veterans Health Administration and  the sliding downward of service that is available to our Nation's  heroes.\n\nOn Monday, VA Secretary Doug Collins announced that he would be  abandoning his disastrous plan to fire 83,000 VA employees, and the  reason is pretty simple: The Trump administration…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…voting  multiple times.\n\nA former GOP lawmaker in Arizona pled guilty to attempted election  fraud involving forged signatures.\n\nIn North Carolina, four people pled guilty on Monday to misdemeanors  for their roles in absentee ballot fraud in rural North Carolina during  the 2016 and 2018 elections to help Republican congressional  candidates.\n\nLet's not…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…need  to make sure we remain vigilant and keep working hard to protect those  rights.\n\nI had a chance over the weekend to do a couple of things. Friday,  Saturday, Sunday, and Monday, I had a chance to visit churches and  groups that were celebrating Dr. King, remembering Dr. King. I went to  First Baptist Church of Highland Park, Faith Temple No. 2, and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Motors? Where are your Chevys? Anything?\n\nMy goodness gracious, we boast and love making vehicles in Michigan  and selling to the world. I do this program called Manufacturing  Monday. There are hundreds of parts, components, that get made in any  car. I visited hundreds of manufacturers, Mr. Speaker, and I mean,  really, I go onto their factory floors.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…faith  leaders, Second Amendment supporters, and civil libertarians.\n\nAnd there is the man in the truck that I saw when I was in  Minneapolis, taking groceries to people on Monday. He is in the truck,  and I drive up. He is, at first, kind of concerned that I might be ICE.  Then he is worried that I am going to think that he is ICE. And we  start to…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…one of the Nation's most  storied and steadfast institutions in the history--the entire history-- of our Nation, the U.S. Marine Corps, which marks its 250th anniversary  on Monday.\n\nAs legend and history have it, 250 years ago, in the back room of Tun  Tavern in Philadelphia, a new fighting force was born, a force of grit,  determination, and unshakable…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the vessel, which killed the survivors.\n\nInitially, as he often does, the Secretary of Defense and his office  denied the reporting when it broke last weekend. But then, on Monday,  White House Press Secretary Karoline Leavitt confirmed that, in fact,  Secretary Hegseth did authorize these strikes and that Admiral Bradley,  the operational commander,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…favors.\n\nThose who are part of the evangelical movement see what is happening  to the country. They have an opportunity to preach on Sunday all of the  righteousness, and then on Monday they benefit from the bigotry. As a  result, righteousness becomes secondary to the loyalty that they  pledged because he did something for them.\n\nI say to my dear friends…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…reconsideration with respect to Executive Calendar No. S.  Res. 377 be at a time to be determined by the majority leader, in  consultation with the Democratic leader, no earlier than Monday; and  that if cloture is invoked upon reconsideration, the postcloture time  be deemed expired.\n\nWhat does that mean? It means that you would have kept your  optionality to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…no starvation in Gaza.\n\nLet me be clear. That is a lie. The world knows it is a lie. We know  that it is a lie. Donald Trump knows that it is a lie. President Trump  said on Monday:\n\nSome of those kids--that's real starvation stuff, I see it,       and you can't fake that.\n\nThe use of food and water and medicine as a weapon of war against  civilians--including…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…NATO, and decimate our international aid  programs, our adversaries are greedily and happily waiting to fill the  gaps that this administration is deliberately creating.\n\nOn Monday, the United States joined Russia, North Korea, Belarus,  Sudan, and Hungary--I will name them again: Russia, North Korea,  Belarus, Sudan, and Hungary--a group of countries…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…within 60 days.\n\nThe Trump administration delivered its war powers notification to  Congress on September 4. The 60-day window to receive congressional  authorization closed on Monday without approval being rendered. A law- abiding administration would cease its operation, but the Trump  administration continues on.\n\nIncredibly, according to public reporting,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…what? She was fired too.  When she was called to testify as a whistleblower about her  termination, she was called by Democrats to Congress. Then the Friday  night before the Monday she was to show up in Congress, armed law  enforcement agents were directed to show up at her house on a Friday  night, late, knocking on her door, and they tried to intimidate…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…administration will raise interest rates.''\n\n--Semafor article, 1/12/26\n\nSenator Cynthia Lummis:\n\n``Senator Cynthia Lummis, one of Powell's more strident       critics usually, on Monday said the Justice Department's use       of a criminal statute looked like a ``heavy lift'' and that       she did not see any criminal intent.''\n\n--Reuters article, 1/12/26…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Carol Brisbois has made through her work with  Metropolitan Ministries. Carol has been a dedicated volunteer at  Metropolitan Ministries since 2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm,…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690148/recognizing-carol-brisbois"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…League Baseball  Draft. Seth Hernandez, Billy Carlson, and Brady Ebel were selected in  the First Round on Sunday, and Ethin Bingaman was selected in the  Twentieth Round on Monday. This is the first time in Major League  Baseball Draft history that three players from the same high school  were drafted in the first round. I am always proud to calI myself…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693755/recognizing-seth-hernandez-billy-carlson-brady-ebel-and-ethin-bingaman"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…enough to make  up for jobs lost because of EPA regulations.                   [From the New York Post, Feb. 8, 2021]\n\nWashington--White House press secretary Jen Psaki on Monday       mocked a reporter who asked when workers on the canceled       Keystone XL pipeline would get ``green jobs'' promised by       President Biden.\n\nIt's expected that up…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…more years, more direct checks to insurance companies,  taxpayer money with no accountability.\n\nSo how bad are these programs? Well, let's just take a look at the  headlines.\n\nMonday's Wall Street Journal: ``ObamaCare Is a Mecca for Fraud.''\n\nThe Democrats must be in favor of all this fraud because that is what  they want to do. They want to continue it…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…for  allowing him to travel, as Mr. Garamendi just said, all that way to and  from the great State of California. After those long trips, he would  come in, and you knew on Monday or Tuesday nights, the start of the  session, when he would come in here wearing some tattered clothes. He  was a little bit disheveled, but he had had a long day.\n\nHe was…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698719/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, as expected, there has been some commentary  on the process I initiated Monday--a process to restore Senate  precedent and codify in Senate rules what was once understood to be  standard practice, and that is the Senate's acting expeditiously on  Presidential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Ellen Tantillo has made through her work with  Metropolitan Ministries. Ellen has been a dedicated volunteer at  Metropolitan Ministries since 2016. Monday and Friday mornings at the  Metro Welcome Center are lively and welcoming, thanks to this  remarkable woman. She greets both new and returning volunteers with  enthusiasm,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690680/recognizing-ellen-tantillo"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…hope they bring it home from Miami, and I have no doubt  they will.\n\nAs Coach Cignetti has said himself: This would make one heck of a  movie.\n\nGood luck to the Hoosiers on Monday.           Congratulating Indiana State Fair Queen Presley Hampton\n\nMrs. HOUCHIN. Mr. Speaker, I rise today to congratulate Presley  Hampton of Jackson County on being named…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…predict that we  were going to be out of the shutdown. Some said as early as Wednesday.  One confidently predicted Thursday. A couple more said Friday. So when  I came back on Monday, I was pretty sanguine about things.\n\nIt gives me no joy to say this, but I was wrong. I don't know. As bad  as this multiple-vehicle pileup looks from the outside, you ought…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  Lycoming County Sheriff Mark Lusk, who retired Monday after 50 years of  outstanding community service.\n\nMark was elected as Lycoming County sheriff in 2009 and served in  this role for four consecutive terms. Over his 50-year…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698576/recognizing-mark-lusk"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…but also for who she is as a person. From day one, it  was obvious that she would fit well with Team Bice. Her attitude,  spirit, and wit will be truly missed, especially at Monday morning  coffee.\n\nThis past weekend was the 126th Army-Navy game. As a member of the  Board of Visitors at West Point, this is not easy to say, but for  Simona, I will: Congrats.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698207/recognizing-simona-elvin"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…volleyball team at Southern Virginia  University in Buena Vista, Virginia, which has brought home the  school's first-ever NCAA Division III National Championship victory.\n\nOn Monday night in Salem, Virginia, the Knights defeated powerhouse  Springfield College in a thrilling straight-set sweep of 25-20, 25-23,  and 27-25, capping an extraordinary 35-1…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…in the Chamber, if they are in the complex  and haven't hopped on a plane to fly home because we had our final vote  on a Thursday morning and we are going to come back on a Monday night  in our usual way of doing things in the swamp, not doing what we should  do, does anybody believe that this is going to save the fiscal health  of America?\n\nLike I said,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…used under the following conditions:\n\n4.4.1 Balcony 1 is reserved for use by Senators only.       Reservation requests can be submitted to the Rules Committee       for use Monday-Friday, 7 a.m. to 10 p.m., or at such times as       may be authorized by the Rules Committee.\n\n4.4.2 Senators may submit requests to the Senate Radio-TV       Gallery to use…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690981/us-senate-hallways-and-balconies-regulations"}]