[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…to people  escaping violence, people will die.\n\nWhen we reduce development assistance that ensures people have access  to food and clean water, people will die.\n\nWhen you cut money to Ukraine for food security and energy grid  resilience, more people will die in their war against the Russian  invasion.\n\nUSAID is our strongest soft power vehicle. Even…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692547/rescissions-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…that he wanted to be on  the helicopter all the time, and that he was following him around,  going to Mar-a-Lago, showing up to these Cabinet meetings, and throwing  all his money around and all that stuff.\n\nIn fact, in response to all the drama, Donald Trump fired back on  Truth Social: ``Elon was `wearing thin,' I asked him to leave, I took  away his…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…agencies, help the government better manage software needs, and  ultimately save taxpayer dollars.\n\nAgencies across the Federal Government spend around $33 billion in  taxpayer money on software every year, but right now, many agencies  don't actually have a list of what they own, what they are fully using,  or whether they are buying the same thing twice.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698152/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Trump 2.0, 365 days of terror,  abuse, and violations of our rights.\n\nAfter infusing $150 billion into DHS and ICE, people in this Chamber  have chosen to give them even more money, even after seeing what DHS  does with its unlimited resources, even after seeing what they do with  unchecked power.\n\nLet me say what they did to Silverio, what they did to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699667/horrific-ice-abuses"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…town had to make a decision about repaving  a road. It is a gravel surface. In order to get repaved more than a  year after the road had been repaired, with the town borrowing money it  really couldn't afford for a project that clearly was ultimately going  to be covered by FEMA, the town clerk was getting questions about, what  is the size of the gravel…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…The Trump administration has rescinded over a billion dollars from  State and local behavioral health programs under mental health and  substance use block grants. This is the money that goes back to the  States, the counties, and the towns to open up the centers,  particularly for young people. That is where this all happens. It  happens at the local…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…especially when we talk  about FEMA. FEMA gets $5.7 billion, including $3.8 billion for Federal  assistance, which is a 20-percent increase above fiscal year 2025.  Again, that money goes back to help firefighters and disasters.\n\nAgain, it also provides money to CISA. As you know, there were cuts,  but we are providing money there to make sure that we fight…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I rise in opposition to this year's  massive $900 billion military spending bill.\n\nThis legislation gives more money to the so-called Department of War  than to our Department of Education, Transportation, and Health and  Human Services combined.\n\nMr. Speaker, can you ask my Republican colleagues…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698052/opposition-to-the-military-spending-bill"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…footing the bill of Big Oil's  methane waste, paired with Federal funding to help big oil companies  reduce their waste.\n\nReducing methane waste in the atmosphere saves consumers money. It  protects local communities from pollution; and methane, as you know, is  a superpotent greenhouse gas.\n\nScientists agree that reducing methane is one of the best things…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…BYNUM. Mr. Speaker, I rise today to recognize the impressive  efforts of Clackamas Community College President Tim Cook, who ran more  than 1,400 miles over 52 days to raise money and awareness for Oregon  students. His journey, which started on the Oregon-Idaho border,  visited each of the state's 17 community colleges. Averaging roughly a  marathon…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694754/recognizing-clackamas-community-college-president-tim-cook-on-his-impressive-fundraising-efforts"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…bill is premature. VA has not  yet seen fit to provide Congress with full and complete justification  for its budget request. We have no clear idea how VA intends to spend  the money we would be appropriating through the Department.\n\nAt worst, I would say the Republican majority has rushed forward with  a bill that is completely divorced from our current…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…If we defeat the previous question, we can claw back the $75 billion  in the ICE slush fund that Trump and Republicans established with their  big, ugly law and redirect that money to where it belongs: lowering  healthcare costs.\n\nIn that same bill, Republicans cut more than $1 trillion from our  healthcare system, jeopardizing millions of Americans.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…majority of them work. That is the program Republicans  want to target? Give me a break.\n\nI will go right through the list.\n\nWe can debate waste, fraud, and abuse all day. The money that DOGE  has supposedly found in waste, even if you believe that number, is  totally offset by the tax breaks for billionaires in this resolution. I  mean, with all the chaos…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…industry. It was disgraceful.\n\nThat is what is wrong with this government--the corruption. The oil  industry promises Donald Trump that Harold Hamm will raise him a ton of  money, so Trump cuts out clean energy, and these guys went right along  with it. The cost of groceries is up. Rent is up. Housing foreclosures  are up. Healthcare is about to soar…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Charities  and the BAPS Temple in Chantilly for hosting its annual walkathon at  One Loudoun in Ashburn.\n\nThe walk, which I was proud to join, was a huge success and raised  money for Mobile Hope which serves at-risk youth in Loudoun County.  BAPS Charities is a global charity, active across the country and in  nine other countries, and its efforts are…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691837/congratulating-baps-charities-and-baps-temple-walkathons"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, I thank my good friend from Utah for his  leadership.\n\nMr. Speaker, the United States spends more money per student than any  country in the world, yet among developed nations, we sadly rank near  the bottom in educational outcomes.\n\nMr. Speaker, 70 percent of eighth graders,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…Regulatory Certainty Act  were included, clarifying, once and for all, that digital asset  developers and service providers who do not custody consumer funds are  not considered money transmitters.\n\nImportantly, the CLARITY Act will help further decentralize our  financial system so that Americans can forgo intermediaries and  transact directly with each…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…sales, and food stands at the Manheim Farm Show. This does not include  past traditions like car shows at the football field and plastic boat  races on the creek. Ultimately, the money raised within the community  is reinvested back into the community.\n\nThe Manheim Lions are currently led by Club President Aaron  Henderson. They are one of 49,000 Lions clubs…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696418/recognizing-100-years-of-the-manheim-lions-club"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…able to advance welfare and Medicaid reforms, SNAP work  requirements, commonsense work requirements for Medicaid.\n\nWe phased down the Medicaid provider tax threshold to save money and  save hundreds of billions of dollars, cracking down on States' provider  tax money-laundering schemes--which were going to illegal aliens--we  saved money, made the system…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…examples barely skim the surface, Mr. Speaker, and it is really  no wonder why Americans are outraged that their tax dollars are being  squandered.\n\nIt is the American people's money. A single dollar of taxpayer money  wasted is $1 too many in our view.\n\nThen there is NPR. I honestly don't even know where to begin on that  one. Even if someone were to accept…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…wealthiest companies, the richest,  biggest companies, not just in America, not just in the world, but in  the history of the world.\n\nBut I just want to say that no amount of money justifies subjecting  our children to sexual abuse. No amount of money justifies  ``sextortion'' of children on these platforms.\n\nI don't care what Facebook's market cap is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…States, and this bill  is about rightsizing our regulations in support of investments and  jobs.\n\nThis commonsense bill will help more well-run companies responsibly  raise money in the public markets. It rightsizes regulatory burdens and  frees up more resources for companies to invest in American jobs and  American innovation.\n\nThe well-known seasoned…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Governor Newsom has just taken out an  emergency loan from the general fund in order to cover payments. On top  of that, he has asked the legislature to appropriate even more money,  billions more.\n\nThink about what this means over, let's say, the next 10 years. If  the cost has grown from a few billion dollars to $9.5 billion just in  this first year,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…operations.\n\nSo the Democrats are holding up the Department of Homeland Security  bill. Ironically, because of the continuing resolution that we passed,  we are funding ICE with more money than we would have otherwise if we  just passed the regular Homeland Security bill because Republicans are  working on fiscal restraint.\n\nAlso ironically, they actually can't…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…line their town's main  streets with American flags made here in the USA by the Saratoga Flag  Company.\n\nTo pay for all 78 flags and the necessary hardware the Troys raised  money through neighbors and local businesses. To install the flags, the  Troys partnered with Veteran Mike Savage, the Middle Falls Fire  Department, and local leaders so that the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…have the legal authority to issue a CBDC  to individuals absent explicit authorizing legislation from Congress.  The Supreme Court has also recognized Congress' power to coin money and  regulate the value thereof, implicitly denying to the executive branch  or to the Fed the ability to do this without congressional authority.\n\nThat said, I think it is…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…referring to the shutdown as  leverage.\n\nUltimately, House Republicans voted to fund the government and end  the suffering. However, we never lost sight of undoing the self-serving  money grab from taxpayers by a select group of Senators.\n\nHours before our vote, I introduced the first standalone bill to kill  that provision. I also cosponsored Representative…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…think that is entirely different than a sex change operation. That  doesn't say the person doesn't have it. With regard to the military and  the funding, that is not where the money should come from.\n\nHow about telling that child who has asthma that he has no treatment?  How about telling that child with a mental impairment there is no money  to do it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…little harder to figure out whether it works or not.  We have got plenty of evidence it doesn't work. Central bank digital  currency inserts government between you and your money.\n\nAnother word for central bank digital currency is programmable money.  Who does the programming? The central bank. They can condition your  access to your own money with…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693732/anti-cbdc-surveillance-state-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…for homeownership  in the country, but I know the dream of owning a home is still out of  reach for many Hoosiers. Every day, I hear from families that work  hard, save their money, and still cannot find a place to call their  own. Unfortunately, this is true not just for families in my district,  but for the families across the country, as well.\n\nHouse…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}]