[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "The Community Development Financial Institutions, if that lapses, the  money will be withheld in funding for almost 1,500 credit unions,  banks, and community financial institutions.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-02-03"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Then this week he said that: ``If the massive deficit spending  continues, there will only be money for interest payments and nothing  else: no Social Security, no medical, no defense, nothing.''\n\nThis week he said about the big, ugly bill: ``I am sorry, but I just  can't stand  it anymore.", "title": "Which Elon Musk to Believe", "date": "2025-06-06"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "It is a  money market account that, under this law, must pay zero percent  interest.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Why is it that we always have money for bombs, but when it comes to  helping improve the quality of life for our people, we are told we  can't afford it?", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "But the Secretary of Defense is committed to accepting  the gift of this plane and then spending upwards of $1 billion of  taxpayer money in order to retrofit this plane--$1 billion that we  don't need because we are already spending $4 billion on the two  Boeings.", "title": "Motion to Discharge--S.J. Res. 54", "date": "2025-06-11"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "That is taxpayers' money that  he wants to get his hands on.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "75  because these resolutions roll back common-sense energy efficiency  standards for commercial refrigerators, freezers, and walk-in coolers-- standards that were rigorously developed by the Department of Energy  (DOE) to save businesses money while cutting energy waste.", "title": "Opposition to H.J. Res. 24 and H.J. Res. 75", "date": "2025-03-27"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Not because the money is gone; it is there.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "I am committed to continuing this work in Congress and fighting to  lower tolls even further and pushing for policies that put more money  back in the pockets of working families.", "title": "Recognizing the Remarkable Work of Sewa International", "date": "2025-07-21"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "On page 244, lines 5968-70:\n\nIf the grant has already been granted and the money is       obligated, then this--then our language does not affect that.", "title": "Greenhouse Gas Reduction Fund", "date": "2025-07-09"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "More  importantly, they cost the company seeking to do this work more money  when they disturb these artifacts and are faced with fines and cleanup  like the Mica shipwreck, which was bisected by a pipeline in 2001.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-06"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "It is a bipartisan bill, and it directs $10  million of already-appropriated money to the National Science  Foundation for a grant program that will support the modernization of  mathematical and statistical modeling for education across this Nation.", "title": "Mathematical and Statistical Modeling Education Act", "date": "2025-03-24"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "That is what the skilled workers at the  Hanford Site have been working on for years--years, years--really-- literally 23 years and about $24 billion in taxpayer money to build a  vitrification plant that supports 3,000 jobs in the Tri-Cities to get  this post-World War II job done.", "title": "Hanford Site Cleanup", "date": null}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "For decades, families have been promised the right to send their kids  to good public schools, regardless of how much money they make or their  child's disability.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "They do not want us  spending endless amounts of money to invest in death and destruction.", "title": "No More Wars", "date": "2025-06-25"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "President Trump said the money shouldn't  go to insurance companies; it ought to go to the consumer, because who  knows better than the consumer what they actually need in terms of  their health insurance coverage.", "title": "Trump Administration", "date": "2026-01-07"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Central bank digital  currency inserts government between you and your money.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "As the Department of Energy acknowledges in its own analysis,  the increased capital expense caused by these standards may take more  than--not many small businesses will invest their money if it is going  to take more than 10, 75, and up to 94 years.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator- Freezers''", "date": "2025-03-26"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "We spend trillions of  dollars a year to do this, and that money we spend didn't just fall  from Heaven.", "title": "Welfare Fraud", "date": "2025-12-03"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Spend less money.", "title": "United States' Fiscal Situation", "date": "2026-02-04"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Unless we want to pass along $37 trillion, and climbing, of debt to  our children, we have to start spending money on the must-haves, not on  the nice-to-haves.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "It will also reduce postage costs, allowing the VA to spend money in  ways that better serve our Nation's heroes.", "title": "Delivering Digitally to Our Veterans Act of 2025", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I just don't know if intellectually, when  you think about the things you heard behind these microphones this last  week, how many of our brothers and sisters here, how many of the  public, how many of the armies of lobbyists that are in the hallways  here lined up saying they want more spending, more money, more  regulation on their competition understand this.", "title": "A Real Math Problem", "date": "2025-03-06"}, {"senator": "John Thune", "party": "Republican", "sentence": "It  spends less money than a continuing resolution.", "title": "Appropriations", "date": "2026-01-08"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "If a city  refuses to enforce America's laws, it has no right to another dime of  American money.", "title": "Immigration", "date": "2026-02-04"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Some expenses surprised       her, and she was suddenly out of money for the month.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''", "date": "2025-04-09"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "For many families in the Big First District of Kansas, that money  could be used much better elsewhere.", "title": "National Guard Shooting", "date": "2025-12-02"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "You are trying to explain it about the amount of money we  are borrowing per family or taxpayer per second.", "title": "Economic Anxiety", "date": "2025-05-01"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "So we have to get the government back to work because it costs money  to shut the government down, and it costs money to open the government  up.", "title": "-9999", "date": "2025-10-09"}, {"senator": "French Hill", "party": "Republican", "sentence": "De La  Cruz) for her leadership on this important issue to make sure the Fed  is ready and the discount window use is appropriate for the 21st  century, where money now moves, Mr.", "title": "Bringing the Discount Window Into the 21st Century Act", "date": "2026-02-09"}]