[{"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…in 2020. In the years after her passing, the Castellano  children were the driving force behind the foundation until its  operations concluded in 2023. The impact of their monetary  contributions is exceeded only by the change they cultivated on behalf  of the Latino community by pushing for cultural preservation and more  diverse representation in nonprofit…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…million cases, and avoiding 430,000 school absence days  and 25,000 lost workdays.\n\nOne estimate found that this Good Neighbor Plan would provide over  $16.2 billion in net monetary benefits when you count the hospital  visits, the lost workdays, the school days, the doctors' treatments-- all that adding to $16.2 billion. That is no bargain for the United…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…the United States.\n\nMembers of the Caribbean diaspora also have a longstanding legacy of  economic contributions, both in the U.S. and in their countries of  origin. Through monetary and social remittances, they play a vital role  in supporting sustainable economic development in the Caribbean, with  these contributions representing significant percentages…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…school you probably learned of fiscal policy, and that is what the  Congress of the United States does. We create the budget of the United  States. Fiscal policy is here, and monetary policy is at the Fed,  establishing the rates in terms of relating to inflation.\n\nLet's rid ourselves, disabuse ourselves of notions. Instead, we need  serious ideas about…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…comfortable acting illegally, and who wasn't comfortable with  judicial rulings. It is hard for us to imagine that President, but this  could be abused.\n\nIt could be used for monetary policy, a bad idea. It could be used  for taxation, a bad idea. It could also, by the way, be a trusted  electronic currency  for an unbanked population. It could be a way…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Rubicon--even  for Donald Trump, who has crossed many Rubicons already, to his  detriment and to the country's detriment.\n\nAmerica's economic stability depends on impartial, stable monetary  policy. Our central bank must always operate free of coercion, free of  intimidation, and free from short-term political calculation. But what  Donald Trump is doing is the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…California and cosponsored by Representative Green of Texas.\n\nH.R. 910 requires the United States to advocate for Taiwan's  membership and participation in the International Monetary Fund, also  known as the IMF.\n\nTaiwan is currently seeking to join the IMF, and I believe we should  support this effort.\n\nThe IMF was formed in 1944 to encourage economic…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…balance of  my time.\n\nMr. HOYER. Mr. Chairman, I again urge the rejection of this  amendment. It is clearly designed to alter opinions based upon the  threat of being reduced in monetary ability to proceed.\n\nThey disagree with the judge. There is a way to go about that. It is  to appeal, not to threaten financial retribution.\n\nMr. Chair, for the sake of our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…based  in reality. People have tried these work requirements in the past, but  even disabled or able-bodied people--we all have barriers, from  childcare, transportation, and monetary limitations. It is a foolish  idea to think that this won't have a negative impact.\n\nThey are just trying to remove people from the program, and it is  cruel.\n\nPatrick is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…1984 to provide funding  for State victim compensation and assistance programs, the Crime  Victims Fund does not rely on taxpayer dollars. Instead, it is funded  by fines, monetary penalties, and assessments paid by convicted Federal  defendants, as well as forfeited bail bonds and other gifts and  donations.\n\nFor four decades, the Crime Victims Fund…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…becomes liable,  becomes legally responsible, and citizens can seek redress against that  individual. They have legal recourse in court. They have a day in  court. They can seek monetary damages and a court order that stops the  violation. It is used all the time in the United States of America  against State or local police or law enforcement that break the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Service Officers, military  and intelligence officials, political appointees from both major  parties, Members of Congress and their staffs, Peace Corps and  International Monetary Fund officials, global business leaders, and  other professionals dedicated to promoting American interests and  diplomatic relations.\n\nThrough DACOR and the DACOR Bacon House…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…bill authorizes several economic levers available  to the United States. This includes potential sanctions and restricting  Burma's access to support from the International Monetary Fund. These  are sensible steps to demonstrate Congress' continuing support for the  people of Burma.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699833/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…watching this debate, is  the truth about the Biden-Harris policies, that when you combine  irresponsible fiscal policy in this Nation over the past 4 years and an  irresponsible monetary policy--what is irresponsible, Mr. Chair, is the  fact that our families are suffering from inflation, the highest in 40  years. It takes $1.21 for what cost $1 just 4 years…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688083/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Act to  prohibit the Federal reserve banks from offering certain products or  services directly to an individual, to prohibit the use of central bank  digital currency for monetary policy, and for other purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. HILL of Arkansas.  1919.\n\nThis bill has…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…emerging technologies by States, non-State actors, foreign       terrorist organizations, and other terrorist groups to evade       sanctions, finance terrorism, or launder monetary       instruments, and threaten the national security of the United       States; and\n\n(B) a strategy for the United States to mitigate and       prevent the illicit use of…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…actions with       respect to a loan made by a development company under this       title recommended by the Administrator; and\n\n``(11) the number and dollar amount of any civil monetary       penalty assessed pursuant to an enforcement action described       in paragraph (10).\n\n``(c) Availability of Report.--The Administrator shall make       available to…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…international synthetic drug sales from the People's Republic of China,  and the CCP never disclosed this program.\n\nIn addition, the select committee found that the CCP gave monetary  grants and awards to companies openly trafficking illicit fentanyl  materials and other synthetic narcotics. There are even examples of  some of these companies enjoying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Suspend Exemption; Reports to Congress.--The Securities and       Exchange Commission, acting in consultation with the National       Advisory Council on International Monetary and Financial       Problems, is authorized to suspend the provisions of       subsection (a) of this section at any time as to any or all       securities issued or guaranteed…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Studies observes:\n\nNo major power has suffered anywhere near these numbers of       casualties or fatalities in any war since World War II.\n\nAs these casualties mount, the monetary cost to lure new recruits is  increasing. Russian regions are increasing their signing bonuses for  contract soldiers, indicating that Russian recruitment is beginning to…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…it. There is, obviously, no silver bullet  that can magically make inflation disappear. The Federal Reserve  continues to struggle with this issue when they deal with the monetary  policy, with what the interest rates are. The good news is the rate of  inflation has gone down, but we still have the higher baseline sticking  around from the Biden era.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "French Hill", "party": "Republican", "sentence": "…ADMINISTRATION COUNCIL OF BURMA.\n\n(a) In General.--The Secretary of the Treasury shall       instruct the United States Executive Director at the       International Monetary Fund to use the voice and vote of the       United States, when assessing potential changes to any       shareholding formula in connection with a governance review…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Republicans voting against it, but  it can't get a floor vote in the Senate yet.\n\nThink about this. At the end of World War II, we knew we had to spend  less. Even then, they did a monetary reset. Some people might have  heard of this idea of a great reset. One of the core components of it  is resetting the money system.\n\nThe money system they have in mind is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…does raise serious  privacy concerns and concerns about government control and  politicization of loans, online payments, credit scores, tax  compliance, Federal contracts, monetary policy, and the like.\n\nIn addition to these privacy concerns, a central bank digital  currency would centralize Americans' finances, eroding the banking  deposit base. That…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…place from TCJA when  tax reform took place with Republicans.\n\nThe American Rescue Plan was stimulus spending masquerading as COVID  relief spending. It was massive amounts of monetary policy added to the  system. There is only one equation, and that is inflation.\n\nLook at the difference between an inflationist and real wage growth.  Those are the two things…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of St. Vincent de Paul to  assist people who struggle to afford basic necessities. To help ease  these burdens, Assumption BVM collects grocery store gift cards and  other monetary donations for those in need.\n\nTheir outreach also includes the Caring for Friends program, which  provides home-cooked meals to individuals facing food insecurity.  Additional…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…CVF, has plummeted,  jeopardizing Federal support for these victims.\n\nThis fund does not use taxpayer dollars. It is solely financed by the  fines, settlements, and other monetary penalties collected from Federal  criminal prosecutions. From 2017 to 2023, the balance of CVF dropped by  over 92 percent. It was almost completely wiped out.\n\nCongress attempted…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Akwesasne  Mohawk students attending State University of New York institutions and  preferred-rate power from the New York Power Authority.\n\nThe settlement requires no Federal monetary contribution and clearly  defines the reservation's boundaries.\n\nNegotiated settlements related to Indian land claims under the Non- Intercourse Act require congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}]