[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…China, which is becoming the global leader in  clean energy technology, building almost three-quarters of the world's  solar and wind projects, according to the Global Energy Monitor. And  despite President Trump's claims that China is simply exporting these  technologies and not utilizing them, the New York Times reported that  ``In China, more wind turbines…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…highlight some of those concerns.\n\nFirst, based on congressionally mandated reports that the committee  has received, VA has not established enough metrics to allow Congress  to monitor the success of the program. Additionally, in our view,  grantees are not collecting or reporting complete data for all  participants, which further limits Congress' ability…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…research universities--and withholds  those funds unless an academic institution agrees to adopt his cultural  agenda or fire certain faculty or allow it to have some kind of a  monitor, some kind of a Big Brother overseeing what takes place in our  universities, it is a sign of a democracy in decline.\n\nNo. 3, when an administration, when a ruler goes after…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…collaboration. It carves a path for our small  businesses to lead the way.\n\nIt mandates a collaborative report within 2 years of its enactment.  This report will empower us to monitor and comprehend the effectiveness  of our research collaborations, providing us with the opportunity to  revise and refine strategies as necessary.\n\nI am excited, and I hope…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687907/doe-and-sba-research-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…1,000 of them, under the age of 1. They  never got a chance to pursue their dreams. They were cut down by  bombing and by malnutrition.\n\nThe IPC, the world's leading hunger monitor, published a report on  Tuesday, and I have that report here. Let me hold it up. This report,  it says:\n\nThe worst-case scenario of famine is [currently] playing       out…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…be.''\n\nWhen she was first diagnosed, Abby had to give herself       injections, and didn't have the insulin pump, phone app and       other devices she has now to help her monitor her blood       sugar. ``I didn't have the easiest time with it, so if I get       the chance to maybe help other kids not have that, it's       really important to me,''…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693470/recognizing-ms-abby-lachman-for-her-dedicated-medical-research-advocacy"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…limbs from fingers and toes  towards the torso. Loss of reflexes, such as the knee jerk, are usually  found. Usually, a new case of GBS is admitted to ICU (Intensive Care)  to monitor breathing and other body functions until the disease is  stabilized. Plasma exchange (a blood ``cleansing'' procedure) and high  dose intravenous immune globulins are often…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…of our most important  international financial institutions.\n\nAs H.R. 910 requires, the U.S. would be an advocate that the IMF  admit Taiwan as a member, allowing the IMF to monitor and evaluate the  health of Taiwan's economy, provide technical support to Taiwanese  officials, and support employment opportunities at the IMF for Taiwan  nationals.\n\nGiven…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…International Airport and met  directly with controllers managing the skies above Delaware. They are  working 10-hour days, 6 days a week, making split-second decisions to  monitor thousands of lives at once. The pressure is relentless, and the  margin for mistakes is zero.\n\nOn top of all of this stress, this administration and Republicans in  Congress…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans are trying to repeal today is first  and foremost a public health protection measure. It requires facilities  that emit the worst of the worst hazardous air pollutants to monitor,  report, and cut those emissions to the maximum degree of reduction  achievable, even eliminating them entirely if possible.\n\nThe rule also prevents any backsliding by major…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Monitoring System had halted  operation. This PRAMS, which was developed in 1987, is designed to  identify groups of women and infants at higher risk of health problems  to monitor changes in health status, to measure the progress toward  goals, and improve the health of mothers and infants. Over the last 38  years, the program has collected essential…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…anti-abortion clinics. They don't want accountability on those  clinics.\n\nI would tell my Republican colleagues not to lecture us about waste,  fraud, and abuse when they refuse to monitor anti-abortion clinics and  when they stay silent when Trump pardons over 44 people convicted of  fraud. That is a conviction of fraud, not just a suggestion.\n\nMr. Speaker,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…managers have  resorted to answering phones in place of receptionists because so many  employees have been pushed out. Amid all this, the agency no longer has  a system to monitor customer experience because that office was  eliminated . . . by Elon Musk. And the phones keep ringing. And  ringing.''\n\n``The turmoil is leaving many retirees, disabled…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…directs the Consumer Product  Safety Commission to launch a pilot program exploring the use of  artificial intelligence so that we can track injury trends, identify  hazards, monitor recalls, and identify products not meeting importation  requirements.\n\nThe reality is that the crooks are already using AI. The cops on the  beat need to be able to use this,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…American manufacturing, foster innovation, and protect  both our economic and national security. It gives the Federal  Government the tools and the authorities needed to map, monitor, and  respond to supply chain vulnerabilities before they escalate into full- blown crises.\n\nThis legislation includes critical provisions from last Congress'  Supply Chains…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…do to  infringe on civil liberties. However, there is a law that states that  every vehicle manufactured is going to have to have a kill switch in  it.\n\nThe car itself will monitor your driving, and if the car thinks that  you are not doing a good job driving, it will disable itself, so the  car dashboard becomes your judge, your jury, and your executioner.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…collaborated with the California Department of  Corrections and Rehabilitation to gather intelligence from inmates,  analyze trends in violence and narcotics distribution, and monitor gang  activity. Deputy Blair enhanced his training by becoming a jail  training officer and the team leader for the Custody Emergency Response  Team.\n\nSubsequent to his service…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…which       each such individual is affiliated.\n\n(C) A description of the following:\n\n(i) The capability of the Department of Homeland Security       to identify, track, and monitor such individuals.\n\n(ii) Any associated challenges with such capability.\n\n(D) A description of any action of the Department with       respect to the following:\n\n(i) Mitigating…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697015/syria-terrorism-threat-assessment-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…bicycles, scooters, and other micromobility       devices. The bill also would require the CPSC to determine       the applicable scope of covered consumer products and to       monitor and evaluate future revisions to the voluntary       standards and report to the Congress within five years of       enactment.\n\nUsing information from the CPSC, CBO estimates…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694306/ads-for-mental-health-services-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…States Government, including United States representatives at       relevant international organizations, should take to       strengthen international cooperation to monitor and mitigate       such financial stability risks and protect United States       interests.\n\n(b) Transmission of Report.--The Secretary of the Treasury       shall transmit…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…of this Act, the       Director of the Federal Protective Service shall--\n\n(1) conduct a comprehensive evaluation of the personnel       tracking system used to manage and monitor the deployment       availability of contract security personnel;\n\n(2) determine whether to replace the system described in       paragraph (1) with a more reliable personnel…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…resilience of our systems, particularly for small and rural utilities.\n\nThe Electric Supply Chain Act will boost these efforts by putting DOE  in the driver's seat to attentively monitor emerging threats and allow  the Department to utilize their existing authorities to address  vulnerabilities.\n\nIn recent years, we have seen how supply chain constraints and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…temperature sensors under this section       shall, after receiving written permission from the resident       of a dwelling unit, install such temperature sensor and       monitor the data from such temperature sensor.\n\n(d) Collection of Complaint Records.--\n\n(1) In general.--Each public housing agency or owner of a       covered federally assisted…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…monetary policy without  explicit authorization from Congress.\n\nI would like to pose a fundamental question to my colleagues. Should  the Federal Government have the power to monitor, control, or restrict  how Americans use their own hard-earned money? Further, should the  Federal Government be allowed to make such sweeping decisions behind  closed doors…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…bank digital currency may sound like innovation, but under  Federal control, it becomes a powerful and dangerous tool for  surveillance. This allows unelected bureaucrats to monitor and  potentially restrict how Americans spend their hard-earned wages.\n\nRecently, we have seen alarming examples of this kind of overreach,  from the Chinese Communist Party…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…advanced technologies to improve  wildfire detection, response, and suppression efforts.\n\nAerial capabilities are critical tools in combating wildfires,  enabling crews to monitor fire behavior and spread, conduct suppression  activities, and support ground operations. As unmanned aircraft systems  continue to mature, they present new opportunities…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…and survivors,       including with respect to actions made by the Secretary to       protect the identities of veterans and their beneficiaries.\n\n``(4) Developing methods to monitor fraud and scam metrics       within the Department to--\n\n``(A) provide internal and external reporting;\n\n``(B) enable advanced data analytics; and\n\n``(C) facilitate proactive…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the  bill (S. 2878) to reauthorize funding to monitor, assess, and research  the Great Lakes Basin, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698192/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…our work is ongoing, as of September 2025 18 of our 20       fictitious applications for plan year 2025 were receiving       subsidized coverage. We will continue to monitor the status       of these applications during plan year 2025.    All Four of Our Fictitious Applicants Received Subsidized Coverage in                                 Late…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed sale will significantly       enhance Japan's intelligence, surveillance, and       reconnaissance (ISR) capabilities and help ensure Japan is       able to continue to monitor and deter regional threats.\n\n(v) Justification: This proposed sale will support the       foreign policy goals and national security objectives of the       United States…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}]