[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…a vision where everyone is accountable.\n\nPlus, in this particular case involving Jeffrey Epstein, every single  one of us, all 100 Senators, know that Jeffrey Epstein was a monster, a  monster who groomed and abused underage children, a monster who  trafficked girls to rich and powerful men, a monster who destroyed the  lives of hundreds of young women.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…you no  offense. The voice of her innocent blood cries out from the ground  where it was spilled, where you try to cover and hide. But we saw what  was done.\n\nWhat kind of monster shoots an unarmed, fleeing woman in the head?  What kind of monster watches the video of that crime and chooses to lie  to the American people as they defend the murderer…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Has there been a  classified briefing on this? Are we aware of this?\n\nHe said: No, there has been no classified briefing yet, but there is  grave  concern about the Cookie Monster. Anytime you have ``monster'' in your  name, the American people ought to be made aware of it, and you ought  to be vitally concerned about what kind of habit this monster…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…United States. They are trying  to give him a jet plane.\n\nIt is humiliating for the American President to be flying around in a  plane created by the dictator, the theocratic monster of Qatar, while  they are collecting billions of dollars. His son-in-law, Jared Kushner,  has gotten $2 billion from Saudi Arabia.\n\nThis is totally in violation of the Constitution.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…hiding? What is Pam Bondi, the Attorney  General, hiding? Why won't they release the Epstein files right now?\n\nHe must explain to the public why he moved sex trafficker and monster  Ghislaine Maxwell to a cushy, low-security prison after her interview  with Trump's personal lawyer. He should declare, and every Republican  should say, that she does not…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696810/epstein-files-transparency-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…arrest for the murder of a different woman back  home in El Salvador. He had been deported three times in that year  alone, only to waltz back in across our open border.\n\nThe monster who murdered Laken had been illegally released into our  country under the Biden administration's humanitarian parole program.  He had been arrested in New York for endangering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…degree is from the Hebrew University of Jerusalem earning       an M.A. Public Administration from Harvard University. His       arousing, even disturbing novel, The Memory Monster (New       York: Restless Books, 2020), raises profound questions       reflecting the searing struggle of Israelis to come to grips       with the Holocaust's enormous impact…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…up a ``Sesame Street'' character here on the floor as if  ``Sesame Street'' is somehow going to go away.\n\nI was just watching a commercial on TV yesterday where the Cookie  Monster was actually doing an advertisement for Netflix because a  private company is paying money to run ``Sesame Street.'' It is not  going away. It is doing just fine. It is very…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…on the market by my bill are  in prime locations, so potential buyers should be prepared to act  quickly before these once-in-a-lifetime sales vanish like a ghost.\n\nThe real monster this bill is designed to slay, however, is one that  has been lurking around Washington for way too long: our national debt,  which now exceeds $38 trillion. That amount should…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…socialism is,  and we, those of us who did not vote for this guy, are going to pay the  price. It is up to all of us to fight back, to educate our youth, and  to contain this ugly monster so it does not spread and destroy our  country.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today to recognize the Monster  Energy American Motocross professional supercross racer Aaron  Plessinger on his remarkable victory and his second career win under  what many are calling the worst conditions…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689821/congratulating-supercross-rider-aaron-plessinger"}]