[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I stand before you tonight to honor and  to celebrate Black History Month.\n\nBlack History Month is not just a celebration, but a reminder of the  struggles, achievements, resilience, and contributions of Black  Americans throughout our Nation's history.\n\nIn New Mexico, it is…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687897/black-history-month"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…largely because the outage at Freeport decreased  U.S. natural gas exports, putting downward pressure on natural gas  prices.''\n\nThat is 30 percent inflation in just one month from just one  facility. Supply and demand is real. This is not complicated.\n\nMr. Speaker, understand what this bill is trying to do. By  stipulating that all exports are in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…we go again.\n\nAlmost 25 years ago, George W. Bush and Dick Cheney cooked up claims  of Saddam Hussein having weapons of mass destruction to justify going  into Iraq. Last month, just 2 weeks before ordering the capture of  Nicolas Maduro, Donald Trump designated fentanyl as a weapon of mass  destruction. Fentanyl is terrible. It is not a weapon of mass…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…and his wife who have worked  to do everything right. They budgeted. They made sacrifices. Yet,  today, they are paying $1,200 a month for health insurance, up from  $280 a month just a month ago because vital healthcare lifelines were  allowed to expire.\n\nRichard told me that they can identify places to make cuts in their  lives, but what worries him…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698785/breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Nothing happened.\n\nAugust 3, 2020, the President said: ``We are going to be introducing  a tremendous healthcare plan sometime prior--hopefully, prior to the  end of the month. It is just about completed now.'' Nothing.\n\nSeptember 15, 2020, the President says: ``You are going to have new  healthcare. We have other alternatives to ObamaCare that are 50…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…She and her husband own a  healthcare business, a wellness business, in Tampa. With the benefit of  the Affordable Care Act tax credits, they were paying about $300 per  month. Just like a lot of Florida families, they are hardworking  Americans, small business owners.\n\nAs they are too young for Medicare, healthcare costs are just killing  them. Without…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…work. We cannot be  afraid. We cannot be silent.\n\nThat is why I am here on the Senate floor today. By passing this  resolution and recognizing Jewish American Heritage Month, we are not  just celebrating the numerous accomplishments and contributions that  Jews have made to our country, we are sending the message back, a  message that Jewish people have…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…back home in west Michigan to my Special Order hour  honoring notable Black west Michiganders and the impact they have made  on our wonderful community.\n\nBlack History Month is not just about reflecting on the past. It is  also about acknowledging the incredible individuals who have shaped our  communities and continue to inspire future generations.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…from Virginia's Fourth District, for her  outstanding leadership and for leading this incredible hour.\n\nMr. Speaker, I rise tonight during National Gun Violence Awareness  Month not just with sorrow but with a sense of urgency. I rise tonight  during the National Gun Violence Awareness Month to shake the core of  our very beings.\n\nI want to be abundantly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…healthcare.  People won't be able to see doctors if they get sick. Medical bills  will stack up. Millions more will be left paying hundreds or even  thousands of dollars more every month just to maintain their coverage.  They will have to cut back on food or won't be able to make their rent  because of these steep increases.\n\nIn some cases, the damage has already…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…people.\n\nLet me tell you the story of Tracie, a small business owner, who  wrote that her family's premiums have tripled. Before the tax credit,  they were paying over $1,000 a month just to stay insured. With two  children in college, she wrote: Our family relies on these subsidies  just to support our students and pay our bills. We don't live  extravagantly.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…to see her monthly premium triple.\n\nSharon, in Thurston County, in my State--if Republicans refuse to  act, her premium is going to double, increasing by over $100 a month.\n\nAnd we are just getting started, because if Republicans refuse to  act, Nanette in Tumwater and Stacya in Seattle are both going to see  their premiums increase by $400 a month--not…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…the  Congressional Black Caucus but to Congress, the constituents we  represent, and to all Americans.\n\nIt is a privilege to be able to stand here today. Black History Month  is not just an opportunity to reflect on our past, but it is certainly  an opportunity to uplift our present and renew the cause to fight for  our future.\n\nI begin with a story because…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…``You know what? Something is wrong.'' They went to the emergency room,  and he, in fact, had a heart attack.\n\nPart of what we need to do with Men's Health Awareness Month is not  just identify the unique factors impacting men's health and the  policies that we can put in place to help people get and stay healthy  but also ensure that we are educating…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…James Clyburn of South  Carolina.\n\nYou see, Mr. Speaker--and to all those who are listening and watching  tonight--it is not only our 100th anniversary of Black History Month,  but it is just that, it is our history, as Mr. Clyburn has so aptly  outlined.\n\nFor the remainder of our first hour, you will hear from us. We will  speak directly to the American…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…the troopship. When, let's say, you were in the South Pacific  and coming back to the States, you boarded a troopship somewhere and  sailed, in some cases, for well over a month just to return to U.S.  soil. It was the same thing with the European theater or the North  African theater.\n\nThere was a long period of time where those combat veterans who had…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Congressional District of Missouri: The Funky  Buffalo Coffee House and Trading Company, a weird name, but a great  place. It is our September Small Business of the Month.\n\nNow, this just isn't an ordinary coffee shop. It is where community  happens, families gather, students study, friendships are built, and  real conversations are had like we used…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…supports our  children's health and gives a boost to our Nation's dairy farmers who  work hard every day to provide safe, nutritious products.\n\nMr. Speaker, National Dairy Month is not just a moment of  recognition. It is a call to action to stand with rural America, invest  in the next generation, and ensure our food policies are rooted in  science and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…pass the United States Senate very soon.\n\nFinally, when it comes to California's election system, it is much  more chaotic than any other State in the country. We take a month just  to count votes, so the entire country is waiting for California to  finish a process that takes everyone else a matter of hours or a few  days.\n\nWe have passed in the House…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}]