[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…and the Chinese  Government--concern because that means that, again, we are going to  allow this national security issue to fester and to continue on, maybe  for several more months.\n\nWhat we know now, though, in the middle of a global conflict, during  which we know our enemies can weaponize TikTok to spread their  propaganda and turn the world against…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in research--a 60-percent  increase in cures, hopes, and breakthroughs.\n\nBut what took us 10 years to build, President Donald Trump has all  but dismantled in less than 11 months.\n\nRecent reporting from the New York Times shed light on the dire  consequences of President Trump's medical research cuts. The President  and DOGE instituted a new set of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, I rise today to speak against the  administration's immigration enforcement policies.\n\nFor months the President and House Republicans have said that they  are only targeting violent criminals.\n\nWhy is it, then, that last week ICE attempted to deport a constituent  of mine…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…the Committee on Appropriations and the dedicated staff  for their tireless work.\n\nDespite serving in the minority, Democrats on the Committee on  Appropriations have spent months fighting back against the Trump  administration's proposed cuts to critical programs that support our  healthcare systems and save lives. These efforts have made a  difference.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…And just after Thanksgiving, her senior year in high school, Cindy  started chemotherapy. Each session lasted 3\\1/2\\ hours, and she had to  do them every other week for 6 months. She went to classes as much as  she could, took the SAT, and continued her plans to go to college. She  went to her senior prom, even though it was just 2 days after her…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, in just a few weeks, tax credits for the  Affordable Care Act are set to expire.\n\nThe President has had weeks and months to negotiate a deal that  addresses the healthcare crisis in this Nation. Instead, here in the  House of Representatives, the Speaker chose for us to be out of session  for…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697056/aca-tax-credits-set-to-expire"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…too late.\n\nI have seen this movie before, Mr. Speaker. It always starts with the  White House telling us that it will be quick, clean, and over in a  matter of days. Then, months later, years later, you get troops  deployed, kids coming home in caskets, and taxpayers paying for endless  quagmires that never end, and the same people here on the floor…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…people we represent. This week, it means tackling the  quality, affordable health insurance issue. It is no secret what  happened in this Chamber over the last several weeks and months. We had  the longest government shutdown in history--42, 43 days, depending on  how you calculate it, but it was a record.\n\nThe issue was whether or not we would do something…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…When they learned of her status, they stripped her of her green  card and threw her into ICE detention without another thought. She had  been trying to reach her family for months.\n\nAnother woman told me a story about a guard taking all of the women  out into the blazing Arizona heat. He forced them to march in circles  for hours without water. One woman…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…people were given a buyout if they resigned  by October. Others had simply put in their time and were ready to leave  and receive their earned retirement benefits.\n\nWe are here months later, and many of these Federal employees who  have served our country well are still waiting for their benefits and  the money that they are owed.\n\nOur office has seen a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699549/restoring-retirement-processing-for-federal-workers"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…decision, but not only for the benefits they are due, but  for the stability, the security, and the relief that comes with these  benefits.\n\nToo often, that wait stretches from months and sometimes into years.  During that time, veterans are left in limbo, unable to work,  struggling to support their families, and forced to navigate a system  that moves…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Chicago. We have seen it in Minneapolis and in other cities. This  administration is targeting legal immigrants who followed every rule  and regulation.\n\nOver the past few months, the Trump administration has issued a  flurry of new policies effectively ending lawful--lawful--immigration  for individuals from 39 countries. It harkens back to the bitter…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…procedure) and high  dose intravenous immune globulins are often helpful to shorten the  course of GBS. The acute phase of GBS typically varies in length from a  few days to months. Patient care involves the coordinated  efforts of a team such as a neurologist, physiatrist (rehabilitation  physician), internist, family physician, physical therapist,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…corporations and  billionaires but not the urgency or respect to help Americans afford  their healthcare.\n\nHouse Democrats are 100 percent united, and now four Republicans,  after months of delay, have finally chosen to join us to extend the  advanced premium tax credits.\n\nThat is why it is time for the Speaker to bring the House Democrats'  bipartisan discharge…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698367/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. NEAL. Mr. Speaker, the destruction that is taking place in  America's healthcare system during these 10 months is unbelievable.  They have eviscerated the National Institutes of Health. They have cut  back on the Centers for Disease Control and billions of dollars for  Medicaid for…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696736/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…appeal. If a party submits such written notice, the Board of       Land Appeals shall issue a final decision on the appeal by       not later than the date that is 6 months after the date on       which such written notice is received, except such deadline       may not be earlier than the date that is 18 months after the       date on which the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…leaders today. Let me remind them of what  happened. They inherited a government in January 2021 with 1.4 percent  inflation, and they delivered 9.1 percent inflation just 5 months  later. That was almost a sevenfold, 700 percent, increase in inflation  on the American people.\n\nWhen they talk about being good stewards of the American taxpayers'  tax dollars,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…calculated by multiplying--\n\n``(i) the total amount of contributions described in       paragraph (1)(A) with regards to such individual; and\n\n``(ii) the sum of the number of months described in       subclauses (I) and (II) of paragraph (1)(B)(i) with regards       to such individual; and\n\n``(B) to the individual not later than 60 days after the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…extraordinary measures. We are up against the debt  ceiling. We are not issuing new debt. We are only issuing refinance and  what comes due within the cap.\n\nWhat happens a couple of months from now when we all raise the debt  ceiling? I love the brain trust that says don't raise the debt ceiling.\n\nDid I mention last year for every dollar we took in, we spent…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I thank the chairman for yielding.\n\nI would first say it has been a great pleasure of mine to work with  the chairman over the past few months. He has done an incredible job  leading the Budget Committee and leading our Conference to a resolution  passed out of the House that not only extended the tax cuts but secured…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689909/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…leaders.\n\nWe congratulate Mikhail on this special accomplishment. He has earned  it. I very much look forward to hearing more about his progress and  accomplishments in the coming months and years. May God continue to  bless him and his family.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689068/recognizing-cadet-of-the-year-recipient-cadet-lieutenant-colonel-mikhail-karnaukh"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that we were stripping  away critical regulations. I would say, Mr. Speaker, if it was so  critical, why did the Biden administration wait until November 29 with  less than 2 months left in their term? If it was so critical, why did  the EPA in 2020 find that there was an ample margin of safety in the  regulations that already existed?\n\nMr. Speaker, this…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…celebrate the  one-year anniversary of T1 Energy's operations in Wilmer, Texas. On  November 1, 2024, production began at its state-of-the-art facility. In  just twelve short months, the company has already created more than  1,200 good-paying Texas jobs, including 200 held by proud residents of  Texas' 6th Congressional District.\n\nBy all accounts, the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…communities. I don't want to demean the  concept of a strong family, but it is one of the core aspects of having  a strong economy.\n\nThere is a lot going on now and in the coming months. I am looking  forward to seeing the Senate come together and getting us the  parameters that they would like to see with respect to this tax  package. We are working very…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…House. We are not for socialized  medicine.\n\nWhen I was a student, I remember being in Edinburgh in 1979. Mr.  Finch across the hall with socialized medicine had to wait 10 months to  get surgery for a blockage in his heart.\n\nWhen I came home, I discovered that in the United States it would  have been 3 days before he would have had that surgery. He…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…input on the topics of       such study.\n\n(c) Report.--The agreement under subsection (a) shall       require NASEM, or such other appropriate entity, not later       than 24 months after the effective date of such agreement, to       submit to the Director, the Secretary of Education, and the       Congress a report containing the following:\n\n(1) The…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…of the challenge at hand requires       overcoming the statutory 15-day Congressional Notification       timeline to expedite transfers to Israel.\n\n(U) Further, over the 15 months between Hamas' October 7       attack and implementation of the ceasefire, Israel has faced       attacks from Hizballah in Lebanon, the Houthis in Yemen,       Iranian Aligned…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…minimum--\n\n(1) if the event is cancelled, a full refund for the total       event ticket price;\n\n(2) subject to availability, if the event is postponed for       not more than 6 months and the original event ticket is no       longer valid for entry to the rescheduled event, a       replacement event ticket for the rescheduled event in the       same or a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Representative Jack for  asking me to do that. I think he has raised the expectations here, so  we will see what I can do.\n\nMr. Speaker, I have been in Congress now for 10 months, and this is  the second time the government has been shut down. What is similar in  them both is the reason because Democrats have put the priorities of  illegal immigrants…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "Mr. TUBERVILLE. Mr. President, for months, I have been raising the  alarm over radical Islam infiltrating the greatest country on the face  of the Earth, the United States of America.\n\nSome Americans see what is happening…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]