[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I thank Representatives Bynum and Figures  for organizing this Special Order hour.\n\nMr. Speaker, I rise to celebrate Black History Month and the profound  and vibrant legacy of the many Black Americans who have made our  country.\n\nBlack history is a living, breathing narrative that enriches our  Nation and influences…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…safety. While he and his enablers  claim that they are after the ``worst of the worst'' or that they are  only going after people who are criminals, that is just not true.\n\nLast month, Federal agents detained this youngster, 5-year-old Liam  Conejo Ramos, and his father from their driveway in Minneapolis, MN.\n\nIs this a criminal? Is this a public safety…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…failure of Republicans to extend the Affordable  Care Act tax credits.\n\nSusan, from Foster, Rhode Island, a marketing consultant, is seeing  her insurance go up from $600 a month to $2,100, a 250 percent  increase.\n\nSarah, a small business owner from Cranston, is seeing her premiums  go up more than $5,000 a year. Hillary, from Providence, her family…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696996/extend-the-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Unfortunately, Mr. Chair, Republican leaders refused to include the  Affordable Care Act enhanced premium tax credits in this bill, which  passed the House overwhelmingly earlier this month. I urge our Senate  Republican colleagues to stop stalling and extend the ACA subsidies  immediately to lower healthcare costs for millions of Americans who are  bearing the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699331/consolidated-appropriations-act-2026"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I am grateful to be here to co- anchor this Congressional Black Caucus Special Order hour for the month  of June. I thank my esteemed colleague and dear friend, Congresswoman  Jennifer McClellan, a Democrat from Virginia's Fourth District, for her  outstanding leadership and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…will soon  be able to see the contributions of women and value those contributions  will let them know that they can and should dream big.\n\nOn this final day of Women's History Month, I would be remiss if I  did not address the elephant in the room. No, it is not my Republican  colleagues. It is the attack on diversity, equity, and inclusion.  Including…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, it is Black History Month, and I came to give  you hell all month.\n\nThis weekend, ICE agents tear-gassed kids. Let me repeat that. ICE  agents tear-gassed kids. Protestors from union families in Portland,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699493/protests-in-portland"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…across this country are getting squeezed from every  direction. Groceries cost more. Rent costs more. Childcare costs more.  Healthcare costs more. For too many families, every month feels like a  math problem they can't solve.\n\nFor generations, the American Dream meant that if you worked hard,  you could build a stable life, you could afford a home, you…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, addiction is a public health  crisis from which no community is immune. We saw the worst of it in  2021, when, in a 12-month span, more than 110,000 people died of  overdose. That is 300 or more people a day, 365 days a year.\n\nHere is a small light. In 2024, overdose deaths fell by 27 percent.  We…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691500/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…remind the gentleman, but the last time I checked, his party is  in control of everything: the White House, the Senate, and the House.  You run the show. Maybe November will be a month of reckoning. Let's  hope so for the sake of this country.\n\nMr. Speaker, if we defeat the previous question, I will offer an  amendment to the rule to make in order amendment…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…share food directly with those in need.\n\nDuring COVID, she launched Waste to Taste, a free, no-questions-asked  grocery store that now serves more than a thousand families each month.\n\nTime and time again, Ms. Denson has stepped up to serve our most  vulnerable neighbors. Her grassroots work has touched thousands of  Oregonians and should serve as an inspiration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695683/recognizing-jennifer-denson"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Ms. SCANLON. Mr. Speaker, I rise today to speak about the White  House's pet project, the department of government inefficiency,  otherwise known as DOGI.\n\nFor the past month, our Federal workers and agencies have been  assaulted by a dilettante billionaire empowered by President Trump to  muck about in Americans' lives and Federal agencies.\n\nAmericans…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…district, families are doing everything they  can to make ends meet. They are juggling rising grocery costs, higher  rents, and healthcare bills that seem to grow every single month. They  expect this Congress to meet the moment with integrity, responsibility,  and the basic respect for the people who we serve. What Republicans did  was an insult to every…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…segregation, and of the enduring hope of working families seeking a  better life. Her name endures in our memory because her legacy endures.\n\nAs we close out Immigrant Heritage Month, Saint Frances Xavier  Cabrini challenges us to stand up to those in power who would seek to  divide us and pit us against our own neighbors.\n\nDespite those who seek to use…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…today to recognize five pioneering  Californians who this year were awarded Nobel Prizes for their  groundbreaking advancements in medicine, physics, and chemistry.\n\nJust last month, the Nobel Foundation announced the annual recipients  of their world-renowned awards, recognizing those who ``conferred the  greatest benefit to humankind.'' In 2025, a record-breaking…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Speaker, I rise today in belated recognition of  Post-Traumatic Growth Day--I repeat, post-traumatic growth.\n\nObserved annually on June 13 as part of National PTSD Awareness  Month, this effort was initiated by Boulder Crest Foundation, a  nationally recognized nonprofit helping veterans, first responders, and  their families turn their struggles into…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…period, to not       more than 1.25 percent of the aggregate square meter       equivalents of all apparel articles imported into the United       States in the most recent 12-month period for which data are       available.''; and\n\n(B) in paragraph (2), by striking ``in each of the 16       succeeding 1-year periods'' each place it appears and       inserting…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Madam Speaker, I rise today in recognition of Military  Appreciation Month.\n\nBeing an Air Force veteran myself, I understand the sacrifices that  are made every day by this Nation's men and women who serve in our  Armed Forces. These sacrifices aren't…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690884/military-appreciation-month"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Mr. Speaker, this month, our friend and partner, the  Republic of Azerbaijan marks the 36th anniversary of ``Black January.''\n\nThis period symbolizes the beginning of the end of Soviet rule over…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699195/recognizing-the-36th-anniversary-of-black-january"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…borrow the  Social Security money, and then the trust fund gets IOUs from the  Treasury, and we pay it interest? Then when the Social Security needs  money--which they do every month--because the tax receipts come in from  your FICA taxes and there is a shortfall, so they cash that in every  month?\n\nIf you add up all of the money and interest paid from…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…recognize an outstanding  Minnesotan, U.S. Immigration and Customs Enforcement Enforcement and  Removal Operations Field Office Director, Peter Berg. Peter is retiring  later this month after nearly 30 years in federal law enforcement.\n\nAfter graduating from the University of Illinois, Director Berg began  his career in 1996 as an Immigration Inspector with…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Madam Speaker, I rise today to recognize our July Veteran  of the Month, Edward Eugene Holmes. He was a proud Missourian and a  resident of the Missouri Veterans Home, and I got a chance to meet him  this past winter.\n\nHe just left this Earth last…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…achieving the rank of Eagle Scout and his  continued dedication to public service.\n\nOliver is currently a senior at Plano West Senior High School who  will be graduating this month with Honors. From a young age, he has  been a decorated Cub Scout and Boy Scout with Troop 219 in Plano.  Oliver has earned the Arrow of Light badge and served as the Senior…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…China has its sights set on the full- scale invasion of Taiwan.\n\nThe United States must not waver in our deterrence of this threat and  our support for this nation.\n\nJust last month, the commander of the U.S. Indo-Pacific Command  testified to Congress that China escalated military pressure against  Taiwan by 300 percent last year. Commander Paparo explicitly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  American Heart Month, observed every February, to raise awareness about  cardiovascular health.\n\nThe first CPR training occurred in the early 1960s. In 1964,  President Lyndon B. Johnson proclaimed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699741/recognizing-american-heart-month"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…on Energy and Commerce  has heard in hearings with grid operators, utilities, engineers, and  those charged with protecting the reliability of our grid. In fact,  just last month, the head of the NERC called the current reliability  crisis a five-alarm fire.\n\nThe State Planning for Reliability and Affordability Act prioritizes  the resources we need…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…stop the hearing. Oh, let's not worry  about putting this guy in jail. Let's let him sneak out the back door  so he is not removed from this country.\n\nThis was after about a month ago, our Governor, Tony Evers, nice guy,  came out with a directive implying that State employees ought not be  that gung ho when it came to removing State employees from this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, October is Breast Cancer Awareness  month. October is the month that we bring attention to the plight of  those who have had breast cancer and educate others on the importance  of early detection.\n\nMy wife Barbara…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…$12,000.\n\nNow, they have a choice. They are either going to pass that on to  their consumers in higher food prices, or they are going to continue to  pay an extra $10 or $20 a month in electricity.\n\nThat is what is going to happen that they don't realize, that what  they are wanting to do is mandate that businesses have to increase  their expenses at the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…stewardship.\n\nThrough more than two decades of service to the people of Papillion,  Mayor Black helped to guide the city into the thriving economic hub  that it is today. This month, he announced that he will not seek  reelection, which will conclude 17\\1/2\\ years as mayor and nearly 5  additional years of serving the city in other roles.\n\nMayor Black…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}]