[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…toileting, feeding. These are not jobs that can be       easily filled, and require a personal relationship between       the staff and the residents that are forged over months and       years together. When these relationships are lost the       residents suffer.\n\nA staffing shortage like this creates a domino effect that       will impact resident care…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…not true. We proved it today. I  urge Democrats to continue to use their power and make sure that we  don't sign off on a weak deal, on a bad deal, on a deal that, months  from now or years from now, we say: Oh, that turned out to be a bad  idea.\n\nWe can only vote for the GENIUS Act when we have a bill that protects  consumers, that promotes financial…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…physician), internist, family physician, physical therapist,  occupational therapist, social worker, nurse, and psychologist or  psychiatrist. Recovery may occur over six months to two years or  longer. A particularly frustrating consequence of GBS is long-term  recurrences of fatigue and/or exhaustion as well as abnormal sensations  including pain and muscle…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Secretary Rubio committed to faithfully implementing  this bill, and now it is on all of us to work together to make that  true. There will be a lot more work to do in the months and years ahead  to rebuild American foreign assistance, but this week marks a very  important first step.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…who were  ordered removed following a conviction for certain offenses.\n\nThe gentleman's bill would increase the penalty for people who enter  without inspection from 6 months to 2 years for a first offense, and  then if you reenter without documentation for up to 5 years, and in  certain circumstances, potentially up to life. You could be held for  life…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…resolve retirement issues  for Federal retirees.\n\nI have heard directly from my constituents who spent their careers  serving this country. These folks are now waiting months or even years  for their retirement benefits that they earned. This backlog directly  impacts their ability to pay their bills, remain financially stable,  and live with dignity.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690798/pending-opm-claims"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…countries, including individuals from those  countries who are already in the United States. Going through an asylee  claim, a refugee claim, playing by the book, takes months and sometimes  years in refugee camps. People go through extensive background checks  before they are even considered to come to the United States.\n\nIn this situation, those who have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…moment that who I was, my  identity, somewhat shifted and changed.\n\nMore than 200,000 people were killed, most of them civilians. Some  died instantly. Others suffered for months or years from burns,  radiation, and grief.\n\nMr. Speaker, 80 years after the erasure of two cities we have still  not learned the lessons of these terrible bombings.\n\nThere are…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to be supported as enthusiastically and  fully as we can do, and not, in effect, use the National Guard as a  quick fix.\n\nThey won't stay in the District of Columbia for months or years. They  are here very temporarily. And if they have accomplished a reduction in  crime, the same could have been done by simply providing more  resources, more cops on…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, imagine if someone owes you money and  they said they would pay you back immediately, but they take weeks,  months, and then years to do so.\n\nThat is what is going on right now with our Federal Government. The  IRS has a backlog of tax refunds that is costing the American people a  lot of money.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…I  thank her for her partnership on this vital bill named after the  incredible young woman whom you just met.\n\nI came out here looking for her because I said to Frank months or  years ago: Frank, she will be in the committee. She is the living  energy of somebody who knew that something had to be done, and  Charlotte is just always there. Her energy…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692715/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…plan for that kind of rationale and  for those kinds of swings? They need to secure financing. They need to  place orders. They need to invest in order to grow in the months and  years ahead, but building a new plant and moving production takes time.  In some cases, it takes years. So how can companies plan when they  don't even know whether the Trump…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…about the same as a single day in  the hospital.\n\nUnfortunately, one in four Meals on Wheels programs around the  country have wait lists. Many older Americans wait months or even years  to access program benefits. It is not just about the food. Nutrition  programs also promote socialization, wellness, and safety checks. Food  delivery or community…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…after three days,       proof that unnecessary detention fuels instability and       recidivism. When someone cannot afford bail, they can sit in       jail for days, months, or even years without a conviction.       That is not justice--it is punishment for being poor.      Jurisdictions that have reformed their bail practices have           been successful…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…not only for the benefits they are due, but  for the stability, the security, and the relief that comes with these  benefits.\n\nToo often, that wait stretches from months and sometimes into years.  During that time, veterans are left in limbo, unable to work,  struggling to support their families, and forced to navigate a system  that moves far too slowly…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699209/veterans-law-judge-experience-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…on the tremendous potential, the  boundless opportunities that AI--even as it exists right now, let alone  what its capabilities are going to be in a matter of weeks, months, and  years, the unbelievable opportunities to close achievement gaps and  advance student achievement.\n\nI firmly believe, if it isn't already true now then it will be true  in a…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…reporting requirements, overtime and wage rules that change from one  administration to the next, and lengthy permitting processes that can  delay construction projects for months or even years.\n\nFamily-owned shops face costly data privacy mandates designed for  multinational corporations, while contractors struggle with ever- shifting OSHA paperwork requirements…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…congratulate Mikhail on this special accomplishment. He has earned  it. I very much look forward to hearing more about his progress and  accomplishments in the coming months and years. May God continue to  bless him and his family.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689068/recognizing-cadet-of-the-year-recipient-cadet-lieutenant-colonel-mikhail-karnaukh"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…championship meet. Now, think about that. We all have children. We know  the heartbreak when someone has trained and trained and trained, not  just for days or weeks or months but for years, and they are denied the  ability to move forward because there is a boy competing in a female  category.\n\nThere were 39 times when a girl was denied an opportunity…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…historic milestone because it was the first  boys' basketball State championship title in the school's history.\n\nThe journey to a championship is never easy. It requires months, if  not years, of dedication, sacrifice, and relentless effort. The  championship win is not just about the trophy or the title. It is about  the countless hours of practice, the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689630/manchester-squires-state-champions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…doesn't sit over one town very long. Sometimes  we get a little inversion in the Roanoke area and it sits there for a  few days, but it doesn't sit there for weeks and months and years. We  need to be looking at the worldwide issue in regard to that.\n\nMr. Speaker, I make no apology for supporting bills that will take  care of making sure that we can,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…rise to recognize Israel's Independence Day  and 77th birthday.\n\nThe United States and Israel have a binding, ironclad partnership  that continues to grow stronger as the months and years go on.\n\nAs President Reagan once said: ``For the people of Israel and America  are historic partners in the global quest for human dignity and  freedom. We will always…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690754/9999"}]