[{"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…ensure that  our Nation's veterans receive the care and benefits they have earned  through their service.\n\nThis bill also provides necessary funding for the American Battle  Monuments Commission, the U.S. Court of Veterans Appeals, and the Armed  Forces Retirement Homes, as well as Arlington National Cemetery.\n\nAs ranking member of the subcommittee, I…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Mr. Speaker, I rise tonight during Black History Month  to raise the alarm on the rewriting of American history that is  happening at our national parks, our museums, our monuments, and our  public spaces as the Trump administration is attempting to erase the  histories, the stories, and the lives of our Black, Native, Chicano,  AAPI, and LGBT+ communities.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…who  keep our public lands open and safe. Republicans are trying to sell off  our public lands for a quick buck.\n\nRepublicans are working to undo protections for national monuments,  trying to block updates to outdated resource management plans, and  pushing reckless development for extractive industries no matter the  public health or environmental…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…services, and forests.\n\nI want the people in my life, the little people in my world to be  able to go and visit a natural reserve or to go to one of our national  parks and monuments and see that it is still owned by the United  States, that we haven't sold it to some corporation or, God forbid,  some other country, someone with the highest bid.\n\nWe are…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…cost of healthcare,  groceries, or housing, Republicans are focused on protecting President  Trump while he invades foreign countries, builds golden ballrooms, and  renames monuments to himself, all while families in my district watch  their healthcare premiums double.\n\nI will remind everyone: Republicans already kicked 15 million people  off their healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698799/breaking-the-gridlock-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…their religious  heritage.\n\nThe Fallen Servicemembers Religious Heritage Restoration Act seeks to  correct this oversight. It formalizes a program with the American  Battle Monuments Commission to identify and establish contact with  descendants of those fallen servicemembers who were mistakenly buried  under the Latin cross and works in partnership with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…trade wars on our allies abroad  while making everything more expensive at home, and has spent his days  flattering himself, putting his name on buildings and constructing  monuments in his own honor.\n\nAre we really surprised that a man who tried to overturn the will of  the people in a free and fair election does not care about solving the  problems…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…reached far beyond Towaoc, inspiring both Tribal and non- Tribal leaders alike all across this Nation.\n\nAs chairman, he helped establish Bears Ears and Camp Hale National  Monuments, elevated Tribal voices in the Colorado River Basin, and  advocated for the protection of the Dolores River.\n\nAfter generations of the unjust loss of their ancestral homelands,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…marking graves and honoring these       brave Jewish American servicemembers.\n\nThe Fallen Servicemembers Religious Heritage Restoration       Act requires the American Battle Monuments Commission (ABMC)       to create a program to identify Jewish servicemembers buried       with grave markers that do not reflect their faith and to       connect with their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…readiness, which is  especially needed in these incredibly dangerous times.\n\nI thank President Trump for this initiative.             Recognizing Efforts to Restore Gettysburg Monuments\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to acknowledge  the efforts of the Gettysburg National Military Park to restore several  monuments. These restoration…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…families across the country can celebrate America 250  by connecting with our natural landscapes and historic places. From our  forests and lakeshores to our battlefields and monuments, these sites  tell the story of our liberty, resilience, and shared civic values.\n\nThis is a simple, bipartisan bill that expands access to our public  lands, encourages…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Mr. CARTER of Texas. It includes $2 billion to improve and maintain  housing for servicemembers and their families. It provides requested  resources for the American Battle Monuments Commission, Armed Forces  Retirement Home, and operations at Arlington National Cemetery.\n\nI thank Mr. Cole for his endless work to get us to this point.\n\nMr. Speaker, I…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "Mr. LANKFORD. Mr. President, I wanted to thank the Presiding Officer  and several folks because we passed by unanimous consent today a  national monuments piece for the Greenwood District in Oklahoma.\n\nOn May 31 of 1921, the largest race massacre in American history  occurred in my great State of Oklahoma. It was in North Tulsa.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Antiquities Act. For decades, the  executive branch, Presidents of the United States, mostly Democrats,  have used the Antiquities Act of 1906 to designate vast areas as  national monuments, and that is in an authority that we delegated to  them in the Antiquities Act of 1906.\n\nThe abuse of that narrow delegated authority has resulted in  restricted access to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Pharmacists provide accessible guidance anytime, empowering informed  decisions that promote safety, independence, and healthy aging.           Recognizing Scottish Rite Monuments in Savannah, Georgia\n\nMr. CARTER of Georgia. Mr. Speaker, I rise here today to recognize  the monuments being dedicated to the ancient Scottish Rite Valley of  Savannah,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…barricaded.\n\nNow, compare that to the government shutdown in the first Trump  administration. Vendors remained in business, the public lands remained  fully open to the public, no monuments were obstructed, no barricades  were erected, and the gates to the national parks remained fully  accessible.\n\nToday, opponents of President Trump's war on government waste…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…to commemorate our  Nation's brave men and women and to recognize the High Plains Honor  Flight Network, which conducts trips for veterans to Washington, D.C.,  to tour the monuments built to honor their bravery and service. The  High Plains Honor Flight gave some of our fellow brave men and women  the chance to visit our Nation's Capital. As a fellow…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…quality  of life for servicemembers and their families.\n\nI also want to note that the bill includes robust funding for related  Agencies, which include the American Battle Monuments Commission, the  U.S. Court of Appeals for Veterans Claims, Arlington National Cemetery,  and the Armed Forces Retirement Home.\n\nFunding at these priorities at these levels…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and traditional  architecture in Federal public buildings.\n\nI think every American can imagine what we are talking about here.  When you look at the Capitol, our national monuments, the White House,  many courthouses, the classical style very much evokes the values that  we have in this country, the values of representative government, the  values of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…from  Minneapolis to California to our Nation's Capital. I didn't see statues  getting toppled and tossed into water. I didn't see spray-painting and  destruction of public monuments and statues.\n\nWhat I saw was prayer. What I saw was people coming together in  defense of their collective belief in God and their belief in this  country, but willing to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…surrounding area requires an additional act of Congress. H.R.  2290 provides that authority, ensuring this memorial can be located in  a place of national prominence alongside other monuments honoring  wartime service and sacrifice.\n\nThis bill is bipartisan and straightforward. It properly recognizes  the contributions of millions of American women whose work…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}]