[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…American diplomacy to end the Ukraine war, which may be a       prerequisite for restarting any semblance of dialogue on       nuclear dangers between Washington and Moscow.\n\nFor more than three years, ever since the Russian invasion       of Ukraine, congressional Democrats have rarely advocated the       kind of diplomatic efforts that might…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…chief of staff conspired to  institute a rule: No more pit stops at McDonald's.\n\nYou also are sure find McDonald's on your international travels. In  fact, I remember being in Moscow when the first McDonald's opened in  Pushkin Square. It was January 31, 1990, and I remember seeing the  dreary grey colors of the former Soviet Union punctuated by the Golden…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…then I will yield to my fellow Congressman  from Illinois.\n\nChina's dictator Xi was recently at the historic military parade that  fellow dictator Vladimir Putin celebrated in Moscow. The purpose of the  celebration was to honor the anniversary of Europe's defeat of Nazi  Germany, signaling Putin's intent to actually use that occasion to turn  his binoculars…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…vision of a world based on spheres of influence with  our own alternative of a stronger global order, not participating in  the destruction of the existing one by endorsing Moscow and Beijing's  alternative.\n\nThese moves also have costs at home. At his press conference over the  weekend, President Trump demonstrated a deep lack of understanding that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of the normalization of relations with that  former enemy, which is now a Comprehensive Strategic Partner, advance  U.S. national security? It doesn't.\n\nAnyone can see that Moscow is celebrating these reckless actions,  while Beijing plots how to fill the void to advance China's interests.\n\nThis wholesale, thoughtless, and illegal destruction of USAID…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…a steadfast and unflinching moral leader  supporting the people of Ukraine as they resist Vladimir Putin's bloody  imperialist invasion and a forceful counterweight to the Moscow  Patriarchate's Putinist subversion. This is a cause that most Americans  support, recognizing that the cause of the people of Ukraine and their  war of self-defense and self-determination…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…reportedly been followed by an uptick in contacts with       Haftar, who met Putin in May at Russia's 80th anniversary       World War II Victory Day parade.\n\nIt's not just Moscow or even adversaries of Washington that       the Government of National Unity suspects of seeking a       lasting piece of Libya. Sahad argued that the United Arab       Emirates…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…have been  carefully developed over the past 4 years.\n\nNow, with all due respect to my friend and colleague, the chairman, I  heard a lot of slogans, a couple of references to Moscow. I will just  say that the CRA before this body is very simple. It is an effort by  House Republicans to do something that has never been done before in  the history of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Georgia's constitutional promise  to join the Euro-Atlantic community. And it cracked down on civil  society and imprisoned political opposition, moves that align squarely  with Moscow's interests. Leaders in Georgian civil society--including  Nino Dolidze, the recipient of the National Democratic Institute's  democracy award--have worked at great personal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…what did that assessment actually conclude? I think every one of  us understood that Russia conducted a sweeping, systematic campaign to  interfere in our 2016 election; that Moscow's goal was to sow chaos, to  undermine faith in American democracy, and specifically to boost Mr.  Trump's candidacy. These findings were not partisan talking points;  they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Nobody understands this better  than President Trump, who is reversing the war on American energy and  ushering in a new age of energy dominance. He is putting Montana over  Moscow and the Powder River Basin over the PRC.\n\nBy passing the CRA today, we are advancing President Trump's  executive orders on unleashing American energy and reinvigorating  America's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…witness testifying before the Ways  and Means Trade Subcommittee put it bluntly when discussing the  potential for a lapse in AGOA when he said: ``There will be a party in  Moscow. There will be a party in Beijing if we don't reauthorize it.''\n\nTo achieve this, however, we aren't going to lower our standards.  This extension maintains the most stringent…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…troop pay, but it also ensures innovation in our technology, a  force for good in the world.\n\nYet challengingly, we have seen on the world stage leaders flock to  Beijing. From Moscow and Pyongyang, they have come to kneel at the  altar of Xi Jinping.\n\nThe reality here is that China is looking deep to degrade the West,  fracture our allies, and capture emerging…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…America's threats and commitments seriously if we  are content to let our own strength atrophy.\n\nA base budget request that cuts defense spending in real terms  doesn't show Moscow we are serious, let alone Beijing. Leading from  behind would be bad enough, but this is just plain falling behind.\n\nThe strongest deterrence is denying an adversary's objectives…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…should be known by the company he keeps.\n\nWhen the brutal Syrian dictator Bashar al-Assad was toppled,  thankfully, where did Bashar al-Assad run? He ran for safe haven to  Moscow--that is where he went--to be under the protection of Vladimir  Putin, who seeks to make us believe that he is an honest negotiator.  Nicolas Maduro was wisely counseled to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…North Korea pitching in to help them, has NATO outlived its  useful life?\n\nIs the notion of U.S. interests in Europe just a relic from the Cold  War?\n\nOr, to paraphrase some of Moscow's most useful idiots, has NATO's  existence and growth provoked Putin's aggression?\n\nLet's get a few things straight.\n\nFor decades, America and our allies bent over backward…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]