[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…were shocked, dismayed and bereft at losing such       an important team member.\n\nMy son delivered this news with a crack in his voice,       something that will bring any mother to her knees. He felt as       though a piece of his soul was destroyed. He immediately       filed an appeal with the Merit Systems Protection Board. Four       months later,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…is visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international award  in religion and science. With this honor, he joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama. The recognition  reflects not only his scholarship and spiritual leadership but his  unwavering witness for peace, human…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…affordable, accessible,  appropriate healthcare, especially in the rural communities I  represent.\n\nToday, I will share a story of Florence from North Bend, Oregon. She  is a mother, a caregiver, and a fighter. She lives with a rare  neuromuscular disease, myasthenia gravis, a rare form of angioedema.\n\nFor her, Medicaid isn't just a safety net, it is a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691434/gop-tax-scam-hurts-women-and-families"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…harder for  law enforcement to do their jobs. As a result, it has endangered every  single Minnesotan.\n\nEarlier this month, the President's political stunt got a Minneapolis  mother, Renee Good, killed. That didn't prompt the President to  withdraw ICE or attempt to deescalate the unfolding situation in our  cities. Why? Because escalation isn't a symptom.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699323/consolidated-appropriations-act-2026"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…career.\n\nBorn in Detroit, Michigan, Byron Allen's interest in the  entertainment industry began at a young age when he was first taken to  the NBC Studios in Burbank by his mother, publicist Carolyn Folks, who  was--and still is--Byron's biggest supporter. At the tender age of just  fourteen years old, he was already pitching jokes to show biz titans…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…world. His All-Holiness is  visiting Washington, D.C. in conjunction with his acceptance of the  distinguished Templeton Prize in New York City--an honor previously  bestowed on Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu,  among others. While here, he will visit both the White House and the  Congress.\n\nElected in October 1991 as the 270th…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…not up since January of  this year?\n\nAnd many Michiganders are going to end up in the position my mom was  in--walking into an ER, getting that diagnosis--your brother, your  mother, your child--needing care and having to choose between  bankruptcy and getting some sort of care for that terminal illness.\n\nWe can't end the fight there. I am willing to negotiate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I rise to honor the nine Black worshippers  murdered at Mother Emanuel AME Church in Charleston, South Carolina.  June 17 marks the 10-year anniversary of that horrific act by a white  supremacist.\n\nRepresentative Wendell Gilliard has…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692130/defending-black-history"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…government.\n\nThis wasn't an isolated tragedy, Mr. Speaker. It was the second  public killing of an innocent American in Minneapolis tied to Homeland  Security. Renee Good, a mother of three, was shot by ICE on January 7,  mere weeks before the murder of Alex Pretti.\n\nMr. Speaker, as co-chair of the Tom Lantos Human Rights Commission,  named after our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…aspect of lifesaving humanitarian work, and right now over  16,500 people are waiting to be medically evacuated from Gaza for  essential treatment.\n\nI recently heard from a mother named Hadeel. Seven months ago, her 6- year-old son died while awaiting medical evacuation. He suffered from a  kidney condition, and the decimated medical system in Gaza could…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…premiums will more than double. She  will be forced to choose which child sees a doctor and which child  stays home and waits to get better.\n\nMr. Speaker, that is not a choice any mother should have to face.  That is not freedom. That is fear.\n\nMaria is not alone. In Florida's 20th District, more than 200,000  people depend on these tax credits, and many are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697212/medical-bills-are-too-high"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…good-paying energy jobs. Republicans' supposed signature bill  betrays everyone outside of the billionaire class and the special  interests.\n\nNow, Republicans are going to spin the mother of all propaganda jobs  to sell this ugly bill to the American people. But today's report  reminds us of something: Facts are stubborn, and the facts are clear.  The ``Big…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693882/budget"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Department of Agriculture specialist just moved to Ohio  to assist local farmers sell produce locally. That job is gone.\n\nA young farmer with a newborn daughter and a single mother with two  children just back from maternity leave were hired to help citizens  understand how to save money through the Centers for Medicare and  Medicaid Services. They are…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…by his wife and infant daughter.\n\nOfficer Buckner was killed on March 31, 2024, when he was hit by a  car while responding to a reported crime. He is survived by his wife,  mother, sister, and three brothers.\n\nMr. Speaker, 23-year-old Joshua Briese was shot and killed while  responding to a disturbance call in the Gila River Indian Community. He  had…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Mr. MENENDEZ. Mr. Speaker, last week, a mother of three, a U.S.  citizen, was killed in broad daylight. You would think in that moment  Republicans would find their voice to speak out against the cruelty of  this administration.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699379/speaking-out-against-ice"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…family that has both parents at home.\n\nAmerica has changed dramatically. In the 1960s, about 5 percent of  the children in this country were born into families without both a  mother and father at home. I want to point out, I know families of all  sorts of backgrounds. I know parents who have done a fantastic job of  raising children in all backgrounds,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…D.C., where he will be recognized as this year's  recipient of the prestigious Templeton Prize, an award that has been  garnered in the past by great historical figures such as Mother Teresa,  the Dalai Lama, and Archbishop Desmond Tutu.\n\nIn his previous visits to the United States, His All Holiness has had  visitations with five Presidents, he has spoken…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "French Hill", "party": "Republican", "sentence": "…business that serves customers  across our State. Yet, Bart's contributions to his community are not  confined to his successful business.\n\nSince the tragic passing of his mother, he has been serving others in  our State, including sponsoring local sports teams, feeding healthcare  workers, and providing free meals to victims of domestic abuse.\n\nBart's…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…penalized $25,000 a year if you get married.\n\nThis is the primary reason why, in the 1950s, we only had about 4  percent of the newborn children in this country  born without a mother and father at home, and now, we are over 40  percent.\n\nIt is not difficult if people in this body would meet with some  average people rather than the lobbyists or the big…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…up in southern Ohio and  lived with her grandmother as her father traveled, looking for work.  Joanna raised seven sons and one daughter as a hardworking and devoted  single mother, working two jobs to support them and provide for their  needs. With a creative mind and a skill for writing, Joanna authored  multiple poems that were published in the Columbus…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in the family.\n\nIt is not surprising with people following this group that there is-- they would consider it successful to pass more and more programs that a  family with a mother and father at home would not be eligible for. If  they somehow get the man out of the home, they are eligible for it.\n\nWe are all familiar with these programs. One program…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…decades. She  personifies this commitment through her outstanding and unwavering  dedication to her patients, colleagues, and hospital.\n\nAdditionally, Ms. Harn is a loving mother, grandmother, and friend to  all those around her.\n\nThis achievement speaks not only for Ms. Harn's fantastic skills as a  professional, but also for her grateful and compassionate…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…to Washington as part of his visit to the United States, where  he will also receive the distinguished Templeton Prize in New York  City, an award previously bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment to faith, peace, and science.\n\nMr. Speaker, it is fitting that we welcome…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…just want to say one more thing because I would talk to these  people. I am privileged to represent them. Each of these homes has a  story. There was a wedding dress that a mother had, saving for her  daughter, that was ruined in a flood. There were wedding pictures from  a grandparent, parents, and daughters--multigeneration--and an album to  save for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…empty slogans, Democrats fight for the  health and dignity of the American people. We fought all night long to  protect 8.6 million Americans from losing Medicaid, for the mother  caring for a child with disabilities. We fought to protect the senior  in rural New Mexico who has to drive hours just to see a doctor and  will have to drive hours more when…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…lost beautiful young lives,  including Gavin Guffey from South Carolina, Bryce Tate from West  Virginia, and many other children. I have also met with parents,  including a mother from my home State of Florida, who shared the  heartbreaking story of her son who fell victim to sextortion and later  took his life.\n\nEach of these precious lives was taken…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Lyndon Johnson, who I felt, before Joe  Biden, was the worst President in this country's history. In the 1950s,  we only had about 4 percent of American children born without a mother  and father at home. We now have over 40 percent who are born without a  mother and father at home.\n\nThis doesn't mean there aren't wonderful single parents. I know some  single…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…community. A full-blooded Maidu Indian raised in poverty on a  reservation in Susanville, California, she grew up with strong values  of respect and kindness, taught by her mother.\n\nNot long after graduating from Sherman Indian High School, a boarding  school in Riverside, California, Nola joined the Navy in January 1988.  She trained as a welder and…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…down, she stepped up when she heard Gulfside needed  volunteers. In just three years, she has donated more than 3,650 hours  of her time to Gulfside Hospice.\n\nInspired by her mother, a longtime hospice volunteer, Joan has always  felt a deep connection to those in hospice care. Facing her own health  challenges, including chronic pain and limited mobility,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…the needs of the  country before yourself.\n\nI want to recognize my family because when I did this opportunity,  being a good Jewish boy, my family would not send me alone. My mother,  my father, and my sister moved to Washington. My mom, who I will talk  about in a little bit, used to sit where my wife, Wendy, and my father  are. My sons are over there.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}]