[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…how critically important that health  insurance coverage is to a full-term birth with a nonfatal outcome for  mother and child.\n\nIn the middle of the week, with several other mothers of preemies, I  talked about my birth story.\n\nTen years ago, when I woke up one morning and my placenta ruptured  and after almost bleeding to death, my daughter, Samantha,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…want another war. They  don't want American servicemembers put into harm's way, either flying  missions or with boots on the ground, for a war not authorized by  Congress. Mothers and fathers of American sailors, marines, soldiers,  and pilots do not want to lie awake at night wondering if their kids  will be the ones who have to be deployed to yet…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…services for two decades. Under her leadership, she sought funding for  specialized treatments needed by children with medical issues and  initiated programs to assist young mothers fight their battles with  addiction.\n\nAlice was devoted to bringing light to issues she believed in, and a  full-time job was not going to hold her back. During Alice's voluntary…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…guess.''\n\nBubble wrap is not going to help if she has a heart attack. Bubble  wrap is not going to help if she is in a car accident. Bubble wrap is  not going to help those mothers of premature babies who spend, on  average, $70,000 a day in a NICU stay.\n\nVictoria Cassels, an accountant in Roanoke, worries about her adult  daughter in Richmond, who is…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…cures, stolen hopes from  patients battling cancer, Parkinson's, ALS, Alzheimer's, and so many  other devastating diseases. I felt the pain and hope of patients,  grandparents, mothers, fathers, and children who are counting on the  next clinical breakthrough to survive. These cuts say to them: Your  health doesn't matter. Your life doesn't matter.\n\nPresident…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…percent of all businesses are  women owned, and more than 52 Fortune 500 companies are led by women.\n\nThis kind of change did not happen by accident. It happened because  our mothers, grandmothers, great-grandmothers, aunties, sisters, and  cousins dared greatly and forged new paths for us to walk on. The  freedoms and privileges we enjoy today are because…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…bill is unacceptable, but it is  not inevitable.\n\nI need just four Republicans, four people of conscience, to listen to  their constituents, to look into the eyes of pregnant mothers praying  for a safe delivery, and to show a shred of humanity and oppose this  horrific bill.\n\nIf my colleagues aren't here to fight for the people who sent them,  they should…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691443/gop-tax-scam-hurts-women-and-families"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…inundate  people who need Medicaid as a lifeline with paperwork that will be  difficult for them to do.\n\nThese are folks with health issues, folks on Medicaid with  disabilities, mothers and fathers with multiple jobs and kids, or  without access to reliable broadband in a few cases.\n\nThe red tape imposed on Medicaid by this bill isn't meant to be a  flaw.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Medicaid is their lifeline from the womb to  their final years.\n\nIn New Jersey, nearly one out of three births is covered by Medicaid.  But even before that birth takes place, mothers receive prenatal care  covered by Medicaid. That means that for millions of parents across the  country, the first images they see of their child in those early  ultrasounds…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689514/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the  people in my district who stand to be harmed the most: families in  Mattapan who receive their healthcare through MassHealth, the Medicaid  program for Massachusetts; mothers in Chelsea, who rely on SNAP to feed  their babies; disabled veterans in Randolph who receive lifesaving care  and benefits through the VA; families in Roxbury who rely on…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, today, House Republicans betrayed their  mothers, their sisters, their daughters, and every woman in their life.\n\nThe so-called SAVE Act is an antiwoman, antidemocracy, voter  suppression bill cloaked in lies about election…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690040/voter-suppression-bill-cloaked-in-lies-about-election-integrity"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, I rise today with a warning--no, a plea.\n\nRural America is already in crisis. People there die younger. Mothers  face greater risks when giving birth. Hospitals teeter on the edge of  collapse.\n\nMedicaid is the thin lifeline holding together that fragile system.  Cut it and people will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…lifesaving food aid to be restored by the Trump  administration.\n\nSudan is suffering its worst famine in four decades. Without  immediate help, hundreds of thousands could die. Mothers are walking  for days in search of food, and children collapsing into their arms  from hunger.\n\nFor years, the United States has stepped up in the face of these  tragedies.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690624/support-for-edesia"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…process. That includes  over 10,000 people in my home State of Florida, including a mother torn  away from her child while nursing her baby. These people are largely  good, decent mothers and fathers who are workers contributing to our  communities.\n\nWe do need to take the time for bipartisan immigration reform, but  today--today--we must rein in ICE. That…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…under  the Trump administration have never been convicted of any crime. That  is 200,000 people detained and deported who were not convicted of any  crime.\n\nThey are deporting mothers and grandmothers, children with cancer,  and employees of American companies, people just trying to make a  living. They are not only deporting people who came here illegally.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…security threat to the [United States].\n\nI disagree. I think it has more than a little to do with our national  security and our safety. I have heard from too many Arkansas mothers  and fathers whose children have died because of a  drug overdose. This operation was about protecting those families and  families like them, anyone who struggles with or…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Democratic colleagues are trying to tell the American people.\n\nThe One Big Beautiful Bill is not taking healthcare coverage away  from grandmas who are on a fixed income or single mothers. Rather, the  reforms to the Medicaid Program in the One Big Beautiful Bill will  ensure that the money that is spent goes to people who are eligible and  who need it the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…that road by yourself. There is support out  there for you. In Ohio alone, women have access to nearly 200 pregnancy  help centers and maternity homes that serve expectant mothers. I have  visited many of them. They want you to go see them, if you are in need,  if you are scared, if you need someone to talk to. They are there to  help, not to pressure,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…bill.\n\nMr. WALBERG.  6359.\n\nMr. Speaker, I rise today in support of the Pregnant Students' Rights  Act, legislation that affirms a simple but powerful principle:  Expecting mothers should be encouraged to pursue their education like  any other student.\n\nPregnant students often receive incorrect guidance or no guidance at  all on how to navigate classes…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…that are killed each year by illegal  immigrants. Why do we not know their names? What about their families?  That is 500 families whose lives are destroyed, 500 spouses and mothers  and fathers and children who are dead because of someone who should not  have even been here. That is who I swore an oath to protect.\n\nMr. Speaker, let's make no mistake…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…priority remains the same. It is to root  out waste, fraud, and abuse and to strengthen and sustain Medicaid for  those for whom the program was intended to serve: expectant mothers,  children with disabilities, the poor, and the elderly.\n\nMs. FOXX. Mr. Speaker, all time yielded is for the purpose of debate,  and I do not yield for that request.\n\nMs.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…this legislation last February when I brought it. We cannot wait  until an illegal driving drunk kills a family member or a member of our  community.\n\nTime and time again, Mothers Against Drunk Driving say that on a DUI,  normally it is 80 times they have driven drunk before they are actually  caught. Statistics show that it is at least a dozen times…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…to live the rest of their lives with the pain most of  us cannot even begin to comprehend.\n\nThese are stories that most of the people on my side of the aisle  know; American mothers and daughters whose memories we have the duty to  keep alive. But most of my colleagues on the other side of the aisle  won't even say their names.\n\nWe never read their stories…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…reliable American energy. We support technological innovation by  reauthorizing the spectrum auction authority. We secure Medicaid for  those who need it most. This includes mothers, children, seniors, and  people with disabilities.\n\nDemocrats continue to fearmonger and misrepresent what is in this  bill, but let me be clear: House Republicans are eliminating…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693162/one-big-beautiful-bill-act"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…weekend. It may be a snowy March for Life this weekend.\n\nIt has been inspiring to me to see all of the pro-life community  spring into action to really help our expecting mothers and their  babies to thrive because that is what this movement is all about. It is  about recognizing the sanctity of every life and valuing life at every  stage.\n\nIt is crucial…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699314/pregnant-students-rights-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…commercial  surrogacy due to the trafficking risks, and this bill is a strong step  in the right direction to prevent bad-faith actors from taking  advantage of U.S. surrogate mothers and the children they bear.\n\nI am proud to champion legislation that directly benefits Utahns and  families across the country. We have strong families. We have strong  communities,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…House of Representatives, I am a reliable vote for  the pro-life community and have been able to sponsor many pieces of  legislation that provide for the needs of pregnant mothers and the life  they are carrying in the womb.\n\nI am honored to celebrate each person participating in this year's  march, and I am grateful to be in the position to support…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699378/march-for-life"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…resource centers act and the  Pregnant Students' Rights Act.\n\nThese bills are about something very simple: Protecting the dignity  of the unborn and meeting very real needs of mothers and families.\n\nPregnancy resource centers offer counseling, medical services,  parenting resources, and support systems through some of the most  difficult moments that a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699218/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…home of Colorado Springs,  Colorado. Pregnancy centers offer hope, and they offer opportunity.  They promote life and give necessary and lifesaving resources to  struggling mothers and fathers. It is these very pregnancy centers  whose only focus is for the enrichment and support of these often  inexpectant parents who are the target of a punitive and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699216/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Committee. I have seen the film from what Hamas did  on October 7. These were animals. They killed hundreds and hundreds of  people. They took hostages. They cut babies out of their mothers. They  killed children in  front of their parents. They killed parents in front of their children.  They tortured people.\n\nThey knew exactly what they were doing, and that…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689526/motions-to-discharge-sj-res-33-and-sj-res-26"}]