[{"senator": "Summer Lee", "party": "Democrat", "sentence": "…visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international award  in religion and science. With this honor, he joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama. The recognition  reflects not only his scholarship and spiritual leadership but his  unwavering witness for peace, human dignity,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Foundation recognizes pioneers of scientific and  spiritual insight for their contributions to human well-being and  spiritual prosperity. Previous award recipients include Mother Teresa,  Archbishop Desmond Tutu, and Nelson Mandela. On behalf of New York's  20th Congressional District, I congratulate His All Holiness  Bartholomew on receiving this great…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…well-deserved and highly  impressive honor of being awarded the 2025 Templeton Prize, which  recognizes spiritual and scientific advancement. The award puts him in  the company of Mother Teresa, the Dalai Lama, King Abdullah, Jane  Goodall, and Francis Collins--men and women from all walks of life who  have made contributions to understanding the universe and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…prestigious Templeton Prize for his outstanding  contributions to the advancement of science and spirituality. He will  join the company of other spiritual leaders like Mother Teresa and the  Dalai Lama. I am honored to add my voice to the chorus of others who  welcome the Ecumenical Patriarch to the United States and honor him for  his lifetime of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…achievements in  interfaith dialogue. As this year's Templeton Prize Laureate,  Ecumenical Patriarch Bartholomew will join the esteemed ranks of past  recipients, including Mother Teresa, the Dalai Lama, and Archbishop  Desmond Tutu.\n\nHis All-Holiness has been a pioneer in merging spirituality with  science as a force for change. As head of the Eastern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…His All-Holiness is  visiting Washington, D.C. in conjunction with his acceptance of the  distinguished Templeton Prize in New York City--an honor previously  bestowed on Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu,  among others. While here, he will visit both the White House and the  Congress.\n\nElected in October 1991 as the 270th Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…service and leadership has placed him among the illustrious company of  previous Templeton Prize honorees--The Dalai Lama, Desmond Tutu, and  the first ever recipient, Mother Teresa.\n\nAs His All-Holiness reminds us, ``We have it in our power either to  increase the hurt inflicted on our world or to contribute toward its  healing. The choice is ours.''…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…in our Nation's Capital this week after visiting New York City,  where he will receive the distinguished Templeton Prize. The Templeton  Prize was previously received by Mother Teresa, the Dalai Lama, and  Archbishop Desmond Tutu, among others.\n\nEcumenical Patriarch Bartholomew is a world-leading advocate for  interfaith dialogue and peace. As Ecumenical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695734/recognizing-and-welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…groundbreaking  harmonization of faith and science in service of environmental  protection. The Templeton Prize, given to singular champions of human  dignity and progress such as Mother Teresa and Archbishop Desmond Tutu,  honors people who have harnessed the power of the sciences to explore  the deepest questions of the universe and humankind's place and purpose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…stewardship.\n\nPart of his visit to the United States is to receive the  distinguished Templeton Prize in New York City. This recognition,  bestowed previously on figures such as Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu, acknowledges his lifetime of service in  advancing the harmony of faith and reason, and his courageous  leadership on behalf…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…States to receive the Templeton  Prize--the most prestigious award at the intersection of religion and  science. He joins a distinguished group of past recipients, including  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nAs the longest-serving Archbishop of Constantinople in over two  millennia, All-Holiness Ecumenical Patriarch Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Prize. This prestigious international a yard  recognizes his scholarly contributions in exploring the intersection of  faith and the natural world. Past recipients include Mother Teresa and  the Dalai Lama.\n\nIn 1997, he was awarded the Congressional Gold Medal in recognition  of his contributions to the United States. His efforts have fostered  dialogue…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…revolutionaries, Time Magazine named him as one of the world's most  influential people. Now, he is being rightfully honored with the  Templeton Prize, previously received by Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu, among others. Congratulations to  Ecumenical Patriarch Bartholomew on this honor and I thank him for his  life of service.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…where he will be recognized as this year's  recipient of the prestigious Templeton Prize, an award that has been  garnered in the past by great historical figures such as Mother Teresa,  the Dalai Lama, and Archbishop Desmond Tutu.\n\nIn his previous visits to the United States, His All Holiness has had  visitations with five Presidents, he has spoken to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Patriarch has played throughout his lifetime.  Historic international figures who received the Congressional Gold  Medal immediately before and after His All-Holiness were Mother Teresa  and Nelson Mandela.\n\nWe also acknowledge the extraordinary historic role His All-Holiness  has served as the longest tenured Ecumenical Patriarch in history. It  is significant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Washington as part of his visit to the United States, where  he will also receive the distinguished Templeton Prize in New York  City, an award previously bestowed upon Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. This honor recognizes his lifelong  commitment to faith, peace, and science.\n\nMr. Speaker, it is fitting that we welcome…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Christian history, he  stands as a symbol of faith and resolve. His visit comes as he receives  the distinguished Templeton Prize in New York, an honor once bestowed  on Mother Teresa, the Dalai Lama, Archbishop Desmond Tutu, and Nelson  Mandela--leaders whose lives have testified to the power of faith to  transcend borders.\n\nAs a Catholic, I am deeply…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…mothers and children--including the unborn. Since  her announced retirement last year, she has continued to oversee the  Saint Gianna Molla Pregnancy Outreach Centers and Mother Teresa Home in  Western New York.\n\nThe Saint Gianna Molla Pregnancy Outreach Centers have a tangible  impact on our community, providing important material, emotional, and  spiritual…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689281/recognizing-cheryl-calire-for-her-steadfast-service-and-dedication-to-the-saint-gianna-molla-pregnancy-outreach-center"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…All-Holiness is visiting our Nation's Capital in conjunction with  his acceptance of the prestigious Templeton Prize, an award which has  been received by faith leaders including Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. The Greek Orthodox community in Ohio and  across the country take great pride in this recognition of their faith  leader's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695552/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…President Trump at the White  House. This visit coincides with his receipt of the Templeton Prize, a  prestigious award previously bestowed upon renowned figures such as  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nFor decades, His All-Holiness has been a steadfast advocate for  religious freedom and unity among Christians worldwide.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}]