[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…cases in 2025. That represents a 50-percent increase over  the nearly 9,500 threats Capitol Police reported in 2024.\n\nWe are witnessing disturbing incidents of politically motivated  violence across the Nation, targeting elected officials and high- profile individuals associated with both political parties.\n\nWhether it is the horrific assassination of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Ms. RANDALL. Mr. Speaker, I thank the gentleman, Mr. Carbajal, for  yielding.\n\nMr. Speaker, I come before you today to tell a very personal family  story that motivated my interest to serve my community here in Congress  and that continues to motivate me to think about the impacts on  families all across my district and all across the country.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688135/republican-budget-betrayal"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN. Mr. Speaker, when I came to Congress in 2019, I knew it was  a time of great tension, yet I was motivated all the more to do this  work.\n\nIn the almost 7 years since, our empathy and our common humanity has  been tested in unimaginable ways.\n\nThe latest is the horrific murder…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…often, these names are erased from our  history books, our K-12 education, and even our museums.\n\nThe Women's History Museum is a space where women can go to feel  inspired and motivated to dream big. It is a place where women's  legacies can live on, be celebrated, and not forgotten.\n\nOne such woman I want to mention, Alma Thomas, comes to mind. She was…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…healthcare  sector is telling us: We are risking the financial solvency of  institutions all across America, and, again, we are damaging our  future in terms of getting young, motivated people to join the  healthcare professions.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…graduate of Granby Public Schools, and a young man of great promise. He  came to Capitol Hill eager to learn, contribute, and serve the people  and this great institution, only motivated by idealism and a commitment  to public service. Through his determination and intellect, he  accomplished all of that.\n\nThose who were close to Eric speak of his thoughtfulness,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693539/moment-of-silence-in-memory-of-eric-tarpinian-jachym"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Mr. Speaker, Minnesota and our Nation suffered an  unthinkable tragedy in the early hours of January 14th, when our  state's elected officials were attacked in politically-motivated  shootings.\n\nMinnesotans are devastated by the assassinations of Speaker Emerita  Melissa Hoffman and her husband Mark and the attempted murder of  Senator John Hoffman and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…investigations into the Director of the  Federal Housing Finance Agency, Bill Pulte, who is weaponizing the  housing finance giants Fannie Mae and Freddie Mac for politically  motivated witch hunts and trying to lock new home buyers into 50-year  mortgages?\n\nIf Republicans wanted to lower housing costs, why aren't they calling  to exempt materials like lumber…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…projects in blue States like Washington and California and steered  hundreds of millions of dollars to red States instead. I called that  out for what it was--a politically motivated abuse of power that was  only possible because we were operating under a slush fund, full-year  CR.\n\nThis year, we made sure that Trump and Russ Vought cannot muck around…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…given up his position in the Virginia General  Assembly to take this position, within a month, walked out of the U.S.  Attorney's Office rather than succumb to a politically motivated firing  of a long-time, dedicated prosecutor.\n\nIn two instances, the chief Federal law enforcement officials in  Virginia, installed in their positions by the Trump administration,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…friends who were taken from us too soon: Speaker  Melissa Hortman and her husband, Mark Hortman.\n\nWe lost Melissa and Mark two weekends ago in an unthinkable,  politically motivated attack that also threatened the lives of State  Senator John Hoffman; his wife, Yvette; and their daughter, Hope.\n\nLike many Minnesotans, I have struggled to come to terms…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692854/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Boulder, Colorado, at the Jewish Museum in Washington, D.C.,  and the attack on Gov. Shapiro in Pennsylvania.\n\nIt rightfully points out that these attacks are ideologically  motivated--that is politically motivated.\n\nWhat a sad thing to have to say--in our country, a growing number of  people are embracing a political ideology that leads them to murder…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…children, and they are hurting our country, hurting  our economy, and hurting my Commonwealth.\n\nI would like to start with what the President has said. These  policies are motivated by a President who has said a number of things  about the immigrant community, and I think these express the basic  motivations for his actions. There is a beautiful phrase…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…a queer Latino immigrant, Omar has experienced firsthand the  importance of high-quality, culturally competent healthcare and HIV  prevention services. His experience has motivated him to build a world  where no one is denied quality healthcare services because of their  background, citizenship status, identity, or circumstance.\n\nFor almost two decades,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…flying to space with these guys, I realized that Russians and the  Russian military, in particular--because that is where my experience  was with these military guys--they were motivated by different things.  It explains a lot of what I see out of Russia today.\n\nNow, as Americans, whether you are in the U.S. Navy, whether you are  a naval aviator or in the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…last year, six people  were indicted for fraudulent voter registration forms submitted ahead  of last year's Presidential election.\n\nThe allegations of fraud appeared to be motivated by the defendants'  desire to make money and to keep their jobs and was not an effort to  influence the election, so said the Pennsylvania Attorney General Dave  Sunday.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…of  them in the Minnesota Legislature.\n\nWe are still processing this senseless act, and I stand with my  colleagues today as we say that there is no place for politically  motivated violence in this country.\n\nThese victims committed themselves to public service and believed  that they were working to make their State a better place. There is no  scenario…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…engaging with  the full context of the policy environment.\n\nAs we await the Supreme Court's decision on whether tariffs lie  within the authority of IEEPA, today's politically motivated vote, I  believe, is premature. If my colleagues have full confidence there is  no risk of fentanyl imports at the northern border, then they have more  faith than I do.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…emissions inflated and owing large sums under the natural gas tax.\n\nIf not repealed, this rule will arbitrarily increase the costs and  burden of reporting under subpart W, motivated by the Democrats'  interest in growing the revenues generated by their natural gas tax.  This will make it even more difficult and expensive to produce,  transport, and consume…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Rose", "party": "Republican", "sentence": "…perhaps millions of dollars, for alleged illegal  surveillance conducted by the Biden DOJ. I remain convinced the last  administration conducted a large number of politically motivated  investigations. However, the solution isn't for aggrieved lawmakers to  get a payday at taxpayer expense.\n\nAs Members of Congress, the people have entrusted us to be a check…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "James Risch", "party": "Republican", "sentence": "…the individual way, ahead of the  state. On the other hand, you have countries like China that are  communist. They are socialists. They are not free market or capitalist  motivated. And they have no regards for human rights. The best example  of that is the genocide that they commit against the Uighur Muslims in  China, and the world pretty much looks…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the company did was buy counterfeit kits from China and resell them  in the United States. Thus, the committee found there was a lack of  apparent legitimate or even profit-motivated criminal motive in the  operation of the facility.\n\nMeanwhile, Jesse Zhu, its operator, was receiving unexplained  payments via wire transfer from Chinese banks.\n\nAs I mentioned,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Prime Minister Netanyahu for securing the recent ceasefire  agreement which has led to Hamas releasing American and Israeli  hostages. As we remember this day, we are more motivated than ever to  stand with Israel and the Jewish people. I am grateful to my colleagues  for joining me this evening to discuss this solemn anniversary.\n\nMr. WILSON of South…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…against this legislation. I cannot say this  enough: This is not a vote against safety. I continue to pray for the  victims and their families, and I understand that they are motivated to  prevent anyone else from having to experience what they are going  through.\n\nI simply want to get this right, and I believe that we can absolutely  do that by allowing…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…section 351 of the Public Health Service Act (42 U.S.C.       262) of a drug for which a priority review voucher was used.\n\n(ix) Whether, and to what extent, companies were motivated       by the availability of priority review vouchers under section       529 of the Federal Food, Drug, and Cosmetic Act (21 U.S.C.       360ff) to attempt to develop a…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…supplied Europe and our allies  with LNG. The U.S. was the number one supplier of LNG to Europe in  2023. Unfortunately, in 2024, the Biden administration took politically  motivated actions to place an indefinite ban on LNG export permits to  appease the climate lobby. This legislation ensures that future  administrations cannot unilaterally prohibit…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…When my kids were growing up, they woke up every  Saturday morning to a job list, and they couldn't get their allowance  until they completed the jobs on the list. They were motivated to get  their jobs done by that allowance, and I would have had very little  luck incentivizing them to do their jobs if they never received their  promised reward.\n\nThis…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…do you get in this group of eight people? Jack Smith went after  my phone records. I am the chairman of the Judiciary Committee. We  found out later that this politically motivated hit job against  President Trump by Jack Smith got eight of us, and there are probably  more.\n\nWhat did I do to deserve this, Senator? I will just tell you. I don't  know…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…LNG. A whole lot of that  energy comes straight out of my district in the great State of Texas.\n\nThat is why it is long past time that we repeal the harmful,  politically motivated Biden-era restrictions that have shackled and  locked down our LNG industry. These restrictions did nothing but  threaten American jobs, drive away investment, and undermine…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…law, and encourage a vibrant and       inclusive civil society;\n\n(10) to call on the Government of Georgia to release all       persons detained or imprisoned on politically motivated       grounds and drop any pending charges against them;\n\n(11) to call on the Government of Georgia to thoroughly       investigate all allegations emerging from the recent…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]