[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…protect the children of the United States.\n\nRes. 389, which was submitted earlier today;  further, that the resolution be agreed to, the preamble be agreed to,  and that the motions to reconsider be considered made and laid upon the  table, with no intervening action or debate.\n\nMs. ROSEN. Mr. President, this is very disappointing. We know that  childhood…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…third time and the Senate vote on passage of  the bill, with 60 affirmative votes required for passage, all without  further intervening action or debate and no amendments or motions in  order to the bill prior to the vote on passage.\n\nMr. BLUMENTHAL. Mr. President, I respect the points that are being  made by my friend from Mississippi. In fact, we share…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the  committee-reported substitute amendments be considered and agreed to en  bloc; the bills, as amended, be considered read a third time and passed  en bloc; and that the motions to reconsider be considered made and laid  upon the table, all en bloc.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696087/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…headlights of our  government as we move into increasing climate danger.\n\nRes. 550; further, that the resolution  be agreed to, that the preamble be agreed to, and that the motions to  reconsider be considered made and laid upon the table.\n\nMr. WHITEHOUSE. Mr. President, let me just remind everyone who is  listening what this resolution resolved--three…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH.  Res. 224; further, that the resolution be  agreed to, the preamble be agreed to, and the motions to reconsider be  considered made and laid upon the table.\n\nMr. WELCH. Mr. President, I thank the gentleman from Idaho, the chair  of our Foreign Relations Committee.\n\nI join…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…introduced by Representatives Khanna and Massie under a closed rule  with 1 hour of debate.\n\nMr. Speaker, tonight in the Rules Committee, Democrats offered a  motion, several motions, to allow a vote on the floor to actually  release the Epstein files, and Republicans on the committee just voted  to block it, time and time again.\n\nThe only reason it won't…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are in the Middle East or Russia or anywhere around the  globe.\n\nRes. 219, submitted  earlier today, and that the resolution be agreed to, the preamble be  agreed to, and the motions to reconsider be made and laid upon the  table with no intervening action or debate.\n\nMr. BLUMENTHAL. Mr. President, if President Trump is everything that  my colleague has…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Congress--they  actually still included language admitting that these were waivers and  not rules. And when they were called on it, when it was pointed out,  they had to go through the motions, do backups, and resubmit the  waivers to Congress--ridiculous, blatant.\n\nNow, regardless of how ludicrous this effort has been, we continue to  hear all kinds of misinformation…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…consideration of S.  Res. 166, which was submitted earlier today. Further, I ask unanimous  consent that  the resolution be agreed to, the preamble be agreed to, and that the  motions to reconsider be considered made and laid upon the table with  no intervening action or debate.\n\nMs. DUCKWORTH. I just want to set the record straight that the VA's  population…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…have seen over 220 lawsuits brought against them in their first 100  days. That is clearly a record.\n\nIt is also a record of how many of them they have lost already, how  many motions they have lost, how many motions have been filed against  them that they have lost in court.\n\nIn response, rather than trying to adhere to the rule of law, the  Trump administration,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS.  Res. 217 and the Senate proceed to its immediate consideration;  that the resolution be agreed to, the preamble be agreed to, and that  the motions to reconsider be considered made and laid upon the table  with no intervening action or debate.\n\nMs. ALSOBROOKS. Thank you.\n\nMs. ALSOBROOKS. Robert F. Kennedy, Jr., Secretary…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…on American values. Our Nation and they deserve better.\n\nRes. 105, which is at the desk; further, that the resolution be  agreed to, the preamble be agreed to, and that the motions to  reconsider be considered made and laid upon the table with no  intervening action or debate.\n\nMr. BLUMENTHAL. Mr. President, first, let me say I am hopeful that we  can…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…yielding back of that time, the Senate vote on adoption of the  resolutions, individually; and that if any of the resolutions are  adopted, the preambles be agreed to and the motions to reconsider be  considered made and laid upon the table.\n\nMr. BLUMENTHAL. Mr. President, the purpose and effect of these  resolutions, very simply, is to provide votes.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…States of America,  that becomes the way our foreign policy works.\n\nSo I appreciate my colleagues' time and attention to this matter, and  I encourage them to support these motions when they come up for a vote  later this afternoon.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…still fills me with delight,      As if I walk where history resides,      I watch the chambers stir before debate.      Hear quiet murmurs blossom into law;      The smallest motions shape a whole state's fate,      And I, a page, stand humbled by the awe.      The shuffle of the papers, pens, and plans,      The whispered deals that ripple through the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…right to do team building, and the right to succeed and be recognized  for it.\n\nRes. 21; further, that  the resolution be agreed to; the preamble be agreed to; and that the  motions to reconsider be considered made and laid upon the table.\n\nMrs. BLACKBURN. Mr. President, I find my colleague's comments so very  interesting, and I think it would have served…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…to or dealing with the same subject       matter, is substantially the same as House Resolution 23       shall not be in order.\n\n(c) A motion to discharge on the Calendar of Motions to       Discharge Committees that is rendered out of order pursuant       to subsection (b) shall be stricken from that calendar.\n\nMr. GRIFFITH. Mr. Speaker, for the purpose…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…MORENO.  241; that the nomination be confirmed; that the motion to  reconsider be considered made and laid upon the table with no  intervening action or debate; that no further motions be in order to  the nomination; and that the President be immediately notified of the  Senate's action and the Senate then resume legislative session.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698876/executive-calendar"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, as I sat here and listened to that panoply of  speeches or motions over the last few seconds, I was reminded of the  fact that when we say there should be no cuts to Medicaid, we are  saying there should be no  cuts to illegal immigrants…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693215/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE.  646 and all the  nominations on the Secretary's desk; that the nominations be confirmed  en bloc, the motions to reconsider be considered made and laid upon the  table with no intervening action or debate; that no further motions be  in order to any of the nominations; that the President…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699790/executive-calendar"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…MURKOWSKI.  581, Calendar Nos. 602 through 607, and all  nominations on the Secretary's desk, with the exception of PN89; that  the nominations be confirmed en bloc; that the motions to reconsider be  considered made and laid upon the table with no intervening action or  debate; that no further motions be in order to any of the nominations;  that the President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698291/executive-calendar"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…substitute amendment at the desk to S. 539 be agreed to;  finally, that the bills, as amended, if amended, be considered read a  third time and passed en bloc and that the motions to reconsider be  considered made and laid upon the table, all en bloc.\n\nI rise to request unanimous consent here on the bills that were just  mentioned, to call up and pass…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN.  280 and 281, with the exception of Col. Henry R.  Jeffress, III, and Col. George H. Sebren, Jr.; that the nominations be  confirmed en bloc; that the motions to reconsider be considered made  and laid upon the table with no intervening action or debate; that no  further motions be in order to any of the nominations; that the  President…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693698/executive-calendar"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Protection Act of 2000 (22 U.S.C. 7102); and\n\n``(8) the term `violent crime' has the meaning given the       term `crime of violence' in section 16(a) of this title.\n\n``(b) Motions To Vacate Convictions or Expunge Arrests.--\n\n``(1) In general.--\n\n``(A) Convictions of level a offenses.--A person convicted       of any level A offense (or an attorney representing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…640; and Calendar No. 291, H.R. 504.\n\nMr. THUNE.  262, S.  640, be agreed to; that the bills, as amended, if amended, be  considered read a third time and passed; and that the motions to  reconsider be considered made and laid upon the table, all en bloc.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698046/the-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…nomination; further, if cloture is  invoked on Calendar No. 75, all postcloture time be expired and the  Senate vote on confirmation of the nomination; finally, if confirmed,  the motions to reconsider be considered made and laid upon the table.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690107/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Gillibrand; and S. 1112, the Big Bend National Park Boundary Adjustment  Act from Senator Cornyn; further, that the bills be considered read a  third time and passed and that the motions to reconsider be considered  made and laid upon the table.\n\nMr. LEE. Mr. President, I appreciate the kind words from my friend  and colleague the distinguished Senator from…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "Mr. SCHMITT.  656; that the nominations be confirmed; that the motions  to reconsider be considered made and laid upon the table with no  intervening action or debate; that no further motions be in order to  any of the nominations; that the President…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700053/executive-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…to executive  session to resume consideration of Executive Calendar No. 144, James  O'Neill, under the previous order; further, that notwithstanding rule  XXII, the cloture motions filed during Tuesday's session of the Senate  ripen following disposition of the O'Neill nomination and if cloture is  invoked on the Eisenberg nomination, the postcloture…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}]