[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…New  Testament that says: From the fullness of the heart, the mouth speaks.  On this topic, the President has a very full heart, and he has spoken  very plainly about his motivation.\n\nIn the speech marking the beginning of his campaign in 2016, day one,  President Trump embarked on a tirade against Mexicans and Mexican- Americans saying:\n\nWhen Mexico…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…they can live with some sense of dignity and have some chance of  success.\n\nWhy cut these programs? Why look in the face of these religious  organizations that, out of a motivation of conscience, for decades,  even a century, have decided that they will try to smooth that path to  integrate people into American life who are here lawfully? Why cut  their…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…is a lie. And they are dehumanizing.\n\nThis is, in fact, a witch hunt. Our civil servants are among the best  of what our Nation has to offer. They serve with no political  motivation. Many have served for years under Democratic administrations  and Republican administrations. They have one dedication: to their  fellow Americans. It is a patriotic calling…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688252/department-of-health-and-human-services"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…that heinous crime is not  about the difference between right and left; it is the difference  between right and wrong. And what happened yesterday was wrong.  Whatever the motivation, this we know: It was wrong. And we have to say  that clearly and without hesitation.\n\nI serve as pastor of the Ebenezer Baptist Church, the spiritual home  of Martin Luther…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…don't know how  that makes sense--that we are taxing our allies more than we are taxing  our adversaries.\n\nSo I would say: Is this really about China, or is a more important  motivation here to raise costs on American families to pay for tax cuts  for the wealthy?\n\nAs the ranking member of the Foreign Relations Committee, I take very  seriously our ability…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…their own pace.\n\nIt encourages them to engage with their communities and strive for  excellence in all areas of life. By providing this recognition, we give  young people the motivation and push they need to realize their  potential, reminding them that they are the future of this country.\n\nThis bill reauthorizes the program through 2029. The award operates…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698223/congressional-award-program-reauthorization-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…come.\n\nOne hundred days in, look at how they have treated the very best of  us--this Nation's civil servants, the Federal workers who serve with  absolutely no political motivation. I have met them. I know them. Close  to 160,000 of them live in the State of Maryland, and many of them have  served for years under both Democratic administrations and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…no name tags.\n\nWhat they do is they overtly target individuals because of the accent  that they have, the skin color that they have. I am not just imagining  this is their motivation because these agents are telling people this  is what is going on.\n\nI mean, this is the story of a Hmong woman that I met in Hmong  Village just last week who, in tears,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…one another and grab power.\n\nMr. Speaker, political violence in every form is abhorrent. I condemn  every single act of political violence, regardless of its source or its  motivation.\n\nI went to war three times for this country to defend the Constitution  and the rights of people to say things I might disagree with. The right  of every American to speak…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…believe,       that new home appliances for sale in the U.S. should be       required to achieve at least a minimum level of efficiency.''       Respondents say that their top motivation for wanting a more       efficient large home appliance is lower energy bills.\n\nAppliance efficiency standards ensure that any of the huge       array of product choices…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…impact he has had on countless individuals entering the  installation.\n\nFor so many, Officer Thomas was more than the first line of security;  he was the first source of motivation for the day. He understood that  his post at the gate was a unique opportunity to make a difference in  people's lives. This understanding comes from a deep personal  philosophy,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…not so onerous that people fall off because of paperwork,''       Kidwell said. ``I don't think that's the same in other states       where they might have a different motivation.''\n\nMr. COURTNEY. Madam Speaker, again, this journalist went out and  interviewed hospitals across the State. This included urban, rural, and  suburban hospitals. What all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…break off hooks and sink to the bottom of waterways.  Mr. Albright cites his early memories of swimming and fishing on the  Susquehanna River with his father as the driving motivation for his  desire to keep our community's waterways clean and plastic-free.\n\nI want to congratulate Mr. Albright on his achievement at the local  and international level, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693515/recognizing-mr-ethan-albright-for-his-achievement-in-local-and-international-science-fair"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the mountains. As their  connection to the area and the great outdoors deepened, JB and JT  witnessed the toll of increased tourism on their natural surroundings.\n\nWith the motivation to give back to the home that had given them so  much, ECO-CLEAN was created to respond to the need for environmental  responsibility and sustainability.\n\nWith the annual…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…paying  attention. President Trump came with Vice President nominee Pence,  spent time there, brought hope to the people, and that is when, in  2018--I am sure part of his motivation was to sign into law what has  ultimately become the BRIC Program.\n\nThese people testify with their flooding how lives are changed when  you don't have resiliency.\n\nI just…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the mountains. As their  connection to the area and the great outdoors deepened, JB and JT  witnessed the toll of increased tourism on their natural surroundings.  With the motivation to give back to the home that had given them so  much, ECO-CLEAN was created to respond to the need for environmental  responsibility and sustainability.\n\nWith the annual…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…make money and to keep their jobs and was not an effort to  influence the election, so said the Pennsylvania Attorney General Dave  Sunday. It really doesn't matter what the motivation is. What matters  is the result--fraudulent voter registrations.\n\nBack in 2008, there was an organization called ACORN. There was an  ACORN whistleblower who worked for both…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the U.S.  Fish and Wildlife Service to make a listing decision being the latest  example.\n\nUnfortunately, as with many ESA-related lawsuits, the species is  rarely the true motivation. The leader of the organization that filed  the lawsuit in question said the not-so-quiet part out loud when he  said that protecting the longfin smelt going forward would…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…In the current state of the law, we must wait for an American to be  harmed before significant punishments are issued to those who are here  illegally. That is the core motivation of the changes being sought in  this bill.\n\nCandidly and specifically, if a person is here illegally with  demonstrated criminal intent, that alone is sufficient to be punished…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…2026 through 2028       to--\n\n(1) recruit, select, train, and delegate the necessary       authorities to additional aviation medical examiners and       human intervention motivation study aviation medical       examiners, including those who are psychiatrists;\n\n(2) expand capacity to provide oversight of aviation       medical examiners and clear the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…anti-Semitism, uses Jews, for a political  objective. This was an anti-Semitic attack. The victims were Jewish.  One victim was a Holocaust survivor. There is no question that the  motivation of the perpetrator was anti-Semitism. It has nothing to do  with how he got into this country.\n\nIf you want to have an immigration enforcement conversation, let's  have an…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…world's top exporter of LNG,  a vital pillar of both our economic strength and national security.\n\nIn an effort to placate the radical left, which I think was primarily  the motivation, the Biden administration, with its whole-of-government  assault on American energy, froze new LNG export permits with no  economic, environmental, or national security justification.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697087/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…groups happy. It turns out we would meet their  requests, and then they would change their standard. The problem or the  disagreement kept changing.\n\nI don't know what the motivation is for playing games, but we bring  this to the floor with honest hearts. We want our brothers and sisters  not to die in this moment of violence. I would think there would…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that there were going to be some politicians who were going  to try to make people dependent on the government in exchange for  votes. I think that at the time was maybe the motivation for these  horrible programs; but in any event, it is something that we have to  address now.\n\nNow, we are going to be doing a reconciliation bill, I hope, sometime  in the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}]