[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…year.\n\nI am encouraged that a Federal court in Washington, DC, granted a  motion allowing work on Revolution Wind to proceed and that work has  restarted, but these cynical moves show that the President doesn't  really care about energy prices or supply or jobs; he cares, really,  about pleasing his Big Oil donors.\n\nHe is also pleasing China, which…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Chair Ezell, Ranking Member Carbajal and  others for their cooperation in crafting this critical legislation. I  look forward to our continued collaboration as this legislation moves  forward, and I urge all Members to support this bill.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…high. At the Department of Energy, the DOGE-Musk cuts led  to hundreds of employees being fired. They were responsible for  overseeing our nuclear weapons stockpile. That set of moves caused a  massive counterintelligence disaster and a logistical train wreck.  After realizing these employees were indispensable, the Agency begged  for them to come back.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…everyday Americans, but  this budget won't do that at all. Instead, it will make life harder and  more expensive for constituents and Americans across the country.\n\nAs this process moves forward, I will join with Americans to fight  for fairness and opportunity for every American.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688018/fighting-for-fairness-and-opportunity-for-every-american"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…awards and prohibit the department from  canceling future awards based on their so-called priorities.\n\nMr. Chair, I include in the Record the text of my amendment.\n\nMs. Budzinski moves to recommit the bill H.R. 4553 to the       Committee on Appropriations with the following amendment:\n\nAt the appropriate place in title V, insert the following:\n\nSec. __.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Financial Services Committee chair, French Hill. This bill is the first  step in what I hope will be an effort to reform the definition of  ``accredited investor.'' This bill moves us to add to that definition  by noting that certain experience, licenses, and education can, indeed,  make one an accredited investor.\n\nAt the same time, I will point out…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…still imperfect at this moment that we are working hard to  perfect. This one big, ugly bill, the largest attack on healthcare, Mr.  Speaker, in the United States of America, moves us in the opposite  direction.\n\nDaniella is also from Colorado. She writes to us: ``Medicaid has been  a lifeline for our family, especially for my 5-year-old daughter who…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…politically motivated persecution campaign.\n\nAnd so my question to my colleague is, You are talking about creeping  authoritarianism. What does it say when the Executive makes moves on  law enforcement officials, Republican law enforcement officials,  because they won't bend the knee and politically persecute people  against whom there is no actionable…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…folks. You all know that. You all know that.\n\nLook, days before Americans start receiving notices that healthcare  premiums are about to skyrocket, as the Trump administration moves to  cut off SNAP benefits, this dysfunction is what the American people  have come to expect from Republican majorities in the Congress and the  White House.\n\nI appreciate…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…focused on low-cost  TV programming. The company underwent a name change in 2003, re- emerging as Entertainment Studios, as Allen's extraordinary business  acumen and strategic moves were beginning to differentiate his business  as a premier player in the entertainment industry.\n\nEntertainment Studios, once a small-scale television programming  company…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…prevent the  legislation from taking effect until Congress receives reporting from  the SBA on the proposed relocation of covered offices, including a  justification for how these moves could possibly serve small  businesses.\n\nMr. CISNEROS. Mr. Speaker, I hope my colleagues will join me in  voting for this motion to recommit.\n\nI also submitted a separate amendment…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692102/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…feet. My source again? FOX News. The President sees the writing on the  wall, and he is scrambling to undo the damage he has caused, but it is  too little, too late, unless he moves quickly and changes dramatically.\n\nThe damage goes beyond food prices. Thanks to this President,  Americans are now confronting higher utility bills. Just ask them. On  the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…stood in the well and took my oath  of office into this body. My children stood with me. My then 13-year- old son, who was very excited, impressed some people with his dance  moves.\n\nLess than a week later, my son, Jackson, showed up at school to find  out one of his classmates was dead. He had killed himself accidentally  using a loaded gun as a prop…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…important amendment today. I  hope my colleagues will join me in voting for this motion to recommit.\n\nMr. Chair, I include in the Record the text of this amendment.\n\nMs. Houlahan moves to recommit the bill H.R. 3838 to the       Committee on Armed Services with instructions to report the       same back to the House forthwith, with the following       amendment:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Assistance Initiative.\n\nMy amendment would reinstate funding for the Ukraine Security  Assistance Initiative. I include in the Record the text of this  amendment.\n\nMs. Kaptur moves to recommit the bill H.R. 4016 to the       Committee on Appropriations with the following amendment:\n\nAt the appropriate place, insert the following:\n\nSec. __. Of the amounts…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…with  scrutiny.\n\nSmall businesses make up 99.9 percent of businesses in America, and  they remain the key source of economic prosperity across all of our  districts.\n\nH.R. 2965 moves the needle toward empowering small businesses by  reducing red tape. To say that that doesn't save money to small  business, then obviously she has never been a small business…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…supports rural jobs,  strengthens local economies, and improves how we manage our Federal  lands.\n\nI urge my colleagues to support H.R. 3937 today. Again, I hope the  Senate moves quickly to advance this important piece of legislation.\n\nMr. TIFFANY. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Roy), my friend and colleague, for yielding.\n\nMr. Speaker, I rise today in strong support of the rule. The American  people deserve elections that they can trust, and this rule moves us  just one step closer to restoring that trust.\n\nIt is simple. Only American citizens should be voting in American  elections. I can't believe we are even having to say that.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…on on this because you  watched what happened this weekend. I can tell you with absolute  certainty that you do not know the discussions and what is happening as  the train moves forward to try to resolve this.\n\nThis isn't a resolution that is going to happen with a whole bunch of  people getting involved and trying to lay out different things that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…buildup since day one, and our bipartisan bill  speaks for itself in putting money where our mouth is.\n\nAh, but here is the rub: We can only make it happen if the  administration moves from words to action, and an important step in  that process is the national defense strategy.\n\nHistorically, the national defense strategy is what administrations  use to…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Congressional Record during floor consideration. I appreciate       your cooperation regarding this legislation and look forward       to continuing to work together as this measure moves through       the legislative process.            Sincerely,                                                        Brian Mast,      Chairman.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS.  4 be placed in the Congressional  Record.\n\nMotion to Recommit With Instructions\n\nMr. Coons moves to recommit the bill H.R. 4 to the       Committee on Appropriations of the Senate with instructions       to report the same back to the Senate in 3 days, not counting…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693657/hr-4"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…a bill directing the  Department of Homeland Security to develop a national strategy to help  secure our elementary and secondary schools from acts of terrorism.\n\nThis bill moves us in the right direction. It acknowledges a painful  truth, that the safety of our students and teachers cannot be taken for  granted. It recognizes that schools need Federal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…believe that the day of reckoning is here for the  religious Nazis running Iran; that their terrorism is coming to an end;  that it is going to be replaced by a region that moves together, where  Sunnis and Shias and Israelis and all different groups--Christians-- work together to build economies for all those rights.\n\nWe live in a time of choosing.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…2030 initiative, tuition assistance, childcare, and  housing allowance supplements, and an extension of temporary lodging  expenses from 14 to 21 days to ease the burden of PCS moves. These are  not abstract numbers. They are real solutions for the families who  sacrifice so much to serve our great Nation.\n\nFinally, I traveled to Wallops Island in my district…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…We are continuing to pray for the recovery of Staff Sgt.  Andrew Wolfe, who was injured in the shooting. But, of course,  Specialist Beckstrom lost her life.\n\nThe news cycle moves very quickly, and it seems like while something  happens today, tomorrow, it is something new. But it is important that  we not allow the mistakes that were made by the Biden…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(Ms. De La  Cruz) for her leadership on this important issue to make sure the Fed  is ready and the discount window use is appropriate for the 21st  century, where money now moves, Mr. Speaker, at the press of a button.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…strike was ``limited.''\n\nNow that there is a Republican in the White House, what we are seeing  is that Democrats are suddenly trying to rewrite the rules. National  security moves fast. That is why our Constitution gives the Commander  in Chief real authority. President Trump seized the moment. He did it  responsibly; he did it decisively; and he did…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…President, I rise today to raise a point of order on  the War Powers Resolution before the Senate, which I reserve the right  to do at the close of my remarks and after Senator Kaine moves the  matter forward.\n\nI understand many of the sentiments people have about war powers and  the balance between Congress and the President. There is truly clear  tension between…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…engaging in hands-on learning  in day and overnight summer camps, including military team adventure  camps.\n\nWe, as a nation, ask so much of our military families. Frequent moves  can be especially difficult for children. However, the 4-H Military  Partnership Grant Program can serve as a lifeline to military families  by providing continuity, as it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]