[{"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Harriet Tubman.\n\nTubman served as a nurse, an intelligence operative, and a scout. She  was part of a movement, part of an Army, providing crucial information  on Confederate movements in supply lines. In 1863, she planned and  guided the ferry raid, destroying Confederate supplies and freeing more  than 700 enslaved people, becoming the first American…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans watching at home were waiting for answers, answers and  explanations they never received.\n\nWhile President Trump was addressing us last night on this very House  floor, movements were being made by the Chief of Staff for Veterans  Affairs, Christopher Syrek, to execute a detrimental reduction in force  at VA. With the support of this administration,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688505/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Delaune and  Brian Hublar coordinated with partners from the inaugural task force,  U.S. Secret Service, and the Presidential Inaugural Committee on all  motorcade arrivals, movements, and departures on the east front of the  Capitol, to include the landing and take-off of the HMX-1 helicopter  for the farewell of President Biden.\n\nInside the halls of…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…makes this great Nation beautiful: it is multicultural,  multiracial, indigenous, Black, Brown, White, and diversity that makes  us who we are.\n\nThis erasure delegitimizes the movements and wins we have secured  generation after generation, from the struggle for civil rights at  Selma and the Edmund Pettus Bridge, slavery at Gettysburg, and westward  expansion…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…individuals for their identity and seeking       to deny their shared identity; and\n\nWhereas, the alarming increase in hate crimes against the       Jewish community has catalyzed movements such as End Jew       Hatred, which seeks to reshape public dialogue and create a       society where Jew-hatred is intolerable, empowering       individuals to embrace their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…meant to  hold them accountable. And the regimes that do this are the same ones  that threaten regional stability and our own security, which is why  supporting democratic movements and civil society abroad remains  squarely in America's interests.\n\nThis administration's funding cuts for democracy and election  observation programs move us in the wrong…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…activist,  Yuri Kochiyama, worked alongside Malcolm X during the civil rights  movement.\n\nDuring Black History Month, we are reminded that the civil rights and  Asian-American movements have always gone hand in hand in seeking  justice against systemic racism.\n\nAs we celebrate our progress this Black History Month and fight back  against the Trump administration,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687997/black-history-month-and-the-alliance-between-the-black-and-asian-community"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…these truths to be self-evident,  that centuries of bondage and enslavement brutalized Black bodies and  tore apart Black families, that Black women have been the mothers of  movements, that Black folks have endured redlining and pay disparities,  and yet, still, we rise.\n\nBlack brilliance exists in every corner of this Nation, from the  stage to the court…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…very first chair of  the Congressional Black Caucus, Representative Charles Diggs, was born  and raised also in Detroit, carrying forward our city's legacy of  resilience and movements and so much, again, fights against oppression  here and across the world.\n\nIt was also another son of Detroit, my predecessor and founder of the  Congressional Black Caucus,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…practitioners, but also to remember those who  have died for their beliefs.\n\nFalun Gong is a peaceful religion that teaches self-improvement  through meditation based on slow movements and regimented breathing.  For over two decades, Falun Gong practitioners have suffered from  detention, torture and organ harvesting at the hands of the Chinese  government.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691790/supporting-the-falun-gong-practitioners"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…took  the stage in Munich and further eroded our status in the world. He  castigated European allies for his perceived grievances with their  domestic politics and alleged movements away from ``democratic  values,'' while at the same time remaining silent on the brutal  dictators in Russia and Belarus who have never had a free or fair  election in the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Trump. This rule is but another step on the march to tyranny.\n\nTrump is seeking to create a master file of information on every  single American, a digital ID tracking your movements, where you live,  where you work, when you see a doctor, how much money you have, even  child support agreements, and much more. Today, Republicans are simply  rubberstamping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…rights movement, Rustin, a gay man,  inspired others to advocate for and achieve rights for LGBTQ+ people.  He  remained a strategist and public speaker for workers' rights movements,  including co-founding the A. Philip Randolph Institute, an organization  for Black trade union members. Rustin remained committed to promoting  social good, and advocating…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…affected folks at the federal level.\n\nHuntington's disease is a rare genetic disorder that slowly damages  the brain over time. It leads to a progressive loss of control over  movements, thoughts, and emotions. There is currently no cure. However,  there is hope. Because of ongoing advancements in medical research and  continued investments in biomedical…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…the future of Burma by  leveraging sanctions and financial oversight.\n\nThe BRAVE Burma Act will strengthen U.S. efforts to disrupt  authoritarian regimes, support democratic movements, and protect  vulnerable populations.\n\nMr. Speaker, I thank Congresswoman Betty McCollum, my co-chair of the  Congressional Burma Caucus and an original cosponsor of this…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…GILL of Texas. Mr. Speaker, I rise today in recognition of the  Sharia Free America Caucus, which I am proud to have joined.\n\nAcross the world, ideologically driven Islamic movements have  destabilized entire regions; displaced tens of millions of people; and  fueled terrorism, repression, and violence.\n\nWhere civil law is subordinated to Islamic authority,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699120/sharia-free-america-caucus"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…balance the budget.  Great. Tell me what 40-plus percent--because you have to deal with the  economic effects--of government you want us to cut.\n\nThe fact is, with just the movements in interest rates this year, it  is approaching a couple of trillion dollars in additional interest over  the next 10 years.\n\nLook, no one needs another speech from me doing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…in Washington.  They don't want to do it. At least we do.\n\n$5.1 million was to strengthen the resilience of lesbian, gay,  bisexual, transgender, intersex, and queer global movements. I don't  know what those global movements are. I think they can do that without  taxpayer money. Then, of course, there was funding drag shows in  Ecuador.\n\nThe list goes…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the things we do  around here.\n\nMr. Speaker, we are nowhere near his so-called authoritarian  dictatorship from a historical perspective. For those of us who study  those movements throughout history, I would submit, Mr. Speaker, that  to even say that is damaging to this great Republic, which is known  throughout the world as the beacon of freedom…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…money.\n\nMr. Speaker, there is $567,000 for LGBTQI+ programs in Uganda and  $5.1 million to strengthen the ``resilience of lesbian, gay, bisexual,  intersex, and queer global movements.'' I am not sure what that global  movement is. They can continue that movement in some other way, but  just not with the taxpayer dollars of the United States of America's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…DOGE cuts.\n\nThe American people know waste, fraud, and abuse when they see it.  They want us to eliminate Democrats' radical agenda, including $5.1  million for global LGBTQ movements, $3 million for circumcisions in  Zambia, and $833,000 for transgender surgeries in Nepal.\n\nThis package also ensures tax dollars aren't used to weaponize media  against…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…sovereignty,  and the free world supports them, the world changes. It happened in  1776. It happened throughout Europe in the darkest days of the 20th  century. It happened in the movements for justice and equality on our  own soil, and it can happen again for the people of Iran.\n\nMr. Speaker, that is our prayer. That is our thought for today. I  yield back…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…million for net-zero cities in Mexico; $5.1 million for programs to  strengthen the resilience of lesbian, gay, bisexual, transgender,  intersex, and queer--good grief--global movements; $1.5 million to  advance diversity, equity, and inclusion in Serbia's workplaces; $2  million for Moroccan pottery classes; $2 million for sex changes and  LGBT activism…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…liberties and ensuring       justice for all, regardless of race, gender or background.\n\nAbroad, America plays a critical role in promoting freedom       by supporting democratic movements, opposing tyranny, and       providing humanitarian aid.\n\nThe U.S. has historically used its influence to encourage       the spread of human rights and liberty worldwide,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…and  vote at the World Bank to maintain a strict pause on disbursements in  new financing commitments to the current government in control of  Burma.\n\nSupporting democratic movements, defending human rights, and  advancing stability in Southeast Asia are in our American interest.  When international institutions inadvertently enable authoritarian  regimes…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that adjustment, we may have lost $200 billion in tax receipts in this  fiscal year, the end of September, between now and then. It just shows  how fragile we are with small movements of interest when we have to  refinance $9 trillion.\n\nThink about this. A single point of interest on U.S. debt--and it  takes years for it to roll in because of how much…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Committee, and my staff director for the Ways and Means Committee for  the last 3 years.\n\nMark's deep understanding of and relationships within the  conservative and the populist movements have been invaluable as we  worked to build the One Big Beautiful Bill Act.\n\nI am told that most Ways and Means Committee staff directors often  have their legacies defined…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "Mike Turner", "party": "Republican", "sentence": "…throughout the world, and I  can attest to the important work done under his leadership.\n\nThe National Endowment for Democracy is a critical tool for ensuring  that prodemocracy movements have the resources they need to counter  authoritarianism and confront human rights abuses. Countries such as  Ukraine, Bosnia, and Georgia face constant pressure and interference…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699043/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…million for  circumcision, vasectomies, and condoms in Zambia; $5.1 million to  strengthen the resilience of lesbian, gay, bisexual, transgender,  intersex, and queer global movements; $3 million for Iraqi ``Sesame  Street''; $2.5 million for teaching young children how to make  environmentally friendly reproductive health decisions; and $833,000  for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}]