[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…because they screwed it up the first time, they voted to cut  Medicaid and SNAP again.\n\nAs we stand here, debating unrelated immigration measures, Senate  Republicans are moving forward with their version of the big, ugly  bill. Because House Republicans broke so many rules when they passed  their bill the second time, they are going to have to vote on…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of VA's efforts in ensuring  veterans receive the outreach, support, and services they need and  deserve when it comes to their mental health.\n\nTherefore, I hope that, moving forward, we can work together, along  with our Senate counterparts, to reauthorize the Fox Grant Program in a  responsible way and ensure it is as effective and robust as our…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…micromanage the affairs  of the District of Columbia, which has its own Mayor and city council,  who are perfectly capable of representing their constituents,  Republicans are moving forward with more tax breaks for billionaires  and corporations while lower  income Americans are made worse off through their largest cuts to  healthcare and food assistance in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…National Institute for Occupational Safety and  Health, or NIOSH, produced a report examining what went wrong and,  crucially, how to prevent these tragedies from occurring moving  forward. Those reports went on to save untold lives.\n\nIn Mark's case, the NIOSH report spurred a new emphasis on  identifying and communicating the presence of a basement upon…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689637/protecting-and-serving-our-firefighters"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Chambers have been using the CRA to overturn public lands protections  that have never been considered rules in the past. In an entirely  unprecedented move, they are moving forward, even though the Government  Accountability Office hasn't yet ruled on whether they believe this  public land order constitutes a rule that would be subject to the CRA.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…people.\n\nSo this moment isn't just about looking backward at a Court decision.  That is not what we are getting at. It is about deciding what kind of  Congress we want to be moving forward. Do we accept a system where  access is bought and outcomes are shaped by the wealthiest members in  our society or do we set a higher bar and say that democracy should…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…This approach  will provide a reasonable regulatory framework with proper oversight  and require renewal every 5 years to ensure that it is working as  intended and that, moving forward, the Fish and Wildlife Service  conducts proper environmental assessments as it renews the program.\n\nThis bill will help U.S.-based aquaculture producers deliver healthy…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…wide range of stakeholders, including labor, environmental, and other  trade groups, about proposed changes to make this program better,  stronger, and more effective moving forward.\n\nThis is a straight reauthorization for 3 years, providing a runway  for all stakeholders to weigh in on needed improvements. To appropriate  the sage words of Frederick…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698907/agoa-extension-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…billion into Trump's crypto business, his father--who, again not  coincidentally, is Trump's Middle East Envoy--went back to the region  and announced that they would be moving forward with the transfer of  these computer chips to the UAE--$2 billion into the Trump family's  pockets and the most sensitive American technology that had been  previously…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the harms that steep cuts to programs like Medicaid will have on both  the economic well-being and health outcomes of millions of American  families. They are steadily moving forward with their plan to slash  these crucial programs by billions of dollars while, at the same time,  proposing big tax cuts for those who can afford to pay for quality  healthcare…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…decide they don't like, all on a party-line vote, all  because of obeisance and fear of Donald Trump, not a conviction that he  is doing the right thing. This is a dark omen moving forward.\n\nOur Republican friends say they fight for the middle class. They say  they fight for working people. Then they turn around and take  investments away from middle class…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…things here and making it more  accessible to young families and more reflective of the American  people.\n\nSpeaker Johnson pulled out all of the stops to prevent us from moving  forward. We followed the rules and filed a discharge petition. We got  the 218 signatures necessary to bring it to a vote  on the floor. Yet, he went to historic lengths to try…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…find the will to act after a  tragedy like the one at Brown University.\n\nFor the sake of those who were killed this weekend and for the sake  of so many lives we can save moving forward, Congress must again act  against gun violence and act against all forms of violent hate.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…speakers, and I am  prepared to close.\n\nMr. TAKANO. Mr. Speaker, in closing, I yield myself the balance of my  time.\n\nMr. Speaker, I am glad to see that the House is moving this bill  forward today, and I hope for speedy passage through the Senate and to  the President to be signed into law.\n\nI look at the many other good bills languishing in committee…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I thank Mrs. Dingell for yielding  the time, and I thank Chairman Bilirakis for moving the bill forward to  the floor today.\n\nI rise in strong support of H.R. 906, the Foreign Adversary  Communications Transparency Act. This bill would require the Federal  Communications…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…from the great State  of Texas, the chairman of the House Committee on the Budget, for  yielding.\n\nMr. Speaker, I rise in strong support of this resolution and in  moving this process forward. Let's keep in mind that we worked  incredibly hard, especially here in the House, for months to negotiate  all the details of what needs to happen in this budget…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…race by throwing everything you could at him, whether  it made sense or not, and his friends? See, I don't know, but we are  going to find this out, Senator Peters. We are moving forward.\n\nYou have made up your mind. If it were up to you, we would not be  looking at Jack Smith. You made a mistake there by defending somebody  when you had no idea, actually,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and helium development projects to continue  through the regulatory and permitting process, which they will have to  complete at both the State and Federal levels before moving forward.\n\nMr. Speaker, this CRA will not green-light any proposed project. All  it does is remove the dangerous, misguided ban that stops us from  considering any project. This…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…means jobs and a brighter future  for so many.\n\nWhen you talk about jobs in the space industry, it is not a job to so  many; it is a career. The dedicated folks at NASA are moving forward  with these new technologies. They are working hand-in-hand in public- private partnerships with companies like SpaceX, Blue Origin, Rocket  Lab, Boeing, L3Harris, and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…address homeland  security needs. It also directs DHS to submit a strategy for how the  agency will coordinate with DOE to address biodetection research and  development moving forward.\n\nTo ensure accountability, H.R. 706 requires DHS to report to Congress  on the assessment and strategy no later than 1 year after the date of  enactment.\n\nAs a first responder,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…2022 NPR-A IAP record       of decision.                                  Conclusion\n\nRDC appreciates your leadership introducing S.J. Res. 80       and H.J. Res. 124 and moving forward with disapproval of the       BLM's 2022 NPR-A IPA Record of Decision. The 2022 ROD went       too far and does not properly follow the intent and purpose       for the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…that threaten our most dependable power  sources with the American people paying the price.\n\nThe Reliable Power Act puts an end to this by preventing Federal  rules from moving forward if they threaten the ability of the grid to  keep the lights on. This legislation ensures proper coordination  between FERC, the Federal Energy Regulatory Commission, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…country because  we have tackled these issues, largely in a bipartisan way, including  with people who serve here in Congress on the Democratic side.\n\nMr. Speaker, I say, moving forward, while I am grateful for the  desire and the belief to tackle anti-Semitism, there is a time and a  place for those kinds of arguments. This was not one.\n\nI thank my colleagues…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to save that money or to return it to the taxpayers from  whom it came in the first place.\n\nAs officials at the Office of Management and Budget consider their  options moving forward, I hope they know that I will be a willing and  eager partner in their efforts.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the first 5 months of test driving and  implementing these reforms. The legislation makes these temporary  provisions permanent and stops payments to deceased individuals moving  forward.\n\nMadam Speaker, this bill is a big step toward accountability, and I  urge my colleagues on all sides of the aisle to join me in supporting  this vital antifraud, antiwaste,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…grocery store.\n\nThis legislation has been in the making for a long time, and it is  past due that we send it to the President's desk and make this the law  of the land.\n\nMoving forward, every child across southern Minnesota and the rest of  the Nation will have access to whole and 2 percent milk products when  they go through the school lunch line. Moreover,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698181/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…November  21. Keeping the spending at current levels, this measure would have  given us the time we need to be working on these appropriations bills.  It would have kept us moving forward and kept us from wasting time.\n\nOne of the things I think is so important is that shutdowns are  expensive, and this is something that ends up costing us money every  time…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…production and propulsion technologies  necessary to extend our reach beyond Earth. I thank Representative  Begich and Representative Whitesides for their leadership in moving  this bill forward.\n\nMr. Speaker, I urge my colleagues to support it, and I yield back the  balance of my time.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "John James", "party": "Republican", "sentence": "…with  disabilities had access to public education. Today, millions succeed  because of IDEA.\n\nWith the IDEAL Act, we reaffirm our commitment. We finish the job. We  keep moving forward, not backward.\n\nI urge my colleagues to support the IDEAL Act.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…were asking, ``where did  this guy come from?'', ``he is amazing!'', ``Can he come to every  game?''. Coach Kupcik told him, ``You're hired!'' That day, and every  day moving forward, he refused payment for his services. Mr. Lancaster  always says it's his way of giving back to the community. Since his  ``tryout'', Mr. Lancaster has offered his talents,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}]