[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…invested over $4 billion in  biomanufacturing. We must take action now. We must not cede the lead to  China. We must win the biotech competition.\n\nIt is for that reason, Mr. Chair, I urge my colleagues on both sides  of the aisle to join me in strongly opposing this amendment, and I  yield back the balance of my time.\n\nMs. McCOLLUM. Mr. Chair, I rise in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…addressing vulnerabilities in our electric supply chain, it is time  they speak out against harmful Trump administration policies that  threaten our electric supply chain.\n\nMr. Chair, I also urge President Trump and my Republican colleagues  to stop turning a blind eye to the affordability crisis.\n\nAmerican families are struggling, and President Trump and  congressional…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…both ridiculous and extreme government overreach. We  should be focused on strengthening our military readiness, not  censoring the LGBTQI+ community and our allies.\n\nMr. Chair, I urge my colleagues to oppose this amendment, and I  reserve the balance of my time.\n\nMr. TAKANO. Mr. Chair, may I inquire as to how much time is  remaining.\n\nMr. TAKANO. Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Hazard Reduction and  Healthy Homes grants.\n\nMore generally, we know housing is healthcare. This bill provides $74  billion in discretionary spending for housing programs.\n\nMr. Chair, I urge my colleagues to join me in supporting this  package, and I thank the chairman and the ranking member.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…it would  create enormous new responsibilities for the Department of Education at  the same time that Trump is attempting to illegally dismantle that very  Department.\n\nMr. Chair, I urge my colleagues to vote ``no.''", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…outpatient care.\n\nThe list goes on and on and on.\n\nIt would also eliminate funding for K-12 education programs, higher  education programs, and job training programs.\n\nMr. Chair, I urge a ``no'' vote on this amendment, and I reserve the  balance of my time.\n\nMs. DeLAURO. Mr. Chair, community projects have been successful. It  is Senators and Members…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…him now, I will. If not, I want to  thank him for his leadership of our committee, which has been collegial  and positive. I think it has led to this resolution today.\n\nMr. Chair, I urge strenuously and by the way, let me mention to the  gentleman from Texas he is protected by the Constitution of the United  States from having exactly the same thing done…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…of the defense budget, OHDACA's budget is  modest, but its impact is huge. It yields massive returns in lives  saved, crises stabilized, and partnerships strengthened.\n\nMr. Chair, I urge my colleagues to reject this amendment.\n\nMs. JACOBS. Mr. Chairman, these AUMFs were literally voted on when I  was 2 years old and 13 years old, respectively, and now…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…solutions instead of giveaways to polluters. This special interest  crowd that is getting different treatment to pollute and not respect  our resources has got to stop.\n\nMr. Chair, I urge Members to please oppose this bill.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…messaging bill with unfunded  mandates for busywork that will not provide the clarity and direction  that we need to support and protect America's clean energy supply  chain.\n\nMr. Chair, I urge my colleagues to oppose this bill and refocus on  efforts that will actually strengthen our energy supply chain and  reduce energy costs for our families.\n\nI implore…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…beneficiaries and those around  them from potential harm, beneficiaries with debilitating mental  illnesses such as schizophrenia, Alzheimer's, dementia, and bipolar  disorder.\n\nMr. Chair, I urge my colleagues to vote against this appropriations  bill.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…Ukraine in the fight for freedom  and global democracy.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Chair, I yield 1\\1/2\\ minutes to the  gentleman from Nebraska (Mr. Bacon).\n\nMr. BELL. Mr. Chair, I urge my colleagues to support the amendment,  and I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…money, and it doesn't improve readiness. All it  does is close off technology others are racing to develop while handing  China a free lane in a strategic biotech domain.\n\nMr. Chair, I urge my colleagues to vote ``no'' on this amendment to  ensure DOD can test, validate, or reject technology on the merits, not  because of shortsighted, anti-science ideology.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…administration the tools and funding needed to make our  country safer, more secure, and more prosperous, with the understanding  that they must be partners with Congress.\n\nMr. Chair, I proudly urge my colleagues to join me in supporting this  bipartisan bill.\n\nMs. DeLAURO. Mr. Chairman, I yield 3 minutes to the gentlewoman from  New York (Ms. Meng), who is the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…medical center and academic center at Toledo.\n\nIn Toledo, to level funding in this account will not allow us to grow  and fully support the needs of all of our veterans.\n\nMr. Chair, I urge my colleagues to join me in voting for the motion  to recommit, and I include in the Record the text of my amendment.\n\nMs. Kaptur moves to recommit the bill H.R. 3944…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…would also like to highlight that the DETERRENT Act  includes bills from my committee colleagues Representative Harris,  Representative Owens, and Representative Messmer.\n\nMr. Chair, I urge my colleagues to support the DETERRENT Act. Doing  so will help defend against our adversaries while also holding our  institutions to a higher standard. Take foreign…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…solutions. It supports a cleaner  water for our country. It is strong State leadership. It is better  outcomes for communities. It is locally driven, not federally mandated.\n\nMr. Chair, I urge my colleagues on both sides of the aisle to support  H.R. 3898 and my amendment, and I yield back the balance of my time.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698032/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…behavior on college campuses. We have to make sure that this money  isn't getting through dark channels, back channels, and influencing our  universities and our youth.\n\nMr. Chair, I urge adoption of my amendment, and I yield back the  balance of my time.\n\nMr. OGLES. Mr. Chair, this amendment ensures that Chinese military  companies are included as foreign…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Readiness  Subcommittee.\n\nMadam Chair, I urge all Members to vote ``yes'' on this important  legislation.\n\nMr. BERGMAN. Mr. Chairman, I thank the gentleman for yielding.\n\nMr. Chair, I urge strong support for this amendment to increase  penalties  for unauthorized access to DOD facilities.\n\nIn 2023, five Chinese nationals were caught in my district at Camp…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…appropriate.\n\nTogether, these changes will increase the availability of credits and  provide alternatives to ensure that a lack of credits doesn't hamstring  new developments.\n\nMr. Chair, I urge my colleagues to support my amendment to H.R.\n\nMr. CRAWFORD. Mr. Chair, I am very pleased to recognize that my  friends on the other side of the aisle do recognize that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…purpose of our military is to defend  the United States, not validate identity politics. It makes sure  TRICARE serves the mission of protecting health, not undermining it.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMs. MACE. Mr. Chair, may I inquire as to the time remaining.\n\nMs. MACE. Mr. Chair, if…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…agencies against supply chain constraints that could occur as our  Nation seeks to address timely development of electric generation and  transmission infrastructure.\n\nMr. Chair, I urge my colleagues to support H.R. 3638.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…is responsible governance. It strengthens  transparency, fortifies national security, and ensures Congress remains  fully informed about potential threats to the grid.\n\nMr. Chair, I urge my colleagues to support this amendment, and I  reserve the balance of my time.\n\nMr. GOSAR. Mr. Chair, I think the gentleman is suffering from power  phobia, but this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…strength will  ultimately require us to get defense spending back above 4 percent of  GDP. However, none of that can happen unless we pass this budget  resolution today.\n\nMr. Chair, I urge my colleagues to join me in supporting this  resolution.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688078/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…supporting  accountability by ensuring that we get answers to how this fraud was  able to steal from military families and taxpayers undetected from 2016  through 2023.\n\nMr. Chair, I urge Members to vote ``yes'' on my amendment, and I  yield back the balance of my time.\n\nMr. ROSE. Mr. Chair, I demand a recorded vote.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…that Taiwan has the  resources necessary to help prevent a Chinese invasion. That is the  position of the Trump administration, and that is the position of this  bill.\n\nMr. Chair, I urge a ``no'' vote on the amendment, and I yield 2  minutes to the gentlewoman from Minnesota (Ms. McCollum).\n\nMr. CALVERT. Mr. Chair, I yield back the balance of my time.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…that has been weaponized, that has held up and  killed many good projects that would lead to our energy independence  and to those very States that she is talking about.\n\nMr. Chair, I urge support of my amendment, and I reserve the balance  of my time.\n\nMr. BABIN. Mr. Chair, may I inquire as to the time remaining.\n\nMr. BABIN. Mr. Chair, I yield 1\\1/4\\ minutes…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…shareholders.\n\nMr. SELF. Mr. Chair, as the chairwoman referenced, organizations that  want to do this are already doing it voluntarily. We should not add  micromanagement to it.\n\nMr. Chair, I urge adoption of this amendment, and I yield back the  balance of my time.\n\nMr. SELF. Mr. Chairman, I demand a recorded vote.\n\nMr. SELF. Mr. Chair, I rise in support of my…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…and erosion of our values.\n\nThe American people may be busy, but they are not stupid. With this  vote, they will see clearly who is fighting for them and who is not.\n\nMr. Chair, I urge my colleagues to vote ``yes,'' and I yield back the  balance of my time.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…information to the Federal Bureau of  Investigation about veterans without a judge's consent.\n\nIt also prohibits the VA from processing medical care claims for  illegal aliens.\n\nMr. Chair, I urge my colleagues to vote in favor of this bipartisan  en bloc and for this critical piece of legislation. Our veterans are  the living embodiment of duty, honor, and sacrifice.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692951/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]