[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…I invite my colleagues to listen to their constituents, vote no, come  back to the table, and join us in the work to make healthcare  affordable and accessible for all.\n\nMr. MOORE of North Carolina. Mr. Speaker, as we take up the Senate- passed bill to reopen the government, I want to clarify that we should  be proceeding through regular order before…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are out here working  overtime to shill for coal and gas. It is just very sad.\n\nMadam Speaker, I urge opposition to the amendment, and I yield back  the balance of my time.\n\nMr. MOORE of West Virginia. Madam Speaker, baseload energy in this  country is absolutely quantified and defined by natural gas, nuclear,  and coal. That is baseload energy in this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Americans.\n\nMr. ARRINGTON. Mr. Speaker, I wonder how my colleagues justified the  $800 billion tax break for multibillion dollar, multinational green  energy corporations.\n\nMr. MOORE of North Carolina. Mr. Speaker, this is an opportunity this  evening to vote for a budget resolution that extends tax relief for  working families.\n\nIf Members want to support…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, yesterday marked 100 days  since President Trump took office for the second time. It has been a  whirlwind 100 days, to say the least, as his…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, I am so glad to be joined by my  colleagues this evening to talk about the historic tax relief we are  providing for working families this tax season.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, I thank the gentleman from Utah for  yielding.\n\nMr. Speaker, Mr. Moore is a dear friend not only to me but to my  children. My children don't know him well. They have met him, but the  reason he is a friend to my children and to your children…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I thank the gentleman from Utah  (Mr. Moore) for yielding and for being an incredible member of the best  committee in Congress, the Ways and Means Committee.\n\nMr. Speaker, I rise today to pay tribute to my staff director,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…on the other side of the aisle than the American  people, but anyway.\n\nMrs. McCLAIN.  Boebert).\n\nMrs. McCLAIN. Mr. Speaker, may I ask how much time remains on each  side.\n\nMr. MOORE of West Virginia. Mr. Speaker, as chairman of the RSC  Rescissions Task Force, I am proud to support this bill to codify the  DOGE cuts.\n\nThe American people know waste,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Madam Speaker, Pursuant to House Resolution  953, I call up the bill (H.R. 3492) to amend section 116 of title 18,  United States Code, with respect to genital…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, it has been quite a week for  the House Republicans with the long and late committee hearings as we  move forward on our reconciliation package…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  inauguration of the Sixth President of the University of Mobile, Dr.  Charles Smith, who was unanimously elected…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691962/recognizing-dr-charles-smith"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  outstanding contributions, hard work, and legacy of Mr. Frank Caskey.  His dedicated service to the Alabama Legislative…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  outstanding contributions, hard work, and legacy of Colonel Richard  Tucker. His dedicated service to Alabama and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Every American across the country should expect more from  their government.\n\nJoining me today are a few of my colleagues. I yield first to the  gentleman from North Carolina (Mr. Moore), my fellow North Carolinian  and a fierce border security advocate. Congressman Moore has been a  leading voice in the fight to reform FEMA and to ensure its funds go  toward…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…ROUZER. Mr. Chair, I yield 1 minute to the gentleman from North  Carolina (Mr. McDowell).\n\nMr. ROUZER. Mr. Chair, I yield 1 minute to the gentleman from North  Carolina (Mr. Moore).\n\nMr. MOORE of North Carolina. Mr. Chair, we are not here today to  recognize the Lumbee Tribe of North Carolina. The Lumbee Tribe was  already recognized by the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "MR. MOORE of Utah.\n\nMr. MOORE of Utah. Mr. Speaker, I am glad to be joined by my  colleagues this evening to talk about our progress on the  reconciliation bill, as well as the importance…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, had I been present, I would have  voted NAY on Roll Call No. 333.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698065/improving-interagency-coordination-for-pipeline-reviews-act"}]