[{"senator": "Al Green", "party": "Democrat", "sentence": "…were never going  to do it. Al Green just had this false notion.'' Well, let me have it.  Don't cut Medicaid. It is all they have.\n\nThis is the richest country in the world. Mr. Musk has doctors. He  will get the best healthcare. Let him understand that he should be on  my side. He should be on the side of the people who need this  healthcare. He has the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…vacuum. It is unfortunate  that Elon Musk and his DOGE minions have had access to data on hundreds  of millions of Americans. I wish we were here on the floor preventing  Mr. Musk from getting our personal health records, our consumer data,  our business records, our Social Security numbers, and our tax data.\n\nAfter we pass this bill, I hope that the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…efforts.\n\nAs we face new and ever-growing challenges, including those driven by  climate change and extreme weather, NOAA's work is more vital than  ever.\n\nThe President and Mr. Musk's reckless threats to NOAA's workforce,  its budget, and its scientific research will make us less prepared and  cost more money and, indeed, lives.\n\nCraig McLean, who served…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…range of unlawful powers, effectively granting this  flagrantly unconstitutional creation significant control over the  executive branch.\n\nDonald John Trump has appointed Mr. Elon Musk as the de facto head of  this contrived entity, which was not created or funded by any law,  without a formal title or office. These actions have been in direct  violation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…fire like X or one of Trump's corrupt corporations.\n\nWe can't afford it, and the American people can't afford it.\n\nMr. Speaker, it is well past time that Congress removed Mr. Musk and  his DOGI minions from our government and get down to doing the peoples'  business.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Mr. Speaker, if we are serious about saving money, they should look  into that. That is something that they should seriously look at. We  spend $3.5 million per trip. Tell Mr. Musk to go and ``DOGE'' that  because that is something that is real. That is something that is  within the President's power to be able to stop. Yet, we come in this  Chamber…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Social Security.\n\nSocial Security is currently under attack by the Trump administration  with just this weekend, Mr. Speaker, Mr. Trump calling Social Security  a scam and Mr. Musk calling Social Security a Ponzi scheme.\n\nNow, Mr. Speaker, I am sure as you know in your district, you have  209,000 Social Security recipients: 157,000 are retirees; 25,000…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…agency after agency and database  after database, downloading, accessing, and applying artificial  intelligence systems to those data. Yet, when we have tried to bring  Mr. Elon Musk in front of the Oversight Committee, or any committee of  this body, the GOP has consistently blocked us day after day.\n\nMr. Musk claims to have maximum transparency, yet…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689400/demanding-answers"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…million of  those monthly benefits.\n\nI join my colleagues in sounding the alarm on this administration's  attacks on the bedrock national promise of Social Security, which Mr.  Musk called a Ponzi scheme. We have already seen firings in the Social  Security Administration, threatening to close field offices, a website  crashing several times in March,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Social Security  on behalf of  its recipients. That is why I have introduced legislation specifically  to address this issue.\n\nYet, Mr. Speaker, at the same time, we see that Mr. Musk has been  charged by the President of the United States to cut $2 trillion from  the budget. Mr. Musk has made no bones about the fact that he plans to  privatize Social Security…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688950/it-has-been-over-50-years-since-congress-has-enhanced-social-security"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, if there was fraud, there would be arrests.  There is not fraud. There have not been arrests. They are depending on  the word of Mr. Musk, who took out a chain saw from the President of  Argentina and waved it around, a chain saw. He took a chain saw to the  budget, not a scalpel.\n\nIf my colleagues want to improve…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692546/rescissions-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…of Education may not interfere  with the content that schools teach, nor the academic standards that  they set. Mrs. McMahon doesn't seem to know that.\n\nBy the way, while Mr. Musk has been tearing the Department of  Education apart from the inside, Republicans in Congress have passed  punitive blueprints that will cut trillions from government services…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Musk and Trump  to make sure that $2 trillion is cut so that it can make way for  further tax cuts for the Nation's wealthiest 1 percent.\n\nAt over $500 billion, I would think Mr. Musk might say: Do you know  what? This is a great Nation that has provided me these great  opportunities. How about we care for them the same way this Nation has  cared for us?…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, why is the Trump administration, Mr. Musk,  and their secret meat grinder called DOGE hurting working Americans?\n\nInflation is going up, unemployment is up, the stock market is  rickety and went down again today,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…know it.''\n\nI mean, really, we were quite shocked. I mean, let's be clear: All  215 Democrats have been saying this for weeks, but obviously, things  really boiled over for Mr. Musk on Tuesday.\n\nThen, just a few minutes later, he followed up with another shot at  Donald Trump, where he says: ``It will massively increase the already  gigantic budget deficit…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…no one--absolutely no one--suggesting that. This is what is  called a straw man. You erect a phony argument, and you knock it down,  and you claim victory.\n\nThe truth is, Mr. Musk and the Department of Government Efficiency  should be applauded for their efforts to root out waste, fraud, and  abuse. You would think taxpayers--the same taxpayers our…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}]