[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, I missed the conversation on the floor--\n\nMr. MERKLEY. Thank you, and thank you to my colleague from Oklahoma.\n\nThe issue we are addressing needs to be addressed. The nomination  process is entirely broken. People are sick and tired of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…yield to the  question that is being posed by my colleague from Massachusetts.\n\nMr. MERKLEY. I yield for a question to be posed by my colleague from  Massachusetts.\n\nMr. MERKLEY. Thank you very much, Mr. President. I see that my  colleague from Massachusetts is here and has gotten half of her  question out.\n\nIf you would like to continue the question,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Constitution.\n\nMr. MERKLEY. Mr. President, I ask to be recognized. We are in the  middle of a series of presentations here.\n\nMr. SCOTT of South Carolina. He recognized you.\n\nMr. MERKLEY. Thank you.\n\nI could understand if my colleague was objecting because that  amendment only covers one type of cryptocurrency that is being used in  this fashion, and therefore…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. I thank my colleague Senator Whitehouse, who has been  pointing out that we have a money and politics system that is  corrupting the vision of government by and for the people…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]