[{"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I thank my friend from Kentucky for  yielding.\n\nMr. Speaker, I rise today in strong support of the Medal of Honor  Act.\n\nThe Medal of Honor is our Nation's…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…conduct targeted outreach to small  business owners in rural communities.\n\nI will close by thanking the gentleman from Montana (Mr. Downing),  the gentleman from New Hampshire (Mr. Pappas), and the gentleman from  Florida (Mr. Bean) for their partnership on this important, bipartisan  legislation. I also thank Chairman Williams and Ranking Member  Velazquez…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of Northeast  Delta Dental and their achievement in receiving the prestigious Malcolm  Baldrige National Quality Award.\n\nNortheast…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688205/recognizing-the-achievements-of-northeast-delta-dental"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to honor the career of David  McCormack as he retires after 34 years of service to the U.S.  Citizenship and Immigration Services agency. Over…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to honor the legacy and career  of Somersworth Police Chief Timothy J. McLin.\n\nAfter 33 years in law enforcement Chief McLin is embarking on a…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688242/recognizingmc-the-achievements-and-retirement-of-somersworth-police-chief-timothy-j-lin"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Madam Speaker, I rise today because the House has a  critical opportunity to support families and small businesses who are  struggling to afford healthcare for 2026.\n\nI…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698696/supporting-families-and-small-businesses-struggling-to-afford-health-care"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to urge my colleagues to  support the HALT Fentanyl Act when it comes to the floor tomorrow.\n\nFor the past 5 years, I have engaged with law enforcement,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692340/calling-for-permanent-scheduling-for-fentanyl-analogues"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today because healthcare through  Medicaid, covering more than 10 percent of residents and more than 30  percent of all kids in New Hampshire, is on…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689237/cuts-to-medicaid"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Disability to help employers hire more people with  disabilities and provide much needed support to these entrepreneurs.\n\nMr. Speaker, I thank Mr. Stauber, Ms. Simon, Mr. Alford, and Mr.  Pappas for their bipartisan collaboration on this bill, and I reserve  the balance of my time.\n\nMr. McGARVEY.  Simon).\n\nMr. Speaker, I thank my colleagues: Mr. Stauber,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691776/thinkdifferently-about-disability-employment-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…which is a bipartisan  bill, called the End Driving While Intoxicated Act. It has been  introduced by Mr. Mann, my colleague from Kansas; my colleague from New  Hampshire, Mr. Pappas, who is in my party; my colleague from New  Jersey, Mr. Smith, who is in the Republican Party; and by myself.\n\nWe are the lead cosponsors. What it says is if a State is going…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today to honor the career of David  Caron as he retires after over eight years of service as Town  Administrator of Derry. Throughout his tenure, Dave…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of Patricia Ann  Miller's outstanding service as a Surviving Spouse Liaison at the  Military Officers Association of America. Pat…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of APRN Janette  Gibb of the Manchester VA Medical Center. Her commitment to going the  extra mile and providing the highest standard…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688916/recognizing-janette-gibb-for-her-service-at-the-manchester-va-medical-center"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…rural communities.\n\nThis bill prioritizes SBA's efforts to close out this GAO  recommendation and focus on our Nation's rural communities.\n\nI commend Dr. Morrison, Mr. Downing, Mr. Pappas, and Mr. Bean for  their work on this bill.\n\nMs. VELAZQUEZ.  Morrison).\n\nMs. VELAZQUEZ. Mr. Speaker, I urge Members to support this bill, and  I yield back the balance…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687927/rural-small-business-resilience-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of William  ``Bill'' Cass, Commissioner of the New Hampshire Department of  Transportation (NHDOT), and his retirement after 40…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…chairman and his staff to advance this important  legislation to the House floor. It is an honor to stand with him today.  I also extend my gratitude and thanks to my colleague, Mr. Pappas, for  co-leading this bipartisan legislation with me for the last two  Congresses.\n\nMr. Speaker, today, I rise in strong support of H.R. 695, the Medal  of Honor Act.\n\nThe…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688215/medal-of-honor-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…warm personality. Under his leadership, the restaurant gained  significant acclaim, being ranked in the top 10 percent of restaurants  worldwide by Tripadvisor in 2024.\n\nMr. Pappas was more than just a restaurant owner. He was a loving  father and a grandfather, a mentor and a role model, and an exemplary  civil servant. His legacy will live on through…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692245/congratulating-greg-parker-retailer-executive-of-the-year"}]