[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, Congress, Democrats and Republicans alike,  came together to pass the American Relief Act of 2025, securing $12  billion to rebuild communities devastated by disaster. We made…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688590/maui-minute-on-huds-office-of-community-planning-and-development"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…personally lobby the President like the massive tech companies who  got exemptions did. President Trump's so-called tariff policy is  literally killing our small businesses.\n\nMr. Speaker, Congress has the power to stop it. Article I of the  Constitution says Congress has the power to levy tariffs, but what is  the Republican majority doing?\n\nThey are ceding all…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and humanitarian programs, lifesaving tools that fight disease, prevent  terrorism, supports democracy, and open markets for American  businesses.\n\nHere is the kicker, Mr. Speaker: Congress approved this funding just  2 months ago, and Donald Trump signed it into law. Now, Republicans  want to rip it back to cover up the massive hole they are blowing in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…like China and punch back as  the White House Press Secretary says that we are doing? I guess we  don't have any clarity on that question.\n\nHere is the worst part, Mr. Speaker. The Congress could stop this  madness and provide the certainty that is needed by voting on these  tariffs, but it seems like Republicans are fighting tooth and nail not  to stop…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the highest percentage of amputations because of the late  detection of diabetes. There is a reason for that. There is a reason.  We all know what that reason is.\n\nMr. Speaker, as a Congress and as a country, we must do the things  that are necessary to remove these disparities. With people living  within the shadow of two medical schools and some of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…access, not less. We need more voices,  not fewer. We need to make voting easier, not harder; more joyful, not  more burdensome; and more sacred, not more cynical.\n\nMr. Speaker, this Congress must not wait another day. We must pass  the John R. Lewis Voting Rights Advancement Act to restore what the  Supreme Court gutted when it ripped out preclearance.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Congress, the sole power to declare war.\n\nIt goes on to say: ``Congress has not yet declared war upon Venezuela  or any person or organization within Venezuela. . . .''\n\nMr. Speaker, Congress not having declared war, a President who has  declared that he visited with corporate America before taking kinetic  activity in Venezuela, where do we stand?\n\nWell,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Mr. Speaker, I commend Representatives Stauber and Cisneros for their  work to bring this important bipartisan legislation to the floor today.\n\nMr. Speaker, Congress and the executive branch have carefully crafted  fair and deliberate policies to ensure that small businesses can  compete for Federal contracts.\n\nThese policies, including…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Congress and the rule of law, this is what they do.\n\nMr. Speaker, do you know who makes the laws that govern the DHS  facilities? Do you know who makes the laws, Mr. Speaker? It is  Congress.\n\nMr. Speaker, do you know who doesn't get to just change the rules  when they decide? It is DHS.\n\nMr. Speaker, do you know what is not a valid consideration for…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I thank the gentleman from  Massachusetts for yielding time.\n\nMr. Speaker, Congress must not give ICE or CBP another dollar while  they are killing Americans in our streets. We must protect our  communities by demanding real change first. This is what…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699595/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…provisions make clear that the United States  values our partnerships and will invest in multilateral cooperation  that advances our interests and our American values.\n\nMr. Speaker, Congress has extended privileges and immunities before  to the European Union, to the African Union, and, of course, to the  United Nations and the Organization of American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…asleep, and I am sure we don't want  anyone to not be woke when they are fighting for our freedom, when they  are fighting for our justice.\n\nAs we move forward, Mr. Speaker, in this Congress, I ask that we  remember the things that we shared and that we move forward with an  open mind and a mind of the words that we so frequently say: ``Freedom  and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…name on your voter application or your  vote would be thrown out. S. 218 prohibits individuals from assisting  elderly people in registering to vote.\n\nI say to you, Mr. Speaker, Congress should advance legislation like  the John R. Lewis Voting Rights Advancement Act and the Freedom to Vote  Act to increase equal access across the voting ballot.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…relief process. That is why I am calling on the President to  slash the red tape that is holding back critical assistance that was  appropriated last year for our State.\n\nMr. Speaker, Congress also has a critical role to play. We need to  replenish the disaster relief fund and immediately pass Governor  Stein's request for additional Helene recovery funding.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695772/recognizing-the-one-year-anniversary-of-hurricane-helene"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…and I encourage my colleagues to join me in  supporting this legislation.\n\nMr. COMER. Mr. Speaker, I have no further speakers, and I reserve the  balance of my time.\n\nMr. Speaker, Congress has a constitutional duty to ensure the  District of Columbia is safe and secure. I urge my colleagues to  support this critical police reform bill that has the strong…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696934/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…conversation if we could, sir, with my colleague across the aisle about  what is happening here.\n\nCongress and America, we need to clarify for the citizens watching,  Mr. Speaker, Congress has a unique authority, and therefore,  responsibility for our Nation's Capital as opposed to other  municipalities across the country. Why not Phoenix, New Orleans,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I thank my colleague for yielding.\n\nMr. Speaker, Congress is charged with upholding the solemn  constitutional mandate of providing for the common defense of the  Nation. We must guarantee that the men and women of the Armed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695112/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Act will  lead to the development of a new generation of services, tools, and  systems. I am excited for that future to happen here in the United  States of America.\n\nMr. Speaker, Congress has a historic opportunity here today to act.  With the CLARITY Act, we can pass legislation that protects consumers  and ensures that the United States remains at…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…Jason Smith in getting this bill to the floor.\n\nMr. Speaker, I rise today to speak in favor of President Trump's One  Big Beautiful Bill Act.\n\nHere are the facts, Mr. Speaker: If Congress fails to pass this bill,  taxpayers across the Nation will get a big tax increase. In Tennessee's  Eighth Congressional District, the average household would face…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693167/one-big-beautiful-bill-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…back are Herbies.\n\nWho do you play for? Who do you play for? Team USA. That name on the  front of the jersey meant more than the name on the back--USA.\n\nDare I say, Mr. Speaker, we in Congress have to do that same thing.  Who do we play for? Who do we play for? The United States of America.\n\nI thank my friend and colleague from upstate New York, Representative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, Congress is leaving and won't be back  until next week. If it is like every other weekend, a lot of what you  see on television is going to be incidents going on in Minnesota…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699736/america-cannot-have-unlimited-immigration"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…spend playing basketball with  the Nez Perce Tribe of Indians in Lapwai, close to my family home. On  several occasions, I was able to join and observe powwows.\n\nMr. Speaker, if anyone in Congress or watching at home has not had  the opportunity to attend a powwow, it truly is one of the best  celebrations of our shared culture and history. It is something…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, when Congress is in session, there are  always interesting articles in the paper that I think demand a little  bit more attention.\n\nOver the weekend, or late last week,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…example of the golden age of America  developing right in front of our eyes.                       Supporting Fentanyl Legislation\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, already this Congress, the  House of Representatives passed the HALT Fentanyl Act, legislation to  crack down on the criminals who create, traffic, and sell the deadly  fentanyl that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}]