[{"senator": "Al Green", "party": "Democrat", "sentence": "…speech that the Constitution affords me, and I am not always  in the company of people who can protect me. So my cane has become my  staff and my rod that comforts me, Mr. Speaker.\n\nI wish it were different, but it is not. We seem to live in a society  now where if you are willing to speak truth to power there are  consequences beyond simply having those…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Speaker, there is another article that I would call to your  attention in The Washington Times. It is styled: Growing leftwing  violence blamed for deadly shooting.\n\nMr. Speaker, I wish to address violence. I wish to address violence,  and I wish to start by indicating that, yesterday, I published a tweet.  This tweet, Mr. Speaker, indicated, in essence,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…United Black Clergy of Westchester County. He has done  all of this with his wife, Aro Denise Edwers, as his life partner, and  all of this was done in a mere 65 years.\n\nMr. Speaker, I wish a happy birthday to Bishop Edwers from the floor  of the House of Representatives.                        Recognizing Shoreline Publishing\n\nMr. LATIMER. Mr. Speaker,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…State line, let us also reject any attempt to crown  a new monarch, whether with a golden crown or a gilded office, because  in this country no one is above the law.\n\nMr. Speaker, I wish a happy Separation Day to Delaware.                       Recognizing Gabriella Bourantas\n\nMs. McBRIDE. Mr. Speaker, I rise to recognize two extraordinary young  leaders…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I wish to thank Congressman Casten for his  great leadership and also Congressman   Mike Levin for drawing us  together here today.\n\nMr. Speaker, I rise today, as I do every…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700228/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Mr. LICCARDO. Mr. Speaker, I rise today in opposition to H.J. Res.  87, H.J. Res. 88, and H.J. Res. 89.\n\nMr. Speaker, I wish I was here to speak about different policies,  policies that the American people actually want to see to help them pay  their bills and to lower the cost of living that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. Speaker, I wish Chairman Westerman a happy birthday, but even  that goodwill does not change the fact that this is bad legislation.  So, unfortunately, I am going to have to rise in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Sri Sri Ravi Shankar. For more  than 45 years, Gurudev has dedicated his life to promoting peace,  advancing human values, and serving communities around the world.\n\nMr. Speaker, I wish to extend my deepest gratitude to Gurudev Sri Sri  Ravi Shankar for his work in promoting meditation, and I encourage my  colleagues to join in a moment of silence in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698204/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I wish to recognize the 10th anniversary of  Educators Rising, a nationwide movement dedicated to eliminating the  teacher shortage in America by recruiting, preparing,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…speech.\n\nThe gentleman from Washington (Mr. Baumgartner) says that the  President is supposed to be the President of the entire United States,  not just Republicans.\n\nMr. Speaker, I wish we had seen that last night, but we didn't. In  all of my years, I have never ever witnessed anything as partisan and  as divisive as that.\n\nDelBene).\n\nMr. Speaker,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…community emigrated from Asian countries in  pursuit of the American Dream, like my family. Their stories and  success are a testament to the founding ideals of our country.\n\nMr. Speaker, I wish a happy AANHPI Month to everyone.\n\nMr. Speaker, I also rise today to recognize the month of May as  National Cancer Research Month.\n\nEvery day, 5,000 Americans will…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and  education is a life that is left unprotected. Terminating these  critical programs and offices just puts millions of lives battling  substance abuse in jeopardy.\n\nMr. Speaker, I wish my colleagues would spend time on these issues of  protecting public health and coming up with solutions instead of  retreading a bill that prioritizes this criminal…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…healthcare.\n\nThat is what this bill represents. That is why I am taking the time  to share these stories, experiences, concerns, fears, and anxieties of  the American people.\n\nMr. Speaker, I wish we had a lot more time to debate this bill. This  is the type of bill that under normal circumstances we would have hours  and hours of debate. Hundreds of Members could…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…medical professional on staff. Mr. Speaker, 95 percent do not  provide prenatal care, and only 1 out of 607 provides contraception,  and the facilities are unregulated.\n\nMr. Speaker, I wish the previous speaker could have met this  Massachusetts woman who sought care at a crisis pregnancy center after  a Google advertisement led her to believe it was a…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, I wish we were here on the House floor this morning  debating solutions that would reduce grocery bills, lower housing  costs, end Trump's tariffs that are strangling American…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…celebrates 100 years on  this planet, and I recognize a life that has given this Nation  countless reasons to smile. It is a privilege to share his story with  this Chamber.\n\nMr. Speaker, I wish Dr. Mitchell a happy birthday.", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…friend, and he is so missed by many of us, including  me. We love his family, and we are grateful to him.                        Birthday Wishes To Trey Tenney\n\nMs. TENNEY. Mr. Speaker, I wish a happy birthday to my son, Trey,  today, and congratulate him for being a major in the Marine Corps.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…you can tune into our hearing next Tuesday at 10:15 a.m. eastern  time.\n\nCelebrating the 100th Anniversary of the Rotary Club of Grass Valley\n\nMr. KILEY of California. Mr. Speaker, I wish to mark and to celebrate  the centennial anniversary of the Rotary Club of Grass Valley based in  California's Third Congressional District.\n\nThe Rotary Club of Grass…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…as it is  infectious. I saw this personally in the Raleigh men's class of Bible  Study Fellowship where for nearly 40 years Richard met with dozens of  men each week.\n\nMr. Speaker, I wish Richard a happy birthday.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…their families.\n\nIn Congress, I remain committed to supporting legislation that  strengthens our national defense and honors the men and women who wear  the uniform.\n\nMr. Speaker, I wish a happy 250th birthday to the United States Army.  May their legacy of service continue for generations to come.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…call her weekly and some even daily to keep in  touch. She is a social animal who loves being with people and is a  wonderful friend, aunt, and, most of all, mother.\n\nMr. Speaker, I wish Eileen a very happy 100th birthday.                       Honoring the Life of Bob Sekerak\n\nMr. MILLER of Ohio. Mr. Speaker, I rise today to honor the life of  Bob Sekerak,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…The reason President Trump is having to reestablish it and it is  coming soon is because it got unestablished. That is what we are trying  to prevent in the future.\n\nMr. Speaker, I wish the gentleman from Kentucky (Mr. McGarvey), my  friend and colleague, were still here because I would thank the  gentleman for the kind words. He is a good friend with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I wish to congratulate JB  Harris, JT Chevallier, and the entire team at ECO-CLEAN Solutions for  reaching a record-breaking milestone late last year: 1 million square  feet…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…to wear the uniform.\n\nHappy birthday to the United States Army.\n\nArmy Strong, always.                  Celebrating Richard Miller on His Birthday\n\nMrs. MILLER-MEEKS. Mr. Speaker, I wish a happy birthday to a very  special person, the eldest of eight children, my brother, Richard  Miller.\n\nRichard Miller served in the Army, served in the coal mines in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…supporting our veterinary diagnostic lab and the world-renowned  Ames Laboratory. She will continue to be remembered as a phenomenal  leader for our Iowa State University.\n\nMr. Speaker, I wish President Wintersteen and her husband, Robert,  all the best in this next chapter of life.                Congratulating High School Seniors Across Iowa\n\nMr. FEENSTRA.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…premiums skyrocketing.\n\nTalking about how much the premiums are skyrocketing, do you know  why? What is the underlying law? The underlying law is the Affordable  Care Act.\n\nMr. Speaker, I wish I could answer the question. I wish I would get  an answer to the question of why did they set them to expire and why is  the Affordable Care Act not working.\n\nMr. Speaker,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, I wish a good morning to northwest Florida  and rise to offer a special congratulations to the Northwest Florida  State College women's basketball team.\n\nOn April 1,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…I appreciate everything he has done for my team and the House  Republican Conference. I know his experience and expertise will be a  major asset in his next chapter.\n\nMr. Speaker, I wish Michael Comer well, and I congratulate him.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691928/good-bye-michael-comer"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker. I wish to include in the Record the  following letters of exchange between the House Committee on Energy and  Commerce and the House Committee on Foreign Affairs with…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693668/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…congratulating Mr. ``Mac'' MacNeil and Ms. Cathie Adams on the  groundbreaking of their new home.                      Congratulating ECO-CLEAN Solutions\n\nMr. KILEY of California. Mr. Speaker, I wish to congratulate JB  Harris and JT Chevallier, and the entire team at ECO-CLEAN Solutions  for reaching a record-breaking milestone, 1 million square feet of Lake  Tahoe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]