[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Williams and his team for their  collaboration on this bill.\n\nMr. Speaker, I encourage my colleagues to vote ``yes'', and I reserve  the balance of my time.\n\nMr. CISNEROS. Mr. Speaker, I would like to close by once again  thanking Mr. Meuser and Ms. Scholten for their leadership on this bill  and their efforts to extend additional capital to rural and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697258/investing-in-all-of-america-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…ultimately pass a  bipartisan, bicameral comprehensive reauthorization.\n\nMr. Speaker, I urge my colleagues to vote ``yes,'' and I reserve the  balance of my time.\n\nMr. Speaker, I would like to close by reminding everyone that this is  a bipartisan program that has never seen a lapse in its over 40-year  history. The House is taking the responsible step…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ranking member of the Energy Subcommittee.\n\nMr. PALLONE.  Schrier).\n\nMr. PALLONE.  Matsui), the ranking member of our Communications and  Technology Subcommittee.\n\nMr. Speaker, I would like to talk about the seven hazardous air  pollutants that Republicans are apparently fine with pumping into the  air we breathe.\n\nFirst is mercury. Mercury is quickly…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, I would like to remind us what this Nation  used to do to its children.\n\nBefore 1975, this country locked up 200,000 disabled children in  institutions. We shut the schoolhouse…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698108/dismantling-department-of-education-is-not-reform"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…speakers at the moment. I  continue to reserve the balance of my time.\n\nMs. CRAIG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I, too, would like to thank the gentleman from  Pennsylvania, Chairman G.T. Thompson, and his team for working on this  consumer protection legislation in a bipartisan manner.\n\nI…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…students who had severe learning disabilities but who were able to  thrive with the appropriate accommodations and the resources and  support in the classroom.\n\nMr. Speaker, I would also like to note that in my State of  Connecticut, in 2025, we received approximately $160 million from the  Federal Government in order to facilitate services for students…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…alive and preventing crises  before they happen that is what this money does. That is what  Republicans are cutting.\n\nThis isn't just penny wise and pound foolish, Mr. Speaker. It is like  saving money by burning down your house so you don't have to pay for  the heat.\n\nI would like to think that America's greatness comes from our  humanity. It is clear…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the ranking member of the Education  and Workforce Committee, Mr.  Bobby Scott, for yielding time.\n\nMr. Speaker, like so many women across the country, I struggled for  so many years to get pregnant. My husband and I tried everything that  we could do to start a family of our own. Being…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…This is about  persons' lives. This is about how we manufacture and produce in the  United States of America.\n\nI don't like reading that factories are being closed, Mr. Speaker. I  don't like reading another headline written by Patricia Cohen on April  3 that says that the trade war that we are in risks forfeiting  America's economic primacy.\n\nNow, this…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…weapon for settling political scores, well, it may  not be in your State, it may not be in your district, but that could  happen and will happen to any of us.\n\nMr. Speaker, this may seem like a little water infrastructure bill,  but this is a bigger moment than that. This is a bit of a Spartacus  moment for the Members of this body because any of us…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Mr. COSTA. Mr. Speaker, first, I would like to say thank you to Steny  Hoyer for an incredible career and for being a role model and my  friend. He is always a class act.\n\nI also rise today to speak…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, like Hitler, Mussolini, and  Saddam Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically ended free…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…is not immigrants doing that. That is  Republicans doing that.\n\nRepublicans have the audacity to tell us that they are doing all  these cuts because we are broke. Well, Mr. Speaker, like I said to  Chairman Green in the Homeland Security Committee, we wouldn't be broke  if the ultrawealthy would pay their fair share.\n\nFair taxing could fund a budget that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…businesses, schools, local governments, and citizens to honor children,  inspire hope, and advocate for continued progress in both cancer and  blood disorder care.\n\nMr. Speaker, I would like to urge the chamber to join me in  congratulating OSF Children's Hospital of Illinois Cancer and Blood  Disorders Institute on their new name, while applauding their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I would like to include in the Record the  following statement mourning the tragic shooting at Annunciation  Catholic Church in Minneapolis, Minnesota.\n\nSAINT PAUL, Minn.--Congresswoman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694811/mourning-the-tragic-shooting-at-annunciation-catholic-church-in-minneapolis-minnesota"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Fund.\n\nMr. Speaker, I rise in support of H.R. 452, a bill that awards three  Congressional Gold Medals to the members of the 1980 U.S. Olympic Men's  Ice Hockey Team.\n\nMr. Speaker, I would like to start by thanking Congressman Stauber  and the numerous original sponsors for getting this important bill to  the floor today.\n\n``Great moments are born from great…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I like being in the top five. I rise to  recognize Wyoming's outstanding small businesses during this Small  Business Week.\n\nLike Wyoming's diverse topography, from pastures…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…that math.\n\nThis trend will be compounded if there are not statutory reforms. It  is absolutely dishonest to try to blame LNG for this. America can't run  without energy, Mr. Speaker. Like it or not, a lot of that energy comes  from natural gas.\n\nListen to this. When we stopped building pipelines between 2013 and  2021, over 25 million homes were put at…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in Congress to protect the tax  dollars of hardworking California residents.                  Recognizing Robin Trimble on Her Retirement\n\nMr. KILEY of California. Mr. Speaker, I would like to recognize Robin  Trimble, who is retiring as the chief executive officer of the Rocklin  Area Chamber of Commerce, for her 20 years of dedicated service to the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…advisers with him, Eleanor and Mary  Clay.\n\nMr. HILL of Arkansas.  He is a former Congressman returning to the House  Financial Services Committee.\n\nMr. HILL of Arkansas. Mr. Speaker, I would like to inquire of my good  friend from California if she has any other speakers.\n\nMr. Speaker, I thank my friends on this side of the aisle who have  worked hard today,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…scholarships.\n\nAt its core, Rotary is about service above self. It is about bringing  people together, regardless of background, to make the world a better  place.\n\nMr. Speaker, I would like to thank the Wellsboro Rotary Club for its  contributions to the community and congratulate these volunteers on 100  years of making a difference.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687905/recognizing-wellsboro-rotary-clubs-centennial-anniversary"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Stanton), are extremely honored to once again be able to sponsor this  resolution.\n\nMr. Speaker, I urge support of this resolution, and I reserve the  balance of my time.\n\nMr. Speaker, like my friend, the gentleman from Arizona (Mr.  Stanton), implied, these are heartbreaking, heart-wrenching stories  about real people. Oftentimes, in our country, people…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Mr. Speaker, I would like to recognize and welcome to  Washington, His All-Holiness Bartholomew Archbishop of Constantinople- New Rome and Ecumenical Patriarch, the spiritual leader…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, like many Americans, I caught a little of  the TV over the weekend, which was dominated by the tragic events in  Minneapolis.\n\nHowever, there is one thing I felt had…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…during Biden's  LNG export ban, Russia overtook the U.S. as the lead supplier of gas to  Europe. In no world was this good for the American consumers or our  allies.\n\nMr. Speaker, I would like to say that Republicans and Democrats have  similar goals, but that is just not true. We had 4 years to study this.  We had 4 years of evidence on this. Democrats…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I would like to take this  opportunity to congratulate and recognize the Rotary Club of Lincoln on  their centennial anniversary.\n\nThe Rotary Club of Lincoln began meeting one…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…entire economy  this year. Try to keep that number in your head because we are going to  come back to that in some charts and explain why that is so  devastating.\n\nMr. Speaker, it is like we don't care about people's retirement, our  kids, the next generation, and how the hell they will actually cover  any of the scale of debt. Then we lie about what…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…GROTHMAN. Mr. Speaker, first of all, due to when I was pushed  back to start this, my speech will go a little less than 10 minutes, if  anybody is planning around it.\n\nMr. Speaker, I would like to talk a little bit about the big bill  that we just passed and some provisions that should be monitored as we  work our way not only through the big reconciliation…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I would like to one more time congratulate  President Trump on a great speech last night. He is a great orator. I  think of the six speeches I have heard him give in this…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700208/president-trumps-great-speech"}]