[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…my colleagues: Let's get back to work on  behalf of the American people and defeat this disgusting and hateful  amendment.\n\nMs. STANSBURY.  Bonamici).\n\nMs. STANSBURY. Mr. Speaker, I remind us that we are here to talk  about the National Defense Authorization Act and to stand with our  servicemembers who proudly signed up to serve this great Nation. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695234/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…Medicaid,  Medicare, and the ACA are all about to be gutted in the name of a tax  cut for the wealthiest amongst us.\n\nMr. NEAL.  Sanchez).\n\nMr. NEAL.  Sewell).\n\nMr. NEAL. Mr. Speaker, I remind the gentlewoman that in 2017, the  Republican Party borrowed $2.3 trillion for that tax cut.\n\nMoore).\n\nMr. NEAL.  DeLauro).\n\nMr. NEAL.  Chu).\n\nMr. NEAL. Mr. Speaker,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Congress must assert its authority over the power of the purse.\n\nMr. Speaker, I encourage my colleagues to vote ``no,'' and I reserve  the balance of my time.\n\nMs. DeLAURO. Mr. Speaker, I remind the majority leader that for a 60- year-old couple earning $82,800 per year, their premiums will rise by  over $17,000. This is a 255 percent increase.\n\nMs. DeLAURO.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…The SAVE Act would cost voters in Mrs. Miller's district $53.8  million should they avail themselves of a passport to prove the  requirements of the SAVE Act.\n\nRoss).\n\nMr. Speaker, I remind the gentleman that, in the United States of  America, you have to be a U.S. citizen to vote in a Federal election.  If you are not, you are subject to penalties for…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…see the lengths to which some people  will go to destroy the ideas and institutions that for decades have  made this country great.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I would just remind my  colleagues that Donald Trump was elected President of the United  States. While we are yet to put many of his policies into law, where  the Democrats left…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…legislating upon essentially local District matters,'' yet  the House today is denying D.C. residents local self-government and  spending its time on local D.C. matters.\n\nMr. Speaker, I remind my Republican colleagues what Republican  President Richard Nixon said when he signed the Home Rule Act: ``One of  the major goals of this administration is to place…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…special government employee, and this  was to avoid having any kind of Senate confirmation or congressional  creation of the agency or any confirmation of Elon Musk.\n\nMr. Speaker, I will remind you that the entire time that Elon Musk  was in office or as a Federal employee, he was, in fact, exercising  powers that were far greater than any special government…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…allow folks to answer the phones for our constituents.\n\nCalifornia has the second highest number of Federal workers.\n\nWhy are the Republicans going to cut that?\n\nMr. Speaker, might I remind you that we have the Olympics coming, we  have the FIFA World Cup coming, we have the All-Star Game, and Super  Bowl coming, and we are still producing movies and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…economically striving and struggling among us.\n\nRepresentative Garcia is a dedicated public servant, and his record  of accomplishment is worthy of celebration.\n\nMr. MORELLE. Mr. Speaker, I once again remind the Members that any  one of the citizens of this district could have filed petitions. In  fact, Mr. Garcia has faced primaries before and general elections…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696785/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Speaker, I will now move on and yield to the gentlewoman from  Oregon (Ms. Hoyle).\n\nMr. TAKANO. Mr. Speaker, I thank the gentlewoman for standing up for  the rule of law.\n\nMr. Speaker, I remind my colleagues that, in this country, under our  Constitution, no one is above the law, not even the President. Our  President, at this very moment, is defying a 9-0…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I remind many of my constituents in the 12th  Congressional District that I hear you and I understand the pain and  the fear that you all are going through as you continue to…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688625/michigan-has-million-people-on-medicaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…are talking about here. That is not an accurate  assessment of what is going on here.\n\nThis is the most closed Congress in history. Republicans should be  ashamed.\n\nMr. Speaker, I remind my Republican friends, who kind of just go  along to get along, that Mr. Arrington, who is a chairman, had 71  percent of his amendments blocked.\n\nI will go right down…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…support funding  for a Department that has shown repeated disregard for the  Constitution, the rule of law, and the safety of the people it is  supposed to protect.\n\nMr. Speaker, I remind the American people and this body: Every Member  of Congress has sworn an oath to uphold the Constitution. That means  all aspects of it--the Fourth Amendment, the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699309/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…from foreign indoctrination. I urge my colleagues to  support this legislation and defend the role of families in  safeguarding our children's education.\n\nMr. WALBERG. Mr. Speaker, I would remind my friend and colleague from  Virginia that the U.S. Department of Education has been in place while  our concerns with foreign influence have been developed…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…such time as I may consume. During  consideration of this resolution, all time yielded is for the purpose  of debate only.                                General Leave\n\nMr. Speaker, I remind my Democratic colleague that the rule we are  debating today provides for consideration of H.J. Res. 42 regarding a  Department of Energy appliance rule, H.J. Res.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Mr. Speaker, I will remind my colleagues across the  aisle that not a single Republican has ever voted for ObamaCare. This  is your plan. You put it into law. It was a disaster then.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…being my fellow  Navy SEALs, who were lost in the Red Sea. Their loss underscores the  serious consequences of the decisions made by the previous  administration.\n\nMr. Speaker, I would remind everyone that the enemy does not care if  you are a National Guardsman or -woman. They don't care if you are a  selected reservist or Active Duty. They are simply…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689695/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the juvenile crime rates in Washington, D.C., so we are  taking action to try to make our Capital City a safer place. That is  why I strongly support this bill.\n\nMr. COMER. Mr. Speaker, I remind the gentlewoman that we believe on  this side of the aisle that lowering the crime rate is a big issue. It  is a priority for the American people.\n\nThe gentlewoman…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…talking about the six lines of  the resolution that says to remove forces from Venezuela. They are not  talking about it because there are no forces in Venezuela.\n\nMr. MAST. Mr. Speaker, I remind my colleague that President Trump has  yet to start any war in either administration. His fight every day is  protect the American homeland, protect the people…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…are clouding the issue and come  together to pass this bill and continue to work together in 2026 to  deliver more affordable healthcare to all Americans.\n\nMr. GUTHRIE. Mr. Speaker, I will remind my friends that the premium  tax credits from the ACA are extended. They are permanent. These are  the enhanced premium tax credits. It is good, and sad, that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…be considered expeditiously in the Senate and  sent to President Trump's desk under the reconciliation process, which  is what this engrossment resolution does.\n\nMr. Speaker, I will also remind the ranking member and my Democrat  colleagues that when they were last in the majority, they also utilized  an engrossment resolution to strike extraneous provisions…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…minutes to the gentleman from  Texas (Mr. Pfluger), the sponsor of the bill.\n\nMr. COMER.  Malliotakis).\n\nMr. COMER. Mr. Speaker, may I inquire how much time remains.\n\nMr. Speaker, I remind my colleague on the other side of the aisle,  the U.S. Congress has a constitutional role to oversee Washington,  D.C., law and intervene as necessary.\n\nD.C.'s noncitizen…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692313/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…a big ceremony  yesterday with much hoopla about a supposed milestone for high-speed  rail, which is to say the completion of a single railhead in Kern  County.\n\nMr. Speaker, I will remind the Governor that this is the year 2026.  The high-speed rail project was supposed to be completed, having a  full-fledged, high-speed rail system from Los Angeles…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Congressman  Schweikert, Congressman Stanton, and all the others who have been  supportive of this--for their leadership on this issue over the last  two Congresses.\n\nMr. Speaker, I remind Members that the bill itself has a ton of  support, to include the Fraternal Order of Police, Major County  Sheriffs, the National Organization of Black Law Enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…and that is what the  Democrats are best at.\n\nHouse Republicans are going to fight back to restore that personal  choice, all while ensuring fiscal responsibility.\n\nMr. Speaker, I remind my colleague on the other side of the aisle  that House Republicans did pass a funding mechanism out of the House of  Representatives to the Senate, and because of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…powerful adversaries.\n\nAbortion violence must be replaced with compassion and empathy for  women and respect for the weakest and most vulnerable.\n\nMr. SMITH of Missouri. Mr. Speaker, I remind this body that the  reason why these COVID-era tax credits expired is because the Democrats  focused all their resources on helping their wealthy environmentalists…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]