[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. SCOTT of Virginia. Mr. Speaker, I join my colleagues in honoring  Black History Month and uplifting the connection between the Black and  Asian community.\n\nAs a Member of Congress who is part of both the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687997/black-history-month-and-the-alliance-between-the-black-and-asian-community"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…hair and nail appointments.  After many incredible years, Dina Boccippio's contagious positivity and  kindness is truly deserving of this body's recognition.\n\nMr. Speaker, once again, please join me in wishing Dina Boccippio  another year of good health and happiness she celebrates the milestone  of her 100th Birthday.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694728/recognizing-recardina-dina-boccippios-100th-birthday"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…tariffs,  then they will own this, too. They will own the higher prices. They  will own the jobs lost. They will own the retirement savings erased.  They will own all of it.\n\nMr. Speaker, join us, sign on, and stop this tax of American people.  This is what should be happening for us to continue to be the greatest  Nation on the planet and make sure that things…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I join my colleagues in condemning what can  only be seen as sheer desertion--yes, I used the word ``desertion''--of  Ukraine  by this President, and I deeply regret,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…thriving  for years to come. As she embarks on this new phase, Dorothy is joined  by her beloved two sons, husband, Alex Giamboi, two shih tzus, and  grandchildren.\n\nMr. Speaker, please join me on congratulating Dorothy Giamboi on her  fourteen years of service with the Borough of Metuchen. It is my  privilege to recognize her remarkable contributions…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…importantly, these future generations of Americans will look to  us, the Congress, to see what we did to try to stop it.\n\nWe cannot stop it alone. We need Republicans like you, Mr. Speaker,  to join us. Think of our future. Think of how history will remember  this government you are a part of: executions of Americans on our  streets, demanding  papers from Americans…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…northwest Indiana as they return home from service.\n\nIt is because of the sacrifices of veterans just like Oscar that we  are able to live in a free, democratic country.\n\nMr. Speaker, please join me in celebrating Black History Month and a  century of national Black history commemorations by recognizing the  selfless service, bravery, and patriotism of retired…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699475/recognizing-black-history-month"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…cause of peace.'' In a time of global Turbulence, his visit marks a  moment of deep significance for Orthodox Christians in New Jersey and  across the United States.\n\nMr. Speaker, I join my colleagues in welcoming His All-Holiness  Ecumenical Patriarch Bartholomew to the United States.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…4,000-plus spouses; and 10,000- plus children who haven't seen an increase in more than 50 years. It is  long overdue for Congress to take action.\n\nI plead with you, Mr. Speaker, to join us and to encourage Republican  leadership minimally to have a hearing on this. If you have a better  plan, Mr. Speaker, by all means, put it forward. At least let the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I join the global community in celebrating  the remarkable achievements of His All-Holiness Ecumenical Patriarch  Bartholomew, which now include the 2025 Templeton Prize.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695408/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…them to foster their strengths. As a woman who was one in a million,  she continued to prove to the people who surrounded her, that they were  also just as special.\n\nMr. Speaker, please join me in honoring the life of Alice Kitchen.  Her passing is devastating, but the legacy she leaves behind reminds us  that no matter how short life tends to be, we can…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…scientist at a  research and engineering company. Together, Emily and Branden have  built a strong, loving partnership that reflects their shared values  and passions.\n\nMr. Speaker, please join me in leading this body in recognition of  Emily McLaughlin Wisniewski and Branden Anton Ehrenreich as they embark  on their marriage together. It is with great pleasure…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690468/recognizing-the-marriage-of-emily-mclaughlin-wisniewski-and-branden-anton-ehrenreich"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…can learn from mistakes of the previous. That is why it is important to  recognize educators like Ed Donnellan and encourage others to follow in  his footsteps.\n\nMr. Speaker, please join me in honoring Ed Donnellan and wish him  continued success in educating students on America's past.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691693/recognizing-edward-l-donnellan-jr-as-the-winner-of-the-2025-mary-k-bonstell-teacher-of-the-year-award"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Indiana Plan, which is a pre-apprenticeship program which  provides students with the skills and knowledge needed to thrive in the  construction and building trades.\n\nMr. Speaker, please join me in celebrating Black History Month and  recognizing the invaluable contributions of Arvella Greenlaw, Joree  Richards, and countless others who selflessly fight…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687951/black-history-month"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Mr. Speaker, I join my colleague and chair, Mr. Babin, and rise in  support of the Commercial Remote Sensing Amendment Act of 2025, H.R.  1325. We are very pleased to see this legislation…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…council until October of 2013. He was appointed Mayor of Piedmont on  October 4, 2013, after Mayor Rick Freeman resigned. He was reelected as  mayor in 2016 and 2020.\n\nMr. Speaker, please join me in recognizing my friend, Mayor Bill  Baker, and thanking him for his service to the City of Piedmont.  Congratulations.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693645/recognizing-the-retirement-of-mayor-bill-baker"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…support of this commonsense bill. I urge all of my colleagues to  support H.R.\n\nMr. BOST. Mr. Speaker, I have no further speakers, and I am prepared  to close.\n\nMr. BOST. Mr. Speaker, I join with the ranking member and ask all of  my colleagues to support this bill, and I yield back the balance of my  time.\n\nMr. BOST. Mr. Speaker, on that I demand the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…buildings--simply could not be provided. The Oxford  Public Works team works every day to rebuild, improve and safeguard our  transportation systems, structures and facilities.\n\nMr. Speaker, please join me in recognizing National Public Works Week  and thanking the City of Oxford's hardworking Public Works  professionals, engineers, managers and employees for their…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691680/recognizing-the-national-public-works-week-may-and-the-city-of-oxfords-public-works-department"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…for Renew our Rivers and Rainbow  City Clean Up Day, as well as traveling, boating, cattle farming, and  spending as much time as possible with friends and family.\n\nMr. Speaker, please join me in recognizing Councilwoman Anita  Bedwell, and thanking her for her service to Rainbow City, Alabama.  Congratulations to Anita.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696590/recognizing-the-retirement-of-city-councilwoman-anita-bedwell"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…since I took office in  2003. She is an outstanding employee and has a heart for the people of  Alabama's Third Congressional District. She will be greatly missed.\n\nMr. Speaker, please join me in recognizing Beverly for her retirement  and thanking her for her dedication and service to our great State of  Alabama. I congratulate Beverly.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688459/recognizing-the-retirement-of-beverly-denise-buckhannan-graben"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Alumni--Southern Union State Community College. He is married to his  wife, Laura, and has two children. The Fullers are active members of  First Methodist of Opelika.\n\nMr. Speaker, please join me in recognizing my friend, Mayor Fuller,  and thanking him for his service to the City of Opelika.  Congratulations to Mayor Fuller.", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…1971) and Army Reserve (1971 to 2000). He is supported by his loving  wife, BBB4 Wilbert D. Payne, Jr., and has been blessed with 4 children  and 12 grandchildren.\n\nMr. Speaker, please join me in recognizing Mr. Payne on this  milestone and wishing him a very happy birthday.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…will tell Dale that we are praying for him. We are going to make  sure he gets through this and that he gets the best healthcare possible  through the VA system.\n\nMr. Speaker, please join me in thanking Mr. Dale Karst, a true  American hero, for his courage, his sacrifice, and his enduring love  for the United States of America. I want Dale to know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…continue to leave a lasting  impact on all of us after he leaves. His incredible tenure of service  has strengthened my team and this institution for the better.\n\nMr. Speaker, please join me in thanking Mr. Mark Roman for his  dedication and years of public service to this institution.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…buildings--simply could not be provided. The Anniston  Public Works team works every day to rebuild, improve and safeguard our  transportation systems, structures and facilities.\n\nMr. Speaker, please join me in recognizing National Public Works Week  and thanking the City of Anniston's hardworking Public Works  professionals, engineers, managers and employees for their…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691676/recognizing-the-national-public-works-week-may-2025-and-the-city-of-annistons-public-works-department"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…also keep in mind his loved ones,  including his wife, Judy; his daughter, Heather; and his sister, Betty.  We offer them our condolences and our heartfelt prayers.\n\nMr. Speaker, please join me, and all members of Pennsylvania's 13th  Congressional District, in remembering the incredible life and legacy  of Lieutenant Lloyd Peck.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…While our community grieves this tragic loss, I am reminded of John  15:13, ``Greater love has no one than this, that someone lay down his  life for his friends.''\n\nMr. Speaker, please join me in praying for Deputy Sikes' wife, Amber,  their daughter, Lyndsey, and all of Brandon's loved ones as they  continue to mourn this fallen hero.\n\nPlease also join…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690553/mourning-the-loss-of-deputy-brandon-sikes-and-praying-for-swift-recovery-for-deputy-gavin-white"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…lasting legacy.\n\nHer induction into the Veterans Hall of Fame recognizes her impact on  the Sunshine State and our country. We are proud of her and her  service.\n\nMr. Speaker, please join me in congratulating my friend Lieutenant  Governor Jennifer Carroll on being inducted in the Florida Veterans  Hall of Fame.\n\nShe is indeed one of the best of the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…would be lucky to have.\n\nChris, a talented storyteller and comedian, made connections wherever  he went, creating valuable memories for his friends and loved ones.\n\nMr. Speaker, please join me in prayers for his family and all  privileged enough to know him and to love him.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691812/mourning-the-loss-of-chris-lane-gay"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…U.S. House of Representatives, we wish her continued  success and look forward to her enduring leadership in the continuous  struggle for a world where all are free.\n\nMr. Speaker, please join me in recognizing Annie Wilcox Boyajian's  extraordinary service and the enduring legacy of Freedom House--a  legacy that continues to inspire hope and action in the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}]