[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Los Angeles to exist, as it has done since its  founding, as a multicultural, vibrant, and working-class city. The  violence was in less than three to five blocks.\n\nMr. Speaker, I think the resolution is an attempt to rewrite history  in real time and to prescribe extreme violence onto the people of Los  Angeles, California, who were exercising their…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692811/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Mr. Speaker, I think we have figured out the rhythm, the prime  directive here for Republican governance these days.\n\nFirst, they slashed the services that working families actually  depend…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. Speaker, I think I have heard that story before that this is all  about drugs. If I recall correctly, the former President of Honduras  probably put more drugs in the United States than…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. Speaker, I think we all agree that the United States' main  competitor is China and the Chinese Communist Party who are intent on  tilting the global playing field to their benefit,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688747/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…way that at this  point with the permits that have already been approved that the  Europeans or any of our allies have to worry about not getting enough  LNG from us.\n\nMr. Speaker, I think it makes sense to ask the Department of Energy  to keep an eye on this to ensure that all these exports are actually a  good thing and are in our public interest: For…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…push crypto legislation.\n\nPresident Trump just yesterday posted to pass the GENIUS Act ASAP.  There is no need to debate it, read it, or amend it. Just pass it.\n\nMr. Speaker, you might think that Republicans might be cautious about  taking financial policy directions from someone who has a side hustle  selling baseball hats and Bibles and who has filed…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…whenever final deals were made with their  Members. Yet, Republicans are deliberately choosing to meet at 1  o'clock in the morning on something this consequential.\n\nMr. Speaker, I think the gentleman thinks it is a good idea. The  gentleman says that I will use my time and try to take every moment I  can to make my points. I can say to the gentleman:…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…emblematic of the  issue, is that of Dr. Ardem Patapoutian. He is a world-renowned  researcher who won the Nobel Prize for his work on researching the  sense of touch.\n\nMr. Speaker, I think we can all agree that is the kind of talent we  strive to encourage in this country.\n\nWhen his research funding was delayed by the Trump administration,  Dr. Patapoutian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…decide which residents are fit to govern on local  D.C. matters. I promise the gentleman that if he spoke with his own  constituents, they don't give a damn.\n\nNorton).\n\nMr. Speaker, I think it is interesting because the gentlewoman who  just spoke said this is about preserving ``our elections.''\n\nThis is not about our elections. It is not about my election.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…mention that. Republicans have really lost the plot, and I think  Americans are taking notice.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, I think it is important to clarify some of the numbers  that we are hearing from the Republicans. The chairman keeps mentioning  a 94-year payback period for one of the products…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…worries about what will happen to her nephew after she  is gone. This is just one of many examples of who will be harmed by  unreliable and onerous work requirements.\n\nMr. Speaker, I think it is absolutely morally wrong that millionaires  and billionaires will be given $4 billion plus $4 trillion.\n\nWhat is being done for families like this?\n\nCruelty is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691458/medicaid-and-snap"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…from Medicaid, SNAP, Meals on Wheels, Head Start, and the other  programs that actually serve Americans who don't live like Elon Musk  and Donald Trump. However, Mr. Speaker, you would think they would have  the time at least to write a bill that would not permit these kinds of  things to happen.\n\nThese are unacceptable risks of dangerous weapons being…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…irresponsible. Mr. Speaker, it is immoral, and it is a damned disgrace.\n\nMr. McGOVERN. Will the gentlewoman yield?\n\nMr. McGOVERN. Mr. Speaker, I don't like Elon Musk.\n\nMr. Speaker, I think the idea that quoting somebody means that you  like them is kind of absurd. I quote Trump a lot, and I could assure  the Speaker that he is not anywhere on my top two-millionth…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…passed the Committee on Ways and Means with  overwhelming bipartisan support. I urge my colleagues on both sides of  the aisle to support this commonsense legislation.\n\nMr. Speaker, I think this is a commonsense bill, and I am so happy  that our colleagues thought it appropriate to bring it forward to help  older Americans make better-informed decisions.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…people in the region  will have clean drinking water. The Department of Homeland Security  canceled that grant, saying it had nothing to do with natural  disasters.\n\nMr. Speaker, I think we all want to be sure that a water  infrastructure system will provide clean drinking water when there is a  hurricane, a tropical storm, or another natural disaster.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…cause significant  curtailment in production at certain facilities of tires made in the  United States. It is our job as Members of Congress to prevent this  travesty.\n\nMr. Speaker, I think that the arguments that we have made have now  worn out. We have used up the mileage on these arguments. Now, we get  to vote ``yes,'' and voting ``yes'' is where the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…commend them to those who have an interest in seeing that  moment in history and perhaps feeling just a little piece of what those  who saw it in person understood.\n\nMr. Speaker, I think it is true--I know it was a few years ago--that  there are still fewer Jewish people alive today than there were at the  start of the Holocaust, that the roughly 6 million…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…be 37 percent when we pass this bill.\n\nThat is not a tax cut. Get it straight. They are on the same level.  They are in a situation where they are paying high taxes. Mr. Speaker,  think about 37 percent. Thirty-seven percent of every hour and 37  percent of every dollar you earn goes to the government in that regard.\n\nThere is no tax cut for the rich.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Medicaid benefits to people who are in our country  illegally. These are funds that could have gone toward improving access  to care for the most vulnerable Californians.\n\nMr. Speaker, I think this is absolutely unacceptable. For all of the  Members who have been giving impassioned speeches about the importance  of protecting Medicaid, joining our efforts…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "French Hill", "party": "Republican", "sentence": "…is a man who lived under  socialism. He lived through the Communist regimes of Stalin and Eastern  Europe and of Nazi Germany. He talked about the road to serfdom. Mr.  Speaker, we think of some of these policies potentially as the scenic  route to socialism.\n\nHe is someone who  understands market capitalism and a constitutional Republic like no  other…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Mr. Speaker, I think it is important to set the scene in  contrast to some of the revisionist history that Democrats seem to be  talking about today.\n\nThe definition of a showerhead…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…winners on and off the field and in every  sense of the word.\n\nAgain, God bless America, and go west Texas.\n\nMr. Speaker, may I inquire as to the time remaining.\n\nMr. ARRINGTON. Mr. Speaker, I think I can say a few things in 2  minutes, believe it or not, about some of the comments my colleague,  Representative Baumgartner, said about the One Big Beautiful…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bleed money that should have been going to people  who needed the help.\n\nLook, if we don't get an alignment of policy, the cost, and how these  things can actually work, Mr. Speaker, I think we are going to continue  to live in this world where our debates mean nothing here. They are  just based on feelings, exploitation of our voters, telling them things…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "Mr. MILLS. Mr. Speaker, I have a motion at the desk.\n\nMr. MILLS. Mr. Speaker, I think that it is very clear that the actual  committee of jurisdiction is, in fact, the Ethics Committee, and  cooperating with them is my top priority.\n\nI believe that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696987/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I think it is important to hear from  legislators on the experiences they had before this week as they toured  their district and as they talked to normal people to see…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…single one of us.  You are right. I will concede that all of us need a reminder that we  all need to raise our level of accountability due to the actions that  we take.\n\nMr. Speaker, I think this is a necessary but difficult step. This  resolution is offered in all seriousness. It is something that I  believe that we must do in order to get us to the next…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…subsidies for  state media and grants to corrupt NGOs for outrageous foreign  propaganda.\n\nMr. Speaker, $9 billion comes to about $70 for an average American  family.\n\nMr. Speaker, do you think they prefer to spend that $70 on a new pair  of shoes for their child or for ``girl-centric climate change  programs'' in Brazil?\n\nThat is the choice.\n\nCongress squanders…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693724/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Arizona, and we have had no suppression. We are the only  State that does it because the Supreme Court ruled that way. Somehow,  we can't do it for Federal ballots?\n\nMr. Speaker, think about that. For an alderman or legislator in  Arizona, we have to show proof of citizenship to register to vote. We  can't do it for the President, though. How absurd…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…will allow for the deployment of undersea  cables while providing appropriate protection of our marine resources.  I urge my colleagues to support the legislation.\n\nMr. Speaker, I think it is important that we understand exactly what  is going on here. If you look at this map, this is an example along the  California coast. These pink areas are national…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I think it is important that all  conservative opinion makers be aware of one of the controversies that  is going on here right now.\n\nThe United States is over $37 trillion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694922/passing-bills-with-51-votes-in-senate"}]