[{"senator": "Al Green", "party": "Democrat", "sentence": "…law is in this country. You, and you alone, will  decide whether a person should be locked up or released, unlike what  the Constitution requires. I know who you are.\n\nMr. Speaker, I know who you are. I understand that there is an  attempt to roll back the clock. People of color are becoming suspect in  this country. You can be African American; you can…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…individual has a disability.\n\nThe legislation also acknowledges the importance of support networks  and services in helping with postoperative care.\n\nOrgan transplants, Mr. Speaker, as you know, save lives, and it is  important that the system is free from discrimination.\n\nI am pleased that we are taking this step to clarify and build upon  existing civil…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692716/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…a public  health issue. Frankly, it is about dignity. These parents aren't asking  for luxury. They are asking for a clean, flat surface and some basic  respect.\n\nMr. Speaker, we all know diaper changes are not optional, which is  why safe baby-changing stations shouldn't be optional, either.\n\nThe Baby Changing on Board Act is about building a country…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…energy on that side.\n\nI yield 1 minute to the gentleman from New York (Mr. Morelle), the  distinguished ranking member of the Committee on House Administration.\n\nMr. McGOVERN. Mr. Speaker, I know a Senator from North Carolina who  disagrees with everything the gentleman just said, including a lot of  hospitals in North Carolina that disagree with what…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, we all know the public deserves full  transparency when it comes to holding police accountable for  misconduct. Instead, States and cities all across our country have  started…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, how do we know if this President is working  for us? He is working for us if we make over $4 million and are about  to pocket a new tax cut of $300,000.\n\nHe is working for us if…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696771/working-people-pay-the-price"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…opposing these bills,  reject H.R. 6359 and H.R. 6945, and instead stand up for those who are  making that personal decision themselves.\n\nMr. AUSTIN SCOTT of Georgia.\n\nMr. Speaker, I know a lot of people who work in these centers. They  are honest, dedicated, hardworking people who care about the pregnant  mothers and the unborn children. I think that…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…antipoverty program for the elderly. Since its inception in 1935, it  has never missed a payment.\n\nIt is, for capitalism and entrepreneurialism, our safety net. Yet,  Mr. Speaker, as you know, Congress has not acted on enhancing Social  Security in more than 50 years. Richard Nixon was the President of the  United States the last time Congress, whose responsibility…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. GARCIA of California. Mr. Speaker, I thank the Congressman for  yielding. I appreciate the gentleman having this opportunity for us to  speak.\n\nMr. Speaker, we all know that the Hatch Act is here to keep partisan  politics out of our government. It has been in place to over 80 years,  and I rise today to make sure that our government…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…rent, zero about prescription drugs, and  zero about caring for our veterans--he didn't even mention them--and  zero about the wildfires devastating South Carolina.\n\nMr. Speaker, do you know what Donald Trump did mention 13 times? Joe  Biden. That is because he is obsessed with the past, and he is obsessed  with himself.\n\nRepublicans jump into action after…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…repeals commonsense criminal justice reforms that were passed by D.C.'s  elected representatives in the wake of George Floyd and the Black Lives  Matter movement.\n\nMr. Speaker, we know that cities and communities all over the country  passed similar reforms to increase trust, accountability, and safety.  In D.C., these measures increased accountability…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Mr. Speaker, is that unbelievable? Maybe it is.\n\nActually, it is believable because given Noem's disregard for  Congress and the rule of law, this is what they do.\n\nMr. Speaker, do you know who makes the laws that govern the DHS  facilities? Do you know who makes the laws, Mr. Speaker? It is  Congress.\n\nMr. Speaker, do you know who doesn't get to just…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Justice to serve their  own interests, then they shatter that trust.\n\nFamilies looking for answers, for protection, and for justice cannot  afford to wait. Trust me, Mr. Speaker, I know. I have been one of those  families. I know the stakes of receiving justice for a loved one, and  they are just far too high.\n\nI thank my colleagues for standing up.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Trump has now proposed a tax cut for Social Security that  is unpaid for. That is over a $900 billion hit to Social Security and  all the constituents who receive it.\n\nMr. Speaker, I know you to be a man of goodwill and you understand  your district and what your people need, as well. It is long overdue  for the citizens of the United States to have their…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…showing up at school after graduation, on and on, every time it  happens, my son and my daughter look at me, and they ask: Am I next?\n\nDo you know how difficult that is, Mr. Speaker? Do you know how hard  it is, Mr. Speaker, when your children who know someone who has died  from gun violence have to spend their days in school in active shooter  drills rather…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…simple. They can  hate the President, or they don't have to, but don't let these people  facing substance addiction and our communities suffer for their talking  points.\n\nMr. Speaker, I know that my colleagues on the other side have been  using the same anti-Trump, anti-Republican talking points for months  and months, and I understand that they don't like…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…law enforcement to support them in any number of  ways that we can as policymakers. One of the easiest ways, in my mind,  is this bill. Data is incredibly important, Mr. Speaker. You know this  firsthand. Data is incredibly important. Understanding these attacks on  our law enforcement, how it is affected by the officer, how these  things occur, where…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…afraid to sit down and talk to anyone. He has the  American people behind him. He has the American economy behind him.\n\nLook at what he is doing with China right now, Mr. Speaker. We all  know that China is the threat that we are concerned about the most. We  also know that others around the world don't want to do business with  China because of the way…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…opportunity for the care that we need for  childcare as well as dependent care.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I know I spent my opening remarks discussing how the  Empowering Employer Child and Elder Care Solutions Act helps empower  working families. In closing, I would like to highlight…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Con. Res. 33.\n\nThis measure will ensure that the plaque honoring the brave police  officers who defended us on January 6 is hung in the Capitol as  required by law.\n\nMr. Speaker, you know it is Police Week, but Republicans for some  reason refuse to put up the plaque honoring the heroic efforts by U.S.  Capitol Police and other local and Federal law…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…company at  Florida State.\n\nWhy do I tell this story? Law enforcement at Florida State did  everything right. They rushed to the scene. They subdued the shooter.  Mr. Speaker, do you know how long it took them to do that? It took them  4 minutes, the amount of time that I will speak here today. In those 4  minutes, with law enforcement doing everything,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…American family to  live and afford the basic necessities of life, including vehicles and  the right to be able to choose the vehicle of their choice in an open  market.\n\nMr. Speaker, I know my colleagues are going to say that we are  infringing on California. Let's remember that California gets treated  specially and uniquely and that that then has a domino…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…what the price can be. It is Federal price-fixing.\n\nWhat the opposition has argued today is that these fees are hidden.  They are not. Consumers opt into this product, Mr. Speaker. They know  what the fee is because it is disclosed to them. It is required by  Federal law today to disclose it under regulation DD.\n\nThis is about access for overdraft protection.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I thank Chair Foxx for yielding to  me.\n\nMr. Speaker, we all know what Neil Armstrong said when he first  walked on the Moon. As founder of the DOGE Caucus, I am proud to say  that, with this rescissions package, the first of its…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693715/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the year 2030 will be 100 million less than  forecast. There will be zero riders still by the year 2030. We are  told, no, no, substantial progress has been made.\n\nMr. Speaker, how do we know there will be no riders by the year 2030?  The rail authority has said so itself. It has continued to scale back  its initial leg of the system but has continued…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Democracy,  Human Rights, and Labor, testified as well at that hearing: ``The size  and scope of the organ harvesting and organ trafficking `market' is  staggering.''\n\nMr. Speaker, we also know that there are hospitals dedicated just to  dealing with and helping to assist Chinese Communist Party leaders. One  of them is the Army Hospital 301 in Beijing.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…has shown  outstanding dedication, creativity, and a genuine commitment to serving  others, qualities that earned her the rank of Eagle Scout. The  accomplishment, Mr. Speaker, as you know, is impressive for any Scout,  but for Miley's achievement, it also marks an historic moment for our  community--expanding what is possible for young women in northeast…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698832/congratulating-miley-meredith"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, many of my colleagues on the other side of  the aisle have repeated the phrase ``budgets are about priorities'' a  lot lately.\n\nMr. Speaker, do you know what really signals someone's priorities? It  is their actions.\n\nJust last week, we witnessed a group of elected officials storm an  ICE facility, demanding sympathy…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691318/elected-officials-storm-ice-facility"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…wants to put together  a college fund for her kid. Maybe she wants to take her family on a  vacation. She is going to have that opportunity when this bill passes.\n\nMr. Speaker, do you know who else we are going to give opportunity to  in this bill? Sorry, it is not a billionaire again. It is that shift  worker working overtime. The other tax cut is going…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…the Interior to convey 3,400 acres  of BLM land to La Paz County, Arizona, for rural economic and solar  development.\n\nIf you have ever visited southwest Arizona, Mr. Speaker, you will  know it is pretty darn sunny. Conveying the land to the county for  solar maximizes the potential for renewable energy generation and  unlocks employment opportunities…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}]