[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…communities, on Tribal communities, and our education  system.\n\nWe will continue to fight back because we cannot stand with a country  that is attacking our students.\n\nMr. Speaker, I say to our President: Hands off our schools, hands off  our students, and hands off our communities.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689604/hands-off-our-education"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…the job that sanitation workers would be doing in the District of  Columbia.\n\nWe are talking about $770 billion for Medicare. I talk to young  people in my district, Mr. Speaker. They say: ``I am not on Medicare.''  I say: ``That is right. Maybe you are not, but your grandmother is,  your elderly aunt is, and the doctor you see is able to see you because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…through a free and fair election.\n\nThey have shown strength, unity, and a dedication to the rule of law  in a way that the rest of the world could do well to emulate.\n\nMr. Speaker, I say to the citizens of South Korea, the people of the  free world salute you.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691847/south-korea-election"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…aisle had principled opposition just a few hours ago and  now seem prepared to fold on the floor of the House of Representatives?\n\nDon't you have some responsibility, Mr. Speaker, to say to the  American people what happened, what deals were cut, what occurred in  the back room?\n\nIt will all come out one way or the other, Mr. Speaker.\n\nIt is incredible…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I will say to my friend from Kentucky  that it has been a long time since you have been to the Bay Area, so I  will take you up on your offer.\n\nOne of the reasons I wanted…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…bill that  includes billions of dollars for ICE, an already bloated agency that  has been upending due process and racially profiling people in my  district for weeks.\n\nMr. Speaker, I say to my colleagues across the aisle, have you no  decency? Have you no humanity? It is not too late to do what you know  is right by your constituents and by your country.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693180/one-big-beautiful-bill-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…they are Pine-Richland, Fox Chapel, and Shady Side  Academy.\n\nIn boys' cross-country, they are Quaker Valley.\n\nIn girls' cross-country, they are Shady Side Academy.\n\nMr. Speaker, I say it a lot: We make champions in western  Pennsylvania.\n\nI congratulate all the winners. They make us proud at home.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699040/congratulating-wpial-champions"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the ranking member of the Committee  on Education and Workforce for yielding time.\n\nMr. Speaker, I have to say, today, we are here considering a bill  that is named the PROTECT Our Kids Act. I am going to speak and shift  this conversation a little bit in the direction I think…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…protection for critical salmon  habitat and other interests, and they endorsed the RMP after extensive  consultation. They oppose this resolution, among many others.\n\nMr. Speaker, I do say that it is important to recognize what this  resolution, which I think the chairman, if I am not misquoting him,  called a hammer, will do.\n\nMy view is very simple.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…lectured on governance by a  guy who is just coming off an 8-week paid vacation. Give me a break.\n\nSherrill), the next Governor of New Jersey.\n\nMr. McGOVERN.\n\nMr. McGOVERN. Mr. Speaker, let me just say that the gentleman from  New York sounds as extreme as his voting record. Mr. Speaker, I say to  the gentleman who just spoke, by supporting this bill, he…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…McGOVERN. Mr. Speaker, during consideration of this resolution,  all time yielded is for the purposes of debate only.                                General Leave\n\nMr. Speaker, all I can say is, it is about damn time. I mean, we have  had to wait months while the Republican leadership of this House  dragged their feet, all so we could take up a simple…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I often say that while my name may be on the  ballot, we are all going to Congress together. Families in Ohio's 13th  Congressional District and all across the country are telling…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the full suite of reproductive care options.\n\nMr. McGOVERN. Mr. Speaker, to discuss our proposal, I yield 3 minutes  to the gentlewoman from California (Ms. Chu).\n\nMr. Speaker, I would say to the gentleman who just spoke that some of  us had different experiences. In my district, a woman almost died from  one of  these crisis pregnancy centers because…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…bill that fails to decisively address the  Republican healthcare crisis and fails to extend the Affordable Care  Act tax credits for tens of millions of Americans.\n\nMr. Speaker, before I say anything further, let me thank our men and  women in uniform, our Active-Duty troops, our hardworking Federal  employees, our civil servants, our TSA agents, our…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this is what we are doing this week.  It is shameful. It is outrageous, and it is wrong. I urge every Member  of this body to vote ``no'' on this Republican rule.\n\nMr. Speaker, let me just say that as the son of businessowners, I  don't think the gentleman knows what he is talking about.\n\nThis is outrageous. I have the bills that we are considering here…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…associated with mass murder in Ukraine or Cuba or Venezuela  or imprisonment but the capture of the spirit that ends individual  freedom and ends individual opportunity.\n\nMr. Speaker, I will say that I have been shocked at some of the  debate today that we hear from a daughter of  Korea, two daughters from Cuba, who have seen firsthand the dangers,  the fear,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Leader Scalise, and  Representative Emmer, as well as all the members of the House Natural  Resources Committee for working with me on this proposal.\n\nAs I conclude, Mr. Speaker, I have to say that for four decades this  has been an important place in my life. It reminds me of John Muir's  famous poem:       Climb the mountains and get their good tidings.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas.  Hoyle).\n\nMr. WEBER of Texas. Mr. Speaker, I want to say that tonight I rise to  speak as we continue to examine what is unfolding before us. It is  important to remember that the fight for the Iranian people is not some…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…sisters; and his many friends, nieces, nephews, and  neighbors who knew him, Carrol was the kind of man whose legacy is  etched not in headlines but in the lives he lifted.\n\nMr. Speaker, we say goodbye to a veteran, a man of character, a  family man, and my friend. It hurts because that is the impact that  Carrol made on so many.\n\nMay his memory continue to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…what the Democrats are doing. The American people know what this is.  They know Democrats have nothing else to run on because of the success  of this administration.\n\nMr. Speaker, I say let's vote ``yes'' on this resolution, and then  let's get focused on making sure we are doing what the American  families elected us to do.\n\nMr. VAN DREW. Mr. Speaker,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the space industry continues to grow and evolve, Utah is at the  heart of it all, leading through ingenuity, collaboration, and  unwavering dedication to the future.\n\nMr. Speaker, I say to my good friend from Florida that his Space  Coast district might be where the rockets are launched, but they  wouldn't get off the ground without Utah's ingenuity.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…a message from the Senate on a  Republican bill that does something. Now, they may not like it, but I  find it fascinating. These debates are always so interesting, Mr.  Speaker.\n\nThey say we haven't put forward anything at some points, and at other  points in their debate, they claim that this bill is terrible, that it  does nothing.\n\nLet me remind…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…light  bills and the expenses of this growing, massive Federal Government,  paid more of a share of taxes than they did less. The code got more  progressive.\n\nMr. ARRINGTON. Mr. Speaker, I say to Mr. Panetta that if we do  current policy and don't offset the impact of the deficit, that would  be a dangerous precedent.\n\nMr. ARRINGTON. Mr. Speaker, I…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…technology that has been there for some  time and has been proven to be a de-escalator in these very tense  situations that law enforcement officers find themselves in.\n\nMr. Speaker, I will say Wisconsin, my State, defines deadly force in  its use-of-force policy as: The intentional use of a firearm or other  instrument that creates a high probability of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, they say all the world is a stage,  but in Jacksonville, Florida, the best seat in the house comes with  dinner and a standing ovation.\n\nMr. Speaker, it is with great excitement…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…(Mr.  Balderson), another good friend. I am yielding to all of my good  friends, but I yield to a very valued member of the Committee on Energy  and Commerce.\n\nMr. GUTHRIE. Mr. Speaker, I will say that we want the world price  produced by what we have here in our country. The price does fluctuate  on a stop price day-to-day. However, just because we are…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the 117th Congress. We are debating, in  fact, procedure today. I think we would all welcome an explanation of  that horrific abolishment of committee procedure.\n\nMr. Speaker, I would first say that screaming doesn't make up for  substance.\n\nIn closing, the rule I presented today, H. Res. 1032, enables the  House of Representatives to carry out its responsibilities…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…financial institutions across the country.\n\nThe Biden administration's CFPB issued this rule right before they  left town, and they sold it as a defense of consumers. Mr. Speaker, you  can say something a million times, and it still won't make it true.\n\nInstead of helping consumers, government price controls will simply  lead to more denied transactions…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689847/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…illegal again in  California, then all of these other supposedly pro-public safety bills  will automatically be repealed as a consequence.\n\nWhat was the point of this?\n\nMr. Speaker, you might say that it was to punish the voters, maybe,  but the real point was fraud. What the Governor hoped to do was to get  these measures passed.\n\nRemember how he was committing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]