[{"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, I want to clarify something for some of my  colleagues and for leaders across this country because there seems to  be some confusion. There is a big difference between taking…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689224/repealing-green-subsidies"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I want to start by saying welcome back to  my friends across the aisle. It is really nice to have them back here  in the people's House, especially after last week.\n\nTheir…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689704/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…pollute our air and water for nothing except some  additional cash for Republicans' friends in the coal industry. It is  really a rotten deal for the average American.\n\nMr. Speaker, I also want to say in opposition to this bill that  Republicans claim that the National Coal Council is so important that  it demands floor time in the House of Representatives,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…It is the  Department of Defense. It is not the Department of War. The law is very  clear on that point. We passed a law that called it the Department of  Defense.\n\nMr. Speaker, if you want to call it the Department of War, I think  that is a god-awful idea for a whole bunch of different reasons, but  okay; come back to Congress, and let's do it. They…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…that keep us guessing  as to what the Trump administration is going to do from one moment to  the next. I am going to talk about this plane from Qatar toward the  end.\n\nMr. Speaker, I want to speak today about my deep concern about the  appropriations and budget processes as established by the Constitution  because they are broken. I rise out of deep concern…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Ms. ANSARI. Mr. Speaker, I want you to imagine for a moment that a  person is going to the grocery store, grabbing coffee, or picking their  child up from school.\n\nInstead of running errands or waiting…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…too high  at this moment in time. Elon Musk is, I believe, really inflating the  price of popcorn right now. This is something that is going to affect  my household.\n\nMr. Speaker, I want to continue back to Elon Musk. Whatever side is  taken in this debate, we cannot forget that Elon Musk, again,  repeatedly violated the law. He made illegal spending…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''\n\nMr. Speaker, I want to lock in for just a moment on that aspirational  objective, the pursuit of happiness. When it comes to everyday  Americans, this one big, ugly bill will hurt the quality…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I want to start by clarifying something  that was said on the Record. The sponsor of the resolution is stating  that Chuy Garcia has won his primaries with 100 percent of the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, first, I want to thank the gentleman  from Virginia for giving me this opportunity to speak, but also for his  leadership. This is such an important discussion for Americans,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of California. Mr. Speaker, I want to start today with  some good news. I think it is fantastic that the Golden State Warriors  played an incredible basketball game last night and brought them to  victory…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "Mr. MEEKS. Mr. Speaker, I want to first thank Chairman Rogers and  Ranking Member Smith for the manner in which they worked together in a  bipartisan way. It is an example of what has taken place…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…learn in their job  serving the people in Congress. It is corrupt. We ought to end it.\n\nMr. Speaker, I thank the gentleman from Texas (Mr.  Casar) for his comments.\n\nMr. Speaker, if you want to respect hard work, you have to respect  the people who do that hard work. That is at the core of this, and  respecting the labor movement is so central.\n\nI am from…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…Deadlines Act. I urge my colleagues to  support this bill that would help our government be better in helping  those constituents in times of need all across this country.\n\nMr. Speaker, I want to say briefly in closing that, as you have  heard, this legislation has tremendous bipartisan support and will  remove burdensome processes at the IRS to make government…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…up in some people's mail.  That is because the Affordable Care Act subsidies are about to expire.  Oh, that was part of President Trump's One Big Beautiful Bill Act.\n\nMr. Speaker, I want to ensure that the funding Congress passes is  actually delivered to the people in our communities, and I don't want  it to be illegally cut or withheld by the Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas.  Hoyle).\n\nMr. WEBER of Texas. Mr. Speaker, I want to say that tonight I rise to  speak as we continue to examine what is unfolding before us. It is  important to remember that the fight for the Iranian people is not…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…want, bipartisan work. Here it is.\n\nI look forward to this bipartisan piece of legislation that  strengthens our national security moving forward this afternoon.\n\nMr. STAUBER. Mr. Speaker, I want to paraphrase in my own mind what  was said moments ago across the aisle, real simple: anywhere but  America, any worker but the American worker. I am paraphrasing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…some of their best supporters are waving  a Mexican flag in an American city right now, and they support those  efforts. Most Americans don't support those efforts, Mr. Speaker. They  want to spend $3 million for ``Iraqi Sesame Street.'' The minority  leader held up a ``Sesame Street'' character here on the floor as if  ``Sesame Street'' is somehow going…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank the gentleman from South Carolina. I  thank him for bringing forward this important resolution before the  body.\n\nMr. Speaker, I do want to say that I appreciate the gentleman from  Maryland, his commentary about the vote on removal, and his considered  judgment with respect to Santos. I agreed with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I want to thank the  distinguished chairman of the Agriculture Committee Subcommittee on  Forestry for his great work, for his leadership, and for his tireless  work on this…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…recognition our  correctional officers deserve. I thank Jon and Haley for their courage,  compassion, and relentless advocacy bringing attention to this very  important issue.\n\nMr. Speaker, I want to wish a very happy birthday to my nephew,  Andrew Martino.\n\nHappy birthday, Andrew.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "Ms. TENNEY. Mr. Speaker, I want to first address a comment by the  ranking member, Mr. Morelle. We both hail from New York. He is a dear  friend, but I just want to point out something.\n\nNew York City…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…supports President Trump's regulatory rightsizing  agenda and gives our job creators the relief they desperately need to  start, to grow, and to succeed once again.\n\nMr. Speaker, do you want to make things more affordable in America?  Do you want to cut down on overregulation? This is the bill to do it.  Let's all stand with America and our small businesses…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…we need to  focus.\n\nWe do need to work together, as he said, to make sure we can do  permit reform and produce the energy this country needs for AI and  other things.\n\nMr. Speaker, I want to say that this does not replace any need for  permits, so the idea that there would be no environmental review or any  review for a  cross-border project approved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…colleagues to join me in voting ``yes'' to end  the insanity and actually put Americans first. Let's rescind wasteful  spending. It is really simple.\n\nMrs. McCLAIN. Mr. Speaker, I just want to clarify: We are having a  debate on the rescissions package, correct, Mr. Speaker?\n\nMrs. McCLAIN. Mr. Speaker, I will just remind you, that is fear- mongering at…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a choice to shut the government down in order to set up a fight  and to try to elevate the issue of healthcare because they believe they  can win on it politically.\n\nMr. Speaker, I want everyone to think about that for a minute. They  shut down the government because they want to politicize the issue of  healthcare and not actually work to solve the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dependent  on China, less dependent on Middle Eastern oil, and all those things  that over the years have been eroded away from our American economy and  from Americans.\n\nMr. Speaker, if they want to complain about renaming the Gulf the  Gulf of America, they can complain about  that all day. It gives them something to do other than to talk to  Americans about…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…in this body wants  to see people go hungry, and I am personally offended by these lies.\n\nWe want families to be able to put food on their tables. The  difference is, Mr. Speaker, we want these programs to actually serve  the most vulnerable communities for generations to come: the single mom  taking care of kids too young to be in school, the disabled,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…support and has been endorsed by Arkansas  Governor Sarah Sanders; the Arkansas Department of Parks, Heritage and  Tourism; and the Arkansas Game and Fish Commission.\n\nMr. Speaker, I want to recognize Representative Hill for his efforts  on this legislation, and I urge my colleagues to support this bill. I  reserve the balance of my time.\n\nMr. WESTERMAN.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…system that will make sure that these things are used appropriately,  honestly, and openly. We continue to work together on that matter.  Again, I am very proud of her.\n\nMr. Speaker, I want to join every other speaker today, which is  unusual in a very partisan-polarized era, to urge the passage of this  bill. We have worked together. We have worked in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]