[{"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…don't have the  resources they need.\n\nNow this administration is pulling people off the front lines of  wildfires to conduct immigration enforcement? Give me a break.\n\nMr. Speaker, 5 years ago, the Labor Day fires killed nine people and  destroyed thousands of homes in Oregon. Central Oregon is currently  fighting the Flat fire. Thanks to the hard work…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694775/fighting-fire-with-fire"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, 9 years ago today, 49 lives were stolen and  ripped away from us at Pulse nightclub in my district, in my home of  Orlando, Florida, a safe haven for Orlando's LGBTQ+…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "Mr. SOTO. Mr. Speaker, 9 years ago today, on June 12, 2016, at 2:02  a.m., our little happy town of Orlando, Florida, was changed forever as  we saw 49 angels killed and 53 others who were injured…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…financing commitments to  the Government of Burma. This pause was initiated after a military coup  overthrew the democratically elected Government of Burma in 2021.\n\nMr. Speaker, 4 years ago, the democratically elected leaders in  Burma's ruling party, the National League for Democracy, were  overthrown by the Tatmadaw, Burma's military. Since the military…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697197/no-new-burma-funds-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Notably, many of the people who helped make atomic weapons turned out  to be some of the most powerful voices against their use and for the  reduction in their arsenals.\n\nMr. Speaker, 2 years ago this week, the film ``Oppenheimer''  premiered. It told the story of J. Robert Oppenheimer, the theoretical  physicist who helped create the atomic bomb but then…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, almost 7 years ago, I came to Congress to  serve my community, my State, my fellow veterans, and the country that  I deeply love in a different way than I served it on the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…moment and say: Wait a minute. We are the  Congress of the United States. This bill, while it does many things,  does not assert congressional authority as it should.\n\nMr. Speaker, for years, the House Armed Services Committee has worked  to craft a bipartisan bill that ensures strong congressional oversight  of the Department of Defense and guarantees…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, for 3 years, Ukraine has fought for its  survival  against Russia's brutal assault. For 3 years, America has supported the  Ukrainian people in their brave fight for freedom.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688655/america-still-supports-ukraine"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…reclaimed it when the  American people called him to serve as their first President.\n\nIt is a symbol of the peaceful transition of power upon which our  democracy depends.\n\nMr. Speaker, 5 years ago today, that painting towered over the swarm  of insurrectionists Donald Trump sent to this Capitol. That is why he  was deemed to be, as the whip said, the most…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, 3 years ago this week, the Supreme Court  stripped from millions of women the right to make their own healthcare  decisions. Since overturning Roe v. Wade, women across…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692893/third-anniversary-of-dobbs-decision"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…law and succeeded. In 2024, President Joe Biden signed the East  Palestine Tax Relief Act. That is what accountability looks like. That  is what results look like.\n\nMr. Speaker, 3 years later, the most important question remains  unanswered. What has Congress done to prevent this from ever happening  again to East Palestine or any other American city?…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…passed a law  directing the Architect of the Capitol to place a permanent memorial to  honor every one of those officers who had violence perpetrated against  them. Mr. Speaker, 5 years after that tragic day, the plaque is here in  the Capitol but the Speaker has not allowed it to be placed.\n\nMr. Speaker, I rise to urge Speaker Johnson to not allow…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, 3 years ago, the Supreme Court overturned  Roe v. Wade, ripping away a constitutional right that generations of  women had relied on for nearly one-half century.\n\nIn that moment,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, 3 years ago this week, Russia launched an  unprovoked invasion on Ukraine. We are entering the fourth year of war  in Ukraine and 11 years of war on Ukraine since the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…shareholder  proposals in place and have put these requests in place, don't care  about return. That isn't their goal. Their goal is social change.\n\nWhat we have seen, Mr. Speaker, is over the years we have seen time  and time again the cudgel of government and the cudgel of regulators  being used to pound business and investment into what they think is the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…years, halfway  through that year, the Medicare trust fund is empty. In 2033, the first  full year, our best estimate is that there is about $140 billion  shortfall.\n\nMr. Speaker, in 7 years, the Social Security trust fund is empty.  Meaning, in 2033, if you are going to cover Medicare and Social  Security, you are approaching almost $600 billion. How…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…accomplishments are remarkable. At the 2003 Special Olympics  World Games in Dublin, Ireland, he earned a Bronze Medal in the 100- meter dash and a Silver Medal in softball.\n\nMr. Speaker, 4 years later in Shanghai, China, he brought home a Gold  Medal in the long jump, a Bronze Medal in the 400-meter dash, and  placed fourth in the four-by-four relay.\n\nMr. Speaker,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Speaker, today is a good day for innovation. It is a good day for  free markets, entrepreneurs, and consumer choice. It is a good day for  American digital leadership.\n\nMr. Speaker, after years of debate and, frankly, as I was chair of  the Capital Markets Subcommittee in 2017 and 2018 and held hearings on  cryptoassets, Congress has finally recognized the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693829/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Speaker, this is not reinventing the  wheel. This delivery already exists for temporary flight restrictions.  This would just be extending it to the restricted areas.\n\nMr. Speaker, 4 years later now, the DOD and the FAA have still not  acted on this.\n\nMy amendment simply conditions the Marine Corps' issuance of a new  restricted area on compliance with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…exceptional good health make their organs highly  desirable.\n\nThe Chinese Communist Party has declared the Falun Gong practitioners  to be an evil cult fit for butchering.\n\nMr. Speaker, over the years I have chaired several hearings on this  barbaric abuse, and 2 years ago, on March 27, the House passed my bill,  the Stop Forced Organ Harvesting Act of 2023, 413-2.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I thank the chairman for yielding  and for his leadership throughout this process.\n\nMr. Speaker, years of chronic underinvestment in our national  security have shattered American deterrence. It has allowed our  adversaries to threaten and challenge us in new and unprecedented…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…America's Critical Minerals Supply Act, which will strengthen  our domestic critical mineral supply chain so we can be stronger here  at home and across the world.\n\nMr. Speaker, for years, Democrats told the American people not to  believe what they could see with their own eyes. They said that crime  was under control, our infrastructure was secure,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I thank my good friend for yielding me time.\n\nMr. Speaker, for 4 years I have worked tirelessly with my colleague  from Virginia's Ninth District to pass the HALT Fentanyl Act. In 2023,  we saw over 107,000 overdose deaths, 75,000 of…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…service rather than the other interests and agendas that too  often prevail at our capital.                        Calling for Education Reforms\n\nMr. KILEY of California. Mr. Speaker, for years, I have been warning  about the declining education outcomes that exist across our country,  but in particular, in my State of California. We just received a  jarring…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…money over the past decade.\n\nLet's keep in mind that the Biden administration did not utilize  section 117 authorities at all in its 4 years. You heard that  correctly, Mr. Speaker. In 4 years, the Biden administration did not  enforce section 117. Despite the Trump administration's uncovering and  investigating, the Biden administration didn't invoke section…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Speaker, I rise to congratulate Dominique  Claseman and Ahren Jurgensen of Olivia, Minnesota, on raising nearly  $120,000 for a veterans memorial in their hometown.\n\nMr. Speaker, 3 years ago, Dominique raised over $77,000 to construct  a memorial for veterans. Since then, he has enlisted in the U.S. Army  and is currently completing his basic training.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691916/congratulating-nathan-lund-on-receiving-minnesotas-agriculture-in-the-classroom-2025-outstanding-teacher-of-the-year-award"}]