[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…financially as a hedge fund manager doesn't think  the American people care either. To quote him: ``Access to cheap goods  is not the essence of the American Dream.''\n\nClearly, Mr. Trump and Mr. Bessent have never struggled to make ends  meet from paycheck to paycheck and appear to view those who do with  disdain.\n\nWith our Nation's economy in such a precarious…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…sweeping, systematic campaign to  interfere in our 2016 election; that Moscow's goal was to sow chaos, to  undermine faith in American democracy, and specifically to boost Mr.  Trump's candidacy. These findings were not partisan talking points;  they were sober judgments of career professionals, backed by evidence,  and affirmed by both parties in Congress.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…would like to do is give you what I feel are some  of the--a piece of the best evidence.\n\nI believe this to be the best evidence. This is on Truth Social. I am  told that Mr. Trump is either the owner or one of the owners of Truth  Social, and this is a tweet that bears the name Donald J. Trump. I  don't think he has ever denied making this tweet, and…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…class.\n\nToday, when we still lead in auto manufacturing, Michigan faces some  of the Nation's highest unemployment rates while families are  struggling with rising costs.\n\nMr. Trump promised that tariffs would protect our jobs. Instead, they  have driven up the cost of steel, aluminum, and auto parts while plants  close and workers are left behind. When…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695795/real-solutions-for-manufacturing-in-michigan"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, candidate Trump and President-elect Trump  consistently and repeatedly promised the American people that when he  was elected, on day one that he would lower the cost of living…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…care most about and not  renaming bodies of water.\n\nAs Sergeant Friday used to say on the show ``Dragnet\": Just the  facts, ma'am.\n\nThe facts during the first 100 days of Mr. Trump's administration are  the following: The economy has shrunk; The stock market has taken a  hit; 401(k)'s that are critical for a majority of Americans' retirement  have declined;…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690812/renaming-the-gulf-of-mexico-to-the-gulf-of-america"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…for all Americans.\n\nThere are 10,000 baby boomers who become eligible for Social Security  every day. More than 70 million people receive Social Security, and now  Mr. Musk and Mr. Trump are out to cut those benefits?\n\nAsk your constituents where those cuts are going to come from, Mr.  Speaker. Are they ready to say that cuts ought to be made to the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…K-12 education, Trump's actions jeopardize key programs that  improve educational success for low-income students and students with  disabilities. Contrary to federal law, Mr. Trump plans to withhold  Title I grants that help districts meet the educational needs of  students with limited financial means based on his personal whims about  curricular content.…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…violating First Amendment rights, ignoring due process, and  finally refusing to abide by a unanimous Supreme Court ruling.\n\nJust as I stand here in the House of Representatives, Mr. Trump is  traveling to the Middle East to accept a gift worth $400 million from a  foreign government.\n\nI have spoken with Americans all over the country.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691026/protecting-our-constitution"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…colleagues were hoping that it would, but it is  worse now than it was even then.\n\nIn fact, the Republicans knew this problem was coming all the way  back on January 20 when Mr. Trump first took office. To much fanfare,  they began moving forward with his legislative agenda, the big,  beautiful bill and other pieces of legislation. I don't even know how…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…working-class families and seniors to pay for tax  handouts to billionaires. When Americans already face increased prices  and economic hardship from the President's chaotic policies, Mr. Trump  threatens Social Security--the leading assistance program that 73  million Americans depend on for monthly assistance. This group includes  the more than 7 million seniors…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…important thing. Most Members of  Congress don't realize this. Do you know how much money comes into your  district monthly to those recipients? That is $318 million that Mr.  Trump and Republican leadership want to cut.\n\nA 20 percent cut across the board to Social Security would decimate  people across all districts, including Iowa and Connecticut and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…tariffs  after  President Trump swore up and down he would do no such thing. Sadly, we  cannot trust a word our President says, let alone plan around his  erratic behavior. Mr. Trump's turbulent game of chicken with some of  our closest allies is absurd.\n\nHow does Mr. Trump expect people whose 401(k)s and kids' college  savings accounts just took a nosedive…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690067/tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…terrible that he was found guilty and sentenced to 45 years in  prison.\n\nThen what happened? Well, you won't believe it. Donald Trump pulls  out his pardon pen.\n\n[O]n Saturday, Mr. Trump said in a statement to the New       York Times that ``many friends'' had asked him to pardon Mr.       Hernandez. ``They gave him 45 years because he was the       President…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Which makes it all the more puzzling that he's so intent on  imposing tariffs that will punish those same Americans.''\n\nThe Wall Street Journal said: ``Tariffs are taxes, and Mr. Trump's  latest tariffs are estimated to be about an annual $150 billion tax  increase. Taxes are antigrowth. That is the message investors are  sending this week since Mr. Trump…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…pushed out after the election but before President  Trump's inauguration.\n\nThis rule was flawed to begin with. It was published on November 29,  2024, after the election of Mr. Trump but before his administration  could take office.\n\nFurther, as required by the Clean Air Act, EPA performed a risk and  technology review specifically on rubber tire plant…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Federal Government and environmental activists have  waged legal warfare on our farmers, small businesses, and job-creating  projects, causing endless delays and litigation.\n\nMr. Trump's vision is clear: America is building again.\n\nMy Judicial Review Timeline Clarity Act, which is included in this  vital permitting reform package, establishes a strict 60-day…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}]