[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Field or the Queens fans of the New York Islanders to get  to UBS Arena. There is another way.\n\nNorth of New York City, Westchester County and its border  communities--Yonkers, Mt. Vernon, Pelham, and New Rochelle--work  cooperatively and in harmony with the Bronx. New York City Bronx  residents routinely visit New Roc City and Cross-County Shopping  Center,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the Gospel of Jesus Christ. This journey began at Mount  Zion Baptist Church in Camilla, Georgia, and expanded to include  service at Ephesians Baptist Church in Albany and New Mt. Pleasant  Church in Waycross, Georgia.\n\nIn 1984, he co-founded First Monumental Faith Ministries alongside  his loving wife, First Lady and Co-Overseer, LaVerne Shinault Carter.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Club;       Parent: Martine Silve, Field Hockey, Herndon Reston Youth       Field Hockey.                              Franconia District\n\nMale Athlete: Bowen Kirui, Soccer, Lee- Mt. Vernon Sports       Club; Female Athlete: Vivienne Jensen, Soccer, Lee-Mt. Vernon       Sports Club, Coach Russell Balikian, Soccer, Basketball, Lee-      Mt. Vernon Sports…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Peterson and Brenda Brown;\n\nIn New Rochelle, Aisha Cook and Jareca Lee;\n\nIn Yonkers, Kisha Skipper and Karen Edmonson;\n\nIn Williamsbridge, Laura Rhodan and Shirley Fearon;\n\nIn Mt. Vernon, Kathie Brewington and A.J. Woodson;\n\nIn White Plains-Greenburgh, Janice Griffiths;\n\nIn Port Chester-Rye, James Henderson III.\n\nI also recognize other leaders such as…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. LARSEN of Washington. Mr. Speaker, I rise today to congratulate  Linda McCarthy on her retirement from Mt. Baker Planned Parenthood and  thank her for her many decades of service and dedication to the people  of Northwest Washington.\n\nSince 1977, Linda McCarthy has been an advocate…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689685/recognizing-linda-mccarthy"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Senator Sheehy for joining me in the  Senate.\n\nThis resolution is supported by many Montanans, starting with the  Governor of Montana, Governor Gianforte; the mayor of Colstrip, MT; the  Montana Coal Council; the Montana electric co-ops; Northwestern Energy;  local counties; both of the affected coal mines; and many, many more  and, I will tell you, many,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696070/9999"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Cattlewoman's Association.\n\nMichelle moved to Visalia, California in 1975 with her parents at the  age of six. She discovered her love for agriculture in high school  through Mt. Whitney High School's FFA program, where she quickly  immersed herself. Her involvement in FFA inspired her to pursue a  career in agricultural education, leading her to attend…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698441/recognizing-michelle-nuckols"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…overseeing 46  counties. His leadership and commitment to public safety earned him  widespread respect. Notably, he served as the Commander of all DPS  uniformed forces during the Mt. Carmel incident, further underscoring  his critical role in high-stakes situations.\n\nAfter retiring from DPS, Danny continued to serve by leading in the  field of education.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…MN--Mayor Andrea       Zupancich; Duluth Area Chamber of Commerce; Laurentian       Chamber of Commerce; Hermantown Area Chamber of Commerce;       Copper Development Association; Mt. Iron-Buhl School Board,       MN--Lisa Kvas; Grand Rapids Area Chamber of Commerce;       American Coal Council; Industrial Township, St. Louis County,       MN--Don Carlson;…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…economy was originally  dominated by forests and farms. Today, the town attracts outdoor  enthusiasts from throughout Maine and beyond to Rocky Mountain Terrain  Park and nearby Mt. Blue State Park.\n\nCarthage is also home to Newman Cemetery, a reminder of the  townspeople's service to the State and country. In this historic  cemetery, lie the remains of…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700097/200th-anniversary-of-the-town-of-carthage"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Arkansas. Mr. Speaker, I rise in condolence to Jill  LaMalfa and the LaMalfa family of northern California, that beautiful  area north of Sacramento, deep in the wilderness, home to Mt. Shasta.  There was no better representation of the people of California than  Doug LaMalfa.\n\nHe was a gentle giant. I had so much fun with him over the years. He  was such a…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Speaker, eastern Washington and Spokane are home  to many heroes and champions, but I would like to speak today of one  particularly exceptional young man, Brycen Phillips of Mt. Spokane High  School.\n\nBrycen was named a two-time U.S. Paralympics Track and Field High  School All-American, and he is somebody who has overcome tremendous  challenges.\n\nAfter…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Village, Colorado.\n\n(9) Greenwood Village, Colorado.\n\n(10) Highlands Ranch, Colorado.\n\n(11) Keystone, Colorado.\n\n(12) Lone Tree, Colorado.\n\n(13) Mountain Village, Colorado.\n\n(14) Mt. Crested Butte, Colorado.\n\n(15) Severance, Colorado.\n\n(16) Silver Cliff, Colorado.\n\n(17) Sterling Ranch, Colorado.\n\n(18) Superior, Colorado.\n\n(19) Telluride, Colorado.\n\n(20)…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Basic Course (ABC)  followed by Officer Candidate School and subsequent Basic School in  1957. Carrying on with additional training, he completed Duties of a  Motor Transport (MT) Officer and Embarkation Duties in 1958. By 1965,  he completed additional training that included Jr. Landing Force Plan  Staff II and Nuclear Weapons Orientation. As the war…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}]