[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…digits. That is just a huge sucking sound pulling out of  America's revenue the revenue of the corporate entities, and it is not  the mom-and-pop flower store. It is the huge multinational that goes  and pretends that it is doing its business in Ireland or the Cayman  Islands or someplace and hides profits.\n\nThis is a tax racket against the American people…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…policy. More and more are being  bent to the whim and the will of the wealthiest of the wealthy in our  country and the world, as well as to corporations--many of them,  multinational corporations.\n\nWe are in crisis--our Nation is in crisis--as more and more Americans  lose trust and lose faith in our country, in our democracy, in the  people who serve--the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…House Republicans have come up with an answer. This week, they are  focused on what really matters to the American people: Cutting taxes  for tasers and making it easier for multinational tech companies,  monopolies, to build undersea cables through marine sanctuaries.\n\nThose are the bills that we are considering today on the floor. That  is their answer…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…performative effort to try to convince us that they  are saving money. They are doing this in order to justify their plan  for a $3.5 trillion tax cut for hedge fund managers, multinational  corporations and billionaires, but they are really not saving anything.\n\nThen, yesterday, we passed a budget resolution, and all my Republican  colleagues are on Twitter,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Americans, that is not on the level. That is what is happening here, is  that there is an agenda: Get that tax cut.\n\nI happen to profoundly disagree with the tax cut for major  multinational corporations, and I profoundly disagree with lowering  taxes for billionaires--totally disagree with that. But when it is the  situation that we are going to pay for it…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the Trump administration has tried to  make immigrants the enemy. They have tried to convince us that the  problem isn't their abuses of power or the unchecked greed of  multinational corporations but it is immigrants.\n\nIn their 100 days in office, the Trump administration and Noem, the  Secretary of Homeland Security, have abused the power of the Department…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690501/trump-immigration-policies"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…as nations put retaliatory tariffs on  the United States. And so these businesses are pausing their investment  decisions.\n\nBusinesses in Virginia that are connected to multinational businesses  are saying that their headquarters are deciding, well, we can invest in  the United States or we can invest in another country. It is not wise  to invest in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…and revitalize American  manufacturing, why are we punishing the companies that are driving  innovation, the ones who are footing the bill?\n\nEarthQuaker Devices isn't some multinational conglomerate dodging  taxes and hiding profits offshore. They are a small business that  turned a passion for music and creativity into a business. They are our  neighbors.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…U.S., including tuna, cane  sugar, ginger and taro, would be eligible for duty-free treatment under  GSP but for this lapse.\n\nThe Pacific Islands Forum (PIF), the leading multinational political  organization for the Pacific Islands region, has prioritized the  region's need to build trade capacity and infrastructure and has  specifically advocated for…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…cut can be designed so it goes to folks who have really  been riding the wave of the financialization of the economy, folks who  have become billionaires--God bless them--multinational corporations  that have extremely strong balance sheets and really strong profits,  companies that already saw a tax cut in the last tax bill that has  exceeded what they…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "French Hill", "party": "Republican", "sentence": "…inflation).\n\nPrivate-Sector mandates: The bill would impose regulatory       requirements on some entities involved in digital commodities       and assets, such as large multinational businesses with       market capitalizations in the hundreds of billions of dollars       and with millions of U.S. consumers. Using publicly available       information…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…most liquid, and most competitive capital markets on planet Earth. This  is not a bad thing. This is a good thing.\n\nThose large institutions are capable of serving large, multinational  corporations that make the United States a destination for capital  flows in our country. They are a magnet for foreign direct investment.  They help us with countering…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…expire if we keep going  with this resolution, is the equalizer for small businesses to be able  to compete on the same level playing field as a large business, a  massive, multinational corporation.\n\nThe massive, multinational corporations already have their tax rates  set at 21 percent. Think of the small business down the street, the  mom-and-pop store,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…next, and lengthy permitting processes that can  delay construction projects for months or even years.\n\nFamily-owned shops face costly data privacy mandates designed for  multinational corporations, while contractors struggle with ever- shifting OSHA paperwork requirements that eat up their time better  spent on the jobsite.\n\nEarlier this year, the Small…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…folks actually get what we are  talking about. Not the bill of goods they are being sold, but when you  look at what happens with the concept of inversion. When a U.S.  multinational company can choose to co-op with a foreign entity to be  able to find a lower tax domicile, lowering their overall tax  liability, they can do that. That happens, and they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…defining the term ``small entity'' under  the Regulatory Flexibility Act.\n\nSimply put, small businesses can't afford the extensive legal and  regulatory expertise that large, multinational firms employ to comply  with every regulation while still managing their operating costs.\n\nRecognizing that company sizes and market dynamics constantly evolve,  my bill…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…credit, the Trump administration responded swiftly. Within  days of taking office, it approved nearly $41 million to support the  Haitian National Police and the Kenyan-led Multinational Security  Support Mission. It also issued a humanitarian waiver to keep emergency  relief flowing.\n\nThis bill complements those efforts by requiring the State Department…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the economic  indicators for the country, and we are heavily tilted toward small  business out of Utah. There aren't an enormous amount of global  headquarters for big, multinational firms. It is a ton of small  businesses. I thank the gentleman for highlighting that.\n\nMr. Speaker, I thank my other colleagues for being here to discuss  the goings-on…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…sustainability of that program for future Americans.\n\nMr. ARRINGTON. Mr. Speaker, I wonder how my colleagues justified the  $800 billion tax break for multibillion dollar, multinational green  energy corporations.\n\nMr. MOORE of North Carolina. Mr. Speaker, this is an opportunity this  evening to vote for a budget resolution that extends tax relief for…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…inversion,'' where U.S. companies were taking their  revenue to other countries. Instead, they decided that they have a more  favorable rate here, so they will bring it back. Most multinational  companies, most U.S.-based companies, a lot of times foreign companies,  want to be based here.\n\nAll we did with that rate was to say that we are going to make that  rate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…wealthy country because you make things. Our manufacturers, unlike some  of these other industries, have to compete against companies abroad.\n\nMr. Speaker, when these big multinational corporations have to decide  if they are going to set up shop in Germany or Korea or Brazil or India  or wherever, we want it to be favorable taxwise to set up shop in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}]