[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…personnel, authorization of funding for Kirtland  Air Force Base, and language which I am most grateful for to hold the  Department of Defense accountable for cleaning up munitions and  unexploded ordnance on Tribal lands, including in Isleta Pueblo.\n\nIt also authorizes funding to stand with our allies in Europe against  Russian aggression and strengthens…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697793/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…tax dollars, your tax dollars are fueling the genocide  that is taking place. If you wanted to do something about it, you  wouldn't fund it. Those planes are our planes. The munitions are our  munitions.\n\nNow, someone is going to say that I am somehow creating the fervor,  the incitive response that may take place because I speak the truth.  Truth has,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…not account for inflation, thousands  of DOD programs would see cuts. That includes programs that deal with  nuclear triad modernization, shipbuilding and ship  maintenance, munitions production and replenishment, and U.S.  priorities in the Indo-Pacific.\n\nUltimately, a yearlong CR would force too much uncertainty and stress  on our servicemembers and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…from the United  States because we sent our weaponry over there. We have to pay for  weapons that were used to bomb the Palestinians. The bombs, many of  them, were actually munitions that came from us.\n\nWe have a duty to respect their lives and their property, and we have  a duty to help to rebuild. This is something that we can't push off on  others,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…assets that now are in bank accounts in Europe can be  used to finance the purchasers of weapons, Tomahawks, F-16s,  interceptors for the Patriot systems, 155s, all of the munitions and  weaponry that Ukraine needs to win.\n\nWe must be unified in this Chamber and so must America across this  great land with other democracies that are under attack through…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…biological cells and systems to perform complete chemistry-- complex issues.\n\nThey will enable us to onshore the production of critical chemicals,  including those used in munitions and high-performance aviation fuel,  as the chair mentioned; to develop new medical cures and treatments and  produce them on-demand near the front lines; to engineer biological…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…incredibly important. We have taken many of the  recommendations over the year and find it very valuable.\n\nThe bill also continues the subcommittee's work to revitalize our  munitions industrial base by providing multiyear procurement  authorities, coupled with strong investment in these accounts.\n\nMadam Chair, this bill also includes and fortifies the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695154/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…ensure reasonable execution of these programs  that include all of our tactical aircraft programs; the intelligence,  surveillance, and reconnaissance aircraft; and tactical munitions.\n\nThis bill also includes the subcommittee's multiyear effort to manage  the largest acquisition program in the history of the Department of  Defense. Yes, that is the F-35…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…actually a lot of that out there. From World War II into the  1970s, the Federal Government dumped massive amounts of UXOs into the  ocean, including depth charges, torpedoes, munitions, mustard gas, and  even chemical weapons, all in designated explosive dumping areas. If  that wasn't bad enough, these same waters were used to dispose of  radioactive waste.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…shipbuilding for additional submarines and surface vessels;  $38 billion to ensure air dominance with new generation fighter jets;  $25 billion to restore America's arsenal of munitions; and $145 billion  to research and develop innovative new technologies our warfighters  will need to win on future battlefields.\n\nThis is a strong bipartisan bill that delivers…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Module or M-Code.\n\nNon-Major or Defense Equipment:\n\nThe following non-MDE items will be included: AMRAAM       control sections, containers, and support equipment; Common       Munitions Built-in Test (BIT)/Reprogramming Equipment       (CMBRE); ADU-891 adaptor group test sets; munitions support       and support equipment; spare parts, consumables and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the Department of Defense Appropriations Act protects  that lifeline by prohibiting any Federal funds from being used to  reduce the workforce at Rock Island Arsenal, Joint Munitions Command,  Army Sustainment Command, or any other active U.S. Army arsenal.\n\nRock Island Arsenal is more than just a military installation. It is  a critical node in our Nation's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Venezuela with  military aid while also facing the challenges of waging war in Ukraine.  In fact, Venezuela opened a factory last summer to manufacture Russian  Kalashnikov rifle munitions.\n\nChina, Russia, Iran, and Cuba use the country as a platform for  intelligence operations in asymmetric warfare.\n\nInstead of considering this resolution, which carries little…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "James Risch", "party": "Republican", "sentence": "…High Mobility Artillery Rocket Systems       (HIMARS).\n\nOne hundred thirty-two (132) M31A2 Guided Multiple Launch       Rocket System (GMLRS) Unitary pods with Insensitive Munitions       Propulsion System (IMPS).\n\nOne hundred thirty-two (132) M30A2 GMLRS Alternative       Warhead (AW) pods with IMPS.\n\nThirty-two (32) M403 Extended Range (ER) GMLRS AW…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…OMB this year  doesn't even keep up with inflation. The fiscal year 2026 top line  won't come close--close--to covering growing costs and requirements,  like the multiyear munitions contracts the Department of Defense  rightly wants to actually sign.\n\nWe should keep the cost and value of America's own commitment to the  transatlantic alliance actually…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…for the Golden Dome missile defense  system, our answer to hypersonic and NextGen threats from adversaries  like China and Iran.\n\nIt expands our naval fleet, restocks our munitions, modernizes our  nuclear deterrent, and accelerates the delivery of Next Generation  aircraft and autonomous systems.\n\nJust as important, it puts our troops first, with $8.5…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692966/peace-through-strength"}, {"senator": "James Risch", "party": "Republican", "sentence": "…consumables,       accessories, and repair/return support; classified software;       books, technical documentation, and other publications;       training and training equipment; munitions support and       support equipment; and other related elements of logistics       and program support. The estimated total cost was $380       million. Major Defense Equipment…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…progress in Europe.\n\nThe proposed sale will improve the Netherlands capability       to meet current and future threats by ensuring it has modern,       capable air-to-air munitions. The Netherlands already has       AMRAAMs in its inventory and will have no difficulty       absorbing these articles into its armed forces.\n\nThe proposed sale of this equipment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695757/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Vehicles (FMTV) truck chassis. HIMARS is the modern Army-      fielded version of the Multiple Launch Rocket System (MLRS)       M270 launcher and can fire all the MLRS Family of Munitions       (FOM), including Guided Multiple Launch Rocket System (GMLRS)       variants and the Army Tactical Missile System. Utilizing the       MLRS FOM, the HIMARS can engage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…November 19,       2025.\n\n* As defined in Section 47(6) of the Arms Export Control       Act.                             POLICY JUSTIFICATION                              Japan--Munitions\n\nThe Government of Japan has requested to buy twenty-eight       (28) GBU-53 Small Diameter Bombs-Increment II (SDB-II) all-      up-rounds (AURs) that will be added to a…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…advancing my legislative priorities across the House Armed Services,  Intelligence, and Foreign Affairs Committees. In 2013, Evan  commissioned as a Logistics Readiness and Munitions Maintenance Officer  after graduating from the University of Colorado, where he received a  Bachelor of Arts Degree in International Affairs with magna cum laude  honors.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…We have to prepare for the next war, not prepare to refight World War  II.\n\nI think it is important for our press corps to publicize people who  talk about the new type of munitions and the new type of armaments we  are going to need in a new war. Given that we are so entirely broke and  that 26 percent of our budget is borrowed, we have to make sure…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "James Risch", "party": "Republican", "sentence": "…cost, quantity, or requirements of       these cases, in the national security interest of the United       States:\n\nFor Israel:\n\nBulldozers\n\nAdministrative Price Change to Munitions\n\n1,000-lb Warheads and JDAM Kits\n\n2,000-lb Warheads\n\nThis determination shall be published in the Federal       Register and, along with the accompanying Memorandum of…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…with the men and  women of our industrial base. The One Big Beautiful Bill Act invests  more than $29 billion in shipbuilding and another $25 billion in  advanced weapons and munitions. These funds will help sustain high- skilled jobs across Hampton Roads and guarantee our Navy remains the  strongest in the world.\n\nAt Naval Station Norfolk, I heard from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}]