[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…motivated--that is politically motivated.\n\nWhat a sad thing to have to say--in our country, a growing number of  people are embracing a political ideology that leads them to murder  Jews. All of the recent murder attacks have been carried out by some  who identified closely with antisemitic hatred of Israel, organized  around the rhetoric of Palestinian…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…achieve her pledge to establish an international commission to combat  corruption and impunity, and the lack of progress in bringing to  justice those responsible for the murder of environmentalist Juan Lopez  and others who have lost their lives defending the land and water that  indigenous communities depend on. There is no doubt that part of the…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…second  public killing of an innocent American in Minneapolis tied to Homeland  Security. Renee Good, a mother of three, was shot by ICE on January 7,  mere weeks before the murder of Alex Pretti.\n\nMr. Speaker, as co-chair of the Tom Lantos Human Rights Commission,  named after our former colleague, the only Holocaust survivor to serve  in the United…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…American citizen.  Renee Good was a wife and a mother who has now become ICE's latest  victim. To those at DHS and in this Chamber who have created and  rewarded a culture of murder, I ask the same question that God asked  Cain:\n\nWhat have you done? You have slain your sister who gave you no  offense. The voice of her innocent blood cries out from the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…whether they had been engaged in armed conflict, is a war crime, plain  and simple. The administration is trying to brainwash the American  people into thinking that cruelty and murder and war crimes are normal.\n\nMr. Speaker, I have news for the Trump administration. This is not  normal. Even if we were at war, attacking survivors of an airstrike,  whether…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…damn  community.\n\nThen yesterday, on the Oversight Committee, my Republican colleagues  voted ``no'' on a simple subpoena so we can get information, documents  relating to the murder of a U.S. citizen by a Federal agent. Then my  colleagues broke into this righteous debate: Let the process play out,  let DHS do their investigation, the agent gets due process.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and retaining police officers  is not unique. It is a nationwide issue that predates the police  accountability and transparency laws enacted across the country after  the murder of George Floyd. In 2019, before the murder of George Floyd,  the International Association of Chiefs of Police conducted a survey  that found ``The challenge of recruiting…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Federal officer in doing his or her duty, or seditious conspiracy  against the Union, which is why the vast majority of crimes are  prosecuted at the local level like assault, murder, armed robbery,  theft, and so on.\n\nFederal law would also be limited, the Founders thought, according to  number because the Federal criminal laws would be organized around…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…the  man who was convicted and imprisoned after targeting me. Since their  release, at least 23 individuals have re-offended and committed crimes  that include plotting the murder of FBI agents, violent assault,  strangulation, possession of child sexual abuse material, and reckless  DUI homicide.\n\nDespite the clear evidence of crimes committed by these…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…at least investigate something  real, like why Donald Trump pardoned people who assaulted police  officers. One of those men is now serving a life sentence for plotting  to murder nearly 40 law enforcement officers and blow up the FBI. His  lawyers even tried to argue that Trump's pardon should cover his murder  plot.\n\nAnother pardoned rioter committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…enforcement in Minnesota have been blocked from the vehicle  where Renee was killed because the FBI sealed it off, blocking  transparency and accountability.\n\nRenee Good's murder is not an isolated incident. In my community, we  know this pattern all too well. In September, Silverio Villegas  Gonzalez, a father of two, was killed by ICE on the side…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…legacy of Charlie Kirk.\n\nCharlie Kirk's assassination was a horrific and vile attack. It was  an incident of political violence, and condemning the depravity of  Kirk's brutal murder is a straightforward matter. It is one that is  especially important to help stabilize an increasingly unsafe and  volatile political environment where everyday people feel…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…were attacked in politically-motivated  shootings.\n\nMinnesotans are devastated by the assassinations of Speaker Emerita  Melissa Hoffman and her husband Mark and the attempted murder of  Senator John Hoffman and his wife Yvette. These are shocking and  heinous acts of targeted political violence against elected officials.  They were clearly intended to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…including those regulating so-called       `ghost guns.' In 2022, an adjudicated domestic abuser who was       prohibited from possessing firearms used a ghost gun to       murder his three daughters in a Sacramento church during a       supervised visitation then murdered the chaperone and killed       himself. Unable to pass a background check, he…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…motivated all the more to do this  work.\n\nIn the almost 7 years since, our empathy and our common humanity has  been tested in unimaginable ways.\n\nThe latest is the horrific murder of Charlie Kirk.\n\nBeyond the horror of such a vile act is the pervasive ugly rise in  political violence.\n\nWe have witnessed it in my home State of Pennsylvania with the  attempted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695813/political-violence"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Since then, anti-Semitic  incidents have reached unprecedented levels across this great country.\n\nThe attack in Boulder, Colorado, is the most recent incident  following the murder of two Israeli Embassy staff members in  Washington, D.C., and the attack on Pennsylvania Governor Josh Shapiro  and his family, as we previously heard.\n\nThis growing trend…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "James Risch", "party": "Republican", "sentence": "…long, long- term ally of the United States going back almost 100 years. We have had  a long relationship with them.\n\nCertainly, nothing I am saying here is to denigrate the murder of  Jamal Khashoggi. That happened. There is absolutely no question about  it. But nothing that--this resolution will do nothing to achieve  accountability for the murder of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697011/9999"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Knott talked about Tren de  Aragua, and we see that Tren de Aragua has become embedded in our  communities. They are involved in violent crimes like robbery, assault,  and murder. They are involved in human trafficking, and they are  involved in narcotics trafficking.\n\nSo, Mr. Speaker, I believe that this legislation goes hand in hand  with the previous…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Mr. President, we all remember the tragic murder of SPC  Sarah Beckstrom on the eve of Thanksgiving. She was, as we all will  recall,  one of the National Guard servicemembers working here in the District  of Columbia. We…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…with  his wife, Lynn, and their family.\n\nOn July 21, 2022, Officer Mazurkiewicz was tragically shot and killed  while on duty while conducting surveillance duty. As part of a murder  investigation, Officer Mazurkiewicz and another officer were in an  unmarked police vehicle when the subject walked up from behind and  fired 17 rounds.\n\nOfficer Mazurkiewicz…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…border, processed, and then simply released into the interior just  weeks before. The illegal alien who murdered Rachel was a fugitive with  a warrant out for his arrest for the murder of a different woman back  home in El Salvador. He had been deported three times in that year  alone, only to waltz back in across our open border.\n\nThe monster who murdered…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Tobacco & Firearms; the  U.S. marshals. The good guys, that is who they are.\n\nMy colleagues on the other side of the aisle literally are defending  these people who came here to murder, rape, and rob. That is who they  are defending. They are literally defending--there is no other way to  cut it.\n\nRachel Morin died about 30 miles from my house. I don't live…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…aggravated sexual  assault of a child under the age of 14, after previously being caught  and removed twice before.\n\nIn January, a 24-year-old Mexican national was charged with the  murder of his girlfriend in Utah just one week after being deported for  the second time.\n\nThese are not isolated cases. They are just a few recent examples  from my home State, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the fourth time this year, a city  of Milwaukee police officer was shot. This time, sadly, it was fatal.  When Officer Kendall Corder was killed, we suffered another savage  murder in Milwaukee.\n\nWhen I was a child, Milwaukee was the safest of the 25 biggest cities  in this country. We have gone a long way from that. I hope this House  addresses the root…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693490/events-in-milwaukee"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Silverglate estimates  that the average American commits three felonies a day without even  knowing it.\n\nDr. Silverglate clearly wasn't referring to violent felonies like  murder or felonies like money laundering or fraud, but instead to those  vague, hidden, duplicative and sometimes downright silly laws.\n\nI have other pending legislation; the End…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Jocelyn Nungaray was       brutally murdered in Houston, Texas.\n\n(2) Two illegal aliens who were allegedly members of the       Tren de Aragua gang have been charged with her murder.\n\n(3) On March 4, 2025, President Donald J. Trump signed       Executive Order 14229 (90 Fed. Reg. 11585; relating to       honoring Jocelyn Nungaray) renaming the area known…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…who back in April 30,       1956, spoke at Nahal Oz's first funeral. Dayan, initially       arriving the day before for planned four weddings only to       face the brutal murder of Roi Rutberg, Nahal Oz's security       chief, by infiltrating Gazans. Dayan's stirring words created       a stir in the young community for its pessimistic message…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…way, they are simply the faces of hundreds of thousands of  Americans who have lost their lives violently through narcotics,  through fentanyl, through drunk drivers, through murder, through rape,  and through intimidation.\n\nThey represent a large block of Americans suffering at the hands of  people who have been released on our streets purposely for crass…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…adult in D.C. This bill lowers that age to 14 years old, making  14- and 15-year-olds who commit violent crimes eligible to be charged  as adults.\n\nViolent crime refers to murder, first-degree sexual abuse, burglary  in the first degree, and robbery while armed, for example. When  juveniles commit crimes of this magnitude, they deserve sentencing that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…generation  for the mothers, but we just treat the single fathers very poorly. We  don't give them a purpose in life. As a result, so many are unhappy. So  many wind up dying from murder, dying of drug overdoses, and just, in  general, leading unhappy lives.\n\nMr. Speaker, these are some of the things that I hope we begin to  take up next week. I hope our leadership…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]