[{"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…to promoting affordable housing to ensuring that sustainability issues  are front and center for the Village. Mayor Van Dusen was a key  supporter of the Illinois Holocaust Museum and Education Center, which  opened in Skokie under his tenure. This institution is now a landmark  that has received national acclaim as it combats hatred and bigotry.\n\nSkokie…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688871/recognizing-the-career-of-skokie-mayor-george-van-dusen"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Belen City Council and as  former Mayor of the City of Belen for over fifteen years. During his  mayorship, he worked on amazing projects, such as renovating the Harvey  House Museum, establishing a Festival of Trees, and providing the long- time display of the Bugg Lights. His work has not only improved the  city but established a community where people…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…artists. For those with an  affinity for art and culture like me, frequenting the heritage center  is truly an incredible experience.\n\nSince its founding, the foundation's museum has welcomed over 80,000  visitors. There have been more than ninety different exhibition areas  ranging from `Budapest in the 1900s' with a focus on looking into the  past…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689612/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…history of the state of  Georgia, and I am honored to uplift today's remarkable milestone. Back  home in my district, constituents will gather this evening at the  Douglas County Museum of History & Art for a reflection on the history  of the city and a celebration of the progress they hope to make in the  future.\n\nI want to commend Mayor Rochelle Robinson,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688019/recognizing-the-city-of-douglasville-georgia-on-its-sesquicentennial-birthday"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, last night, just a few blocks from here,  at the Capital Jewish Museum, a scourge of anti-Semitism reared its  ugly head yet again in America. The sickening, cold-blooded murder of  two Jewish staffers of the Israeli Embassy seems to be another…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691653/capital-jewish-museum-shooting"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the project, also served as the  copresident of the Akron's Rites of Passage Institute. Earlier this  month he laid out plans for a new African-American cultural center and  museum complex on behalf of the program. The building will house a  museum, a business incubator, and center to teach people about trading  and investing as a means to building economic…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to condemn this  administration's harmful and illegal efforts to gut  the Institute of Museum and Library Services.\n\nLet's be clear. This is a direct attack on rural families, veterans,  caregivers, and children, including thousands of Delawareans who rely  on libraries…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690588/cutting-lifeline-of-institute-of-museum-and-library-services"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…unseen.\n\nIn New York, this priceless collection had few visitors, little  space, and no real home, but now these treasures are coming to  northwest Ohio to the world-class Toledo Museum of Art.\n\nThe American Numismatic Society has chosen Toledo, located on  beautiful Lake Erie, as the place where its future can flourish. We are  so grateful that the society…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…higher standards. We have a golf tournament that is the  FedEx St. Jude Golf Classic.\n\nHe had his hand in every good thing in Memphis from education, zoos,  and the civil rights museum. It is a big loss to Memphis. It is a big  loss to Tennesseans. It is a big loss to Americans.\n\nMr. Speaker, I thank Mr. DesJarlais and Mr. Burchett for joining me  up here.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692872/in-memory-of-frederick-w-smith-jr"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…America's most prominent citizens, including Justice  Thurgood Marshall, Ray Charles, and performers on the chitlin circuit.  Today, that landmark is known as the Wells'Built Museum of African  American History and Culture.\n\nShe served in the Florida House of Representatives from 2006 to 2012  and 2018 to 2022. She was elected to the Florida Senate in…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Boulder, Colorado, in support of the hostages being held in Gaza.\n\nThis horrific attack comes on the heels of another targeted anti- Semitic terror attack at the Capital Jewish Museum here in Washington,  D.C., where a hate-filled gunman murdered two young employees of the  Israeli Embassy, Yaron and Sarah. May their memories be a blessing.\n\nWe must send…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691979/condemning-the-boulder-colorado-anti-semitic-attack"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…discussions, policy programs, leadership  development opportunities, and musical events, the House continues to  be a vibrant center of cultural and diplomatic exchange, a museum of  American life, and the home of the foreign affairs community.\n\nTwo hundred years after its construction, the DACOR Bacon House  remains a pillar of strength in the President's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…first Bipartisan  Women's Caucus of the year to stand in solidarity with my colleagues in  this historic caucus as we continue the work to break ground on a  Women's History Museum on Washington's National Mall.\n\nI would like to thank my colleague and cochair, Representative Monica  De La Cruz for organizing this Special Order hour. I would also like…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, this past weekend, I visited the United  States Holocaust Memorial Museum with my daughter. I had been before,  but the timing of this visit was very intentional. I went to reflect on  the horrific history of dehumanization and ethnic cleansing that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697114/genocide-in-gaza"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…decades, the IRCC became a lifeline to Vietnamese,  Cambodian, and Laotian families throughout our region.\n\nHe also founded, funded, and passionately led the creation of the  Museum of the Boat People and the Republic of Vietnam to ensure future  generations understand the tremendous sacrifice, courage, and  resilience of the thousands who came to our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "Mr. ZINKE. Mr. Speaker, I rise today to honor the 250th year since  our Nation's founding by recognizing the legacy of the World Museum of  Mining in Butte, Montana.\n\nThe World Museum of Mining has been in operation since 1956 and is  one of the world's only museums that sits on a former mine. For seven  decades,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700162/recognizing-the-world-museum-of-mining-in-butte-montana-in-celebration-of-americas-250th"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…building EV charging  stations, part of the ``green new scam''; subsidize California's  disaster rail system; fund infrastructure and renovation projects at  the wealthy Met Museum and the Michigan AFL-CIO; a dance festival in  Massachusetts; DEI initiatives.\n\nLook, we don't need this. We don't want this. This is what is driving  the train toward the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…on a model at home for over four years. The  model is one of a kind, and the only one in existence. He donated the  large-scale model to the Army and it's on display at the Museum Support  Center in Anniston Alabama (MSCA).\n\nCharlie worked from July 1999 until the completion of the ANCDF  mission and left in August 2013, He started in April 2014, as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694773/recognizing-the-contributions-of-charles-charlie-webb"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Eveleth, MN, where it shall be       displayed as appropriate and made available for research; and\n\n(3) one gold medal shall be given to the U.S. Olympic and       Paralympic Museum in Colorado Springs, CO, where it shall be       displayed as appropriate and made available for research.       SEC. 4. DUPLICATE MEDALS.\n\nThe Secretary may strike and sell…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…highest honor we can give.\n\nAs was alluded to earlier, the Olympic Center in Lake Placid is going  to have a Congressional Gold Medal. The United States Olympic &  Paralympic Museum in Colorado Springs will have a Congressional Gold  Medal. Yes, the United States Hockey Hall of Fame Museum in Eveleth,  Minnesota, will have a Congressional Gold Medal.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…leader in runs scored and RBI's,  carrying an impressive .521 batting average and .662 on-base percentage  this past spring.\n\nOff the field, Sadie is a two-time Hunterdon Art Museum Young Artist  Award recipient and has been featured in the Holland Brook School  Bobcat Bulletin. She also maintains straight A's in all core subjects.  I invite my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize one of  our Nation's greatest World War II museums, the National Museum of the  Mighty Eighth Air Force.\n\nThe museum, located just outside of Savannah in Pooler, Georgia,  received a preserved B-24 Liberator from the National Museum of the  U.S.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693104/recognizing-the-national-museum-of-the-mighty-eighth-air-force"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…country by having unfettered immigration, but also to  divide America by groups. Part of that was when he passed one of his  big bills, and he put in there an American Hispanic museum. This is  consistent with the Democratic policy of trying to divide America.\n\nOur motto put in place in 1782 was E Pluribus Unum, Out of Many, One.  The Democrats are trying…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692121/opposing-funding-for-museum"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…about digital assets, I want  to take a moment to remember Sarah Lynn Milgrim and Yaron Lischinsky,  who were tragically, senselessly murdered last night at the Capital  Jewish Museum.\n\nMay their memory be a blessing for their families, their friends,  their community, and their faith.\n\nLet me be very clear. Anti-Semitism and this kind of hate-fueled  violence…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Communist Party is also subjecting them to forced       sterilization. The CCP's persecution of the Uyghurs has grown       so severe that the U.S. Holocaust Memorial Museum has       recently announced that ``there are reasonable grounds to       believe that China is responsible for crimes against       humanity.''\n\nAccording to the report: ``Organ…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…instrumental in the renaming of West Broad Street to Martin Luther  King, Jr. Boulevard.\n\nMs. Pryor served on the Board of Directors of the Ralph Mark Gilbert  Civil Rights Museum and was the former grand marshal for the annual  Martin Luther King, Jr. Day Parade.\n\nMs. Pryor is survived by her two daughters and many other beloved  relatives and friends.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Army of the Republic. His  legacy of service continues to inspire Americans today.\n\nIt is fitting that the Woman's Relief Corps has made its home at the  General John A. Logan Museum in Murphysboro, Illinois.\n\nAlthough the Woman's Relief Corps received its congressional charter  many years ago, the charter still lists Washington, D.C., and  Springfield…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…that role at the Fort Worth Jewish  Community Center. His leadership and vision led him to soon become  president of the Center as well as Treasurer of the Fort Worth Art  Museum, now The Modern, setting a high bar for service at a young age.\n\nMarshall's dedication to community did not stop there. He has been a  tireless advocate and supporter of Jewish…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…did back in the  day.\n\nI said that I want to be like that guy, and it was for a lot of  reasons. I just got back from the economic forum out there in  California and saw the museum. I was reminded of what a statesman  leader he was and how he was the right person to work with Tip O'Neill  and our Democratic colleagues to do something really big that hasn't…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…antisemitism is       still present albeit with a small Jewish community. I vividly       recall upon visiting Poland in 2017 and stepping out of the       new state-of-art Polin Museum next to the giant Warsaw Ghetto       Memorial, an Israeli military group getting ready to conduct       a memorial service at the moving site. I introduced myself to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}]