[{"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…decades, the IRCC became a lifeline to Vietnamese,  Cambodian, and Laotian families throughout our region.\n\nHe also founded, funded, and passionately led the creation of the  Museum of the Boat People and the Republic of Vietnam to ensure future  generations understand the tremendous sacrifice, courage, and  resilience of the thousands who came to our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to condemn this  administration's harmful and illegal efforts to gut  the Institute of Museum and Library Services.\n\nLet's be clear. This is a direct attack on rural families, veterans,  caregivers, and children, including thousands of Delawareans who rely  on libraries…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690588/cutting-lifeline-of-institute-of-museum-and-library-services"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…face of deep-rooted, systemic  racism.\n\nThis Juneteenth, Chicago will celebrate Juneteenth as a testament to  community, remembrance, and pride. There is the Pullman Porter Museum's  Juneteenth parade, games, and concert. Or the Cook County celebration  at Malcolm X College, the Juneteenth Annual barbeque at the DuSable  Black History Museum, or 1865…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the Tribe to continue stewarding an  ecosystem that they have cared for since time immemorial.\n\nThe Quinault Nation plans to use this land as a place of education, a  living museum where future generations can learn about their heritage,  their connection to the Salmon River watershed, and their  responsibility to protect the land.\n\nThis is self-determination…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, this past weekend, I visited the United  States Holocaust Memorial Museum with my daughter. I had been before,  but the timing of this visit was very intentional. I went to reflect on  the horrific history of dehumanization and ethnic cleansing that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697114/genocide-in-gaza"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…unseen.\n\nIn New York, this priceless collection had few visitors, little  space, and no real home, but now these treasures are coming to  northwest Ohio to the world-class Toledo Museum of Art.\n\nThe American Numismatic Society has chosen Toledo, located on  beautiful Lake Erie, as the place where its future can flourish. We are  so grateful that the society…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…issues  impacting communities across the State of Illinois.\n\nBoth Billy and his wife, Veronica Ocasio, have lent their talents and  time to creating and growing the National Museum of Puerto Rican Arts  and Culture, also based in Humboldt Park. In Billy's role as president  and CEO, as well as in Veronica's role as director of education and  programming,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…my home community in Ohio, Lieutenant Colonel Harold H. Brown. He was a  Tuskegee Airman, and this is the bronze statue that was cast in our  region as part of our Air Force museum, honoring his astounding life.\n\nHe was a warrior for justice on many fronts and an unwavering  patriot. He was always happy. His story is one of resilience,  excellence, and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Boulder, Colorado, in support of the hostages being held in Gaza.\n\nThis horrific attack comes on the heels of another targeted anti- Semitic terror attack at the Capital Jewish Museum here in Washington,  D.C., where a hate-filled gunman murdered two young employees of the  Israeli Embassy, Yaron and Sarah. May their memories be a blessing.\n\nWe must send…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691979/condemning-the-boulder-colorado-anti-semitic-attack"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Belen City Council and as  former Mayor of the City of Belen for over fifteen years. During his  mayorship, he worked on amazing projects, such as renovating the Harvey  House Museum, establishing a Festival of Trees, and providing the long- time display of the Bugg Lights. His work has not only improved the  city but established a community where people…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…last night, this time--this time--in our Nation's Capital, less than 1  mile from where I am standing this very moment. This shooting occurred  outside of the Capital Jewish Museum, where the American Jewish  Committee was holding a large event. And the shooter went there  specifically to target and kill Jews and people whom he perceived to be  Jewish.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…discussions, policy programs, leadership  development opportunities, and musical events, the House continues to  be a vibrant center of cultural and diplomatic exchange, a museum of  American life, and the home of the foreign affairs community.\n\nTwo hundred years after its construction, the DACOR Bacon House  remains a pillar of strength in the President's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, on May 21, Sarah and Yaron were leaving an  event at the Capital Jewish Museum. They worked at the Israeli Embassy  and were planning their engagement, but their future together was cut  short when a man yelling, ``Free Palestine,'' murdered them.\n\nThis…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691921/rise-of-anti-semitism"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the project, also served as the  copresident of the Akron's Rites of Passage Institute. Earlier this  month he laid out plans for a new African-American cultural center and  museum complex on behalf of the program. The building will house a  museum, a business incubator, and center to teach people about trading  and investing as a means to building economic…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…history, our history, from Heart Mountain to Topaz to  Santa Fe. Are they next? Will the truth be rewritten or, worse,  completely erased?\n\nHistory is not just decor for a museum exhibit or a national park. It  is a warning label for the same injustices we are now seeing repeated  today. We see it in the targeting of immigrants. We see it in the  dismantling…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699715/rewriting-history"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…the Jewish people, with their murderer chanting  ``Free Palestine'' after killing them in cold blood.\n\nThese were innocents, out for a night together at the Capital Jewish  Museum here in DC, just like members of our own staff do each and every  week. This anti-Semitism and hate for Israel and the Jewish people is  disgusting, unacceptable, and must…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Army of the Republic. His  legacy of service continues to inspire Americans today.\n\nIt is fitting that the Woman's Relief Corps has made its home at the  General John A. Logan Museum in Murphysboro, Illinois.\n\nAlthough the Woman's Relief Corps received its congressional charter  many years ago, the charter still lists Washington, D.C., and  Springfield…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…building EV charging  stations, part of the ``green new scam''; subsidize California's  disaster rail system; fund infrastructure and renovation projects at  the wealthy Met Museum and the Michigan AFL-CIO; a dance festival in  Massachusetts; DEI initiatives.\n\nLook, we don't need this. We don't want this. This is what is driving  the train toward the…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…community first home to the Seminole Indians.\n\nFrom its early years as a hub for citrus and watermelon growers to  the history now preserved by the Lady Lake Historical Society Museum,  the town's heritage reflects a century of resilience.\n\nThe recent weeklong celebration brought that heritage to life,  uniting residents, visitors, and community partners…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…1972 and later the  Instructors Orientation Course in 1975.\n\nAfter his 32-year career in the Marine Corps, Colonel Airola  transitioned his service over to the HEARTS Veterans Museum from its  inception. His countless hours of volunteering, setting up museum  displays, participating in parades, and educating the visitors and  children is nothing short of…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696280/recognizing-colonel-john-battista-airola-usmc-retired-with-a-congressional-veteran-commendation"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…leader in runs scored and RBI's,  carrying an impressive .521 batting average and .662 on-base percentage  this past spring.\n\nOff the field, Sadie is a two-time Hunterdon Art Museum Young Artist  Award recipient and has been featured in the Holland Brook School  Bobcat Bulletin. She also maintains straight A's in all core subjects.  I invite my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize one of  our Nation's greatest World War II museums, the National Museum of the  Mighty Eighth Air Force.\n\nThe museum, located just outside of Savannah in Pooler, Georgia,  received a preserved B-24 Liberator from the National Museum of the  U.S.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693104/recognizing-the-national-museum-of-the-mighty-eighth-air-force"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…country by having unfettered immigration, but also to  divide America by groups. Part of that was when he passed one of his  big bills, and he put in there an American Hispanic museum. This is  consistent with the Democratic policy of trying to divide America.\n\nOur motto put in place in 1782 was E Pluribus Unum, Out of Many, One.  The Democrats are trying…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692121/opposing-funding-for-museum"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…about digital assets, I want  to take a moment to remember Sarah Lynn Milgrim and Yaron Lischinsky,  who were tragically, senselessly murdered last night at the Capital  Jewish Museum.\n\nMay their memory be a blessing for their families, their friends,  their community, and their faith.\n\nLet me be very clear. Anti-Semitism and this kind of hate-fueled  violence…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Communist Party is also subjecting them to forced       sterilization. The CCP's persecution of the Uyghurs has grown       so severe that the U.S. Holocaust Memorial Museum has       recently announced that ``there are reasonable grounds to       believe that China is responsible for crimes against       humanity.''\n\nAccording to the report: ``Organ…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…instrumental in the renaming of West Broad Street to Martin Luther  King, Jr. Boulevard.\n\nMs. Pryor served on the Board of Directors of the Ralph Mark Gilbert  Civil Rights Museum and was the former grand marshal for the annual  Martin Luther King, Jr. Day Parade.\n\nMs. Pryor is survived by her two daughters and many other beloved  relatives and friends.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…distribute tool and equipment  mounting solutions for the fire service, military, and other industries  in over 38 countries.\n\nIn 2007, Dick established the Greater Lancaster Museum of  Firefighting, located next to his business. The museum showcases  historic firefighting artifacts, including those from local departments  and even pieces from the 9/11…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Printing that was opened in 1981, and Walker County Judge from 1994 to  2002.\n\nAs a longtime volunteer, Lt. Col. Wagamon has poured numerous hours  into the HEARTS Veterans Museum of Texas. Setting up displays and doing  tours educating visitors and students was a weekly occurrence. In  addition to his work at the museum, he spent many hours and full…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…did back in the  day.\n\nI said that I want to be like that guy, and it was for a lot of  reasons. I just got back from the economic forum out there in  California and saw the museum. I was reminded of what a statesman  leader he was and how he was the right person to work with Tip O'Neill  and our Democratic colleagues to do something really big that hasn't…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…antisemitism is       still present albeit with a small Jewish community. I vividly       recall upon visiting Poland in 2017 and stepping out of the       new state-of-art Polin Museum next to the giant Warsaw Ghetto       Memorial, an Israeli military group getting ready to conduct       a memorial service at the moving site. I introduced myself to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}]