[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…hospital bill 50 times more than she  will make in a single year covered by Medicaid.\n\nThat little boy is now 3 years old, full of life, laughter, and love  and obsessed with music and trucks. He is alive only because Medicaid  was there.\n\nWe cannot forget what is at stake. These are not just numbers on a  page. They are real lives, real children, real…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…May 11. The band was one of 127 that applied this year,  competing with bands from all over the world including Japan and Spain,  and was one of the 30 bands--some trained at music magnet schools or  with private tutors--invited to New York. The Central High students  advanced to the semifinal level where 10 were selected and then was one  of the top…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691133/congratulating-memphis-central-high-school-jazz-band"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…than a week later, my son, Jackson, showed up at school to find  out one of his classmates was dead. He had killed himself accidentally  using a loaded gun as a prop to film a music video. My son was  devastated.\n\nHe was devastated again when 2 months later the school year abruptly  came to an end when Shawn Jackson was shot and killed minutes after  receiving…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…well-rounded education. That is what students need: to improve school  safety and to create better conditions for student learning and  engagement. These grants fund critical music and arts programs and  integrate technology into the classrooms so students can develop  digital literacy skills.\n\nFinally, Adult Basic and Literacy Education grants help provide…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of  different channels have different programs that people become quite  attached to. So there are simply good humor programs that are fun to  listen to, and others are good music programs. But a lot of it is good  news programs--things deeply appreciated throughout the State but often  harder to access in rural Oregon. So I am concerned about this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…family deeply and held his faith close to his heart.  He began serving God early in life at Nichols Chapel AME Church, where  his musical talents flourished. His passion for music led him to serve  as Minister of Music at the church and as a member of the Board of  Trustees.\n\nNone of Cliff's achievements would have been possible without the  love and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…common value  reflected is fiscal unsustainability ranging to irresponsibility. We  need look no further than a mirror for the root cause: our collective  inability to face the music of fiscal responsibility and  sustainability. It is clear that we need additional help to focus our  Nation on the specific issues and collective decision-making required…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689288/introduction-of-the-sustainable-budget-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…K-8 with free breakfast and  lunch. They place a strong emphasis on core subjects, notably English  and math, foreign languages, enrichment classes, ELL, special ed  services, music, arts, after-school, and athletics.\n\nAmani honored four outstanding individuals at their recent gala: John  Howard, Stephanie McCaine, Charles Stern, and Johnayia White. The…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…for the community to enjoy.\n\nSince 2011, Ms. Merkling has been the driving force behind the 4th  Fridays Art Event at The Dole, which brings together photography, art,  and music to enrich the local cultural landscape. Held ten times a  year, this program fosters collaboration among a diverse range of  artists and provides a vibrant social space that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Claudia also founded Rena's New Life Ministry, supporting  underprivileged families through school supply drives, Secret Santa  programs, and scholarships. She preserves gospel music through Quartet  Unstoppable and advocates for the elderly through Patience for  Patients, LLC. Her dedication to service and community makes her a  deserving recipient of…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…healthy and happy. His days include       volunteering at a senior citizen center, working at the local       gym, shopping, leisure activities, speech therapy. He does       music therapy.\n\nWe follow the self-direction model, which is work on my       end, but I would not have it any other way. But if Medicare       funding is cut, these cuts would impact…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…residents.\n\nJust last month, rogue Federal agents descended on the Allston  neighborhood in Massachusetts' Seventh District, a diverse community  that is home to small businesses and music venues that are welcoming to  all. These Federal agents targeted a local car wash to harass and  abduct hardworking community members. Among them were five women who  were…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…their outdoor campus at the  foot of the Rocky Mountains. The staff at Red Rocks Elementary School  go above and beyond by focusing on lessons that integrate art,  technology, music, and the outdoors. This award-winning school has  provided excellent education to children in Colorado and produced  generations of creative and innovative leaders in our state.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692016/recognizing-red-rocks-elementary-school"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…annual festival.\n\nVirginia is home to a vibrant Puerto Rican community, and the  festival celebrates the community's culture and contributions. It  brings in vendors, volunteers, music, and a vibrant community.\n\nThe festival made history in 2023 as the first-ever Puerto Rican  festival in the DMV region. Each year, the festival draws over 10,000  attendees…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692244/recognizing-the-puerto-rican-alliance-of-northern-virginia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…deserved a  choice and that no one should receive a rubber-stamped, gerrymandered  seat in Congress without having to work for it.\n\nHe always fought the good fight. His favorite music was Aaron  Copland's ``Fanfare for the Common Man.'' Steve loved this land and  worked to preserve its future. This was embodied in legislation he  drafted to add an international…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Japan, Hong Kong, China, and  South Korea.\n\nTarquin's journey began at the age of 5 when his mother, who taught  herself to play the violin at age 34, inspired him to pursue music.  Since then, his passion has taken him to venues like the Montana Senate  Chamber where he performed a piece from Mozart's Violin Concerto No. 4  during his time as a page.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693758/recognizing-tarquin-bennion"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Marching Band Southern  Regional Championship.\n\nThe Bobcats broke the program's record for the highest score in a  regular season show. They also brought home the highest score in music  performance, visual performance, general effect, and percussion  performance.\n\nI also congratulate them on coming in as State silver medalists at  the Arizona Marching Band…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699071/catalina-foothills-high-school-boys-swim-team-wins-d2-state-championship"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…service.\n\nAfter earning his bachelor's degree in English Literature from the  University of California, Santa Barbara, Terry became increasingly  drawn to the copywriting and music industry. Born into a family of  salesmen, Terry began his career in broadcast as a sales representative  for two stations in Santa Barbara--99.9 KTYD-FM and 990 KBLS-AM. As…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691791/recognizing-the-service-of-mr-terry-fahy-on-the-occasion-of-his-retirement"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…snacks, laundry, bilingual television, recreation, cultural events, and  individual tutoring for mathematics and social studies. Most  shockingly, it paid for  pet therapy, music therapy, and horticultural therapy for illegal alien  children.\n\nIn 2021 alone, Endeavors paid Christy Merrell, a music therapist,  $533,000 for her services. In addition to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "…and Ranking Member Pallone  for supporting this act.\n\nWe have the opportunity today to vote on legislation centered around  something that brings us all together, and that is music. Today, we  will take the American Music Tourism Act under consideration. It is a  bipartisan piece of legislation that I am proud to have led through the  House alongside…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690269/american-music-tourism-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…musician. Over 8 weeks, Sorren  rehearsed and performed with the Pittsburgh Symphony Orchestra, gaining  valuable experience. This, no doubt, will shape his bright future in  music education and conducting.\n\nThrough his dedication to the Brookfield orchestra, the PMEA  festivals, and the Venango Symphony, Sorren has set an example of what  passion, discipline,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689957/recognizing-sorren-morelli"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…a spirited donkey, always accompanied by his loyal  German shepherd. His favorite horse, Duke, reflected Bob's own gentle  strength.\n\nToday, we celebrate a life of service, music, and quiet devotion, a  life that touched all who knew him.\n\nRecognizing Chiefs of Police Robert Butler and Edward Kinney\n\nMr. MILLER of Ohio. Mr. Speaker, today, I rise to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…while he was in high school. He also  served as a cadet in the Civil Air Patrol, the civilian auxiliary of  the United States Air Force.\n\nBart attended Tyler Junior College on a music scholarship, where he  played in the school's band and performed at high-profile events,  including the Cotton Bowl, as well as Dallas Cowboys games. He later  transferred…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Chesney. Today  is his birthday, Mr. Speaker, and I can't think of a more fitting  birthday present for Kenny than the announcement that he will be  inducted into the Country Music Hall of Fame.\n\nHe was born in Knoxville. Kenny is a graduate of Gibbs High School,  which is not a mile from my house, where he had a storied career in  baseball and football.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689157/recognizing-kenny-chesney-on-his-birthday"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Herzog, and our own Ambassador Mike Huckabee. Each visit  afforded a deeper understanding of the enduring bond between our  nations.\n\nOur delegation visited the site of the Nova music festival, where  Hamas terrorists carried out one of the most horrific attacks on  October 7.\n\nThe trip was both sobering and inspiring. It reaffirmed my conviction  to stand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695802/reflecting-on-trip-to-israel"}, {"senator": "John Rose", "party": "Republican", "sentence": "…treasure that I have the privilege to represent here in Congress. This  year marks 100 years since the Grand Ole Opry first introduced  audiences around the world to country music and to Nashville,  Tennessee.\n\nMy home State of Tennessee is known for many things. If I had to list  some of the most prominent, I might think of the Great Smoky Mountains…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689807/congratulating-the-grand-ole-opry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Madam Speaker, I move to suspend the rules and pass  the bill (H.R. 617) to amend the Visit America Act to promote music  tourism, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 617\n\nBe it enacted by the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…lessons from nature and 2 books on nature.\n\nIn 2010 during a short interim at Faith Lutheran in Valley       City, Jim met Carol Winter, also widowed, with a heart for       music ministry through her singing. The LORD had a plan for       Jim and Carol. After a brief courtship, they were married in       the Chapel at Mount Carmel Family Bible Camp…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…million people who illegally crossed into our country during Biden's  term in office.\n\nTaxpayer-funded awards paid for illegal aliens' housing, healthcare,  education, even music lessons, therapy. You name it, the taxpayer  covered it.\n\nUsing NGOs as a proxy, the Biden administration sent a clear message  that our laws were not to be taken seriously,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…events. He was known for his generosity, kindness, and  willingness to help others, always offering a listening ear and  thoughtful advice.\n\nJoe found joy in family, good friends, music, cycling, and long walks  on the beach with his dogs. His legacy of service, faith, and love for  his community will continue to inspire all those who knew him.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}]