[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…drugs. These are the bullet points he said that we should do, imploring  Congress: Don't just do what you have already done. Do something more.  Give law enforcement officers naloxone to reduce overdoses; education  for fifth and sixth graders; ensure the continuity of care and  successful reintegration of people who are returning to the community  from…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…oversight where drugs may also be present.\n\nThis bill requires the Coast Guard to update its policy on carrying  and utilizing medications to treat drug overdoses such as naloxone.\n\nFurther, the bill ensures access to these medications at every  installation and operational unit. As we all understand, handling drugs  like cocaine and fentanyl is an…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692170/controlled-substance-onboard-vessels"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…needs access  to technology and resources to quickly and efficiently detect these  drugs. This includes expanding nonintrusive inspection capabilities,  making lifesaving Naloxone widely available, and adequately funding  State and local law enforcement.\n\nI am also gravely concerned about the negative impact of President  Trump's recent order diverting…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…treat the  opioid crisis like the public health crisis that it is.\n\nMy bipartisan RECONNECTIONS Act will do that by helping get overdose  education and prevention tools like naloxone into the hands of those  who need it. I am proud that my commonsense bill is included in the  SUPPORT for Patients and Communities Reauthorization Act of 2025.\n\nIt is great…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691877/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…servants need to be fired at SAMHSA  before we say enough? How many suicide prevention trainings need to be  canceled before Republicans can speak out? How many lifesaving naloxone  trainings need to be canceled for Republicans to say anything? How many  lives need to be lost before Republicans tell the Trump administration  to stop the decimation of…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691882/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…cases where illicit drugs are discovered on unmanned vessels or  smuggled onboard without the knowledge of the crew.\n\nThis bill also ensures that Coast Guard facilities have naloxone and  other similar medications on hand to treat overdoses, bringing the  Coast Guard in line with other branches of the military.\n\nBy giving our coastguardsmen and -women…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692171/controlled-substance-onboard-vessels"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…and Communities Reauthorization Act  of 2025, we are reauthorizing prevention programs and recovery services  and ensuring that first responders can access and administer Naloxone.  We are ultimately restoring hope and healing by putting a stop to drug  overdose and poisoning.\n\nMr. Chair, I thank Chairman Guthrie for his work on this important  issue,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691872/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…foundations. Sec. 269. Concurrent jurisdiction at Coast Guard Academy.                      Subtitle F--Reports and Policies  Sec. 271. Policy and briefing on availability of naloxone to treat                opioid, including fentanyl, overdoses. Sec. 272. Policy on methods to reduce incentives for illicit maritime                drug trafficking. Sec.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…are facing an epidemic of fentanyl overdoses in this  country and this bill provides meaningful steps in countering them. The  programs that this bill reauthorize provide naloxone for first  responders, funding for prevention programs, funding for treatment  programs, funding for recovery services, and the efficacy of these  programs  is shown in the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691879/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…semicolon; and\n\n(4) in paragraph (3) by inserting ``while on board a       covered vessel'' after ``such individual''.       SEC. 2. POLICY AND BRIEFING ON AVAILABILITY OF NALOXONE TO                     TREAT OPIOID OVERDOSES.\n\n(a) Policy.--Not later than 1 year after the date of       enactment of this Act, the Commandant of the Coast Guard       shall…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "John James", "party": "Republican", "sentence": "…more that we have to do.\n\nThe SUPPORT for Patients and Communities Reauthorization Act of 2025  plays a critical role by ensuring first responders have access to  lifesaving naloxone, increasing treatment options, and bolstering  support services.\n\nI am especially pleased to see that provisions of my Road to Recovery  Act were included in this SUPPORT…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}]