[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "Ms. McBRIDE. Mr. Speaker, I rise today to congratulate Lieutenant  Colonel Chaplain Reverend Dr. A'Shellarien Addison on her recent  promotion at the Delaware Army National Guard.\n\nEarlier this month, I was honored to attend her promotion ceremony  and celebrate her historic role as the first woman to hold this rank at  the Delaware National…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…included in their reconciliation package a  provision that calls for the elimination of registration and ownership  requirements for silencers that have been in place since the National  Firearms Act went into effect in 1934.\n\nBy contrast, when House Democrats were in the majority in the 117th  Congress, the Congressional Black Caucus was instrumental in…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…scientist, in their own words, said:\n\nI was a biologist for the U.S. Geological Survey. I       conducted wildfire and fuels-related research in Sequoia and       Kings Canyon National Parks, working closely with park       managers to improve the fuel management plan.\n\nScience is the foundation of American leadership and security. These  firings must be…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688224/fired-by-president-trump"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…knowledge is incredibly impressive.\n\nI am proud to report that both top teams are from public high schools  in Oregon. Lincoln High School and Sprague High School won the national  competition in Virginia after competing at the State level and then  spending 3 days here in the D.C. metro area at the finals answering  tough questions with confidence,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…of any       funding for the Corporation for Public Broadcasting for any       broadcasts and media stations that disseminate information       during natural disasters and national emergencies.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693627/hr-4"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…wrote about this in  his book called ``A Sacred Oath,'' and he talked about some of the  things President Trump asked him to do.\n\nPresident Trump wanted him to send in not the National Guard but the  82nd Airborne--an Active-Duty military unit, one of our most elite, a  large unit--to quell protests here in Washington, DC. He asked for them  to be moved…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…First Amendment protects you anymore.  Don't think that you have a right to speak what your opinion is.\n\nThe FCC was created to ensure that the public airwaves--our shared  national resource--are used in the public interest. It was not created  to dictate what late-night hosts may joke about. It was not created to  punish networks for broadcasting opinions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…conserve rangelands,  grasslands, and forests, provide services to veterans, and fund public  safety services. Rural communities and food producers are left  vulnerable. Our national parks and forests are in disarray, and our  local economies are suffering.\n\nAt the same time, mass firings are stripping thousands of dedicated  Federal workers of their livelihoods.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…hockey team in the world.  However, through steadfast commitment, grit, hope, and determination,  the U.S. team emerged victorious and established a much-needed sense of  national pride across this country.\n\nEven decades later, I hope that these themes can continue to inspire  us to confront the difficult challenges that we face as a nation today.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690278/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…our global leadership, this  administration is slashing funding to our science agencies and firing  Federal scientists. The President is proposing a $4.9 billion cut to  the National Science Foundation. That is on top of over $1 billion in  grant funding that this administration has already terminated. At least  $100 million in grant funding was cut from…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…functional commission of the United Nations, dedicated  to shaping global standards on gender equality and the advancement and  empowerment of women and girls. Each year, national representatives of  Member States gather for a two-week session to evaluate progress on  gender equality, identify challenges, set global standards, and  formulate concrete…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688693/recognizing-girl-scouts-of-san-jacinto-county-texas-at-the-united-nations-69th-commission-on-the-status-of-women"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…applied for a mineral withdrawal of  the Rainy River Watershed--the watershed is up here--which is the  headwaters that flows into the Boundary Waters Wilderness and Voyageurs  National Park. It started a 2-year environmental study, which included  extensive public input and scientific review.\n\nWhile the Rainy River Watershed was being studied, Paradise Valley…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…communities, elected officials, and Department of State  leadership, the agency's staff helped reduce backlogs, protect against  fraud, and strengthen processes essential to both national security and  individual liberty.\n\nThe economic and cultural impact of the Boston Passport Agency's work  reverberates far beyond the walls of its office. By powering  international…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…instantly offered their resignation for having  violated the law, contravened common sense, and put American troops in  harm's way.\n\nLet me put it this way: Not only did the National Security Advisor  set up an illegal, unsecured chat with the Secretary of Defense, the  CIA Director, the Vice President, and others to discuss highly, highly  sensitive and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…pediatric cases have a survival rate  of less than the average school year. We have the responsibility and  opportunity to try and change that. Echoing what David Arons, of the  National Brain Tumor Society, stated, ``now is the time to build on  government support for research and access to care for cancer  patients.''\n\nDuring this Childhood Cancer Awareness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…investment in the F/A-XX.\n\nFinally, I am humbled to be standing here in the well of the House  representing the patriots of Texas' Sixth, Americans who believe in a  strong national defense.\n\nThis bill makes smart investments in defense, in America's might, and  the prevention of war, but, if necessary, winning it.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…better understand their effects on human health.\n\nIn 2023, more than 100,000 people nationwide, including 2,190 from my  home State of Indiana, died from a drug overdose. National numbers from  the same year indicate that approximately 75,000 people died an  overdose death related to synthetic opioids. Fentanyl deaths account  for as much as 77 percent…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…not commodities to be sold on the global market. We  can't and won't make everything here, but we must recover the will and  the ability to make the vital necessities of our national life. Our  country now depends on foreign imports for most of those necessities.\n\nBy a nearly 2-to-1 ratio, more Americans now work in government than  in manufacturing. Nearly…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rise in support of this Congressional Review Act  resolution, which would overturn the Biden administration's reckless  withdrawal of more than 225,000 acres in the Superior National Forest  from mineral exploration and development.\n\nMr. Speaker, at issue is the Duluth Complex in northern Minnesota,  one of the largest mineral deposits on the planet, including…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…available services with their Ohio CareLine available 24 hours  a day and 7 days a week to offer emotional support. By simply dialing  988, anyone in our Nation can access the national mental health  hotline, which offers free and confidential support from trained  counselors around the clock.\n\nI thank our local mental health providers, support workers,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, I rise today in support of S. 222, the  Whole Milk for Healthy Kids Act of 2025.\n\nFor nearly 80 years, the National School Lunch Program has provided  low-cost or free lunches to children each school day. We know that  healthy diets can improve student success both in and out of the  classroom.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Res. 61) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Environmental Protection Agency relating to ``National  Emission Standards for Hazardous Air Pollutants: Rubber Tire  Manufacturing'', and ask for its immediate consideration.\n\nThe Clerk read the title of the joint resolution.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…part of the planning area covers the traditional lands of  the Inupiat people in the Arctic Slope Region.\n\nThis vast area includes enormous critical mineral potential of  national and strategic importance. As our geostrategic adversaries  continue to place tighter controls on minerals essential for defense,  advanced technology, and manufacturing, America…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "John James", "party": "Republican", "sentence": "…Recovery Act  reauthorizes lifesaving resources vital to addressing opioid addiction  and substance abuse across the country.\n\nIt provides critical resources for SAMHSA's National Helpline, a  free, confidential, 24/7, 365-day-a-year treatment referral and  information service for individuals and families facing mental and/or  substance use disorders.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…able to build resilience. We were able to keep those  homes from flooding in the first place. This is the type of work that  we need to do. And if we do it, then never is a National Flood  Insurance Program claim filed.\n\nThe family saves; the taxpayer saves. Investing now saves money down  the line.\n\nThat is why back in 2018, during President Trump's…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…America from California  amid a wave of teacher strikes and a heated debate over charter schools  in the Nation's most populous State.''\n\nThe article goes on to say that ``the national nonprofit and its  recruits,  promising college grads eager to teach in poor communities, in the  crosshairs of the State's supermajority Democratic legislature.''\n\nWhy in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "French Hill", "party": "Republican", "sentence": "…low-risk decisions for the benefit of this trout fishery.\n\nIt also prevents the need for new and required equipment,  environmental reviews, such as those required under the National  Environmental Protection Act, and changes to the current water control  plan.\n\nMr. HILL of Arkansas. Mr. Chair, additionally, this program would  build upon the previous…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…as a proud Army dad, I know the sacrifices made by our  servicemembers and their families.\n\nIn Congress, I remain committed to supporting legislation that  strengthens our national defense and honors the men and women who wear  the uniform.\n\nMr. Speaker, I wish a happy 250th birthday to the United States Army.  May their legacy of service continue for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…House on  Monday. He assembled Senator Hagerty and I and some of the Federal  Agencies in the Oval Office to sign an Executive order and to announce  the deployment of the National Guard to Memphis.\n\nIt is going to be several Federal Agencies that are going into  Memphis. Now, the reason for this is that Memphis has had the highest  crime rate in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…President Trump and House Republicans in charge, those days are  over with now.\n\nThe REFINER Act offers a commonsense solution to this critical issue.  This bill requires the National Petroleum Council to submit a report to  Congress analyzing the capacity of American refining and recommending  how we can increase our refining capacity.\n\nThe American people…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}]