[{"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…rise today to congratulate  Danny Miller on his retirement as Co-Executive Producer for WHYY's  Fresh Air with Terry Gross & Tonya Mosely, one of the most successful  national public radio shows in the Nation.\n\nMiller, who joined the Fresh Air team in 1978 as an intern, has been  an integral part of the show's tremendous growth, now reaching over 6  million…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…two major elements. One element was foreign  aid, humanitarian assistance around the world paid for by the United  States. The other element was public broadcasting--National Public  Radio, for example. So $8 billion was taken out of foreign aid, and $1  billion was taken away from public broadcasting.\n\nIt was a close vote in the Senate. Two Republicans…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…legitimize and validate the views of this man.\n\nMr. Martin's weak protests that he didn't know anything about what  his views really were were debunked not only by National Public Radio  but by the record of Martin's involvement with other extremists.\n\nFor example, Mr. Martin has also praised Jack Posobiec, an anti- Semitic conspiracy theorist with…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Adams, Douglas: PBS NewsHour; Adams, Jacob: THE DAILY       SIGNAL; Adams, Jonas: NATIONAL PUBLIC RADIO (NPR); Adams,       Kimberly: MARKETPLACE RADIO; Adams, Lori: FOX NEWS; Adkinson,       Nicholas: ABC NEWS; ADLERBLUM, ROBIN: ABC NEWS; Adly, Jill:       NEXSTAR MEDIA…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…LGBTQ in Africa; cut  $10 million for male circumcision in Mozambique; cut $20 million for  the Arab ``Sesame Street'' in the Middle East; and we cut $600 million  from National Public Radio. Free enterprise in America is alive and  well.\n\nPresident Donald Trump is the President of peace, ending eight wars  in 8 months. Tell me who in history has ever done…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}]