[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…over 100 years, including 163 Nobel       laureates, 214 winners of the Lasker-DeBakey Clinical Medical       Research Award, and more than 200 members of the U.S.       National Academies of Science and Medicine. Non-scientists       like myself are essential to NIH's day-to-day operations and       key to understanding the institution's history and mission.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. Speaker, I rise to express my support for H.R. 530, the ACES Act,  as amended, a bill that would task the National Academies of Sciences,  Engineering, and Medicine with studying the frequency and mortality of  cancer among individuals who served as air crew in the Armed Forces.\n\nI can't help…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…a key role in  removing state barriers to NP practice. Dr. Ferrara has been recognized  for his leadership as a Fellow of AANP, the American Academy of  Nursing, the National Academies of Practice and the New York Academy of  Medicine.\n\nThe American Association of Nurse Practitioner is the largest  professional membership organization for nurse practitioners,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…work with you if this bill advances out of Committee. We       encourage Congress to pursue avenues such as conducting       hearings or requesting a study from the National Academies of       Sciences, Engineering, and Medicine to provide clear guidance       around the use of force against youth. We are happy to meet       any time with your offices…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Panetta) in the House and by Senators Kelly and Cotton in the  Senate, is critically necessary.\n\nThe ACES Act directs the Department of Veterans Affairs to partner  with the National Academies of Sciences, Engineering, and Medicine to  conduct a comprehensive study on the prevalence and causes of cancer  among military aviators. We need to know the why, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…has been an active member for his community, serving on the  board of directors at the Pierre Claeyssens Veterans Foundation in  Santa Barbara and has served with the National Academies of Science and  Engineering.\n\nMr. Speaker, I encourage my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. Speaker, I encourage my House colleagues…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697744/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (S. 201) to provide for a study by the National Academies of Sciences,  Engineering, and Medicine on the prevalence and mortality of cancer  among individuals who served as active duty aircrew in the Armed  Forces, and for other…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…this Act, the Director of the National Science       Foundation (in this section referred to as the ``Director'')       shall seek to enter into an agreement with the National       Academies of Sciences, Engineering and Medicine (in this       section referred to as ``NASEM'') (or if NASEM declines to       enter into such an agreement, another appropriate…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 530) to provide for a study by the National Academies of  Sciences, Engineering, and Medicine on the prevalence and mortality of  cancer among individuals who served as Active Duty aircrew in the Armed  Forces, and for other…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…``(3) A description of the manner in which each such       agreement is advancing scientific research and applications,       including priorities recommended by the National Academies of       Sciences, Engineering, and Medicine decadal surveys.\n\n``(4) Information specifying whether the Administrator has       entered into an agreement with a commercial…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…unmanned aircraft systems capabilities study. Sec. 338. Comptroller General report on Coast Guard acquisition and                deployment of unmanned systems. Sec. 339. National Academies of Sciences report on unmanned systems and                use of data. Sec. 340. Unmanned aircraft systems.                         Subtitle E--Other Matters  Sec. 341.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]