[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…scientific research enterprise.\n\nFor the science enthusiasts watching at home, allow me to clarify  that, yes, we support our national scientific research enterprise, our  National Science Foundation, and our National Institute of Standards  and Technology.\n\nIn this country, we also have the National Institutes of Health. Some  of us are old enough to remember…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…of the lies about Project  2025 and its antiscience agenda; enough with the dismantling of the  National Institutes of Health, the Centers for Disease Control, and the  National Science Foundation; enough with canceling grants for medical  research and STEM programs that ensure our country stays safe and  globally competitive; enough with pedaling disinformation…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Homeland Security.\n\nThis funding prohibition is similar to those found for the Department  of Defense in the 2019 and 2021 National Defense Authorization Acts and  the National Science Foundation in the CHIPS and Science Act of 2022.  However, the restrictions in those measures were limited to  universities with Confucius Institutes only, and the ban…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…and  research advocacy. Let us do it in the purest sense.\n\nNew York's 20th Congressional District has felt the effects of these  attacks firsthand. Over $715 million in National Science Foundation  grants have been terminated in New York's 20th Congressional District  alone, including a $1 million award to the University at Albany's  Project SAGES.\n\nProject…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…this House are launching a full scale  assault on our Nation's ability to think, learn, and to innovate.\n\nLet's look at the facts. Trump's budget cuts funding for the National  Science Foundation, National Institutes of Health, STEM education, and  even basic K-12 public schools. He has tried to crush public service  loan forgiveness and gut Head Start,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…hopefully, pass in the House, and we eagerly await the Senate  to take it up.\n\nSimply put, H.R. 1350 authorizes collaborative research between the  Department of Energy and the National Science Foundation in areas that  are essential to our national competitiveness. This legislation will  build on the longstanding partnership between the Department of Energy…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…signing  our discharge petition to protect Medicaid for their constituents and  healthcare for children, seniors, and the disabled in their district.                         National Science Foundation\n\nMs. RIVAS. Mr. Speaker, this week we should be celebrating the 75th  anniversary of the National Science Foundation and the countless  investments it has made…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…is at risk.\n\nAmidst the Republican assault on science, I am going to focus my  remarks tonight mainly on the NSF.\n\nOn May 10, we celebrated the 75th anniversary of the National Science  Foundation. Today, together with my fellow Representatives  Don Beyer,  Dr. Scott Franklin, and Haley Stevens, we introduced a House resolution  to celebrate that anniversary.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Leinen has also served as the U.S. Department of State's science  envoy for the oceans to Latin America and the Pacific and as assistant  director for geosciences at the National Science Foundation. I have  enjoyed working with her and learning from her at the U.N. climate  change conferences, or COP.\n\nDr. Leinen's work has left an extraordinary mark on…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…really appreciate it.\n\nMr. Speaker, I rise today in strong opposition to the Trump  administration's attack on our scientific workforce and on science,  specifically at the National Science Foundation, located a few blocks  from my home.\n\nToday, my colleagues and I introduced a resolution commemorating the  75th anniversary of the National Science Foundation.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…and Statistical Modeling Education Act is just one  answer to this challenge. It is a bipartisan bill, and it directs $10  million of already-appropriated money to the National Science  Foundation for a grant program that will support the modernization of  mathematical and statistical modeling for education across this Nation.\n\nAs a former educator myself…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…unauthorized access  or disclosure of sensitive information.\n\nAdditionally, this bill would task the Government Accountability  Office to assess DHS' adherence to the National Science and Technology  Council's 2022 implementation guidance and a 2021 National Security  Presidential Memorandum focused on safeguarding U.S. research from  foreign interference.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688735/research-security-and-accountability-in-dhs-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…what's going on here. Elon Musk and the so- called Department of Government Efficiency are using the Federal  Government to settle scores: cancer trials, nonessential; national  science databases, too expensive. That is not policy. It is a crusade  against expertise.\n\nLast month, I sat down with five undergraduate researchers at UC  Riverside. They are…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…future.\n\nScience is not political. It serves all people, regardless       of race, background, or party affiliation.\n\nYes, funding cuts to Agencies like NIH and the National Science  Foundation threaten to halt critical research, slowing the development  of treatment for diseases that impact millions. These cuts will push  out brilliant young scientists,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…scientist, and a constituent of mine, who has witnessed the impacts of  President Trump and Elon Musk's recent firings. He wrote:\n\nThis week, 168 of my colleagues at the National Science       Foundation were fired in a mass meeting and then waited for       hours for an email with instructions before they were removed       from NSF systems.\n\nTwo in my…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688192/fired-by-president-trump"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…reasons for       continued participation in modeling challenges.\n\n(b) Definitions.--In this section:\n\n(1) Director.--The term ``Director'' means the Director of       the National Science Foundation.\n\n(2) Federal laboratory.--The term ``Federal laboratory''       has the meaning given such term in section 4 of the       Stevenson-Wydler Technology Innovation…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "Mr. BABIN. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1350) to provide for Department of Energy and National Science  Foundation research and development coordination, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise in support of the Department of Energy  and National Science Foundation Interagency Research Act, and I thank  Congresswoman Haley Stevens for working with me on this bipartisan  bill.\n\nThe Department of Energy and the National…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688988/doe-and-nsf-interagency-research-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…areas listed in the Critical and Emerging Technologies List       developed by the Fast Track Action Subcommittee on Critical       and Emerging Technologies of the National Science and       Technology Council, including any updates to such list.\n\n(5) Foreign terrorist organization.--The term ``foreign       terrorist organization'' means an organization…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…This bill will  allow us to modernize math curricula and improve K-12 science,  technology, engineering, and mathematics (STEM) education.\n\nWhile this bill directs the National Science Foundation to grant  awards to educational institutions, it does not award any new funding.  As we look at reining in the out-of-control government spending and  bureaucracy,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688977/mathematical-and-statistical-modeling-education-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Kansas and manufacturers in my State can compete  and sell their goods around the world.\n\nFinally, this bill invests in our Nation's science Agencies--NASA,  NOAA, and the National Science Foundation--to advance U.S. leadership  in scientific discovery and space exploration. At NASA, it bolsters  American leadership in human spaceflight, space science, and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Speaker, I rise today to recognize and  congratulate the Pullman High School's science bowl team for their  outstanding performance in the U.S. Department of Energy's National  Science Bowl held in Washington, D.C., on April 28.\n\nRepresenting eastern Washington, these exceptional students, Sahil  Ganjyal, Jack Carper, Leon Liu, Kevin Chi, and Nathan…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690876/congratulating-pullman-high-schools-science-bowl-team"}]