[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…And, again, it is based on a lie.\n\nI bring to this body my 6 years of experience administering elections  not just in any State but the most populous State in the Nation, with  the largest number and the most diverse number of voters in the Nation.  I understand the complexities of both keeping our elections free and  fair but also secure. And I am…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…alarming rate. These projects include lifesaving research on early  breast cancer detection and so much more. Trump even shut down the  Women's Health Initiative, our Nation's largest and most consequential  women's health study.\n\nMillions of women's lives are at stake. That is why I led my  Democratic Women's Caucus colleagues in demanding that Trump…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…bank Morgan Stanley have all reported that most of the President's  tariffs are being absorbed by American companies, small businesses, and  consumers.\n\nIndeed, our Nation's two largest auto manufacturers, General Motors  and Ford, have each reported billions of dollars in new tariff-related  costs. Nike told its investors it will pay $1.5 billion in…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…means making sure the agency is fully staffed and fully  funded. That means answering the phones.\n\nUnfortunately, the administration is doing the opposite, gutting our  Nation's largest emergency management agency.\n\nAs a New Yorker, I saw the flooding in Texas and immediately thought  of hurricane season on the East Coast. It has been a few years since…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693988/fema-cuts-and-hurricane-season"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Street, not the average American.\n\nMr. Chair, if Republicans pass this resolution today, we will be  forced to cut a minimum of nearly $1 trillion from Medicaid, our  Nation's largest healthcare program.\n\nFor those who are saying that somehow the Medicaid program has a lot  of waste, let me remind us that Medicaid is the leanest Federal  healthcare…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688050/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…was funding for a project that had bipartisan support and passed in a  Republican-majority House. It is a piece of one of the largest  infrastructure projects in the Nation and the largest in the history of  upstate New York. That is the reimagining of Interstate 81.\n\nThat money was meant to build roads and sidewalks, reconnect  utilities, and restore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Tennessee Valley Authority.\n\nI thank Representatives Cohen and Burchett of Tennessee for their  leadership on this bill and their tireless work to improve the TVA.\n\nTVA is the Nation's largest government-owned wholesale power  producer, supplying power to 10 million people across the States of  Tennessee, Mississippi, Alabama, Georgia, North Carolina, Virginia,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692214/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…agents detained a sick 7-year-old and her parents in  an urgent care parking lot while they were trying to get her medical  attention.\n\nThen they sent that child to the Nation's largest family detention  facility, recently reopened by Trump, a facility where families report  there is contaminated food, limited access to clean water, and where  there have…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…in agriculture, but a  good friend of mine. He was a leader who was well respected throughout  the country. John shaped the Harris Ranch and turned it into one of the  Nation's largest beef producers in America.\n\nIn addition, his passion was as a leader in the horseracing industry  in which his horses were successful and won on numerous occasions.\n\nJohn…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…facilities in the country, giving a green light for  polluters to pump more cancer-causing pollutants into the air we  breathe.\n\nWithout these safeguards, nearly 2,000 of the Nation's largest  polluters would get a free pass. Oil refineries, chemical  manufacturers, pesticide producers, they would all be allowed to shut  off their pollution controls and start…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Courage  Award and the Woman of Valor award from the New York Board of Rabbis.\n\nPerhaps most widely known is Anita's creation of the Reel Abilities  Film Festival, the nation's largest showcase of films by and about  people with disabilities. Through ReelAbilities, Anita helped elevate  underrepresented voices, challenge public perceptions, and promote…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691706/recognizing-anita-altman"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…corporations in the country are taking  advantage of it, all while Americans are paying more for less due to  corporate price gouging and shrinkflation while the CEOs of the  Nation's largest grocery stores and supermarkets rake in record  salaries.\n\nI just came from a congressional hearing of our Democratic Steering  and Policy Committee on food prices and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…about a cost to  Americans' health and safety.\n\nThis bill allows FERC to override regulations established by other  agencies. This is the Christmas gift to some of the Nation's largest  polluters. Think about that. FERC, which has no expertise in public  health or environmental protections, would just be able to stop another  agency's regulation meant…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…better, how could  we not take the opportunity to do that?\n\nMr. McGOVERN.  Wasserman Schultz).\n\nMs. WASSERMAN SCHULTZ. Mr. Speaker, I rise to insist that we pull our  Nation back from the largest-ever, Republican-forced loss of healthcare  in our history.\n\nThese catastrophic coverage cutoffs and massive premium hikes will  hammer millions of us back in Florida,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Dr.  Hayden is a model public servant who led the Library with dignity and  professionalism for 8 years.\n\nDr. Hayden was the first professional librarian to oversee our  Nation's largest Library, and, yes, I still have too many overdue  Library books.\n\nI worked with Dr. Hayden during the dark days of COVID-19 to help  Michigan, to preserve the history,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…competitors do not eclipse us.  Additionally, by authorizing this interagency collaboration, we  maximize our investments to maintain our competitive edge.\n\nDOE is our Nation's largest supporter of basic research in physical  sciences, while NSF is the backbone of the collaborative research  environment between government and academia. Together, these…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…reasons, we must ensure our  maritime infrastructure is not only state of the art and efficient but  also secure from foreign threats.\n\nUnfortunately, too many of our Nation's largest ports rely on ship- to-shore cranes manufactured by Chinese state-owned companies with  Chinese-owned software. Reports indicate the software used in these  cranes can…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…In just the past 5 years,  over $100 billion in private capital flowed to our defense  technologies, signaling that our best innovations and our ability to  solve our Nation's largest security strategies happen not just in this  Chamber but across the whole Nation.\n\nThese new entrants need a welcoming defense environment, something  the Department of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Chairman, there was silence in the room because it is not 5,000  companies, it was 3,700. Why? It is because we don't have enough  qualified public companies in this great Nation--the largest economy in  the world--to have 5,000 public companies in the Wilshire 5000.\n\nTonight we do something about that. We make it easier to be a public  company in America.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…remain separated by a system that tears apart communities and crushes  basic human dignity.\n\nNow more than ever, as socialist ideas gain traction here at home-- and as our Nation's largest city and financial capital has elected not  just a socialist, but a communist as mayor--we must firmly demand our  capitalist free market system, which empowers Americans…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…after  President Trump signed it, the NCAA, which oversees more than 530,000  student athletes, announced that it would comply with the order.\n\nFor more than a decade, the Nation's largest athletic association  allowed men to compete in women's events. It will be a top priority of  mine to ensure that this injustice never happens again and that the  NCAA…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}]