[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the District of Columbia  National Guard Home Rule Act, which would give the mayor of the  District of Columbia control over the D.C. National Guard.  Representative Jamie Raskin is the co-lead of this bill in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…implications. It causes problems. We are supposed to do our oversight  for a reason.\n\nSome of those problems are borne out in a variety of different ways.  We have the National Guard engaged in domestic law enforcement all  across this country. They are not trained for that. They are not  supposed to be doing it. It is a violation of the Posse Comitatus…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…What he did was deploy ICE to make mass arrests and terrorize  families in Los Angeles.\n\nWhen people went to go exercise their First Amendment rights, he  deployed the National Guard and then the United States Marines against  the American people.\n\nThis is not only a distraction, this is a direct abuse of power  because the reality of what was actually…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…has diverted military resources away from numerous--numerous-- critical missions for his chaotic and violent mass deportation  campaign. He has federalized and deployed National Guard troops in  American cities against our own citizens in violation of the law.\n\nThat is why just last Friday the Ninth Circuit Court of Appeals  ordered National Guard troops…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…credits.\n\nBut maybe most alarmingly--most alarmingly--as is visible in the  streets of Oregon, California, Chicago, Los Angeles, is the deployment  of our military, our National Guard.\n\nThe Senator from Oregon has spoken so powerfully and eloquently to  bring a critical lens to this desecration of democracy and the impact  on our military itself, because…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Trump administration's request to stay a  temporary restraining order issued by U.S. District Judge April Perry,  which had blocked Trump's unnecessary deployment of the National Guard  in Chicago.\n\nIn that unsigned order, the majority of the Supreme Court wrote,  ``The Government has failed to identify a source of authority that  would allow the military…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…honor Major General Laura  Clellan of Broomfield, Colorado, on the occasion of her retirement  following 36 years of service to the United States Army and the  Colorado National Guard.\n\nMajor General Clellan began her military career in 1989, when she was  commissioned as a Military Police Officer. Over the next three decades,  she would shape readiness…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…stripped away balance and accountability.  They denied Democrats and, by extension, our constituents the chance to  openly debate  issues that demand answers, like the National Guard in our streets, the  purges at the Pentagon, or the abuse of Trump's unilateral military  force abroad.\n\nNot surprisingly, not one of the ten amendments I submitted were…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, in just 1 week, this administration has  conducted raids into my community to meet arbitrary deportation quotas.  They have unnecessarily sent National Guard and marines, which have  only inflamed peaceful protest, and they have thrown down to the ground  a U.S. Senator, my U.S. Senator, and handcuffed him for trying to ask…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692443/californians-should-continue-to-peacefully-protest"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…served, both  officially and unofficially, facing off against America's enemies.  Today, women make up nearly 18 percent of the Active-Duty force and 22  percent of our National Guard and Reserve.\n\nStudies prove that their service improves innovation and mission  outcomes, making our military stronger, smarter, and more prepared to  face the challenges…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that is  certainly possible due to the amount of time--there has not yet been a  decision by the district judge to dissolve the second temporary  restraining order. So the National Guard has not been federalized and  able to deploy.\n\nBut it was going to depend on what happened at midnight last night,  in which the district judge had said: I want to see…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…goals of  which have also not been adequately explained to Congress.\n\nSecond, the President has circumvented the authority of several state  governors and federalized the National Guard for the purposes of  deploying them in support of domestic law enforcement activities.  Domestic policing is not among the National Guard's core missions, and  the Posse…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…global War on Terror.\n\nWhen I was Governor of Virginia, I had the honor and responsibility-- but it was also a burden--of being the commander in chief of the  Virginia National Guard. That meant that I was with our Guard men and  women when they deployed to Iraq and Afghanistan and when they came  home. I went to funerals. I went to wakes. These were…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…the work of the JCCIC and the  department's inaugural task force, commanded by Inspector Mike  Spochart. I want to thank Captain Patton, the inaugural task force, the  National Guard, and the entire law enforcement and security partnership  which makes up the Washington Metropolitan Area's National Special  Security Event Executive Steering Committee.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…They erected gallows. They erected gallows on the Capitol lawn to hang  the Republican Vice President of the United States, and so stated.\n\nUnlike the past few months, the National Guard was nowhere to be  found. Donald Trump had every opportunity to restore order. The  Republican leader of this House, Mr. McCarthy, called the White House  and said: Mr.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Charge (NCOIC), Platoon Sergeant, First  Sergeant, Army Instructor, and Public Affairs NCOIC. He served in  multiple units, including the 138th Signal Battalion (Indiana National  Guard), Delta Company 44th Signal Battalion, 50th Military History  Detachment, Army Space Command, 91st Training Division, 5th armored  Brigade, 99th Regional Support Command,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, I rise today with a heavy heart. Last  Wednesday, the Nation witnessed a heartbreaking and senseless act of  violence involving two members of our National Guard from West  Virginia, Specialist Sarah Beckstrom and Staff Sergeant Andrew Wolfe.\n\nSpecialist Beckstrom gave her life in service to our country. She  wore our Nation's uniform…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…completely understaffed police department.\n\nThankfully, in August, President Trump initiated a Federal takeover  of the Metropolitan Police Department and deployed the National Guard  to confront this massive crime crisis. Since then, violent crime has  dropped by 30 percent. Even D.C.'s Democrat Mayor Muriel Bowser has  acknowledged fewer homicides…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…President, we heard so much over the weekend from  Tennesseans who were reaching out, just so saddened by the series of  truly devastating attacks we saw in Syria. Two of our National Guard  members from Iowa lost their lives. Indeed, we know that right now,  President Trump and Senators Grassley and Ernst are out at Dover to  meet with those families. These…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…that pays our soldiers in the United States Army,  providing $54.5 billion in military personnel funding to support  Active-Duty soldiers, 172,000 reservists, and 328,000 National Guard  members.\n\nA ``yes'' vote enables us to consider legislation that pays our  sailors in the United States Navy, delivering $40.5 billion to support  344,600 Active-Duty…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…time.\n\nBenny Blackshire of Sun City Center who served in the U.S.       Army during the Vietnam War.\n\nJeffery Camp of Parrish who served in the U.S. Army and       Army National Guard during the Iraq and Afghanistan Wars.\n\nJack Carter of Lakewood Ranch who served in the U.S. Marine       Corps during the Vietnam and Gulf Wars.\n\nCharles Conover, Jr. of…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697469/recognizing-the-recipients-of-floridas-16th-congressional-district-veteran-commendation"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…leading over 56 security forces members for U.S. Central  Command.\n\nMaster Sergeant Holliday's home unit is the 121st Security Forces  Squadron based at Rickenbacker Air National Guard Base. He also serves  his community as a law enforcement officer, as an emergency management  specialist for the Kettering Police Department, and as a part-time  sergeant…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…we are seeing today,       and it is President Trump's responsibility to restore law and       order. That is why I fully support his decision to send       Marines and National Guard troops to LA.\n\nUnfortunately, we will continue to pay for the consequences       of open borders for decades to come; but to address these       issues, I'm co-sponsoring…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…intelligence plan for our defense industrial  base, and integrated air defenses for U.S. CENTCOM.\n\nAs someone who has served, as well as our 2,000 members from the Iowa  National Guard, they demand this level of support not only in their pay  but in their protection.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695153/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Commendation. His service to both  the Army and  his Nation exemplifies our Nation's altruistic spirit.\n\nMG Hamilton served honorably in Armor and Cavalry units in the Texas  Army National Guard for 35 years. He served full time in operational  assignments including Director of the Joint Staff, Chief of Staff to  the Adjutant General of Texas, and the Texas Army…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689353/saluting-the-service-of-major-general-patrick-hamilton"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania. Madam Chair, I rise today to speak in  support of amendment No. 159, to provide funding for the purchase of  heavy dump trucks, or HDTs, for the Active Army, the Army National  Guard, and the Army Reserve.\n\nWhile much of the focus in our FY26 Defense appropriations bill is on  weapons and on other Defense materials, the tools that our military use…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693691/department-of-defense-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY.                 Recognizing the South Carolina National Guard\n\nMrs. BIGGS of South Carolina. Mr. Speaker, I thank the gentleman from  Texas for yielding.\n\nMr. Speaker, I rise today to recognize and thank the brave men and  women of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…to strengthen our fight  against transnational criminal organizations and the deadly flow of  illicit fentanyl.\n\nMy first amendment redirects $2 million to bolster the National Guard  Counterdrug Program. This funding will enhance training and equipment  for our servicemembers, empowering them to disrupt the cartels and  criminal networks fueling this…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…would  have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad I been present for the rollcall vote No. 651, on the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…before he wore four stars on his shoulders, General Mingus took  up the call to service, in 1981, in the same way that so many of us  did. He enlisted in the Iowa Army National Guard. It was there that he  learned the mundane tasks of a young soldier, at that time--shining  black leather boots, making sure your uniform was ready for those  weekend drills…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}]