[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…over Republicans, over Senate Republicans.\n\nWe saw the reach of his power today as Republicans unanimously voted  for water projects for poor people in Colorado and for a Native  American Tribe in Florida, reversed themselves and sustained his veto.  They voted for these two measures before. That is how immense his  influence is. The question is: Will he…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698663/protecting-healthcare-for-millions-of-americans"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and the Secretary of the Interior to remove what they called improper  partisan ideology from exhibits and materials across the country.\n\nIt targeted mentions of slavery, Native American history, Chicano  history, AAPI history, LGBTQ+ history, climate change, and other topics  which they claimed were divisive, anti-American, and created ``national  shame,''…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…maintains funding to our trust and  treaty responsibilities to Indian Country. It continues to support  education, healthcare, public safety, and human services for our Native  American brothers and sisters.\n\nThis bill maintains Indian Health Service advanced appropriations,  which is targeted for elimination by President Trump's budget. I thank  the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698755/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…alarming situation.\n\nEvery American should be outraged at the Trump administration's  attempt to erase American history and specifically to erase the history  of Black, Native American, Hispanic, and other people of color who have  helped shape this country.\n\nThe Department of the Interior under this administration recently  removed a slavery-related…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699711/rewriting-history"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…a country where every American citizen can vote. That  is why we champion bills like the Freedom to Vote Act, the John R.  Lewis Voting Rights Advancement Act, and the Native American Voting  Rights Act, not the SAVE Act.\n\nI fiercely oppose this anti-American bill. I urge every one of my  colleagues, Republicans and Democrats alike, to defeat this extremist,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I am proud to rise today to recognize Native  American Heritage Month.\n\nNative American Heritage Month is an opportunity to not only honor  the rich cultures and history of Indigenous peoples across North  America, but to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696915/recognizing-native-american-heritage-month"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…the Humanities, which the administration tried  to eliminate entirely. This funding will support the arts in  communities across the country.\n\nFinally, this bill supports Native American families by investing in  a strong and resilient Indian Country, including through education,  public safety and justice, and healthcare programs.\n\nImportantly, this bill…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…iterations of this bill, the current bill prohibits demo  days from taking place at facilities owned by religious institutions.  That is what is prohibited. It allows both Native American Tribes and  startup incubators to host them.\n\nI am aware of several instances where bad actors took advantage of  the halo, if you will, of being in a church to get investments…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…essential food assistance for older Americans at  risk.\n\nThe ACL does more than food assistance. They support paid and unpaid  caregivers, including family caregivers and Native American caregivers.  They study better ways to support older adults living with HIV. They  protect seniors from abuse through the Adult Protective Services  Program. They provide…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…card  fees that unfairly tax veterans and their caregivers. I also proposed  eliminating medical copays for Native Hawaiian veterans, the same  healthcare benefits that Native American and Alaska Native veterans  currently receive. Republicans said no. Apparently, they believe  veterans should keep getting nickeled-and-dimed for basic healthcare  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…because my State has struggled with these issues of  justice, particularly civil liberties and the civil rights of  individuals. We had two tragic cases in our State. One, a Native  American was just carving on a corner, basically whittling away, didn't  understand, as he got up to move to another corner, that a policeman in  the neighborhood thought, ``What…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…pivotal Native  Hawaiian leaders, Edith Kanakaole and Mary Kawena Pukui. Both women  were chosen to be included in the U.S. Mint's American Woman Quarters  Program and Native American $1 Coin Program, respectively. Having  celebrated these pioneering women in their respective fields of Native  Hawaiian education and culture, I come to the floor to celebrate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…hundreds of other  Tribes, to protect their lands, resources, and sovereignty. Congress  must stand by that commitment and override the President's veto.\n\nThe sanctity of Native-American lands is something that is of the  utmost importance to Native-American Tribes, and all of us in this  country that represent Native-American lands and Native Americans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Chinese       forms of money shaped like miniature tools. A silver French       penny from the age of Charlemagne. A medal given by the       Lincoln administration to a Native American chief, pierced by       a bullet. More than 800,000 other telltale coins, medals and       objects of wonder.\n\nBut apart from scholars, members and the occasional…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…I couldn't be more pleased with that result.\n\nI would be remiss not to build on a remark my friend, Ms. McCollum,  made in her speech. I am very proud of  this bill on Native-American issues, which have been a bipartisan  priority over the years. I am proud of all of my cardinals and all of  my ranking members, but particularly the relationship between…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…that is a total of at least 50 percent       Black American, Hispanic American, Asian American (as defined       in section 371(c) of such Act (20 U.S.C. 1067q(c))), Native       American Pacific Islander (as defined in such section), or       Native American (as defined in such section), among other       criteria, as determined by the Commandant; or…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…American ingenuity.\n\nTontogany's long history dates back to the first settlers to settle  in the area, Samuel and Eliza Hamilton. The village's name comes from  the Ottawa Native American Chief Tondoganie. When it was officially  incorporated in 1895, the town was an agricultural village, populated  by farmers. Keeping with the village's small town charm,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…scholarships, and JROTC programs. She  is also a member of the Honor Guard and an adult volunteer with the  Waco Young Marines.\n\nRecently, she made history as the first Native American female  Commander of VFW District 29, overseeing seven posts in Texas. Nola is  also a proud mother of four successful children, all of whom have  pursued higher education…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…accepted into the  United States Marine Corps as an officer. After 10 years of active  duty, she was transferred to the reserves, where she served as museum  director and Native American Graves Protection and Repatriation Act  coordinator for the Cocopah tribe in Arizona. In 2001, Ms. Prehoda was  redeployed following the invasion of Iraq. There she completed…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…process was  created by Congress to prevent political favoritism or arbitrary  decisionmaking as it requires careful documentation and verification,  including proof of Native American ancestry.\n\nBypassing this process, as is suggested through this NDAA, by  including the Lumbee Fairness Act as an amendment, sets a dangerous  precedent. It would invite…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…serving as a foundation for greater self-reliance and long-term  empowerment.\n\nConnie and Bill Eastburn founded this organization by recognizing  pressing needs in these Native American communities--warmth, structure,  and shelter. When they learned that 17 Navajo men had tragically passed  away due to inadequate shelter, Connie and Bill jumped into action.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…forward, I believe we have the opportunity to make even more  progress on housing by addressing reforms to the Build America Buy  America Act, or BABA, and reauthorizing the Native American Housing  Assistance and Self-Determination Act, or NAHASDA.\n\nDon't let the name fool you. BABA may sound patriotic, but mandating  BABA compliance for HUD-funded projects…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Definition of indian tribe.--For purposes of this       subsection, the term `Indian Tribe' means a federally       recognized Tribe, as defined in section 4(13)(B) of the       Native American Housing Assistance and Self-Determination Act       of 1996 (25 U.S.C. 4103(13)(B)).''.\n\n(c) Applicability.--Any activity generated under       subsections (a) or (b)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…COMMUNICATIONS,       INC. (DCI).\n\nCohen, Gabriel: CNN; Cohen, Marshall: CNN; Cohen, NICHOLAS:       NBC NEWS; Cohen, Sari: CNN; Cohen, Zachary: CNN; Cohencious,       Robert: Native American TV (NATV); Coker, Edward: WTTG-FOX       TELEVISION; Colavito, Frank: CBS NEWS; Cole, Bryan: FOX NEWS;       Cole, Devan: CNN; Coleau, Manel: CBS NEWS; COLEAU, Melinda:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…incorporation was but one milestone on a long journey of  progress. For thousands of years, the abundant forests and waters of  the region were the hunting grounds of the Native American Tribes. The  very first house that laid the foundation for a permanent community was  built in 1780 by a Wabanki known as Pierpole. Drawn by the rich natural  resources,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…(DOJ) for renewing       its efforts to prioritize public safety and justice       throughout Indian Country. In the spirit of helping to       improve public safety on Native American reservations, I am       writing to request the assistance and support of the U.S.       Department of Justice in advancing H.R. 2189, the Law-      Enforcement Innovate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…battlefields of  Tinian, Saipan, Guam, and Okinawa. During these years, Richard also  took part in the Wind Talkers Initiative. This initiative involved the  use of the Native American language of Navajo by the U.S. military to  create coded messages the Japanese couldn't decipher. Being a part of  this initiative highlights Richard's high aptitude in…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}]