[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…families lose; billionaires win. And there are  far fewer good-paying jobs for Americans.\n\nAnd, by the way, prioritizing fossil fuels is helpful to China.\n\nIf we have a national energy emergency, we shouldn't be fueling our  competitors by selling our energy to China to make their economy run  better. If we have an emergency, we shouldn't cede the future…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…with  this problem; so, thank you.\n\nI rise today in support of Senator Kaine and Senator Heinrich's  resolution to terminate Donald Trump's Executive order declaring a  national energy emergency.\n\nI just want to start by being clear about what is going on here.  Donald Trump promised to gut our environmental laws if Big Oil CEOs  gave him a billion dollars…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…First. My bill means more  American jobs, more American energy, and more American prosperity.\n\nOn January 20, 2025, his very first day in office, President Trump  declared a national energy emergency to expedite permitting and  emergency regulations to unlock domestic energy production. Now it is  time for Congress to do its part.\n\nThis modest land conveyance…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…fentanyl from all directions.\n\nThis is the second resolution seeking to end an emergency that the  Senate has considered in the last few weeks. Last time, it was ending  the national energy emergency. Now it is ending an emergency related to  fentanyl.\n\nThe American people recognize that these are legitimate crises and  that they warrant an aggressive response.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…is returning to the American economy, and President Trump  has taken us from energy desperate under the previous administration to  energy dominant again.\n\nHe declared a national energy emergency. He unleashed record oil and  natural gas production. He reopened millions of acres for responsible  energy development, and he rolled back radical regulations…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the  groundwork for making the tax cuts we passed during the first Trump  administration permanent as well as delivering a transformational  investment in our border, national, and energy security.\n\nOf course, we are currently working to overturn burdensome Biden  administration regulations using the Congressional Review Act.\n\nThis week, we are taking…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…in February dropped to an alltime low.\n\nPresident Trump said he would unleash American energy. He has kept  that promise as well. On day one, President Trump declared a national  energy emergency. Now, this is going to unlock America's full energy  potential. He withdrew from the Paris climate accord. Did it once  before, but Joe Biden put us back in.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…netted over $1.3 million.\n\nThe people of Wyoming are elated that President Trump, on day one,  committed to fixing the sins of the previous administration by  declaring a national energy emergency.\n\nYou know, I was in Seoul, South Korea, last spring. And one day, we  had clear air. The next day, it was so dirty that you couldn't see, Mr.  President, from…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…to make it  competitive, we need to get back to making things affordable in the  first place.\n\nThe National Coal Council plays a critical role in developing a  cohesive national energy strategy that will unleash American energy  dominance to lower costs for hardworking households.\n\nMr. Speaker, I urge my colleagues to support H.R. 3015, and I reserve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…sheriff in town. None of these efforts would stand a chance of becoming  law without this administration. President Trump has taken swift  executive action to declare a national energy emergency, reopened  exploration on Federal lands and waters, appointed an all-star Cabinet  with the likes of Secretary Wright and Secretary Burgum to streamline  permitting…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and a  reinstatement of the 2020 Final EIS and 2020 ROD issued during the  first Trump administration.\n\nThis past summer, Secretary of the Interior and Chairman of the  National Energy Dominance Council Doug Burgum flew to Alaska and held a  townhall on the North Slope with regional leaders and listened to their  concerns, showing respect for the Alaska…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…come to the floor again  today to discuss my resolution to block the Democrats' natural gas tax,  which I will call up right after we vote to affirm President Trump's  national energy emergency declaration.\n\nThe Biden administration's tax and regulatory onslaught over the past  4 years have driven up the cost of energy and led to a national energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…taxpayers from Washington's overreach.\n\nAs my colleagues have so rightly discussed, the actions by the Biden  administration made it necessary for President Trump to declare a  national energy emergency on day one.\n\nThe Biden administration's green energy programs artificially  incentivized electric vehicles using billions of taxpayer dollars, with  only 60…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688158/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…in the Naval Petroleum Reserves Act of 1976, specifically for       natural resource development, balanced with conservation, to       promote America's national security through energy resources,       and it is an asset to the State of Alaska. Responsible       development in the NPR-A supports our nation's energy       security, well-paying…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Americans, this is the definition of an energy emergency. To Senate  Democrats, it is an inconvenient truth.\n\nToday, Democrats are trying to reverse President Trump's national  energy emergency. They are bringing it right here to the floor of the  U.S. Senate. They are trying to block commonsense measures that are  going to address painfully high energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}]