[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Next week, we will celebrate the Fourth of July, a day when we  reflect with pride on the Nation that we have always been and the  values that we stand for.", "title": "Trump Administration Needs to Honor its Word on Food Aid", "date": "2025-06-26"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Speaker, as part of the Congressional Field Hearing  on Haitian TPS Termination held in the Massachusetts 7th Congressional  District, members of the community were invited to discuss the  importance of extending TPS for Haitian nationals.", "title": "Community Testimony During the Congressional Field Hearing on Haitian Tps Termination", "date": "2026-02-04"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "One of the primary goals of the PACT Act was to recognize the  sacrifice of so many more veterans who were injured during their time  serving our Nation and to make them eligible for many of the programs  offered to help them find meaningful employment such as VR&E.", "title": "Focused Assistance and Skills Training for Veterans' Employment and Transition Success Act", "date": null}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "History shows us that when nations embrace science, they grow  stronger.", "title": "Respect for Science and Pursuit of Truth", "date": null}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "For example, the history of the Potomac Basin Commission reminds us  how the commission was formed in response to extreme pollution levels  in our Nation's River that required a regional, cooperative response by  all jurisdictions.", "title": "Mid-Atlantic River Basin Commissions Review Act", "date": null}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "But despite that, House Republicans are using their majority to  advance an agenda that serves the wealthiest Americans at the expense  of our Nation's working families.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-14"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "As the chief of police of the Capitol Police said at the time:  ``This settlement sends a chilling message to law enforcement  nationwide, especially to those with a protective mission like ours.''\n\nAccording to public reporting, Department of Justice is also  negotiating a settlement of up to $50 million to disgraced former  General Michael Flynn over the purported wrongful prosecution, even  though he confessed to the crimes for which, incredibly, he now says  that he was wrongly prosecuted.", "title": "Repeal of Senate Notification Requirements Relating to Legal Process on Disclosures of Senate Data", "date": "2025-11-19"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Speaker, I rise in opposition to the National  Defense Authorization Act for Fiscal Year 2026 (NDAA).", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-11"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Speaker, I would like to remind us what this Nation  used to do to its children.", "title": "Dismantling Department of Education is Not Reform", "date": "2025-12-12"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "1350 authorizes collaborative research between the  Department of Energy and the National Science Foundation in areas that  are essential to our national competitiveness.", "title": "Doe and Nsf Interagency Research Act", "date": "2025-03-24"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Democrats have worked to conduct oversight for our Nation's students,  but Republicans couldn't care less if title I schools get the funding  they need; if students have their civil rights violated; or if the  promise of a free, quality education is for all students.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, does anyone remember the last time a Republican  President misled the Nation about WMDs, using vague evidence to drag us  into a war in the Middle East?", "title": "Providing for Consideration of H.R. Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, Providing for Consideration of H.R. Special Interest Alien Reporting Act of Providing for Consideration of H.R. Jeremy and Angel Seay and Sergeant Brandon Mendoza Protect Our Communities From Duis Act of and Providing for Consideration of H. Res. Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-24"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "To make matters worse,  they have often been denied their proper and well-deserved benefits as  veterans who proudly served our Nation.", "title": "Paying Homage to the Black Men and Women of the Armed Forces", "date": "2026-02-09"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "And the bills to abolish the Judicial Nominations       Commission and to convert the elected DC Attorney General to       a Presidentially appointed legal officer for the District are       both less democratic and untenable for District operations.", "title": "DC Criminal Reforms to Immediately Make Everyone Safe Act", "date": null}, {"senator": "Scott Perry", "party": "Republican", "sentence": "Certainly with  immigration it is more generous than every other nation and more  generous than all nations combined.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "Our  Nation has already faced significant challenges in scaling artificial  intelligence infrastructure.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Speaker, I am impressed with our Nation's will to face down  potential aggressors.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-10"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Speaker, I rise today in recognition of January as  National Blood Donor Month.", "title": "National Blood Donor Month", "date": "2026-01-21"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "It was truly an extraordinary operation that  couldn't have been done by any other nation other than the United  States.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "It will require the Assistant Secretary of Commerce for Travel and  Tourism to develop a plan to boost music tourism, welcoming both  domestic and international visitors to experience the rich musical  heritage we have across America.", "title": "American Music Tourism Act of 2025", "date": "2025-04-28"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "Founded  152 years ago, the Fort Worth Fire Department is a nationally  recognized agency with a rich history of serving and protecting the  13th-largest city in the nation.", "title": "-9999", "date": "2025-04-08"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "I  join his family, friends, and this grateful nation in celebrating not  only the years he has lived, but the legacy he has built through  courage, service, and unwavering patriotism.", "title": "Recognizing Henry Floyd Wells", "date": "2025-06-12"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "``(2) Alternative fuels.--The term `alternative fuels'       means any solid, liquid, or gaseous materials, or a       combination thereof, used to replace or supplement any       portion of fuels used in combustion or pyrolysis for low-      emissions cement, concrete, or asphalt.", "title": "Innovative Mitigation Partnerships for Asphalt and Concrete Technologies Act", "date": "2025-03-24"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "His life is a testament to the core principles  that define our Nation: service, commitment, and integrity.", "title": "Recognizing John Post", "date": "2025-05-21"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Just a few  years ago, they demanded proof of vaccination just to eat at a  restaurant or pick up food.", "title": "Supporting American Elections", "date": "2025-04-01"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "It is clear that our Nation is on the precipice of great  technological advancements that are straining our electricity supplies,  primarily driven by energy-intensive users such as data centers and  domestic manufacturing.", "title": "Electric Supply Chain Act", "date": "2025-12-10"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "As detailed in DHS' 2025 Homeland Threat Assessment, the Chinese  Government poses a wide array of dangers to our Nation.", "title": "Strategic Homeland Intelligence and Enforcement Legislation to Defend Against the Ccp Act", "date": "2025-03-10"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "During her tenure, Nicole executed many top-tier engagements,  including meetings for foreign heads of state, national travel, and  managing the 2025 Presidential Inauguration events for approximately  five hundred Iowans who came to visit the Nation's capital.", "title": "Recognizing Nicole Schmitt", "date": "2025-02-26"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "This is something we started last year here in  this very Chamber, and I encourage my colleagues on both sides of the  aisle to maybe adopt this in their district to try to re-instill  patriotism into our great Nation.", "title": "Winners of the Congressional Speech Competition", "date": "2025-05-14"}]