[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…dollars spent, and untold new problems in the  region and elsewhere. In response, as a country, we said no more--no  more war--but especially not when our fundamental national interests  are not at stake. Yet Donald Trump is now knowingly, enthusiastically  dragging us into another conflict again.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…President's  view of the world is. His constant abandonment of basic principles of  international law and order are, again, going to eventually reverberate  against America's national interests. The only question is when.\n\nIndeed, the kind of ``spheres of influence'' arrangement on which the  President seems to be so obsessed or focused is exactly the arrangement…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…come to  Congress as a coequal branch of government to ask that we, Congress,  authorize and appropriate the funding they need to defend our Nation  and to protect our national interests on the world stage. And that  request traditionally includes a justification and a rationale for the  proposed plan.\n\nFor over 60 years, Congress has met its responsibilities,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…nongovernmental organizations to lay off thousands of workers by  illegally withholding funds previously appropriated for USAID programs.\n\nUSAID supports programs that serve U.S. national interests overseas,  but it is farmers here in America who grow the corn, wheat, beans, and  peanuts. It is dairy farmers in Vermont who produce the powdered milk  that USAID uses…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…have funded these  programs for decades. Yes, our partners want them. Yes, they employ  tens of thousands of Americans. But more than that, these programs  benefit our national interests in unique ways. For instance, it is  because of USAID's war legacy work in Vietnam that we share a strong  security partnership today. It is thanks to our disaster risk…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…United  States and upheld the values we share.\n\nFrom the day Ambassador Rudd arrived in Washington on March 2023, he  proved to be a driving force in advancing our mutual national  interests. During his accomplished career in the Australian Parliament  and as Prime Minister, he understood the importance of engaging  Congress, steadying the Australian relationships…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…larger  existential threat Russia poses to our national security.\n\nWe support Ukraine to ensure that Vladimir Putin cannot achieve his  goals, which are counter to our own national interests. We must be  clear-eyed about this. If Putin succeeds in Ukraine, it will be the  first piece in his long-stated promise to recreate the Soviet empire.  If that happens,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…not recount each of their mandates and  activities, I encourage my colleagues to do so. It would become readily  apparent that their work is squarely in sync with U.S. national  interests.\n\nOf course, if one believes, as the President and some of his closest  advisers believe, that climate change is a hoax and that any program or  organizations with the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…justice. He  did just that.\n\nWhen Nicolas Maduro continued to operate with impunity, President  Trump made the decision to enforce United States law and protect our  national security interests.\n\nNicolas Maduro was not a legitimate leader. He was an indicted  narcoterrorist who helped turn Venezuela into a hub for drug  trafficking, corruption, and foreign…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…United States on, under, and over the high seas and       waters subject to the jurisdiction of the United States.\n\n``(D) Defense readiness.--Defend United States national       interests in the maritime domain against hostile acts through       military action, and maintain a state of readiness to assist       in the defense of the United States, including…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…matters of war and peace, but I  cannot and I will not support a resolution that removes the ability of  the President of the United States to act decisively in defense of  national interests, our allies, and our Armed Forces.\n\nThis resolution, if passed, would send a dangerous message not just  to Iran's terrorist-sponsoring regime but also to every adversary…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…assessment of how the nature and extent of       collusion between political and economic elites and criminal       gangs threatens the Haitian people and United States national       interests and activities in the country; and\n\n(8) include an assessment of potential actions that the       Government of the United States could take to address the       findings…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…advancements in artificial intelligence by ensuring we identify,  monitor, and address vulnerabilities that foreign adversaries could  exploit to the detriment of our national interests. It reinforces our  commitment to securing the technologies that will define the next  century and ensures the United States remains the world leader in  artificial intelligence.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…justification that an emergency exists that requires the       immediate sale to the Government of Israel of the above       defense articles (and defense services) in the national       security interests of the United States, thereby waiving the       Congressional review requirements under Section 36(b) of the       Arms Export Control Act, as amended.\n\nThe United…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…independence from the Soviet Union should be applauded;\n\n(2) the consolidation of democracy in Georgia is critical       for regional stability and United States national interests;\n\n(3) Georgia has seen significant democratic backsliding in       recent years, as evidenced by numerous independent       assessments and measures;\n\n(4) the current…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…the globe, from the Pacific to the Middle East  and even the Arctic. Our ability to meet any challenge near or far is  critical to homeland defense and advancing our national interests.\n\nThis year's NDAA is an opportunity to make essential investments in  our ability to project power across the oceans and in the air and to  ensure that America's defense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Putting U.S. troops in hostility is an incredibly serious matter.  These are American lives on the line, and we should not expose them to  danger unless there are vital national interests, and, of course, we  should not ask them to engage in endless wars.\n\nWe are not debating those issues here today. What we are debating is  trying to stop something that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…What is odd in America is to declare war by the Congress. The norm is  for the Commander in Chief to use military force as he or she deems  necessary to protect the national interests.\n\nThe 1973 War Powers Act is a congressional statute, not a  constitutional provision, that has a series of reporting requirements  when military force is used, crescendoing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "James Risch", "party": "Republican", "sentence": "…logistics and program support. The estimated total cost is       $510 million.\n\nThe United States is committed to the security of Israel,       and it is vital to U.S. national interests to assist Israel       to develop and maintain a strong and ready self-defense       capability. This proposed sale is consistent with those       objectives.\n\nThe proposed…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…States. In exchange, their contracts  allow China to staff these programs, provide curriculum, and require  teachers to sign contracts, ensuring they do not damage the national  interests of China.\n\nMake no mistake, this is not out of the kindness of their hearts. The  CCP is not interested in helping American students learn Mandarin. They  want to brainwash…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}]