[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…was a second plane that had done  the same.\n\nMadam President, 9/11 was clearly no accident. It was a terrorist  act. As a result of that terrorist act, we made decisions as a nation  on a bipartisan basis. One of the most bipartisan decisions we made was  what to do with those who were responsible--Osama bin Laden and others.  There was no doubt in my…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, Donald Trump has taken us back to the era  of gunboat diplomacy over the last 4 months, back to that era when a  powerful nation would station its gunships off the coast of another  nation in order to compel them to do what we wanted to enable us to  have access to their resources, to force them to enable…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…you stand with the American people and our democracy or did you  stand with the lawless administration who is unleashing chaos on our  communities and our democracy and our Nation? I encourage my colleagues  to find your backbone. Right your minds and right your hearts because  history will remember.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689319/history-will-remember"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…globally, through teaching,  research, and service.\n\nThroughout its history, the University of Georgia School of Social  Work has positively impacted the State of Georgia, our Nation, and our  world. It established a Center for Social Justice, Human, and Civil  Rights; an Institute for Nonprofit Organizations; and a Center on Human  Trafficking Research…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…State like Connecticut  where we value education, I want a high-quality education for every  student. Even the kids in Louisiana with some of the lowest test scores  in the Nation and even the kids in our rural communities, I want those  kids to have a good, high-quality public education. I am going to fight  just as hard for them as I will for the kids…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…branch club isn't just an insult to the working class,  but it is a vivid, grotesque portrait of ruling billionaires focused on  totally enriching themselves and neglecting our Nation. Imagine what a  half million dollars would buy in our communities for children or for  seniors.\n\nThis excess reminds me of the disgusting behavior of Emperor Nero,  who rightly…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690166/executive-branch-club"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Vivian, and me,  along with the more than 765,000 people of Georgia's 2nd Congressional  District in honoring the life and legacy of Adrian Earl Jenkins, Sr.  Our city, our Nation and the world are better because he walkdd among  us. We mourn his loss but celebrate a life whose enduring legacy is  written in the lives he touched: teachers inspired to…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…many earn  scholarships to transfer to 4-year universities.\n\nCongratulations to the College of San Mateo Bulldogs on another  historic championship title. They represent the Nation's best of  community college athletes in the heart of my district, and they make  us all proud.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699641/congratulating-college-of-san-mateos-football-team"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…This  was funding for a project that had bipartisan support and passed in a  Republican-majority House. It is a piece of one of the largest  infrastructure projects in the Nation and the largest in the history of  upstate New York. That is the reimagining of Interstate 81.\n\nThat money was meant to build roads and sidewalks, reconnect  utilities, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…people that despite the darkness,  despite the stoking of fear that you see happening throughout the  country, continue to demonstrate who we are and who we should be as a  Nation.\n\nI will start by recognizing someone who I believe to be a leader in  the community. He is someone who I know stands up by defending our  neighbors. He is someone who recognizes…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…facilities in the country, giving a green light for  polluters to pump more cancer-causing pollutants into the air we  breathe.\n\nWithout these safeguards, nearly 2,000 of the Nation's largest  polluters would get a free pass. Oil refineries, chemical  manufacturers, pesticide producers, they would all be allowed to shut  off their pollution controls and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691589/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…have more children.''\n\nI am an OB/GYN. It has been my life's work to help women have  children. Let me tell you, eliminating early childhood care and  education, making our Nation's childcare crisis even worse and taking  away parents' ability to go to work and provide for their families, is  not how you persuade women to have more children.\n\nOn top…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…congressional  authorization.\n\nThrough this resolution, we can uphold our responsibility to give  voice to Americans on the safety of our troops and the security of our  great Nation. We need to give that voice in this moment because this is  a crisis that can spiral into a conflict and from a conflict into an  all-out war.\n\nWhile Trump tries to claim their…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…tell you the meaning of the words  ``service'' or ``sacrifice'' if he had a dictionary laying open in  front of him. So how dare a coward who cried ``bone spurs,'' when his  Nation needed him the most, turn his back on those who, unlike him,  were actually brave enough to serve our country in uniform.\n\nWhat he has done to our veterans in just a few months…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…the dismantling of these vital  programs.\n\nLet me just say this: In New Mexico, we understand that our young  people are our future. That is why we are the first State in the Nation  to pass universal free childcare and education for every single student  in our State.\n\nI, for one, as a public school kid, was deeply proud to carry the  Federal enabling…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698935/protecting-education-for-children-with-disabilities"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…went on to serve three terms as an Iowa State House  representative for district 779. As a fellow veteran, I understand  Vern's services, sacrifices, and commitment to our Nation.\n\nOur thoughts and prayers are with his wife, Christine; his children,  Mitchell and Megan; and the rest of his family.\n\nVern was unwaveringly kind. He was a wonderful husband,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…increasingly greater dangers, and current restrictions hinder their  ability to carry firearms and protect themselves and others.\n\nAt a time when violent crime continues to plague our Nation, we must  support our active and retired law enforcement officers and ensure they  are able to protect themselves and to protect others no matter where  they are in the United…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…York et al. (82-CV-      1114); and the Saint Regis Mohawk Tribe, by the Saint Regis       Mohawk Tribal Council and the People of the Longhouse at       Akwesasne, by Mohawk Nation Council of Chiefs v. The State of       New York, et al. (89-CV-829).       SEC. 2. LANDS OWNED BY SAINT REGIS MOHAWK TRIBE WITHIN                     SETTLEMENT ACQUISITION…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "John Thune", "party": "Republican", "sentence": "…recognize that it is on us to live up to the ideals for which  generations of Americans have been willing to give their lives.\n\nThese are American heroes, and we are a grateful nation.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691674/memorial-day"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…consumers to  purchase significantly more expensive or less efficient models.\n\nNot only do bans on gas appliances infringe on consumer choice, but  it also increases strains on our Nation's grid, which cannot sustain  such massive and rapid amounts of forced electrification without new,  baseload generation coming online.\n\nPresident Trump, understanding the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Zhou, Yu Zhou, Kaiyan Mao, and 7 others.\n\n(3) expresses sympathies to the people of Wichita, the       entire state of Kansas, the National Capital Region, the       Nation, and the multiple countries who grieve for the       victims; and\n\n(4) commends the heroic actions of the first responders,       emergency services personnel, and all those…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…joining the ranks of the world's  most elite naval force, guided by the motto: ``Acta Non Verba''\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since its inception, defending our way of life  from Lexington to Normandy.\n\nA vital part of our Nation's maritime operations, the Merchant  Marines' duties are dynamic, transporting…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692770/congratulating-jack-gray"}, {"senator": "John Rose", "party": "Republican", "sentence": "…that day didn't change the serious concerns raised  about the ways six States conducted their elections. Members of  Congress still had a constitutional duty to defend our Nation's  election laws.\n\nI was proud to object to the results in six States and vote not to  certify the results of the two States that came to a vote in this room  on that day.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698515/standing-for-election-integrity"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…these very same States continue benefiting from the  affordable, reliable energy produced in other parts of the country,  even as they obstruct the pipelines needed for our Nation's  development, economic security, and long-term competitiveness.\n\nThis amendment tackles that problem head-on. It establishes expedited  judicial review for major energy infrastructure…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Chair, I rise today in strong support of two of my  amendments that are included in H.R. 4016. It will address the fentanyl  crisis devastating our Nation, which has claimed hundreds of thousands  of lives, including thousands in my home State of Colorado.\n\nMy amendments redirect vital resources to strengthen our fight  against…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…think twice  before breaking our laws and choosing to overwhelm our immigration  system. The harsher the punishment, the more the deterrence. That is  just common sense.\n\nA nation that cannot control its borders cannot protect its people.  This legislation affirms the rule of law, defends American families  from dangerous criminal aliens, and restores…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…organizations to put our competitors ahead  of the American people. Groups like the World Trade Organization allow  China to exploit trade loopholes while claiming to be a developing  nation, stealing our intellectual property, and manipulating their own  currency.\n\nUnder these America last trade policies, Ohio has lost a third of its  manufacturing jobs. Between…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694016/cost-of-america-last-trade-policies"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…overreaching Green  New Deal agenda intended to block access to domestic energy production.\n\nNorth Dakota is an energy powerhouse and the third largest oil- producing State in the Nation. Our energy producers operate under the  highest environmental standards in the world.\n\nBut the Biden administration's North Dakota resource management plan  ignores that record…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…appointment to the  service academies.\n\nThese students demonstrate not just academic achievement but also  strong devotion to our country. Young students like these will become  our Nation's leaders in the future.\n\nIt was my honor to call these students this weekend to congratulate  them on this true accomplishment.\n\nMr. Speaker, I congratulate Libby Russell…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689824/congratulating-floridas-eighth-districts-student-accomplishments"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, today, the Governor of my  State, Gavin Newsom, gave his state of the State address in which he  declared that California leads the Nation. Now, the Governor isn't  wrong. As the residents of our State know all too well, California does  lead the Nation.\n\nCalifornia leads the Nation in fraud. California leads…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698654/california-is-the-most-popular-state-to-leave"}]