[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…financial situation many rural communities  face because of the lapse in Secure Rural Schools funding.\n\nFor over 20 years, Congress has used SRS to support rural areas where  national forests limit the local tax revenue. This funding has been a  vital lifeline, helping rural communities pay for essential services  like schools and roads.\n\nSince SRS funding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694977/highlighting-the-lapse-in-secure-rural-schools-funding"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Congressional  District. We have some of the most stunning nature in the country. In  fact, we have the North Cascades National Park, Mount Rainier National  Park, and two national forests stretching over 2 million acres. That is  a fifth of the national forest, approximately 10 million acres in  Washington State.\n\nThe U.S. Forest Service manages these public…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…opportunity to comment on and  evaluate the proposal.\n\nThis is a critical component of the legislative process that ensures  decisions about the administration of our national forests and public  lands are made out in the open. These shared resources belong to all  Americans, and regular order ensures transparency, something which all  of our constituents…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…ghost.''\n\nSo when the Trump administration advocates for eliminating the  roadless rule, they are talking about endangering some of the last  great wild game habitat on our national forests. These are the back- country places where we sit around a campfire under a sea of stars and  pass our traditions down to the next generation of sports men and  women.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…American family deserves.\n\nRural communities across the country and in New Mexico know this  story well. In Catron, Grant, Sierra, and Otero Counties in my  district, national forests define our landscape, and they define who we  are. They are the treasures that we value and protect. Yet, those  beautiful lands also mean fewer taxable acres, fewer revenue…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Americans and  provides support to farmers.\n\nMy colleagues will make our roads less safe by cutting critical  infrastructure. Republicans will cut services that maintain our  national forests and our national parks, as we heard. Firefighters are  being laid off or not even being hired for the summer fire season.\n\nIn our national parks, who will be there? Apparently…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…proposals. This is not  about efficiency. It is about preferential treatment for oligarchs like  Meta and Amazon.\n\nConsider this: When telecom companies want to access our national  forests for one of these projects, they pay rent. When they cross  national parks, they pay fees, but somehow marine sanctuaries are  supposed to be free. That is nothing more…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…expensive for our  four States. In other words, it is all downside, no upside.\n\nWe have now seen weeks of taking a chain saw to our Federal programs  and damage to our grid, national forests, national security, and,  frankly, personal security. It is time for Congress to take our power  back and protect our constituents.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688300/senseless-bonneville-power-administration-workforce-cuts"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…issue. It is a promise to rural America. Let's  reauthorize the Secure Rural Schools Reauthorization Act of 2025 and  keep faith with the communities that steward our national forests.             Recognizing Environmental Stewardship in Our Forests\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to support the timber  industry and the harvest of trees…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…respectively. I also recognize the work of  Representative Pete Stauber, who offered a thoughtful amendment during  our Natural Resources Committee markup to expand this bill to national  forests, refuges, and all public lands.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. Speaker, as we get ready to celebrate our 250th anniversary--and,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…to reauthorize  the Secure Rural Schools program.\n\nMr. Speaker, with such a large percentage of Wyoming's resources  historically locked up in Federal lands, including national forests,  communities across my State have long weathered challenges associated  with reduced flexibility and a decreased tax base.\n\nWhile a percentage of revenue from timber…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697661/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…cited as the ``Apache County and Navajo       County Conveyance Act of 2025''.       SEC. 2. CONVEYANCE OF CERTAIN LAND WITHIN THE APACHE-                    SITGREAVES NATIONAL FORESTS TO NAVAJO COUNTY,                     ARIZONA.\n\n(a) Definitions.--In this section:\n\n(1) County.--The term ``County'' means Navajo County,       Arizona.\n\n(2) Map.--The…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691144/apache-county-and-navajo-county-conveyance-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…across Minnesota's Eighth Congressional  District.\n\nWhile we should really be taking action to encourage and allow  responsible mining and timber harvesting within our national forests,  providing this relief is the next best thing. This is a vital lifeline  for rural America that the American people owe to them. We must  reauthorize it.\n\nMr. Speaker,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697654/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…located  near the town of Minturn, Colorado, that divert water into Bolts Lake.  In 1980, Congress established the Holy Cross Wilderness in the White  River and San Isabel National Forests but inadvertently failed to  include Bolts Ditch among a list of existing water facilities excluded  from the designation.\n\nThis has prevented the structure from being…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…tireless  work on this important issue.\n\nMr. Speaker, I rise today in support of S. 356, the Secure Rural  Schools Reauthorization Act of 2025.\n\nActively managing our national forests is critical for both forest  health and the economic health of our rural communities. Congress has  long recognized that responsible timber harvesting is essential for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Additions Act over the past 5 years.\n\nI stand in strong support of H.R. 1612, which I think is a model for  how to go about considering recreation conservation lands in our  national forests.\n\nThe Ouachita Mountains and the surrounding forest sit in the  southwest corner of Arkansas. It is the oldest and largest national  forest in our southern region. It…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Sierras and the wonder of Lake  Tahoe, we host and steward some of the most magnificent places in the  entire country.\n\nAcross millions of acres of public land, seven national forests, and  countless parks, these wild places are the source of clean water and  air for much of the State, while providing jobs for nearly 545,000  Californians and essential…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}]