[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…people came from,  including the battleground at Little Big Horn in Montana. Memories of  Black and Native history were erased from Independence Park, Cape  Hatteras, and The National Mall.\n\nRemembrance of internment of Japanese Americans was removed from  Jamaica Bay in New York City. References to climate change were removed  at Fort Sumter in South Carolina…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…honor the prolific and powerful  contributions of women in this country than to finally authorize the  creation of the Smithsonian American Women's History Museum on The  National Mall.\n\nAs one of the original cosponsors of this bipartisan bill, I feel  strongly that this museum must become a reality.  The National Mall here in Washington, D.C., tells…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689368/womens-history-month"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Location Act, which I,  as has been previously stated, introduced  alongside my good friend, the gentleman from Idaho (Mr. Fulcher).\n\nMr. Speaker, this bill authorizes The National Mall as the location  for the memorial, commemorating the service and sacrifice of the women  who worked on the home front during World War II.\n\nThis bill advances a decade-long…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Women's Memorial Location Act.\n\nThis legislation, as we have heard, would ensure that the service and  sacrifices of millions of American women are forever honored on The  National Mall and not erased, as we have seen efforts to do over the  course of this year.\n\nDuring World War II, over 18 million women stepped forward to serve  on the home front, raising…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697727/world-war-ii-womens-memorial-location-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…coastal waters. D.C. urgently needs the protection of the  CZMA because of serious flood risks that affect federal assets,  residents and businesses in D.C., including the National Mall and  federal buildings in the Federal Triangle area.\n\nThe CZMA provides planning and technical services to assist states in  protecting, restoring and developing coastal…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in the District of Columbia, celebrates its  bicentennial today.\n\nThe House is situated on land previously owned by David Burnes, whose  other landholdings now house the National Mall, the White House and  other notable D.C. landmarks.\n\nThe House was constructed in 1825 by Tench Ringgold using enslaved  individuals. Shortly after being built, the House's…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692257/recognizing-the-dacor-bacon-house"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…land previously owned by David Burnes, a  Revolutionary War veteran whose other real estate holdings were used  for key national landmarks, including the White House and National  Mall.\n\nThe House's site was acquired in 1815 by Tobias Lear V, George  Washington's personal secretary and subsequent U.S. Consul General to  Algiers. He was also the only person…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…And, most damningly, he told that crowd:\n\n[I]f you don't fight like hell, you're not going to have a       country anymore.\n\nAnd that is when the crowd marched down the National Mall to this  building, which they stormed, to the police officers whom they  attacked, and the doors that they knocked down.\n\nThey entered the Capitol at 2 p.m. Not until 4:17…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…in Congress. H.R. 51 reduces the size of the  Federal District from 68 square miles to 2 square miles, consisting of  the White House, the Capitol, the Supreme Court, The National Mall and  remaining under the control of Congress.\n\nThe new State consists of the residential and commercial areas of  D.C. The new State has a larger population than two States,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Caucus of the year to stand in solidarity with my colleagues in  this historic caucus as we continue the work to break ground on a  Women's History Museum on Washington's National Mall.\n\nI would like to thank my colleague and cochair, Representative Monica  De La Cruz for organizing this Special Order hour. I would also like to  thank the vice chairs…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress. H.R. 51 reduces the size of the  Federal District from 68 square miles to 2 square miles, consisting of  the White House, the Capitol, the Supreme Court, and the National Mall  and remaining under the control of Congress.\n\nThe new State consists of the residential and commercial areas of  D.C. The new State has a larger population than two States,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress. H.R. 51 reduces the  size of the Federal district from 68 square miles to 2 square miles,  consisting of the White House, Capitol, the Supreme Court, and The  National Mall and remaining under the control of Congress. The new  State consists of the residential and commercial areas of D.C. The new  State has a larger population than two States,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…commemorate the sacrifice  and service of the women who worked on the home front to support the  efforts of the United States military during World War II may be  located on the National Mall, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2290\n\nBe it enacted…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697726/world-war-ii-womens-memorial-location-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…the  government shutdown under Obama. All reservations at the national parks  were canceled. Vendors were ordered to close, perishable deliveries  were turned back, The National Mall was cordoned off, gates to the  national parks were chained, and even highway turnouts with a view of  Yosemite Valley were barricaded.\n\nNow, compare that to the government…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…second  term, he signed an executive order to protect women in sports.\n\nToday, we are fighting to get that museum that was authorized in 2020  its rightful place on The National Mall. I thank my colleagues from  both sides of the aisle, nearly 100 Members of this institution, who  have cosponsored H.R. 1329. We can transfer this land and get this  museum…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…that  continues from one generation to the next. This experiment is unique in  the 6,000-year history of humans.\n\nEarlier this week, the Washington Monument, here on our National  Mall, was illuminated to mark keystones in American history: discovery,  independence, westward expansion, the Industrial Revolution,  innovation, and the future.\n\nLast August,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR.  Res. 133) requesting the Secretary of the Interior to  authorize unique and one-time arrangements for displays on the National  Mall and the Washington Monument during the period beginning on  December 31, 2025, and ending on January 5, 2026, and ask for its  immediate consideration in the House.\n\nThe…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696823/requesting-secretary-of-the-interior-to-authorize-unique-and-one-time-displays-on-the-national-mall-and-washington-monument-beginning-december-and-ending-january-2026"}]