[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…jurisdiction over Medicaid, was instructed in that  resolution to come up with about $800 billion in savings.\n\nWhat is the purpose of those savings? It is not to lower the national  debt. It is not to invest in research and development. It is not to  provide universal affordable childcare for a family in medical need-- things that I think all of us absolutely…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689539/h-con-res-14"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…tax breaks for billionaires by making huge cuts  to Medicaid.\n\nThat is what it looks like. The fact is they will still with their  tax bill add nearly $4 trillion to the national debt to cover their tax  break for the wealthiest people in our country.\n\nThis is fiscal engineering to reduce the role of government in the  lives of the American people where…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…people.\n\nThese tax cuts would not go to help everyday Americans. Instead, they  would go to the richest 1 percent.\n\nApart from that, it also increases the deficit and the national debt  to the tune of $4 trillion.\n\nWhat happened to fiscal responsibility?\n\nThis is a betrayal of the American working middle-class families.  There are 80 million people in…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…sale brought in less than 1 percent of the  $2.2 billion that Congress was told to expect, less than 1 percent.  That burdened taxpayers with an additional $2 billion in national debt.\n\nWhy? Well, because the Arctic is one of the most expensive places on  Earth to drill, and investors in the oil industry know this. In fact,  BP and Shell already abandoned…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…over the next 10 years.\n\nThe Committee for a Responsible Federal Budget issued their report  last night and they conclude that this plan is going to add $4 trillion  to the national debt. That is even with the cuts that were part of the  Medicaid plan, which I talked about a little bit more. We have a bill,  which is going to cut services, basically put…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…the attempt by the Trump administration and some of  my Republican colleagues to effectively end Medicaid as we know it and  add $37 trillion over the next 30 years to our national debt, all in  order to pay for more tax giveaways for corporate special interests and  billionaires.\n\nAmericans of every political stripe are alarmed because this bid to  end…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…control, into mandatory spending. If it is mandatory, it  is not a decision decided by the appropriators.\n\nAnd then, on top of all that, we started to build up more and more  national debt, and so all the money that went to interest on that debt  is money unavailable to be spent on basic programs of healthcare,  housing, education, investments that create…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…payment of $2.6 billion a  day.\n\nIf you took 100 percent of the money from the people that are  billionaires in this country, you probably couldn't pay the interest on  the national debt for a year.\n\nMs. SCANLON.  Johnson).\n\nIn January when House and Senate Republicans punted once again on  passing a budget and instead passed a continuing resolution, they…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…and raise household energy  bills, all while adding to air pollution and worsening our climate  crisis.\n\nAnd even after all that, it will add $4 trillion dollars to the  national debt with interest costs over the next decade, saddling future  generations with the cost of tax breaks for the wealthy.\n\nApparently, Republicans are content with continuing…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, Speaker Johnson calls our soaring national  debt the ``number one threat'' to our Nation. The Republican Senate  leader says that it is a ``ticking time bomb'' just before he lights  the fuse with this sorry resolution…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689897/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. President, before we broke for the August recess, I  came to the Senate floor to sound the alarm on our rising national debt  and unsustainable fiscal trajectory. Today, I am here to continue this  discussion and remind this body of the dangers we face if we do not  change course.\n\nIn fact, just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Congress spending their time on? They  want to cut taxes for billionaires and make working people pay for it.  They want to add over $52 trillion--trillion dollars--to the national  debt. I think of my grandson when I think of that. They want to make  the biggest cuts to Medicaid ever. This is the Republican agenda:  Billionaires win. American families…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…will lose their healthcare;  700,000 Alabamians will lose or have reduced their nutrition  assistance; five Alabama hospitals will close, and it adds $5 trillion  to the national debt.\n\nOn behalf of the 750,000 Alabamians that I represent in Alabama's  Seventh Congressional District and the 5 million hardworking  Alabamians, I say  vote ``hell no'' on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693197/one-big-beautiful-bill-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…remainder? Our national credit card does.\n\nHere we are, actually voting not just for the biggest loss of  healthcare in American history, but the biggest increase in our  national debt in American history.\n\nMr. Speaker, I have no idea what in the world the crowd that was  holding out got for holding out. Does anyone know? It is a complete  mystery to…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…a trillion dollars, give  or take.\n\nHow does it do that? It does that by adding $4.1 trillion to the  deficit--one bill, one act of Congress, $4.1 trillion piled on our  national debt.\n\nThere is another law that exists on the statute books of the United  States of America, the Statutory Pay-As-You-Go Act. What does that do?  It requires a look at bills…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…addition to preventing the biggest tax increase in history,  this bill will provide an opportunity for us to take important steps in  controlling spending and addressing our national debt.\n\nNow, I noticed the chairman of the Armed Services Committee just came  into the Chamber, and he knows, like I know, as the Presiding Officer  knows, that we are now paying…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Mr. STUTZMAN. Mr. Speaker, speaking of spending, outside of wasteful  spending on international aid and public media, Congress has another  problem contributing to the national debt: emergency spending.\n\nOver one-third of our current national debt, about $12 trillion, can  be attributed to emergency spending. This is an addiction that needs to  be…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…taxes go up if Democrats had their way and the  temporary tax provisions in the Tax Cuts and Jobs Act had expired.\n\nBut it is important for us to begin to chip away at that national  debt. I have said, time and time again, that we are spending more money  on interest on the national debt than we are on defense, which is an  unsustainable trajectory in a…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…mandate to this Congress: Rein in out-of-control spending.\n\nFor too long, bureaucrats in Washington recklessly spent Americans'  hard-earned tax dollars and drove up our national debt to nearly  catastrophic levels, hurting all Americans, especially the most  vulnerable.\n\nFor example, the Biden-Harris administration attempted to spend as  much as $1…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Of course we should.\n\nFor far too long, our government has put the cost of not just  emergencies but everyday expenses on our Nation's credit card. Now, as  a result, our national debt is a staggering $36 trillion and growing  every day.\n\nMr. Speaker, I am willing to put my money where my mouth is, and that  is why I have introduced the Put Your Money…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688322/putting-your-money-where-your-mouth-is"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…once-in-a-lifetime sales vanish like a ghost.\n\nThe real monster this bill is designed to slay, however, is one that  has been lurking around Washington for way too long: our national debt,  which now exceeds $38 trillion. That amount should scare us all into  taking action.", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…loss of trust from many  Americans. Waste, fraud, and abuse have contributed to excessive  spending without meaningful improvements in outcomes, and that is  driving our national debt now to $37 or $38 trillion.\n\nSecretary Kennedy has committed to addressing these failures. He has  made himself and his staff available to Congress and the American  people…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…ruling on this extremely consequential issue. It is just  amazing to hear the arguments about affordability when they presided  over an era of government that exploded our national debt, exploded  prices, not to the tune of $1,000 but tens of thousands of dollars on  Americans across the board, and they still tried to convince people  that their policies…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…today to urge my colleagues to defund NPR, PBS,  and USAID. For decades, Republicans have campaigned on being fiscal  conservatives, but all we have to show for it is a national debt  skyrocketing toward $37 trillion.\n\nLet me be clear: There is nothing fiscally conservative about forcing  taxpayers to fund vegan food promotion in Zambia or voter ID…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Democrats. Again, with  President Biden they expanded the Federal Government with an  unprecedented $11 trillion in spending, $6 trillion of which has been  added to the national debt. It needs to end. We voted to end it in H.R.  1. We are ending it in this package here today, and we won't stop  fighting for taxpayers.\n\nMs. FOXX.\n\nHere we go again, not…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…taxpayer-funded transgender surgeries for children.\n\nBuried in the minibus package is $14.3 million in earmarks for  special interest projects across the country. At a time when our  national debt is skyrocketing well past $38 trillion, Members of  Congress should be focused on reining in wasteful spending and funding  the essential functions of our government, not…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…smart  and absolutely lovely. I hope I misheard her. She seemed to believe  that if we just didn't have that fraud in Minnesota, we could have  covered a whole bunch of our national debt. She was genuinely  concerned. It sounds like she was trying to quote what she actually  thought she heard on cable news.\n\nMr. Speaker, I had to walk her through saying,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…trillion, which  represents almost a third of all Federal spending.\n\nFor the first time in the history of our country, this year we will  spend more on interest paying the national debt that we have already  borrowed, and in several years three-quarters of all Federal spending,  borrowing, will be just to pay interest on the money that we have  already…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688037/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to take away any of his thunder.\n\nMr. ROY. Mr. Speaker, the question I have for the gentleman: When I  graduated from law school at the University of Texas in 2003, the  national debt was somewhere in the $6 trillion range, $6.5 trillion  dollars. When I came to Congress, when I was campaigning to come to  Congress, it was just over $20 trillion. That…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…think is so important is that shutdowns are  expensive, and this is something that ends up costing us money every  time we do it. And, of course, we have quite a bit of national debt.\n\nNow, when we talk about completing our appropriations bills and  setting our spending limits for the year and fulfilling that budget  document, that portion--we have…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695966/en-bloc-nominations"}]