[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…in a  bipartisan manner to ensure swift consideration of these provisions.\n\nA version of this language is expected to be included in this year's  final version of the National Defense Authorization Act, which is  expected to get a floor vote very soon. This will ensure that the  critical operations at each of these installations proceed without  interruption.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697635/public-lands-military-readiness-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Ms. WATERS. Madam Chair, the National Defense Authorization Act often  includes provisions that have nothing to do with our national defense,  and that is not a bad thing. In the past, members of my committee have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695151/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…down their lives for this  country.\n\nMy colleagues on the other side of the aisle, let's work on  immigration reform. This does nothing to strengthen our country or our  national defense. It hurts our economy. Why are we going down this  path?\n\nLet's get serious about immigration reform. Let's pass some laws that  enable workers to work legally and let…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Over 20 of my Republican colleagues recognize this very real  truth, having voted against this exact language and understanding that  responsible conservation and strong national defense go hand in hand.\n\nMadam Chair, I urge my colleagues to reject this amendment, and I  yield back the balance of my time.\n\nMs. ELFRETH. Madam Chair, I demand a recorded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…bipartisan legislation is based on the recommendations of the  National Commission on Military, National, and Public Service. The  Commission was established in the 2017 National Defense Authorization  Act. Back then, Senate Armed Services Committee Chairman John McCain  and I were trying look at how we could encourage the most qualified  individuals of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…colleagues to vote ``no.''\n\nMr. AUSTIN SCOTT of Georgia.\n\nI urge my colleagues to vote ``yes'' on the rule and ``yes'' on the  underlying piece of legislation, especially the National Defense  Authorization Act.\n\nMr. Speaker, I want to address a couple of things since, as usual,  the Democrats continue to blame President Trump for everything.\n\nJust as a reminder,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…14th Chair of the Armed Services Committee, took him under his wing  and gave him an education on how to successfully navigate the sprawling  annual task of passing the National Defense Authorization Act. He could  not have learned from a better teacher.\n\nAt Seapower, Phil diligently followed the north star of the  Constitution's mandate in Article One,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…activities, and  support arms control efforts. Why would anybody think it is a good idea  to cut that account?\n\nAlso last week, the Armed Services Committee approved the National  Defense Authorization Act. It authorizes $62 billion for the nuclear  enterprise, which represents a 26 percent increase over President  Biden's request last year. Unfortunately,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…U.S. Constitution here at home. Congress must reassert its  constitutional authority to authorize the funds to pay for war.\n\nMr. Speaker, I strongly supported this year's national defense bill.  We must conduct vigorous oversight to halt this executive branch  unilateral war-making. Our soldiers deserve us to do that.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "Mr. AUCHINCLOSS. Mr. Speaker, I rise today to outline my concerns  with a provision contained within the Fiscal Year 2026 National Defense  Authorization Act, which I will vote against. This provision, though  well intentioned, is poorly drafted and shows the deficit of proper  process.\n\nReferred to as the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698004/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today I rise in support of my proposed  amendments to H.R. 3838, the Streamlining Procurement for Effective  Execution and Delivery and National Defense Authorization Act for  Fiscal Year 2026.\n\nOhio's 13th Congressional District has long been known as the Rubber  Capital of the World, and my First Amendment upholds that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…files.\n\nMy Democratic colleagues and I are here to work to lower costs and  grow our economy, to build healthier and safer communities, and to  ensure strong national security and national defense.\n\nI implore my colleagues on the other side of the aisle to join us.  Let's get back to work and deliver the results that the American people  sent us here…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694074/time-to-deliver-results-for-american-people"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to the rule. The fiscal year  2026 National Defense Authorization Act presented to us without  amendment is, against all odds, a strong bipartisan compromise between  Republicans and Democrats on the Armed Services Committee.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…corrected D.C.'s omission,  when honoring the states. For example, each state is entitled to two  statues in the Capitol, and D.C. has two statues in the Capitol. The  National Defense Authorization Act for Fiscal Year 2013 requires the  armed services to display the D.C. flag whenever the flags of the  states are displayed. Legislation gave D.C. a coin…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…past 75 years, the NSF has stayed true to its mission to  promote the progress of science; to advance the national health,  prosperity, and welfare; and to secure the national defense.\n\nUnderpinning this has been its commitment to a merit-based and peer- reviewed grant process that has ensured that good science is  consistently prioritized and free…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…statement regarding  the bill: ``As currently drafted, enactment [of this bil] would create  significant unresolved budgetary burdens and operational security risks  affecting national defense activities.''\n\nLet's talk about those operational security risks. The ROTOR Act  requires ADS-B, which is a beacon signal, In and Out to be transmitted  on all aircraft…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700107/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Her service took her across the world, including to the  Persian Gulf and multiple international ports. She departed the Navy in  1997. During her service she earned the National Defense Service Medal,  Armed Forces Expeditionary Medal, Sea Service Medal Deployment Ribbon  three times, and the Good Conduct Medal two times.\n\nFollowing her military career,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Aeronautics and Space       Administration.\n\n(2) Covered foreign entity.--The term ``covered foreign       entity'' has the meaning given such term in section 1822 of       the National Defense Authorization Act for Fiscal Year 2024       (Public Law 118-31).\n\n(3) NASA.--The term ``NASA'' means the National Aeronautics       and Space Administration.\n\n(4) Unmanned…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…nuclear program has been set back for decades, and  the Middle East is more stable than it has been in years.\n\nTo gain peace through strength, we have invested in America's  national defense. We have increased pay for our troops. We are making  generational investments in our defense industrial base. We are filling  our stockpiles. We are making our soldiers…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Democrat, every Republican--said: We like it. We will take a dozen of  these.\n\nThey liked it so much--my colleagues liked it so much that they made  it a part of the NDAA, the National Defense Authorization Act, which,  as you know, is a bill we have to pass every year. And housing is not  directly relevant to the NDAA. But under the rules, my colleagues liked…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Rose", "party": "Republican", "sentence": "…yield myself such time as I may consume.\n\nMr. Chair, I rise in support of my amendment to H.R. 3838,  Streamlining Procurement for Effective Execution of Delivery and the  National Defense Authorization Act for Fiscal Year 2026.\n\nMy amendment is intended to address the Janet Mello fraud case, the  Army civilian who was indicted and pleaded guilty to stealing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Chairman Rogers and Ranking Member  Smith for their leadership.\n\nMr. Speaker, as a Navy SEAL veteran, I am incredibly proud to rise  today in support of the fiscal year 2026 National Defense Authorization  Act.\n\nThis transformative piece of legislation delivers on the peace  through strength mandate of this administration. This bill that we are  voting on…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697799/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…innovation by providing early-stage funding to small businesses. These  investments have led to groundbreaking technologies that grow our  economy and strengthen our national defense.\n\nSBIR and STTR programs have been regularly reauthorized by Congress  to include many reforms to drive small business. However, the programs  will expire at the end of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…this bill  attempts to stop or at least begin the process of healing.\n\nWe now suffer from World War II levels of indebtedness and pay more  on interest than we do on our national defense, to the tune of over  $880 billion in interest.\n\nUnfortunately, many Members of Congress have demonstrated a complete  lack of fiscal discipline and will try to spoil…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the coast.\n\nFrom blocking SpaceX launches to obstructing fire prevention  projects, the commission has repeatedly threatened the safety of  Californians and weakened our national defense, while  needlessly undercutting innovation and economic progress.\n\nThe need to rein the commission in has now become urgent as we face  the challenge of rebuilding Los…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…we will have yet another launch into the sky as SpaceX is  propelling this movement forward.\n\nAs we recognize, space is important for our economy, infrastructure,  and national defense. It enables modern life, from powering GPS  communications to weather forecasting, artificial limb technology,  solar cells, fire-resistant fabrics, and even medical imaging…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…investment in the F/A-XX.\n\nFinally, I am humbled to be standing here in the well of the House  representing the patriots of Texas' Sixth, Americans who believe in a  strong national defense.\n\nThis bill makes smart investments in defense, in America's might, and  the prevention of war, but, if necessary, winning it.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…security.\n\nThroughout his service, Domenico earned numerous decorations,  including the Navy and Marine Corps Achievement Medal, two Marine Corps  Good Conduct Medals, the National Defense Service Medal, the  Afghanistan Campaign Medal with one Bronze Service Star, the Global War  on Terrorism Service Medal, the Sea Service Deployment Ribbon with one  Bronze…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Johnson to argue the unconstitutionality of the  Senate payday  provision and to ask the courts to strike it down.\n\nI even attempted to insert a repeal amendment into the National  Defense Authorization Act. Yet, when we sent our funding bill to the  Senate last week, we gave Senate leadership a taste of their own  medicine and forced them to choose between…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…defense spectrum, drive  innovation, and strengthen our missile defense systems.\n\nAs a member of the Senate Armed Services Committee, I am proud to  report that this year's National Defense  Authorization Act meets this moment. It includes key provisions I  secured to modernize our nuclear deterrent and strengthen our national  defense.\n\nAs chair of the Strategic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}]