[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…prospective servicemembers, to removing evidence  of the historical impacts of Black servicewomen and -men, this  administration is committed to further marginalizing our Nation's  heroes.\n\nIt is important that we never forget the unique history and  contributions of our Nation's Black veterans.\n\nAs the conscience of the Congress, the Congressional Black…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…VA really needs leadership now at  a time of mass firings, freezes on hiring, cuts, and the kinds of chaos  that we are seeing at this great institution that serves our Nation's  heroes. We need a really experienced, steady, principled financial  leader. And, unfortunately, Richard Topping is not that person.\n\nHe is not the kind of accountable and transparent…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694219/9999"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…in support of the Clear  Communication for Veterans Claims Act, bipartisan legislation that  would simplify the Department of Veterans Affairs' correspondence for  our Nation's heroes. I am proud to lead this bill with Chairman  Tom  Barrett, who I serve with on the House Veterans' Affairs Technology  Modernization Subcommittee.\n\nEvery day, my office…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689679/clear-communication-for-veterans-claims-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…estimated 53,000 veterans from World War I, the Second World War, the  Korean War, the Vietnam War and the War on Terror.\n\nSadly, we have begun to run out of room to bury our Nation's heroes  at the National Memorial Cemetery of the Pacific. It became essentially  closed to casketed burials in 1991 and will stop accepting cremated  remains by 2036. This is…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…States of America because of the chaos  and confusion that continues at the Veterans Health Administration and  the sliding downward of service that is available to our Nation's  heroes.\n\nOn Monday, VA Secretary Doug Collins announced that he would be  abandoning his disastrous plan to fire 83,000 VA employees, and the  reason is pretty simple: The Trump…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…identify best practices and  cost-effective ways to protect the operational needs of our National  Guard while ensuring VSOs are supported in their selfless dedication to  our Nation's heroes.\n\nMy last amendment will require the DOD to address our crippling  reliance on Communist China for critical minerals. We currently rely on  Communist China for roughly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…friend, Bobby Brite, on this incredible achievement. Our community, the  state of Michigan, and the United States of America are grateful for  his continued service to our Nation and its heroes.", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690118/recognizing-bobby-brite"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…of our\n\nThe online version has been corrected to read: Mr. BEAN of  Florida. Mr. Speaker, some of our    ========================= END NOTE =========================     Nation's heroes never made it home. Others returned bearing the scars  of captivity, both visible and unseen. Behind every prisoner of war and  missing soldier is a story of sacrifice,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…home address, which would prevent them from  receiving these updates.\n\nIt will also reduce postage costs, allowing the VA to spend money in  ways that better serve our Nation's heroes. It is a win-win overall.\n\nMadam Speaker, I thank my colleagues, Mr. Van Orden and Mr. Tran, for  their help in introducing this bill as we continue to work to improve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…today to recognize the outstanding  contributions that Tami Gaston has made through her work with  Cryoeeze22. Tami is dedicated, driven and determined to provide our  nation's heroes: military, Veterans, law enforcement and first  responders with scientific holistic options to treat an array of  conditions, including: PTSD, Suicide Prevention, inflammation,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692210/recognizing-tami-gaston"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veterans' surviving  families are prioritized by the VA.\n\nNow, I am proud to co-lead this bill with Representative Ciscomani on  behalf of the surviving families of our Nation's heroes, and I urge my  colleagues to support H.R. 1228.\n\nMr. BOST. Mr. Speaker, very clearly, I say to our veterans and the  taxpayers that a partial claim bill would cure the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…countless lives. She raised over $50,000 for the American  Heart Association's ``Go Red for Women'' campaign, ensuring critical  support for those in need. She has honored our nation's heroes by  organizing reunions for the 75th Ranger Regiment and playing a key role  in the 50th Anniversary commemoration of the end of the Vietnam war,  ensuring their sacrifices…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…major  last week.\n\nThey shouldn't be worried while they are doing their jobs  unnecessarily by people wanting to target them or attack them. Indeed,  if it weren't for our Nation's heroes, our society would fail, our rule  of law could not exist.\n\nI came here to DC to fight for these heroes like you, and it is a  battle. There are those that will stand…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…process of obtaining this grant was very competitive, and I am  immensely pleased that Rockingham County has this opportunity to make a  real difference in the lives of our Nation's heroes.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692311/recognizing-rockingham-county-veterans-treatment-court"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…millions of  Americans who fought in World War II to preserve our freedoms.\n\nI thank the Waverly High School band for the great lengths they went  to in order to honor our Nation's heroes.             Recognizing the Clermont County Chamber of Commerce\n\nMr. TAYLOR. Mr. Speaker, I rise today to recognize the Clermont  County Chamber of Commerce. The Clermont…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…accountability at the VA. It means  no excuses, no wasted dollars, and no veterans left waiting because the  system failed them. That is exactly what this bill delivers for our  Nation's heroes.\n\nI thank Representative Kiggans for her continued leadership on the  committee and her tireless commitment to solving this problem at the  VA. I urge all my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…contributions of our  veterans who have defended our freedoms and continue serving our  country once they transition back to civilian life, often on Main  Street America.\n\nOur Nation's heroes are uniquely positioned to become successful  businessowners because of the skills  they gained in the military, which have made them natural and effective  leaders. Unfortunately,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…of  patriotism and hard work. Programs just like this one represent the  best America has to offer, and it is great to see them focusing their  efforts on honoring our Nation's heroes.\n\nI and all of southern Ohio are proud of Kenley.\n\nI congratulate Kenley.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694175/recognizing-kenley-juillerat"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…distinct honor of leading battlefield walks  for Iraq and Afghanistan Veterans.\n\nMr. Tarr has demonstrated a steadfast commitment to ensuring that the  sacrifices of our Nation's heroes are not forgotten by future  generations. In 2025, he launched the Walk Among Heroes Youth  Ambassador Program where high school students walk the grounds of  historic…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}]