[{"senator": "Dave Min", "party": "Democrat", "sentence": "…straightforward amendment  to the Electric Supply Chain Act, an amendment that strengthens our  workforce, supports veterans, and helps ensure the reliability and  security of our Nation's energy supply.\n\nAs a Representative of California, I know how essential it is that we  shore up the workforce powering our electric supply chain.  Manufacturers in California…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…infrastructure  for traditional and renewable energy sources alike. Both our  constituencies and the energy industry alike remain concerned about  disruptive changes to our Nation's energy tax structure.''\n\nThe letter continues toward the end: ``With all this in mind, we  request that any proposed changes to the tax code be conducted in a  targeted and pragmatic…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…their communities.\n\nI continue to believe that there is a genuine interest in Congress on  both sides of the aisle to advance durable, bipartisan solutions to  meet our Nation's energy demands, to create good jobs, and to safeguard  our communities and environment.\n\nMr. Chair, I encourage my Republican colleagues to focus on real  solutions instead of…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…investments in cleaner  technologies.\n\nThis is not how to build a stronger economy or a cleaner future, and  it is not how to make things more affordable for Americans.\n\nOur Nation's energy future should be driven by innovation. American  technological innovation have allowed us to reduce emissions more than  any other Nation since 2005, all while achieving…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…their colleagues voted ``yes.''\n\nFinally, six Democrats voted ``yes'' on last week's CRA to halt the  Biden-era implementation of a natural gas tax that would harm our  Nation's energy producers and consumers.\n\nThe Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.  However,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Hydropower  Licensing Transparency Act, led by the gentleman from Idaho's First  District and the gentlewoman from Washington's Eighth District.\n\nHydropower is critical to our Nation's energy mix, supplying power to  approximately 30 million homes and businesses and accounting for 40  percent of the Nation's black start capacity.\n\nHowever, the average age of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…represent the most manufacturing-intensive State in the country.  Energy demand is up, manufacturers are invested in expanding, small  businesses are plugging in, and our Nation's energy needs are rising.  Indiana is foremost a manufacturing State. About 45 percent of our  instate electricity generation comes from coal. That is the reality.  That means…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…reliable, available  power. We need the energy, and clean coal will deliver it. American  energy is rocket fuel for a stronger economy--also, for a more secure  Nation.\n\nWhat does more energy mean? It means lower prices for consumers and  manufacturers and producers. Electricity demand is projected to double  by the year 2050. We cannot meet this demand…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…this week, President Trump  will join Senator Dave McCormick in Pittsburgh for the inaugural  Pennsylvania Energy and Innovation Summit.\n\nAs President Trump returns our Nation to energy dominance and forges  ahead in the race to dominate artificial intelligence, Pennsylvania  stands ready to meet the energy needs that AI creates. This summit is  huge.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…promote America's national security through energy resources,       and it is an asset to the State of Alaska. Responsible       development in the NPR-A supports our nation's energy       security, well-paying jobs and economic benefits for local       Alaska Native communities and the state as a whole. The 2022       BLM ROD improperly limits future…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…Security  Administration, prioritizing the continued modernization of the nuclear  weapons stockpile and the United States Navy nuclear fleet.\n\nThe bill strengthens our Nation's energy security by advancing  American leadership in deploying new nuclear technologies and  supporting the administration's efforts to make full use of our  Nation's vast fossil…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…dominance.\n\nI am proud to represent parts of the Utica and Marcellus shale  formations, where natural gas development has transformed local  economies and strengthened our Nation's energy security. Boosting  natural gas production in Ohio and expanding LNG exports are essential  to our vision of energy dominance.\n\nUnder the last administration, President…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…tomorrow like artificial intelligence and  data centers. I congratulate T1 Energy on this milestone and look  forward to their continued growth and contribution to our Nation's  energy security.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "John James", "party": "Republican", "sentence": "…from Texas whose  devastating good looks are only exceeded by his patriotism and sense of  humor.\n\nMr. Speaker, I rise today to advance a transformative vision for our  Nation's energy future through my bill, the Securing America's Critical  Minerals Supply Act.\n\nThis legislation is a bold and necessary step to ensure that the  United States leads the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…encouraged by this bill's historic  commitment to unleashing American energy dominance, while also  responsibly stewarding taxpayer dollars.\n\nWe are at a time when our Nation is at an energy crossroads.  Certainly, as we work to win the AI race against China, energy  dominance is mandatory. This bill appropriately allocates resources to  invest in our nuclear…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698759/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…fulfilling the left's  Green New Deal agenda. Make no mistake. This was not about policy, it  was about shutting coal out of the conversation, an essential piece of  our Nation's energy matrix.\n\nThe United States is home to the world's largest coal reserves, with  approximately 440 years' worth of supply at current production levels.  Today, our fleet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…intent of Congress in the TCJA was that the Coastal Plain  would produce billions of barrels of oil and trillions of cubic feet of  natural gas which Alaska and the Nation need for energy security and  revenue. Not only is it impossible for a competitive oil and gas  leasing program to be administered through piecemeal offerings of land  tracts which…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Green  New Deal agenda intended to block access to domestic energy production.\n\nNorth Dakota is an energy powerhouse and the third largest oil- producing State in the Nation. Our energy producers operate under the  highest environmental standards in the world.\n\nBut the Biden administration's North Dakota resource management plan  ignores that record…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}]