[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Democrats have made to protect lands that Tribal Nations have occupied  since time immemorial.\n\nThis misguided bill would lock in oil and gas development in the  Arctic National Wildlife Refuge, an area known to the Gwich'in people  as the sacred place where life begins. The Coastal Plain is the heart  of the Porcupine caribou's calving grounds. It hosts…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Service (FWS). These specialized teams play an essential role in  managing emerging invasive species, employing strategies tailored to  local conditions across the National Wildlife Refuge System. With 21  teams strategically positioned in various FWS regions, they are on the  front lines, addressing the unique challenges posed by invasive  species.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Mr. HEINRICH. Mr. President, nestled in the far northeast corner of  Alaska is one of the wildest and most untouched places left in North  America: The Arctic National Wildlife Refuge.\n\nI have been blessed to see this refuge with my own eyes. I have seen  its towering peaks; I have seen the critical habitat on the Coastal  Plain where caribou drop…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Mr. Speaker, S. 1596 will codify the renaming of  the Anahuac National Wildlife Refuge in Texas to honor the memory of  12-year-old Jocelyn Nungaray.\n\nWildlife refuges are more than places to protect our environment.  They are places where so many young…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693447/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…will be the law of the land.\n\nToday, I rise in opposition to all the CRAs, but in particular, I  want to talk about one very special place.\n\nIn 2017, when the Arctic National Wildlife Refuge's Coastal Plain was  first officially opened to drilling, supporters promised that the sale  would raise significant revenue. Instead, only three bidders emerged.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I also rise today to oppose the effort to  open up the Arctic National Wildlife Refuge to permanent, irreversible  damage from the Big Oil industry.\n\nThis effort to overthrow the Biden administration's Record of  Decision for the management of the Arctic…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…floor to speak on the  11:30 vote we are about to have. And I come because I want to speak  against the effort to overturn the land management plan for the Arctic  National Wildlife Refuge.\n\nCongress established the Arctic National Wildlife Refuge in 1980 to  protect the diverse and unique, very fragile ecosystem located on 20  million acres in the northeast…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Arctic refuge, the  homeland of Gwich'in and the Inupiat people, offers unmatched, truly  wild fishing and hunting opportunities for all Americans.\n\nIt is the only national wildlife refuge that protects an entire  Arctic ecosystem, and it stands as a profound source of pride for this  Nation.\n\nThese lands, the birthing and calving grounds of the Porcupine…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…are vital to both biodiversity and  community survival. These lands are also interconnected with the Gates  of the Arctic National Park and Preserve and the Arctic National  Wildlife Refuge. They are home to caribou, salmon, and sheep species  that Alaska Native and rural communities depend on for food and  cultural traditions.\n\nThe existing RMP sets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…library board, and I am serving my people, but now I am afraid I  will have to leave. There are no options left.\n\nDevrie, who works with the Friends of Bosque del Apache National  Wildlife Refuge, shared: We already lost two employees at the refuge.  We were understaffed before, and now if we lose visitors, my job is  next. The Bosque brings in thousands of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…that we have been  considering here today are going to strip local land managers of the  ability to respond to future challenges, changes,  and needs in the Arctic National Wildlife Refuge, the NPR-A, and the  Powder River Basin. If these reckless resolutions pass, these places  will be locked into outdated plans that fail to account for changes in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (S. 1596) to rename the Anahuac National Wildlife Refuge located  in the State of Texas as the ``Jocelyn Nungaray National Wildlife  Refuge''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…to  reject the Biden administration's unlawful attempt to stifle Alaska's  congressionally mandated oil and gas leasing program in the Coastal  Plain of the Arctic National Wildlife Refuge, ANWR. I urge my  colleagues to support the Alaska congressional delegation's joint  resolution of disapproval, H.J. Res. 131 and S.J. Res. 91, to reject  unlawful…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Speaker, I thank Chairman Westerman, my good friend  and classmate, for his services here.\n\nMr. Speaker, I rise today in support of S. 1596 to rename the Anahuac  National Wildlife Refuge located in the State of Texas and in my  district as the Jocelyn Nungaray National Wildlife Refuge to forever  commemorate the life of 12-year-old Jocelyn Nungaray,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…economic selfdetermination,       and protect the long-term interests of our Inupiat       shareholders. Kaktovik is the only community located within       the Arctic National Wildlife Refuge (ANWR), and KIC holds       significant ANCSA lands within the Coastal Plain lands that       Congress specifically conveyed to our people so that local       Inupiat…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…which would  repeal a Biden administration-era Record of Decision, ROD, restricting  oil and gas production on 1.16 million acres within the 10-02 area of  the Arctic National Wildlife Refuge, also known as ANWR.\n\nThe 10-02 area of ANWR was specifically set aside by Congress for its  oil and gas potential and is estimated to hold anywhere between 4.25…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…America, which has  produced over 13 billion barrels of oil since production began in 1977.  On either side of Prudhoe Bay are two Federal areas, one being the  Arctic National Wildlife Refuge and the other being the National  Petroleum Reserve in Alaska, the subject of today's legislation. The  U.S. Geological Survey this year reported that half of the…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…conservation efforts to  maintain the swamp's native alligator population.\n\nHe was instrumental in expanding ecotourism by acquiring the visitor  concession at the Okefenokee National Wildlife Refuge headquarters and  the nomination by the U.S. Department of the Interior as the next  American World Heritage site.\n\nAfter his successful tenure in this role, Dr. Clark…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…crime were illegal  immigrants who never should have been in our country in the first  place.\n\nTo commemorate Jocelyn's life, I have introduced the Jocelyn Nungaray  National Wildlife Refuge Act, which would permanently rename the  Anahuac National Wildlife Refuge in Texas in her memory.\n\nThis bill would actually codify President Trump's Executive order…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691123/jocelyn-nungaray-national-wildlife-refuge"}]