[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…military junta engaged in a violent persecution of the Rohingya  minority, forcing 1.5 million people to flee to Bangladesh and  Thailand. A recent investigation by the United Nations concluded the  2017 attacks were a ``coordinated and organized operation'' to strip  the Rohingya of their land rights within the country. In 2022, the  State Department officially…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, last week we learned that President Trump  has decided to withdraw the United States from 66 United Nations  organizations,  offices, and treaties that have had bipartisan support in Congress for  decades. As far as I am aware, neither the White House nor the State  Department consulted…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…message to many  proud democracies, including multiple members of the North Atlantic  Treaty Organization (NATO), that we condemn the domestic political  process within their nations. As Ranking Member of the House  Appropriations Subcommittee on Defense, I know just how crucial it is  to maintain relationships with our NATO allies who have come to our…", "date": "2025-11-28", "source_url": "https://justfacts.votesmart.org/public-statement/1697166/denouncing-the-horrors-of-socialism"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…them stronger.\n\nThen he went on to say--when we asked him about the children  starving, the images we had all seen on television, he said: That is  not true. That is a United Nations' narrative.\n\nThen we asked him basically: If there is such a difference of opinion  about what is happening in Gaza, why don't you allow international  journalists to come…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694435/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…prevent President Trump from invading Canada,  Greenland, or Panama without a vote of Congress.\n\nIt is crazy that we even have to have this conversation. These  places, these nations, are our allies. They pose no threat to the  United States. After thousands of brave American soldiers fought in  Iraq and Afghanistan, many losing their lives, their limbs,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…listened  to the debate on the billionaire bonus bill, I couldn't help but think  of Matthew 25:31-46 where Jesus said that when He came into His glory  in Heaven and all the nations of the Earth would come and be divided  and He would turn to the righteous and say: Come, you who are blessed  by my Father; take your inheritance, the kingdom prepared for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…has shoved  a U.S. Senator out of a room, has proceeded to put that U.S. Senator on  the ground and to handcuff that Senator. This is what we expect to see  in authoritarian nations that can't tolerate a question, and they start  to attack the institutions.\n\nWhat we are seeing in the United States right now, we are seeing it  in the form of the President…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Prime Minister  Carney to know that there is a new generation of America that believes  in a multiracial democracy that raises the sovereignty and self- determination of all nations. I want him to know that there is a new  generation that believes in statesmanship, not subjugation. I want him  to know that there is a new generation that believes in Kant's…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699243/might-does-not-make-right"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…nuclear program--peacefully, without having to bomb  them, without having to kill civilians, without having to assassinate  scientists.\n\nThe United States, together with other nations, used the power of  congressional sanctions--Congress did this well--to leverage an  agreement whereby Iran agreed--in the first sentence of the first  paragraph of the first…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…scold our European allies. Let me be clear. Our Nation  intergenerationally and painstakingly has built the North Atlantic  Treaty Organization, a global fortress of democratic nations.\n\nAcross Europe, from the ruins of World War I and World War II lie the  precious graves of 411,516 American soldiers and--no one knows  exactly--35 million to 50 million…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…good. We need the workers. We need workers.\n\nCalifornia has the biggest agricultural sector in the United States.  We feed ourselves and other States in the Union and other nations, and  70 percent of our workforce is--guess what?--undocumented.\n\nWe are waiting for this body to pass immigration reform so good,  hardworking individuals can be legalized.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692099/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the common good.  His tireless journeys across continents and his engagements with  parliaments, heads of state, and religious leaders have earned him  honors from the United Nations, the European Union, and this very  Congress, which bestowed upon him the Congressional Gold Medal beneath  this Capitol dome.\n\nMr. Speaker, in honoring Patriarch Bartholomew,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695368/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…The rest belong to the U.K., France, China, Israel, India, Pakistan,  and North Korea.\n\nRussia has threatened to use nuclear weapons against Ukraine and even  against NATO nations. North Korea uses its nuclear weapons program to  intimidate the United States, Japan, and Korea. China continues to  build up its nuclear arsenal. It has some 600 warheads…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…sheep and the goats, and this is what Jesus talks about.\n\n``When the Son of Man comes in his glory, and all the angels with  him, he will sit on his glorious throne. All the Nations will be  gathered before him, and he will separate the people one from another  as a shepherd separates the sheep from the goats. He will put the sheep  on his right and the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…from all sides for her ability to bring  people together.\n\nAmbassador Pierce has continued to play a key role in advocating for  increasing economic engagement between our two nations--I look forward  to a U.S.-U.K. free trade agreement--and she has demonstrated an  unwavering commitment to global stability. Whether wrestling with  security challenges,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "French Hill", "party": "Republican", "sentence": "…for civilian nuclear energy projects  abroad, helping U.S. companies compete globally while promoting safe  and reliable energy as an alternative energy source from opposing  nations.\n\nIt requires the Treasury to advocate for nuclear energy assistance at  the World Bank and other international financial institutions,  including the establishment of Nuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699048/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…trusted countries are dealing with the       challenge of State-directed and State-supported investment       and whether there are opportunities to work with like-minded       nations to address such challenge.\n\n(9) Ongoing Federal Government efforts to improve the       investment climate and facilitate greater levels of foreign       direct investment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…pregnant students so that no student feels forced to choose between her  education and her child.\n\nLast week, I also introduced the SAFE KIDS Act to prevent foreign  adversarial nations from abusing the American surrogacy industry to  obtain U.S. citizenship for their children and traffic infants abroad.  Most of the developed world has already banned international…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…exercises, aerial gunnery, and large-scale mobilization training.  Without these vital training areas, we would risk losing our military's  strategic advantage over hostile foreign nations.\n\nI commend Representative Begich for his leadership on this effort.  His bill provides long-term certainty to the U.S. Army so they can  continue training and testing effectively…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that are funding these people to be put on our  streets.\n\nHow about our borders? Should we not know the flow of the dollars, of  the coordinated network through the United Nations and through  international organizations and through supposedly religious  organizations, or the 250 organizations that our friends at the Center  for Immigration Studies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "John James", "party": "Republican", "sentence": "…in critical industries and  emerging technologies, establish an early warning system to predict and  prevent supply chain disruption, and reduce dependence on adversarial  nations by incentivizing domestic manufacturing.\n\nResilient global supply chains are the cornerstone of American  innovation and leadership, and we must take clear and decisive action…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…America, and we can't  simply take it because we want to. To do so would be a colossal  mistake. It would end NATO. It would be a gift to Russia and China and  all autocratic nations that lust after new territory and want it to  justify their own provocations. Again, it is not necessary. It is not  necessary given the decades-long, still-strong partnership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…administration, we saw the impact of an energy  retreat: higher prices for families and businesses, emboldened  adversaries, sluggish economies, and increasing reliance on other  nations.\n\nUnfortunately, this is still the case in States like California,  where a hostile regulatory environment has forced refineries to reduce  operations. In fact, the Golden…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in the securities markets.  Its funding came primarily from donor contributions and repayments on  past loans.\n\nAs the IDA evolves to meet the needs of the world's poorest nations,  it has entered the capital markets to expand its resources and its  impact.\n\nIt is only logical and fair that its securities receive the same  exempted status consistent…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…after the date of       enactment of this Act in providing assistance to the military       departments in--\n\n(1) working with the navies and domestic coast guard of       nations located in the Indo-Pacific region on building       capacity to protect the territorial waters of such nations       from incursions by other nations;\n\n(2) providing a presence…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…admission of an       individual if the admission of the individual is necessary to       comply with United States obligations under the Agreement       between the United Nations and the United States of America       regarding the Headquarters of the United Nations, signed at       Lake Success June 26, 1947, and entered into force November…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…operations in war-torn Bosnia. Once  deployed, he assumed the role of Chief of Staff for the Multi-National  Division (North), leading a diverse team of officers from over ten  nations, including Russia, Turkey, and Norway.\n\nCOL Patterson's distinguished military service earned him numerous  accolades, including the Legion of Merit with oak leaf cluster,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…security, and our  energy independence.\n\nBeyond that, this reliance comes with severe negative environmental  impacts. China's greenhouse gas emissions exceed all of the developed  nations in the world combined. In fact, U.S. industrial manufacturing  is nearly 28 percent cleaner than our competitors, including China.\n\nIf we want a cleaner, healthier environment…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…the troops and  the families who have sacrificed so much for the freedoms that we hold  dear.\n\nBeyond the details, we must keep sight of the bigger picture. Our  adversaries--nations that hate America--well, they are sharing weapons  and resources and a common goal. They want to weaken American power and  dismantle our influence across the globe.\n\nThe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…back home that this is important not  just for today but for the generations to come because when you look at  the powers in the economic sphere in the past, some very small nations  have reached into the future and benefited their children,  grandchildren, and great-grandchildren.\n\nIn fact, I often talk about Royal Dutch Shell Group, Shell Oil, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}]